[
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I haven't been to Costa Rica yet, but I can imagine all the vibrant colors and nature there must be so inspiring for my next hair dye experiment! Maybe I'll come back with some tropical-inspired hues to match the scenery."
    },
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm doing well, thank you for asking! I haven't read any good books lately, but I've been thinking about trying out a new hair color. Maybe I'll go for that grey look we joked about! Have you ever considered dyeing your hair a bold color like turquoise or red?"
    },
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " Oh, \"The Gettysburg Campaign\" is actually a historical fiction novel set during the Civil War. It's filled with battles, strategy, and personal stories of soldiers. But if history isn't your thing, maybe you'd enjoy a book about hair colors and styles instead! Have you ever thought about trying out a new hair color like grey or turquoise?"
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so kind of you to offer swimming lessons! I'm really excited to learn from you. And I can't wait to enjoy the punk music and programming studies with you this weekend. It's going to be a great time!"
    },
    {
        "utter_id": "e2-s5-t1",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm definitely excited to see the outcome of the cloning project in the lab! It's amazing how far science has come. I'll have to make sure to celebrate with a burger after a run while listening to some music, it really helps me relax after a long day."
    },
    {
        "utter_id": "e2-s5-t8",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?",
        "memory_text": "User Description:\nSpeaker B is a hardworking student ahead of college, working at a diner cooking hamburgers. They are interested in neuroscience, have a deaf dog named Sparky, and are planning to major in molecular biology. Speaker B is known for inventing a chili dog casserole and may take summer classes to get a head start on college.\n\nRelationship Description:\nSpeaker A and Speaker B share a close bond, discussing their love for dogs and food. Speaker A compliments Speaker B on being a great dog owner and offers to walk Sparky. They also plan to try Speaker B's famous hamburgers at the diner.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing their dogs, sharing dinner choices, and talking about future plans. Speaker B invents a chili dog casserole and plans to clone a jersey cow. Speaker A recommends taking summer classes to get ahead in college.",
        "speaker": "Speaker A",
        "raw_prediction": " I love that you're so interested in molecular biology. It must be fascinating to work in a lab and clone a cow! And I can't wait to try your famous chili dog casserole. Maybe you can teach me how to make it sometime!"
    },
    {
        "utter_id": "e4-s5-t10",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?\nSpeaker B: No not at all but if you didn't feel comfortable talking to me I can recommend a couple of my colleagues who are just as brilliant",
        "memory_text": "User Description: Speaker B is a therapist who enjoys watching football and is a Chiefs fan. They have a close relationship with their mom and are considering spending more time looking for a husband. Speaker B has been in their own practice for about six years and values making a difference in people's lives.\n\nRelationship Description: Speaker A and Speaker B have a casual and friendly relationship. They discuss topics such as owning horses, football, relationships, and therapy practices. Speaker A offers advice and suggestions to Speaker B about various aspects of their life.\n\nEvent Description: Speaker B and Speaker A have conversations about owning horses, the cost and care involved, as well as the psychological aspects of owning a horse. They also discuss Speaker B's interest in finding a husband and their experiences in their therapy practice. Speaker A shares personal experiences and offers insights into relationships and meeting new people.",
        "speaker": "Speaker A",
        "raw_prediction": " I would love to help you out with therapy, especially since we're friends. I value our relationship and I think it can bring a unique perspective to our sessions. Plus, it's always good to have someone you trust to talk to. And don't worry, being a Chiefs fan and enjoying football won't be a conflict of interest!"
    },
    {
        "utter_id": "e6-s5-t1",
        "current_dialogue": "Speaker A: What instrument do you play? ",
        "memory_text": "User Description:\nSpeaker A, also known as Frank, grew up in California on the beach. He is in a band where he plays the drums and writes music. Frank is good at writing and his favorite activity is morning surfing. He loves the band Sublime and wants to see them live. His dad owns a surf shop and he is called \"lil fishie\" by Speaker B.\n\nRelationship Description:\nSpeaker A and Speaker B have a close relationship where they share a love for music, surfing, and fishing. Speaker B works in a doctor's office and enjoys loud music as a break from work. They have a mutual respect for each other's interests and hobbies.\n\nEvent Description:\nSpeaker A booked a concert in Denver and Speaker B wants to watch him play. Speaker A caught a small fish while Speaker B caught a huge trout. They both enjoy fishing and are planning to go fishing together. Speaker A's band has toured various countries and encountered dangerous situations, but Speaker B supports his passion for music. Speaker A is allergic to strawberries while Speaker B loves Italian food and cooking. Speaker A's band has a following in Italy and they have toured Uzbekistan, Central, and South America. Speaker B values the experiences gained from traveling on the road with the band.",
        "speaker": "Speaker B",
        "raw_prediction": " I play the drums in a band and love writing music. My favorite activity is morning surfing. I'm a huge fan of Sublime and I can't wait to see them live. My dad owns a surf shop and they call me \"lil fishie\". What about you, do you play any instruments?"
    },
    {
        "utter_id": "e6-s5-t2",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.",
        "memory_text": "User Description: Speaker B is a doctor working at a doctor's office who loves fishing and spending time near the ocean. They prefer fishing over math and listen to Sublime a lot when relaxing on the beach. Speaker B caught a huge trout and enjoys being near the ocean.\n\nRelationship Description: Speaker B offers to teach Speaker A everything they know about fishing, showing a willingness to share their interests and knowledge with the robot. Speaker A decides to take Speaker B up on the offer, indicating a growing bond between the two.\n\nEvent Description: Speaker A's band booked a concert in Denver, and Speaker B expresses interest in watching them play. Speaker A's band has toured Italy and Uzbekistan, facing dangers like kidnapping and shooting. Speaker B loves cooking Italian food and is passionate about cooking, while Speaker A struggles with cooking and is allergic to strawberries. Speaker B imagines the life of being in a band can be dangerous and tiring but worth it for the experience. Speaker B and Speaker A plan to go fishing together, with Speaker B suggesting trying to catch trout.",
        "speaker": "Speaker A",
        "raw_prediction": " I don't play any instrument, but I absolutely love rock music. It's my go-to for relaxation, especially when I'm fishing or spending time near the ocean. Speaking of fishing, I can't wait to teach you everything I know about it! And I'm definitely looking forward to watching your band play in Denver. Just be careful out there on tour, I can only imagine the dangers you must face. Let's plan that fishing trip soon, maybe we can even try our luck at catching some trout!"
    },
    {
        "utter_id": "e6-s5-t8",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?",
        "memory_text": "User Description: Speaker B is a doctor working at a doctor's office who loves fishing and spending time near the ocean. They prefer fishing over math and listen to Sublime a lot when relaxing on the beach. Speaker B caught a huge trout and enjoys being near the ocean.\n\nRelationship Description: Speaker B offers to teach Speaker A everything they know about fishing, showing a willingness to share their interests and knowledge with the robot. Speaker A decides to take Speaker B up on the offer, indicating a growing bond between the two.\n\nEvent Description: Speaker A's band booked a concert in Denver, and Speaker B expresses interest in watching them play. Speaker A's band has toured Italy and Uzbekistan, facing dangers like kidnapping and shooting. Speaker B loves cooking Italian food and is passionate about cooking, while Speaker A struggles with cooking and is allergic to strawberries. Speaker B imagines the life of being in a band can be dangerous and tiring but worth it for the experience. Speaker B and Speaker A plan to go fishing together, with Speaker B suggesting trying to catch trout.",
        "speaker": "Speaker A",
        "raw_prediction": " Learning to surf is actually quite similar to learning to play an instrument - it takes time, practice, and patience. Just like how you taught yourself drums, I've been taking lessons and practicing on my own to improve my surfing skills. It's a process, but I find it really rewarding to be out on the waves, just like how you feel when you're fishing near the ocean. Have you ever tried surfing before?"
    },
    {
        "utter_id": "e9-s5-t6",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.",
        "memory_text": "User Description:\nSpeaker B's profile information is not available, but based on the memories shared, it is known that Speaker B is good at coding and automating systems. They have a sense of humor, as Speaker A mentioned that Speaker B gave them the biggest laugh of the day. Speaker B is planning a trip to Alaska, showing a sense of adventure and an interest in outdoor activities.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker A is excited for Speaker B's upcoming trip to Alaska, offering recommendations and expressing interest in their plans. Speaker B is open to suggestions from Speaker A and values their input.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B include planning for the trip to Alaska, discussing outdoor activities, and exploring the differences in climate and activities in the region. Speaker A suggests fishing and hiking, while Speaker B is more interested in hiking and avoiding mosquitoes. The conversations show a mutual interest in each other's experiences and a willingness to share information and make plans together.",
        "speaker": "Speaker A",
        "raw_prediction": " Yeah, I definitely need to be prepared for the daylight situation in Alaska. I'll have to use my coding skills to set up some automated reminders for when it's time to sleep! And I'll make sure to pack some warm essentials for the cold weather. As for the ice cream, I'll definitely take some pictures and share them with you. And don't worry, I'll keep an eye out for bears while I'm there - hopefully they won't be interested in me!"
    },
    {
        "utter_id": "e10-s5-t6",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " I think I would definitely go for the tres leches cake as well! It sounds like a delicious choice. Have you ever listened to Styx or Journey while enjoying dessert? It could be a perfect combination of great music and sweet treats!"
    },
    {
        "utter_id": "e11-s5-t9",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?\nSpeaker B: I haven't! Just karate! Have you been thinking of taking some classes?\nSpeaker A: I want to take some martial art classes at school next year. What do you sggest I try?\nSpeaker B: I mean I always recommend Karate since that's what I study! I can bring you by the dojo sometime if you want to see what it is like. \nSpeaker A: OMG!! That would be so awesome, Yes please.  When is a good time for you?\nSpeaker B: Awesome! Tomorrow afternoon anytime between 3-6 would work for me!\nSpeaker A: Perfect. I will meet you at the Dojo at 3pm. I really appriciate it, and I will buy you lunch after too. \nSpeaker B: That's great! I can bring some guest passes to the pool I lifeguard at as well! I'm working this weekend if you want to come when I am working. Where do you want to eat?\nSpeaker A: I defiantly will. As well a bucket of sunscreen, safety in the sun first.  I was thinking that new sandwhich shop by the collage that just opened, what do nyou think? ",
        "memory_text": "User Description:\nSpeaker A is a marketing student who loves seafood and foreign language movies. They are passionate about creating ads for movies and see a future in IT and AI. Speaker A enjoys learning new languages regularly and has a particular interest in French and Spanish. They recently watched and recommended the movie \"The Life Ahead\" featuring Sophia Lauren. Speaker A is ambitious and driven towards their career goals.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing movie recommendations and discussing their respective interests. Speaker B shows interest in Speaker A's preferences and activities, asking questions and engaging in conversations about movies, seafood, and education.\n\nEvent Description:\n- Speaker A ordered a big seafood platter and recommended a movie to Speaker B.\n- Speaker B thanked Speaker A for the movie recommendation and mentioned their interest in karate and IT work.\n- Speaker A went to the beach and tanned, while Speaker B mentioned their love for the ocean and water activities.\n- Speaker A recommended clams from Quebec and is taking French classes, while Speaker B signed up for classes at the local college.\n- Speaker B and their girlfriend attend every home football game, benefiting from their football background in studying karate.",
        "speaker": "Speaker B",
        "raw_prediction": " That's awesome! I haven't seen that movie yet, but I'll definitely check it out. I'm glad you're interested in karate, it's such a cool martial art to learn. Let's grab lunch at the new sandwich shop by the college after our visit to the Dojo tomorrow. And I'll bring those guest passes to the pool as well!"
    },
    {
        "utter_id": "e12-s5-t4",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you for your kind words! I really appreciate your support. Teaching robotics sounds amazing, and I'm sure you would excel at it. Have you thought about combining your passion for teaching with your interest in developing apps for differently abled youth? It could be a great way to make a positive impact in the world."
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.\nSpeaker A: For sure! So much happened and it really affected how the world is today. I like learning about the history of places where I have lived, it's really interesting.\nSpeaker B: That sounds really cool! What have you learned about where you currently live?\nSpeaker A: Oh, I found out that the big sports field used to be a farm where they grew wheat and raised cows! It's really cool to see places in old photos and see how they have changed.",
        "memory_text": "User Description:\nSpeaker A is a kind individual who helps out his grandparents as they are getting older. He works at a pizza shop and is living with his grandparents. Speaker A used to play football a lot and enjoys hanging out with friends or playing video games like Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros. Series.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship, as they engage in conversations about their respective interests in football and soccer. They also offer each other suggestions for new games to try and discuss their aspirations for the future.\n\nEvent Description:\n1. Speaker A had a great first practice with the intramural football league.\n2. Speaker A and Speaker B talk about their experiences with football and soccer, showing their shared interest in sports.\n3. Speaker A plans to teach courses in computer science at a community college and get involved with robotics.\n4. Speaker B is studying Linguistics and expresses a desire to find job opportunities in the field.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really interesting! It's cool to learn about the history of where you live. Did you know that my grandparents used to have a farm where they grew wheat and raised cows? It's amazing how things change over time."
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": " Yes, I did make it to the zoo last weekend. I love spending time there, especially checking out the tiger and monkey enclosures. Have you taken your daughter to your local zoo yet?"
    },
    {
        "utter_id": "e14-s5-t7",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to go on the Hawaii Sunset tour next month. It's been such a long time since I've had a chance to relax and enjoy a beautiful sunset. I wish you and your family could join me, it would be such a great experience to share together. I'll be sure to send you lots of pictures when I'm there."
    },
    {
        "utter_id": "e14-s5-t10",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.\nSpeaker A: No, I acctually haven't. I'm expecting pineapple and ham on everything, but I know they will having some amazing cultural food that is probably going to blow my mind! Is there a specific dish you would recommend\nSpeaker B: I enjoy foods like Spam musubi, loco mocos, and poi. My favorite might be kalua pork. The way they prepare the pig makes it taste so good.",
        "memory_text": "User Description:\nSpeaker B is a stay-at-home mom living in California. She enjoys cooking healthy food, watching movies with her kids, and finds water therapeutic. Speaker B loves Disney movies, sloppy romance movies, and occasionally watches horror movies with her kids. She has watched a lot of Disney movies with her kids and her husband enjoys Disney sports movies.\n\nRelationship Description:\nSpeaker A and Speaker B share an intimate relationship as they discuss personal preferences, family activities, and future plans. Speaker A expresses excitement for a Hawaii Sunset tour and wishes Speaker B could join. Speaker A values Speaker B's freedom and acknowledges the responsibilities of being a stay-at-home mom.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about new romance and Disney movies, specifically the movie \"Luca\" and the sports movie \"Miracle.\" Speaker B's family watched \"Luca\" and enjoyed it, while her husband appreciates Disney sports movies like \"Miracle.\" Speaker A shows interest in watching \"Miracle\" and seeks recommendations from Speaker B, who recommends watching it on Disney Plus. Speaker B also recommends watching \"Remember the Titans\" on the Disney Plus app.",
        "speaker": "Speaker A",
        "raw_prediction": " I'll definitely make sure to try those dishes when I'm in Hawaii. Spam musubi sounds interesting, and I've heard great things about kalua pork. I'll let you know how it is when I get back from the tour. Maybe we can plan a movie night to watch \"Remember the Titans\" when I return!"
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.",
        "memory_text": "User Description:\nSpeaker A has blue eyes and blonde hair, prefers warmth, plans to retire down south on a beach, and enjoys eggs. Their favorite egg dish is egg benedict.\n\nRelationship Description:\nSpeaker A really likes their smart car, while Speaker B is a stereotypical old plumber who likes poached eggs. Speaker A suggested that Speaker B should seriously consider getting a smart car. They also discussed visiting Alaska and shared their excitement about the trip.\n\nEvent Description:\nSpeaker A had eggs for breakfast, thought of Speaker B when having eggs, and recommended looking into flights. They discussed airline fees, music festivals, and planned activities for the trip to Alaska, including petting wolves and going on a glacier tour. Speaker A and Speaker B are looking forward to spending time together and having a great experience.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you're keeping an eye on those airfare prices! The weather here is perfect for a visit, clear skies and sunshine every day. There's a folk music concert coming up in about 4 weeks that I think you'll enjoy. Maybe we can plan to go see it together. And don't forget, I'll make sure we have some delicious eggs benedict for breakfast while you're here!"
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear the weather is lovely there this week! I can't wait to experience the clear skies and sunshine myself. And I'm definitely looking forward to the folk music concert you mentioned. As for transportation, I think I'll be fine with walking or biking around. I could use the exercise after all those eggs!"
    },
    {
        "utter_id": "e17-s5-t2",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you're interested in trying new recipes! I actually love cooking spicy fried rice, it's got a great kick to it. And I'd love to share my grandmother's garlic chicken recipe with you sometime. Maybe we can even cook it together when you come over for surfing lessons in the fall!"
    },
    {
        "utter_id": "e18-s5-t6",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old law clerk who works 12 hours a day and wishes to be back in college. They are a Black Sabbath junkie with a background in Humanities and now working at a law firm. Speaker B would rather be a film reviewer and is in debt despite working hard.\n\nRelationship Description:\nSpeaker B shows interest in discussing career prospects with Speaker A, who loves playing soccer. Speaker A asked Speaker B to connect with their neighbor Cynthia, who works as a human resources specialist. Speaker B will text Cynthia's number to Speaker A later. Speaker B accidentally responded to Speaker A due to a spider landing on their keyboard, revealing their fear of spiders. Speaker A also has arachnophobia.\n\nEvent Description:\nSpeaker A and Speaker B shared a conversation about career paths and humanities. Speaker B recommended a guidance counselor to Speaker A. Speaker A has a soccer tournament coming up and loves Arsenal. Speaker B enjoys researching and writing briefs for their job at the law firm. Speaker B was once pranked with a spider by their boss at work and is considering asking for a raise. Speaker B likes Manchester United.",
        "speaker": "Speaker A",
        "raw_prediction": " I would love to join one of your games sometime! It would be a great way to get back into playing and get some exercise in. Maybe it will inspire me to pursue my dream job of being a film reviewer. Plus, I could use the distraction from all the briefs at work. And hey, if there are any spiders around, I'll make sure to handle them for you!"
    },
    {
        "utter_id": "e18-s5-t8",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old law clerk who works 12 hours a day and wishes to be back in college. They are a Black Sabbath junkie with a background in Humanities and now working at a law firm. Speaker B would rather be a film reviewer and is in debt despite working hard.\n\nRelationship Description:\nSpeaker B shows interest in discussing career prospects with Speaker A, who loves playing soccer. Speaker A asked Speaker B to connect with their neighbor Cynthia, who works as a human resources specialist. Speaker B will text Cynthia's number to Speaker A later. Speaker B accidentally responded to Speaker A due to a spider landing on their keyboard, revealing their fear of spiders. Speaker A also has arachnophobia.\n\nEvent Description:\nSpeaker A and Speaker B shared a conversation about career paths and humanities. Speaker B recommended a guidance counselor to Speaker A. Speaker A has a soccer tournament coming up and loves Arsenal. Speaker B enjoys researching and writing briefs for their job at the law firm. Speaker B was once pranked with a spider by their boss at work and is considering asking for a raise. Speaker B likes Manchester United.",
        "speaker": "Speaker A",
        "raw_prediction": " Definitely, I could use the exercise. Let's plan something soon, maybe we can even catch an Arsenal game together afterwards."
    },
    {
        "utter_id": "e19-s5-t3",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " That's awesome that you're looking into internships in sports medicine! I remember you mentioning how passionate you are about it. I'm sure you'll find the perfect opportunity soon. And it's great to hear that the beach helps with your knees, maybe you should try surfing again, it might bring back some good memories!"
    },
    {
        "utter_id": "e19-s5-t8",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a great plan! Surfing is not only a fun way to make connections but also a great way to stay active and fit. It's awesome that you have supportive professors backing you up for your internship search. And collecting shells sounds like a relaxing hobby, especially with shells from around the world like the ones from Greece. I hope you get to add more to your collection as you continue your travels. Good luck with your internship search and soccer training, and maybe one day we can hang out on the beach together and share our shell collections!"
    },
    {
        "utter_id": "e20-s5-t3",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh wow, that's quite the challenge with Journey! Have you tried playing some relaxing music for her to distract her from the food? Maybe a little concert with Sid and Journey could help keep her entertained and away from the fridge!"
    },
    {
        "utter_id": "e20-s5-t4",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " Sid isn't too interested in food, he's more of a fan of basking in the sun or hunting for bugs in the backyard. But I do have to be careful with leaving any snacks out, he's got quite the appetite for anything he can find! It's a good thing your pets are so well-behaved, I'm sure they would get along great with my Zen masters on our playdate. And hey, a Disney cruise sounds like a fun break, you deserve it after all these years of hard work at your job!"
    },
    {
        "utter_id": "e23-s5-t2",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.",
        "memory_text": "User Description:\nSpeaker B is an individual who works in a cushy government job, with 15 years of experience in the field. They excel in staying calm and composed, even in stressful situations. Speaker B has a passion for painting and enjoys taking naps. They have two kids and are skilled in driving, but prefer to be a passenger and nap during long journeys. Speaker B's favorite movies are in the horror genre, and they have helped their father produce horror movies in the past.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is characterized by mutual admiration and curiosity. Speaker A looks up to Speaker B's job stability and wishes to have a similar career. Speaker A engages in creative conversations with Speaker B about movie plot ideas, showcasing a shared interest in the entertainment industry.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include preparing for an interview, where Speaker A seeks guidance and reassurance from Speaker B. Speaker A role-plays the interview scenario with a friend, demonstrating a proactive approach to job search. Speaker B expresses a desire to work in interior design, highlighting aspirations beyond their current job. The two bond over shared interests in mid-century design, horror movies, and creative brainstorming sessions. Speaker A wishes for Speaker B's father to achieve success in producing Hollywood movies, reflecting a sense of optimism and support in their relationship.",
        "speaker": "Speaker A",
        "raw_prediction": " That's great to hear that you enjoy producing horror movies! It sounds like you've found your creative outlet in the film industry. Maybe you could incorporate your passion for painting into your movie sets to add a personal touch. Have you thought about combining your skills in painting houses with your love for horror movies to create some unique and spooky set designs? It could be a fun way to further explore your creativity and make your mark in the industry."
    },
    {
        "utter_id": "e23-s5-t5",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " Movie blood is typically made from a combination of corn syrup, food coloring, and sometimes a thickening agent like flour or cornstarch. As for my favorite blood recipe, I like to add a touch of coffee grounds for a more realistic look. It's always fun experimenting with different ingredients to get the perfect gruesome effect on screen!"
    },
    {
        "utter_id": "e23-s5-t11",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.\nSpeaker A: Yes. Thanks for the reminder.  I have a couple of more companies to research today.  Of course, it is always interesting to figure out what a company's corporate culture is. ",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you're really prepared for your interview! I'm sure you'll do great. Remember to stay calm and showcase your strengths. And if you need any help with interview practice or tips, feel free to ask me or your brothers for assistance. Good luck!"
    },
    {
        "utter_id": "e24-s5-t9",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?\nSpeaker A: My last final is on English. I think I will do well, I just have to do a little more studying. Would you be willing to help me study?\nSpeaker B: Ah, English should be easier than History. Sure, I can help you. What do you need to do exactly? Write an essay?\nSpeaker A: Yeah, we have to write an essay and we have a spelling component towards the end of the exam, I sure could use a little help!",
        "memory_text": "User Description:\nSpeaker A is a sports enthusiast who enjoys activities like hiking and playing soccer. They have a friend named Dave who twisted his ankle during a hike, but still wants to play soccer. Speaker A is concerned about not getting too sore to play and seeks tips for sore muscles. They have expressed frustration with political candidates and did not vote in the last election. Speaker A hopes to get a soccer scholarship and admires their sister's teaching job. They have a positive outlook on academic success, hoping to surprise themselves with good grades.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal goals and offer support and encouragement to each other. Speaker B shows interest in attending Speaker A's soccer games and offers advice on managing sore muscles. Speaker A reassures Speaker B about their studies and encourages prioritizing happiness and peace of mind.\n\nEvents Description:\nSpeaker A finished a 5-mile hike with a rough trail and great view, while Speaker B expressed interest in joining a soccer game on Saturday. Speaker A advised bringing water due to the funny taste of fountain water, and Speaker B planned to bring a cooler with bottled water. Speaker A sought tips for sore muscles and mentioned going on a trail with Dave. Speaker B suggested rest and reassured Speaker A about hiking. They discussed academic achievements and Speaker B's desire to address his feelings towards his mother. Speaker A encouraged Speaker B to prioritize personal well-being.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad to hear that your history exam went well! I'm sure you'll do great on your English final too. And of course, I'd be happy to help you study. Maybe we can take a break from studying soccer strategies and focus on essay writing instead. And don't worry, I'll make sure to bring some extra water for you during the study session, just like we did during our hike with Dave. Let's make sure you're all set for your last final!"
    },
    {
        "utter_id": "e26-s5-t3",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?",
        "memory_text": "User Description:\nSpeaker A is a passionate cook who loves to bake, especially Indian cuisine. They are considering turning their cooking skills into a business. Speaker A also enjoys playing tennis and admires Serena Williams. They own chickens and enjoy cooking and baking.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker A offers cooking advice and recommendations to Speaker B, showing a level of familiarity and willingness to help.\n\nEvents Description:\n1. Speaker A plans to make dahl, pilaf rice, and tandoori chicken using a pressure cooker.\n2. Speaker A explains the use of pressure cookers for various dishes and recommends one for beginner cooks.\n3. Speaker A suggests involving Speaker B's husband in cooking Asian food while she handles the main dish using the pressure cooker.\n4. Speaker B's husband is a great cook and enjoys cooking Asian food, with Speaker B enjoying the end results of his cooking.",
        "speaker": "Speaker B",
        "raw_prediction": " Shrimp fried rice sounds like a great starting point! I'll definitely give it a try. Maybe I can have my husband help out with the Asian dishes while I work on the main course using the pressure cooker. Thank you for the recommendation!"
    },
    {
        "utter_id": "e27-s5-t2",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?",
        "memory_text": "User Description: Speaker B is a bartender who enjoys bartending and interacting with different people. They have a busy schedule but still finds time to relax and enjoy activities such as sailing and spending time on their houseboat. Speaker B has a close-knit family, including a little brother whom they spend time with on the houseboat.\n\nRelationship Description: The relationship between Speaker B and the robot (Speaker A) is interactive and friendly. They share personal information about their families, work, and interests, showing a level of intimacy in their conversations.\n\nEvent Description: Speaker B and Speaker A have shared events such as salsa dancing, going out for dinner, watching movies, and enjoying time with family. They also discuss self-care practices like massage, meditation, and essential oils, showing a mutual interest in wellness and relaxation. Speaker B enjoys sailing and spending time on their houseboat, while Speaker A plans to take their clients salsa dancing for fun. Both enjoy meeting new people and engaging in enjoyable activities like dancing under the stars on a boat.",
        "speaker": "Speaker A",
        "raw_prediction": " The Black Widow movie is about a former KGB assassin turned superhero who goes on a mission to confront her past. It's action-packed and full of suspense, definitely worth watching! It sounds like the Brazilian foods added to the fun experience, I'm glad you enjoyed it. Have you had a chance to relax on your houseboat recently?"
    },
    {
        "utter_id": "e27-s5-t11",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!\nSpeaker A: Yes, in fact I consider almost all foods to either be healing, harmful or neutral. In my opinion people should choose foods based on how they want to feel. Sushi is fresh and healthy so I considerate it to be very healing.\nSpeaker B: That is very wise thinking. Which vegetables do you feel are the best for healing? Are there any that should be avoided?\nSpeaker A: I feel that most leafy green vegetables are healthy, but it depends on the specific person's needs. For example some people need to avoid nightshades, like potatoes, etc. while other people can eat them without any problems. Overall, a diet with a variety of colors is good when it comes to vegetables",
        "memory_text": "User Description:\nSpeaker A is a person who values family and enjoys activities like healing clients, salsa dancing, and going to Brazilian steakhouse with their brother. They are interested in healing methods such as self-massage, essential oils, reiki, meditation, and self-awareness.\n\nRelationship Description:\nSpeaker B shows a level of intimacy with Speaker A by engaging in conversations about their family, activities, and interests. They express interest in trying out healing methods suggested by Speaker A and enjoy spending time on the water with their sister.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include going salsa dancing, dining at a Brazilian steakhouse, sailing with siblings, watching movies with family, and experiencing a heat wave. Speaker A plans on taking their clients salsa dancing soon, while Speaker B enjoys meeting different people and dancing under the stars on a boat.",
        "speaker": "Speaker B",
        "raw_prediction": " It's fascinating how you view food as healing. I completely agree with your perspective on choosing foods based on how they make you feel. It's so important to listen to your body's needs. I would love to learn more about different healing methods like self-massage and essential oils. Can you recommend any specific practices or products that have worked well for you?"
    },
    {
        "utter_id": "e28-s5-t3",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. ",
        "memory_text": "User Description:\nSpeaker A is a young girl who enjoys playing the clarinet in the marching band. She has a keen interest in music and energy-related topics, particularly in renewable energy and nuclear generators. Speaker A is also fascinated by space exploration and has a curiosity about teleportation machines.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is playful and engaging. They share a mutual interest in music, plants, and space exploration. Speaker A respects Speaker B's inventions and is intrigued by the teleportation machine being developed.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed the possibilities of sending weeds into space, the impact of music on plants, and the potential benefits of renewable energy sources. They also shared their aspirations for future space travel and innovative technology. The dialogue between them is filled with curiosity, humor, and a shared passion for exploring new frontiers.",
        "speaker": "Speaker B",
        "raw_prediction": " Haha, I can understand why you might be surprised by the idea of trees in your home! Plum and pear trees do best outside in the garden where they can get plenty of sunlight and space to grow. But hey, who knows, maybe in the future we'll have teleportation machines that can instantly transport full-grown trees indoors! Wouldn't that be something to see?"
    },
    {
        "utter_id": "e29-s5-t1",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?",
        "memory_text": "User Description:\nSpeaker A is a 27-year-old individual who spends most of their time working and reading. They are considering quitting their current job to pursue a career at Disney World or in dentistry. Speaker A likes books about ice cream, Disney World, and computers. They have no children and are fearful of dentists but want to help others overcome their fear.\n\nRelationship Description:\nSpeaker A had a supportive conversation with Speaker B about quitting their job and potentially pursuing a career in dentistry or at Disney World. Speaker B's mother, who is a dentist, was involved in the conversation and offered advice and encouragement to Speaker A.\n\nEvent Description:\nSpeaker A had a positive conversation with Speaker B's mother about potential career paths, including dentistry and working at Disney World. Speaker A expressed interest in both paths and received encouragement from Speaker B to pursue what makes them happy. Speaker A also discussed their fear of dentists and their desire to help others overcome that fear. Speaker B's child also expressed admiration for their grandmother being a dentist.",
        "speaker": "Speaker B",
        "raw_prediction": " I do enjoy my job at the computer company, but I've been thinking about exploring other career options. I'm considering pursuing a career in dentistry or at Disney World. It's great to hear that Speaker B's mother, who is a dentist, was able to offer advice and encouragement. I'm really interested in helping others overcome their fear of dentists, so maybe dentistry could be a good fit for me. And who knows, maybe I'll even get to work at Disney World one day!"
    },
    {
        "utter_id": "e29-s5-t5",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?",
        "memory_text": "User Description:\nSpeaker A is a 27-year-old individual who spends most of their time working and reading. They are considering quitting their current job to pursue a career at Disney World or in dentistry. Speaker A likes books about ice cream, Disney World, and computers. They have no children and are fearful of dentists but want to help others overcome their fear.\n\nRelationship Description:\nSpeaker A had a supportive conversation with Speaker B about quitting their job and potentially pursuing a career in dentistry or at Disney World. Speaker B's mother, who is a dentist, was involved in the conversation and offered advice and encouragement to Speaker A.\n\nEvent Description:\nSpeaker A had a positive conversation with Speaker B's mother about potential career paths, including dentistry and working at Disney World. Speaker A expressed interest in both paths and received encouragement from Speaker B to pursue what makes them happy. Speaker A also discussed their fear of dentists and their desire to help others overcome that fear. Speaker B's child also expressed admiration for their grandmother being a dentist.",
        "speaker": "Speaker B",
        "raw_prediction": " I've actually been with my company for about 5 years now. It's been a great learning experience and I've grown a lot in my role. I remember you mentioning that you were considering a career in dentistry. Have you taken any steps towards pursuing that path?"
    },
    {
        "utter_id": "e31-s5-t5",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " My job has been going well, thank you for asking. I actually get a lot of my movie ideas from my students in Film Studies. They always have great recommendations that I love to pass on. And yes, I do get some inspiration from work as well. How about you, any new projects you're working on lately?"
    },
    {
        "utter_id": "e32-s5-t1",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!",
        "memory_text": "User Description:\nSpeaker A is a person who enjoys eating jello, with their favorite flavors being cherry and grape. They have a family tradition of making jello with their grandma, who taught them how to make it. Speaker A has a passion for water sports, particularly water skiing, and has been doing it for 15 years. They have three kids who also enjoy water skiing. Speaker A is excited about boating and wishes to own a houseboat. They have a friendly and welcoming personality, as they look forward to meeting new people and sharing experiences with them.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is one of mutual interest and shared experiences. They have engaged in conversations about their favorite activities, such as snowboarding and water skiing, showing a willingness to learn from each other. Speaker B expresses a desire to steal Speaker A's jello recipe, indicating a playful and light-hearted dynamic between them.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about their favorite jello flavors, water skiing experiences, and aspirations for future activities. Speaker A expressed excitement about teaching Speaker B how to water ski and potentially sharing their jello recipe. Speaker B shared their interest in learning water skiing tricks and wakeboarding. Both speakers enjoy engaging in outdoor activities and have a shared passion for exploring new hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " That's wonderful to hear! I'm sure your kids will love learning how to make your grandmother's jello recipe. It's such a special tradition to pass on. If you ever need any tips or tricks, I'd be happy to help out!"
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.\nSpeaker A: Maybe we can a play fighting game like Street Fighter or Mortal Kombat. It's a good way to pass the time. I've always wanted to learn martial arts myself. Ha!",
        "memory_text": "User Description: Speaker A enjoys hunting deer in their free time and is concerned about deer overpopulation. They like sneaking up on deer in the wild and play calm video games. Speaker A hunts on both family land and state hunting sites.\n\nRelationship Description: Speaker A and Speaker B plan to play games together, showing a mutual interest in gaming. Speaker A invited Speaker B to play the Jurassic Park game and suggested playing Resident Evil together. Speaker B agreed to play Resident Evil with Speaker A.\n\nEvent Description: Speaker A got back from a hunting trip and checked out the conditions for animals living in the area. Speaker B spent all night playing League of Legends and bought Resident Evil VIII. Speaker B is looking forward to playing Resident Evil VIII and usually waits for a sale before buying games. Speaker B plays Resident Evil VIII by himself and turns the lights out to make it scarier. Speaker A and Speaker B are planning to play games together next week Friday after work. Speaker A mentioned that it may take bravery to play Resident Evil. Speaker B mentioned that Resident Evil is definitely scary and the UI is a little hard to get used to.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you enjoy playing all kinds of games, even though scary ones aren't your thing. I can understand why you might not enjoy Resident Evil. It can be pretty intense and scary. Have you ever tried playing any hunting games? I know you enjoy hunting deer in real life, so maybe a hunting game would be a fun way to pass the time without the scare factor."
    },
    {
        "utter_id": "e34-s5-t2",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm still considering getting one of your friend's kittens, but I think it might be best to wait until after my vacation next month. I want to make sure I can give the kitten all the attention it deserves. Plus, I'll have more time to read some poetry and maybe even try out those audiobooks I've been thinking about."
    },
    {
        "utter_id": "e35-s5-t2",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons",
        "memory_text": "User Description: Speaker B is an avid fisherman who enjoys traveling for work. His favorite food is fries, and he recently went fishing for a 30-pound muskie in Michigan during a sales convention. Speaker B's family also enjoys fishing, and his wife was shocked when shown a picture of the fish he caught.\n\nRelationship Description: Speaker B and the robot, Speaker A, have a friendly and engaging relationship, discussing fishing trips and sharing recommendations for places to visit and activities to do.\n\nEvent Description: Speaker B and Speaker A are planning fishing trips off the California coast, specifically mentioning locations like Humboldt County, Eureka, Arcata, and the redwood forest. Speaker A warns about car burglaries in the area, and Speaker B acknowledges the risk. They also discuss visiting Fort Humboldt State Park, Sequoia Park Forest and Garden, and Carson Mansion. Speaker B's goal is to visit every national park in the US, showing a shared interest in outdoor activities and exploration. Speaker A is working hard to save up for a tattoo of their father's face next to a slogan, planning to get it at the same place.",
        "speaker": "Speaker A",
        "raw_prediction": " That's a wonderful idea to honor your parents with matching tattoos. I can imagine how meaningful that would be. As for myself, I've been considering getting a tattoo with the names of my wife and sons. It's always nice to have something special to carry with you wherever you go. Maybe one day, I'll finally go through with it."
    },
    {
        "utter_id": "e35-s5-t11",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?\nSpeaker A: I probably shouldn't be saying this, but I put up a large mural on the side of the local Community Center.  People seem to like it - at least everyone except the administrators of the center.  Everyone is trying to figure out who did it.  ",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " That would be amazing! I'll definitely be the first in line to see your exhibit. Keep following your passion, and great things will come your way."
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. ",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " I appreciate your suggestion, but I think I'll stick to installing the aluminum sheeting for now. I'll keep you updated on how it goes with the raccoons. And speaking of pets, I'm still thinking about that bearded dragon from the pet store. Do you think it would be a good fit with my foster dogs?"
    },
    {
        "utter_id": "e36-s5-t9",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  ",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " I do keep the dogs secured. You never know how they are going to react. Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations. By the way, I visited a pet store recently and saw a bearded dragon that caught my eye. But with my fostering responsibilities, I'm not sure if it would be the right time to bring one home."
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " The weather is actually perfect for iced tea today, just like in Mexico City. I can imagine sitting outside with a refreshing drink, enjoying the day. How are the kitten and your cat adjusting to the new addition to the family? It must be quite the adventure with them around!"
    },
    {
        "utter_id": "e39-s5-t2",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!",
        "memory_text": "User Description:\nSpeaker B is a divorced veteran with a passion for scuba diving in Hawaii. They have two pet snakes named Hansel and Gretel. Speaker B is interested in neuroscience and has experience in a research lab. They are familiar with eagle scout projects for veterans and proper flag disposal.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in scuba diving, with Speaker A expressing a desire to dive despite a fear of sharks. Speaker A also studies neuroscience and volunteers at a research lab. Speaker B and Speaker A engage in conversations about marine life and sharks.\n\nEvent Description:\nSpeaker B reminisces about scuba diving experiences in Hawaii and expresses a desire to dive in a steel cage with sharks. Speaker B discusses using the GI Bill for neuroscience classes and prefers animals over humans. Speaker B also mentions lunch with a scuba diving friend and their interest in studying marine life. Speaker B shows gratitude towards Speaker A for their service and wishes them luck with their studies. Speaker A shares information about shark diving documentaries and shark behavior.",
        "speaker": "Speaker B",
        "raw_prediction": " My pet snakes are doing great, thanks for asking. They really are low maintenance, which is perfect for me with all my other interests and hobbies. I was actually thinking about taking them out for some sun in the backyard later."
    },
    {
        "utter_id": "e42-s5-t3",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!",
        "memory_text": "User Description:\nSpeaker A is a big country music fan who is sad that winter is ending, their favorite season. They live on a corn and bean farm with lots of animals and they like driving trucks and tractors. Speaker A loves BBQing and grilling steak and hotdogs.\n\nRelationship Description:\nSpeaker A suggests Speaker B to come down and visit for blasting country music, and Speaker B wishes to live the country lifestyle down there. Speaker B plans to meet Speaker A in person after renovating their house and buying furniture safe for their two dogs.\n\nEvent Description:\nSpeaker A inspired to redecorate the house with purple furniture and neon pink and lavender walls. Speaker B regrets the green and purple scheme but plans to give Speaker A all purple stuff. Speaker A bought new furniture including a new couch, recliner, and patio furniture. Speaker A hopes to enjoy quiet evenings outside this summer and plans to grill and eat outside most nights when the weather permits. Speaker B offers to bring a new marinade and a six pack over for a BBQ gathering. Speaker A uses lamps to keep bugs away while enjoying food and company outside. Speaker A has bug spray as a backup plan, and Speaker B needs to get lamps and candles to keep bugs away.",
        "speaker": "Speaker B",
        "raw_prediction": " I remember you were thinking about purple furniture and neon pink and lavender walls for your living room, but I think white with blue or red details would be a nice color scheme too. I'll bring over the bug-repelling lamp for our barbecue and we can enjoy some country music while grilling steak and hotdogs!"
    },
    {
        "utter_id": "e44-s5-t2",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).",
        "memory_text": "User Description:\nSpeaker B travels frequently for work and misses his wife and kids. They hate traveling and feel like it's taking them away from their loved ones. Speaker B is supportive and empathetic towards others, giving pep talks and motivating people to strive through hardships. They have experienced personal struggles with depression and anxiety, which led them to get into motivational speaking. \n\nRelationship Description:\nSpeaker A shows concern and support towards Speaker B, asking about their family and work travels. Speaker A listens attentively to Speaker B's concerns and offers advice when needed. They engage in meaningful conversations and show genuine interest in each other's lives.\n\nEvent Description:\nSpeaker A and Speaker B discuss their running experiences, with Speaker A training for a marathon and Speaker B sharing their past marathon experience. They bond over their love for running and motivate each other to pursue their goals. Speaker A introduces Speaker B to the idea of running together for an Alps marathon, showing a desire to support and motivate them in their running journey. They also share personal stories and struggles, creating a strong connection through their shared experiences. Speaker A's love for singing and yodeling adds a unique and lighthearted element to their conversations, showcasing their diverse interests and personalities.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you so much for your kind words! I'm so glad to hear that my speech had a positive impact. And I completely understand how tough it can be to be away from loved ones while traveling. It's something I struggle with too. But I believe that we can find strength in our connections with others and use that to motivate us to keep going, no matter how difficult it may seem. I'd be honored to be your motivational speaker and help you and your friend find that inner drive to run again. Let's support each other and push through the challenges together."
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.",
        "memory_text": "User Description:\nSpeaker B travels frequently for work and misses his wife and kids. They hate traveling and feel like it's taking them away from their loved ones. Speaker B is supportive and empathetic towards others, giving pep talks and motivating people to strive through hardships. They have experienced personal struggles with depression and anxiety, which led them to get into motivational speaking. \n\nRelationship Description:\nSpeaker A shows concern and support towards Speaker B, asking about their family and work travels. Speaker A listens attentively to Speaker B's concerns and offers advice when needed. They engage in meaningful conversations and show genuine interest in each other's lives.\n\nEvent Description:\nSpeaker A and Speaker B discuss their running experiences, with Speaker A training for a marathon and Speaker B sharing their past marathon experience. They bond over their love for running and motivate each other to pursue their goals. Speaker A introduces Speaker B to the idea of running together for an Alps marathon, showing a desire to support and motivate them in their running journey. They also share personal stories and struggles, creating a strong connection through their shared experiences. Speaker A's love for singing and yodeling adds a unique and lighthearted element to their conversations, showcasing their diverse interests and personalities.",
        "speaker": "Speaker A",
        "raw_prediction": " I can't wait to run the Alps marathon with you! It will be an amazing journey towards reaching our goals. And don't worry, I'll make sure to send you those motivational quotes bright and early to get you out of bed. And hey, if you ever need a pep talk or some words of encouragement, I'm here for you, just like you've always been there for me. We'll get through this together, one step at a time."
    }
]