[
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations, which caused them to now live in a little house in the suburbs that they love.\n2. The child's supportive and caring nature towards the parent makes the parent want to provide a safe and stable environment, as they value independence and self-sufficiency.\n3. Both the parent and child express love and support for each other, with the child finding the parent's story inspiring as the parent mentions making mistakes in the past and trying to turn their life around.",
        "speaker": "Parent",
        "raw_prediction": "I'm glad you feel that way. It's important to truly listen and understand others.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t9",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.\nParent: It was. I love being able to appreciate the beauty of nature. And you know, having my own place to live in the suburbs makes it even easier to do things like that.\nChild: Yeah, your house is really nice. You've always been good at taking care of yourself.\nParent: Well, I've always valued my independence. Even as a kid, I wanted to do things on my own. That's why I decided to live on my own a few years ago.",
        "memory_text": "1. The parent values independence and self-sufficiency. This stems from wanting to provide a safe and stable environment for the child.\n2. The child is supportive and proud of their parent for making changes. This reaction was inspired by the parent's story and willingness to appreciate small moments, leading to the parent living in a little house in the suburbs that they love.",
        "speaker": "Child",
        "raw_prediction": "I remember when you first moved into your own place. It was a big step, but you handled it so well.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.\nParent: It was. I love being able to appreciate the beauty of nature. And you know, having my own place to live in the suburbs makes it even easier to do things like that.\nChild: Yeah, your house is really nice. You've always been good at taking care of yourself.\nParent: Well, I've always valued my independence. Even as a kid, I wanted to do things on my own. That's why I decided to live on my own a few years ago.\nChild: I can see why you would want to do that. You're just really good at being self-sufficient.\nParent: Thanks for saying that. But I still think one of the most important things I can do for others is listen. Whether it's to give advice, or just to let someone feel heard.",
        "memory_text": "The parent values independence and self-sufficiency, which is why they decided to live on their own a few years ago. This decision was influenced by their desire to provide a safe and stable environment for the child. \nThe parent's past experience of being in juvenile detention and going through a tough time when they got arrested led them to appreciate small moments and find hope even in difficult situations. This ultimately shaped their decision to live in a little house in the suburbs that they love.",
        "speaker": "Child",
        "raw_prediction": "I appreciate how you're always there to listen to me. It means a lot to feel understood by you.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t3",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.",
        "memory_text": "Neighbors A and B started spending more time together, eventually becoming good friends who have known each other for years. They catch up frequently, reminiscing about past events and planning to hang out once a week. Neighbors A enjoys the support and comfort Neighbor B provides, while Neighbor B suggests cooking together and shows consideration by offering extra water for lawn mowing.",
        "speaker": "Neighbors B",
        "raw_prediction": "I know you meant well, but I wasn't quite ready for a cold plunge. Let's stick to warmer activities next time.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t14",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.\nNeighbors B: I feel the same way. We should plan something fun to do together.",
        "memory_text": "Neighbors A and B want to spend more time together as they haven't seen each other in a while and are catching up. They both enjoy spending time outside, even if it involves doing chores like mowing the lawn. Neighbor A enjoys spending time in Neighbor B's cozy home and wants to hang out more often. They both agree to start this weekend and are looking forward to it. They plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. Both Neighbors A and B, who are on friendly terms, enjoy spending time together. They have known each other for years and have become good friends, reminiscing about past events.",
        "speaker": "Neighbors A",
        "raw_prediction": "How about we go for a walk in the park this weekend? It'll be nice to enjoy the outdoors together.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t1",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?",
        "memory_text": "1. Co-worker B is supportive and encourages Co-worker A to prioritize their health. Co-worker B is supportive and glad that Co-worker A is okay. Co-worker B was surprised to learn about Co-worker A's past struggles.\n2. Co-worker A has been feeling off lately. Co-worker A is grateful to Co-worker B for letting them borrow the horse and is having a great time riding her. Co-worker A expressed gratitude for the horse that Co-worker B gave them, mentioning it brings joy and happiness.\n3. Co-worker B offers help and support to Co-worker A. Co-worker B is generous and allows Co-worker A to ride any of their horses anytime. Co-worker A expressed gratitude for the horse that Co-worker B gave them, mentioning it brings joy and happiness.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's been pretty hectic, but I'm managing. How about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t7",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.",
        "memory_text": "Co-worker B supports Co-worker A in prioritizing their health and is pleased that Co-worker A is doing well. Co-worker B is grateful for the horse given by Co-worker A, expressing joy and happiness.",
        "speaker": "Co-workers B",
        "raw_prediction": "I appreciate your support, it means a lot to me. Let's tackle this workload together as a team.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t6",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.",
        "memory_text": "- Classmates A wants to major in biology or the medical field, and Classmates B is considering taking biology classes in college.\n- Classmates A finds it refreshing to talk to someone genuinely interested in science and learning, while Classmate B admires Classmate A's dedication to science. They both share an interest in Lady Gaga's song \"Born This Way.\"\n- Classmates A suggests grabbing lunch together to spend more time with Classmates B, who they consider a great study partner. They both enjoy talking to each other while balancing school and family responsibilities.",
        "speaker": "Classmates A",
        "raw_prediction": "Oh, I must have misunderstood the situation. I'm sorry for jumping to conclusions.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t1",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors A is overwhelmed but also excited about their new ability. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor A is considering looking for a new job but is unsure of what they want to do. Neighbor A is feeling unfulfilled with their job and wants to make a bigger impact. Neighbor A is thinking about exploring new skills or hobbies outside of work, such as taking online courses or learning a new language.",
        "speaker": "Neighbors B",
        "raw_prediction": "Of course! What's the secret?",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t2",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?",
        "memory_text": "Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors A and B share a dream of developing telekinetic abilities together in the future. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning. Neighbors A is overwhelmed but also excited about their new ability. Neighbor A feels there is no room for growth or new projects at their current job.",
        "speaker": "Neighbors A",
        "raw_prediction": "I think I might have discovered a way to enhance my telekinetic abilities even further.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t4",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?",
        "memory_text": "Neighbors A and B are discussing the idea of having telekinetic abilities. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor A feels there is no room for growth or new projects at their current job. \nNeighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor A feels there is no room for growth or new projects at their current job. \nNeighbors B expresses concerns about accidentally moving objects and causing unintended consequences.",
        "speaker": "Neighbors A",
        "raw_prediction": "She's in one of her cleaning frenzies and I just needed a break.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t15",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbor A enjoys trying new things, like new recipes. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n\nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors A has been practicing moving small objects with their telekinesis.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's a good idea. It's always important to keep growing and challenging yourself. Have you thought about what kind of opportunities you might be interested in exploring?",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t17",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.\nNeighbors B: That's a good plan. It's important to pursue what makes you happy and fulfilled.\nNeighbors A: Definitely. Thanks for being such a great listener and always giving me good advice.",
        "memory_text": "Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. This leads to Neighbors A and B joking about the fun aspects of using telekinesis to surprise people. Neighbors B reacts with excitement and support towards Neighbor A's new ability, expressing a desire to plan a dinner to celebrate their adventures in learning.\nNeighbors B is open to trying new recipes and is thrilled to receive the chickpea curry recipe from Neighbors A. This conversation transitions into Neighbors A and B discussing the idea of having telekinetic abilities. As a result, Neighbor A feels overwhelmed yet excited about their newfound ability. This then contrasts with Neighbor A's feelings of stagnation and lack of growth in their current job.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm always here for you, happy to offer support and help you navigate through any decisions you need to make. Just remember to prioritize your own happiness and well-being.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t1",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.",
        "memory_text": "1. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends. This causes Classmates B to appreciate Classmates A's gesture of buying coffee. In reaction, Classmates A agreed to try the suggestion and thanked Classmates B for it. As a result, Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n\n2. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends. In reaction, Classmates A is social and enjoys meeting new people. This makes Classmates A consider talking to a therapist or counselor to address past issues.\n\n3. Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings. This makes Classmates A want to enjoy treating their friends to coffee, which causes Classmates A and B to have shared memories of buying coffee from Starbucks and enjoying it together.",
        "speaker": "Classmates A",
        "raw_prediction": "That's great to hear! I can't wait to hear about your exciting plans.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t10",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.",
        "memory_text": "Classmates A and B enjoy singing karaoke together and look forward to future outings. They are open to meeting for coffee again in the future. Classmates A agreed to try the suggestion and thanked Classmates B for it. Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n\nClassmates A and B both enjoy socializing and going out to parties together. They are open to meeting for coffee again in the future. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep. However, Classmates A expresses regret about their past academic performance.\n\nClassmates A and B enjoy singing karaoke together and look forward to future outings. They both plan to relax at home later in the day. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep. Classmates B suggests going back to school or taking courses to improve.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm really excited about this opportunity. I think we can achieve great things together.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t13",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.",
        "memory_text": "1. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends, which causes Classmates B to appreciate Classmates A's gesture of buying coffee. This leads to Classmates A agreeing to try the suggestion and thanking Classmates B for it, showing that Classmates B wants Classmates A to work through their feelings and take steps towards a better future.\n\n2. Classmates A and B both enjoy socializing and going out to parties together, and they are open to meeting for coffee again in the future. This mutual interest in socializing also extends to both planning to relax at home later in the day. Additionally, Classmates B suggests meditation or breathing exercises to help Classmates A relax before bed, which causes Classmates A to consider talking to a therapist or counselor to address past issues.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! It's amazing how simple practices like yoga and meditation can make a big difference in our daily lives.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?",
        "memory_text": "Neighbors A emphasized the importance of taking care of trees and the environment for future generations, showing their concern for the environment. Neighbors B values their friendship with Neighbors A and wants to ensure it remains strong, offering help and support in times of need.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, I've been hitting the gym regularly. It feels good to stay active.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t2",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?",
        "memory_text": "- Classmates B is supportive and encourages Classmates A in their business venture. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans. Classmate A has always loved singing but never thought it was possible until now.\n- Classmates A appreciates the President's difficult decisions and actions to improve the country's situation. Classmates A is willing to work hard and learn the necessary strategies for business success. Classmate A wants to pursue a dream of becoming a singer.",
        "speaker": "Classmates A",
        "raw_prediction": "I actually started learning carpentry from my grandfather when I was young. He was a skilled craftsman and inspired me to pursue it as a career.",
        "previous_summary": "Classmates A is interested in entrepreneurship and has signed up for a seminar on starting a business.\nClassmates B is supportive and encourages Classmates A in their business venture.\nClassmates A has had a business idea for a while and is now taking steps to make it a reality.\nClassmates A is willing to work hard and learn the necessary strategies for business success.\nClassmates B mentions the importance of seeking advice from mentors and staying motivated and passionate about the business idea.\nClassmates A appreciates the support and encouragement from Classmates B.\nClassmates A wants to get to know Classmates B better and become friends.\nClassmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\nClassmates B is interested in starting their own business but doesn't know where to start."
    },
    {
        "utter_id": "e9-s5-t4",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?",
        "memory_text": "- Classmate A has a background in carpentry from helping their dad and now enjoys it as a career.\n- Classmate B acknowledges and supports Classmate A's journey into carpentry.\n- Classmate B hopes for improvements from the President for the country's betterment.\n- Classmate A is eager to learn business strategies and attends a seminar on starting a business.\n- Classmate A plans to apply the knowledge gained from the seminar to future business endeavors.\n- Classmate A is researching local opportunities like open mic nights to build a following for their talent.",
        "speaker": "Classmates A",
        "raw_prediction": "I recently finished a custom-built bookshelf for a client, and they were thrilled with the result. It's always satisfying to see the impact of my work on someone's home.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t9",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.",
        "memory_text": "[Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.] - (React) - [Co-worker A and Co-worker B excel at working well with others and resolving issues.] - (React) - [Co-worker B appreciates Co-worker A's effort in giving them a massage to help them relax.] \n[Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.] - (SameTopic) - [Both Co-worker A and Co-worker B value communication and understanding in relationships.] - (SameTopic) - [Both Co-worker A and Co-worker B enjoy connecting with each other to make work more enjoyable.] \n[Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.] - (React) - [Co-worker A and Co-worker B excel at working well with others and resolving issues.] - (React) - [Co-worker A's massage to Co-worker B helps them feel relaxed and at peace.]",
        "speaker": "Co-workers B",
        "raw_prediction": "Absolutely, open communication and collaboration are key to our success as a team. Thank you for being willing to consider different perspectives.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t10",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.",
        "memory_text": "Co-worker B appreciates Co-worker A's competence and effort in their work, leading to a positive impact on the workplace. \nCo-worker A and Co-worker B work well together, resolving issues effectively, and enjoying moments of connection, making work more enjoyable.",
        "speaker": "Co-workers A",
        "raw_prediction": "Of course, I remember giving you back your watch. It's the little things that can make a big difference, right?",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t13",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.\nCo-workers A: Of course I remember! I'm happy we're friends again.\nCo-workers B: Me too. And do you still have that baby doll and rattle you bought a couple of years ago?\nCo-workers A: Yes, actually! I gave them to my niece and she loves them.",
        "memory_text": "Co-worker A takes pride in their work and enjoys helping others, while both Co-worker A and Co-worker B value communication and understanding in relationships. They find these moments of connection make work more enjoyable. \nCo-worker A's good work ethic is acknowledged by Co-worker B, leading to a positive impact on the workplace. Co-worker A made Co-worker B happy again by returning a watch to them. Additionally, Co-worker A bought a baby doll and a rattle for themselves, even though they do not have any kids, and later gifted them to a friend who is expecting. \nBoth Co-worker A and Co-worker B excel at working well with others and resolving issues. Co-worker A is giving Co-worker B a massage to help them relax.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's so sweet of you to give them to your niece. It's great to see you spreading joy and kindness, even outside of work.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t4",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.",
        "memory_text": "Neighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This has caused Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. Neighbors A values the relationship with Neighbors B and considers them like family. As a result, Neighbors A is excited to explore the neighborhood and make new friends.\n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. In response, Neighbors B acknowledges Neighbors A's friendly and outgoing nature.\n\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This has caused Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. Neighbors A finds spending time with God brings them peace and happiness, which led to Neighbors A finding a park and a coffee shop nearby that they want to visit.",
        "speaker": "Neighbors A",
        "raw_prediction": "It was definitely a nice change of pace, but there's still no place like home.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t5",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.",
        "memory_text": "Classmates B is interested in attending a new technology conference next month. Classmates B noticed Classmates A's improvement and acknowledged their hard work. Classmates B is supportive of Classmates A's new relationship and believes they found someone who makes them happy.\nClassmates B is working on finishing a history project. Classmates A is dedicated to studying hard and taking extra classes to get into a good college. Classmates B advises Classmates A to consider how others perceive them, especially in situations like applying to college. \nClassmates A is willing to work hard to achieve their dreams. Classmates A met the girl of their dreams at a party and have been texting her nonstop.",
        "speaker": "Classmates B",
        "raw_prediction": "That's awesome! It's great that you're diving deeper into the subject. Any plans on how you'll continue to explore it further?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t6",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.",
        "memory_text": "- Classmates B noticed Classmates A's improvement and acknowledged their hard work after working on finishing a history project.\n- Classmates A is dedicated to studying hard and taking extra classes to get into a good college, which Classmates B wants.\n- Classmates A had a moment of frustration in the past but has learned to channel that energy into studies, hindering the finishing of Classmate B's history project.",
        "speaker": "Classmates A",
        "raw_prediction": "Thanks! I just find history so fascinating.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t8",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.",
        "memory_text": "1. Classmates A's dedication to studying hard and taking extra classes to get into a good college has led to their willingness to work hard to achieve their dreams, as well as meeting the girl of their dreams at a party and texting her nonstop.\n2. Classmates A's improvement in their studies, noticed by Classmates B, has resulted in Classmates B being supportive of Classmates A's new relationship and believing they found someone who makes them happy.",
        "speaker": "Classmates A",
        "raw_prediction": "All that hard work paid off in the end. It's amazing how far dedication can take you.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t10",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.",
        "memory_text": "Classmates A's dedication to studying hard and taking extra classes to get into a good college caused them to show up to school in pajamas due to oversleeping after studying late. This reminds Classmates B of a funny moment from high school involving Classmates A wearing pajamas to school.\nClassmates A's dedication to studying hard and taking extra classes to get into a good college makes them want to work on an essay about the Industrial Revolution. Furthermore, their dedication also makes them value being true to themselves and expressing their own style, which their girlfriend appreciates.\nStruggling with motivation while working on an essay about the Industrial Revolution, Classmates A found a way to stay focused by thinking about the payoff of their hard work. This determination leads them to be willing to work hard to achieve their dreams and receive support from Classmates B in their new relationship.",
        "speaker": "Classmates A",
        "raw_prediction": "Haha, good times. I've always liked adding my own twist to things.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.",
        "memory_text": "Mentor's encouragement and support have played a significant role in Mentee's journey to sobriety, for which Mentee expresses gratitude and credits Mentor. This positive change has made Mentor proud of Mentee's growth and ability to take control of their life.\n\nMentor's ongoing support for Mentee's sobriety journey has been well-received by Mentee, who values Mentor's willingness to share knowledge and help them achieve their goals.\n\nMentee's focus on living in the moment and feeling more connected to life resonates with their challenging but rewarding experience of getting sober. Mentee is now dedicated to sobriety and believes incorporating yoga into their routine will further benefit their mental and physical health.",
        "speaker": "Mentor",
        "raw_prediction": "That's wonderful to hear, Mentee. Living in the moment can truly enhance your overall well-being and outlook on life. Keep embracing that mindset, and you'll continue to see positive changes in your journey.",
        "previous_summary": "The Mentee is trying to live in the moment and feel more connected to their life.\nThe Mentor is supportive of the Mentee's approach and encourages them to continue.\nThe Mentee focuses on savoring the small details in life, such as food and nature.\nThe Mentee used to feel overwhelmed, but now feels more fulfilled by living in the moment.\nThe Mentor advises the Mentee to be gentle with themselves when they slip back into old patterns.\nBoth the Mentor and Mentee believe that living in the moment can bring joy and strength in facing challenges.\nMentee has a history of substance abuse but has been sober for a year.\nMentee values living in the moment and staying focused on their sobriety and goals."
    },
    {
        "utter_id": "e14-s5-t6",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?",
        "memory_text": "1. The Child suggests creating a schedule for chores to ensure everyone contributes equally. The Parent expresses a desire to be a better role model for the Child and their siblings. The Child is caring and offers help to the Parent.\n\n2. The Parent agrees to make an effort to start pulling their weight around the house and to follow the chore schedule. The Parent expresses a desire to be a better role model for the Child and their siblings. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n\n3. The Child feels it is unfair that they have to do certain chores because the Parent is too tired. This causes the Parent to acknowledge being lazy about washing dishes and promises to contribute more to keeping the home clean. They have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores. The Parent has seen a doctor and is taking medicine for their illness.",
        "speaker": "Parent",
        "raw_prediction": "I'm not sure yet, but I'm hopeful that it will attract some interest.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t13",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?\nParent: Yes, I do remember that. That was a fun afternoon.",
        "memory_text": "The Parent expresses a desire to be a better role model for the Child and their siblings. This leads to the Child being caring and offering help to the Parent. \nThe Child feels it is unfair that they have to do certain chores because the Parent is too tired. This leads to the Parent acknowledging being lazy about washing dishes and promising to contribute more to keeping the home clean. They have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores. This leads to the Parent seeing a doctor and taking medicine for their illness.",
        "speaker": "Child",
        "raw_prediction": "Maybe we can work on some more creative projects together in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t1",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.",
        "memory_text": "1. Classmates A and B both value trying new things and taking risks for personal development. Classmates B supports Classmates A's perspective on living authentically and free from others' opinions, as Classmate A values independence and focuses on their own happiness. This has led Classmates A to pursue their passions and enjoy life.\n\n2. Classmates A and B, who are in the same class, have discussed study tips in the past. Classmates B gave advice to Classmates A that paid off, leading to a beneficial outcome for Classmate A.\n\n3. Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth. Both speakers highlight the importance of focusing on personal happiness and not being swayed by external judgments.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, I saw it! Your blog is awesome, and I love how you're supporting emerging artists. Keep up the great work!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t2",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.",
        "memory_text": "Co-worker A has grown and become more confident over the years, which has led to considering taking on more responsibility at work as a start towards being a leader. Co-worker B acknowledges and supports Co-worker A's growth and progress, advising them to take small steps and have one conversation at a time. Both Co-workers emphasize the importance of supporting each other as co-workers.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks! I'm really looking forward to the new challenges and responsibilities.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t5",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.",
        "memory_text": "- Co-worker A has fantasies of being a great leader, which leads to Co-worker A being focused on getting along and working smoothly with Co-worker B. This is acknowledged and supported by Co-worker B, who advises Co-worker A to take small steps and have one conversation at a time.\n- Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader. This drives Co-worker A to have aspirations of being a great leader and emphasize the importance of communication. Over the years, Co-worker A has grown and become more confident, although at one point feeling embarrassed for losing control of their emotions.\n- Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader. As a result, Co-worker A is focused on getting along and working smoothly with Co-worker B, who acknowledges and supports Co-worker A's growth and progress, advising them to take small steps and have one conversation at a time.",
        "speaker": "Co-workers B",
        "raw_prediction": "I'm confident you'll excel in your new role as a product manager. Your dedication and leadership skills will undoubtedly shine through in your work with the design team.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t12",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.",
        "memory_text": "Co-worker B believes that Co-worker A has the potential to be a great leader if they use their power for good. This aligns with Co-worker A's aspirations of being a great leader and emphasizing the importance of communication.\n\nCo-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader. In response, Co-worker B acknowledges the importance of communication and resolving conflicts, which prompts Co-worker A to calm down and have a conversation with Co-worker B.\n\nCo-worker A has fantasies of being a great leader, which is related to their feeling stressed about their relationship with Co-worker B. This stress is a result of Co-worker A feeling embarrassed for losing control of their emotions in the past.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, I've always believed in the power of growth and learning from past experiences. I'm ready to tackle this new challenge head-on and continue to develop my leadership skills.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t2",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?",
        "memory_text": "Neighbors A surprised Neighbors B with a pizza, which led to Neighbors A being willing to take things slow in their relationship with Neighbors B. This was followed by Neighbor B sharing that their son also started high school, creating a bond over the challenges and excitement of this milestone. \nNeighbors A did a gesture of appreciation for Neighbors B's actions in the neighborhood, resulting in Neighbors A being willing to take things slow in their relationship with Neighbors B. Neighbor B then reassured Neighbor A about past embarrassing incidents, highlighting their strong friendship. \nNeighbors A surprised Neighbors B with a pizza, showing their value for friendship, leading to a discussion about Neighbor A's daughter starting high school and the adjustments the family is going through.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's called box breathing. You inhale for four seconds, hold for four seconds, exhale for four seconds, and hold for four seconds again. It's quite calming.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. ",
        "memory_text": "Neighbor A surprised Neighbor B with a pizza as a gesture of appreciation for Neighbor B's actions in the neighborhood. This surprised Neighbor B and both neighbors appreciated their friendship and are open to going back to being friends if the romantic relationship doesn't work out. Additionally, Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship. \nNeighbor A went to the park with their son, who had a great time, caused by their gesture of appreciation for Neighbor B's actions in the neighborhood. It's similar to when Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.",
        "speaker": "Neighbors A",
        "raw_prediction": "Absolutely, having simple techniques like that can really make a difference in our daily lives. It's all about finding what works best for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t12",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.\nNeighbors B: It's always nice to find a good outdoor space like that. Have you been back recently?",
        "memory_text": "Neighbor A ordered a large cheese pizza with extra sauce for Neighbor B as a gesture of appreciation. This act caused Neighbor A to recently discover a park on Main Street with a playground and water park area. In the past, Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic. This gesture of appreciation also led Neighbor B to value their friendship with Neighbor A. Additionally, Neighbor A reminisces about simpler times and expresses missing them.",
        "speaker": "Neighbors A",
        "raw_prediction": "I haven't been back recently, but I definitely miss those times we spent at the park. It was such a relaxing and enjoyable place to be.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t13",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.\nNeighbors B: It's always nice to find a good outdoor space like that. Have you been back recently?\nNeighbors A: Not in a little while, but maybe we should plan a visit soon. ",
        "memory_text": "Neighbor A recently discovered a park on Main Street with a playground and water park area, which reminded Neighbor A and Neighbor B of the park they found together a couple of years ago and enjoyed playing frisbee and having a picnic. \nNeighbor A surprised Neighbor B with a pizza, showing Neighbor B the value of their friendship. In return, Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship. \nNeighbor A surprised Neighbor B with a pizza, which made Neighbor B appreciate their friendship even more. As a result, Neighbor A reminisces about simpler times and expresses missing them.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds like a great idea. It would be nice to revisit that park and enjoy some outdoor time together.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t12",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.\nNeighbors B: That sounds like a great idea. You have the opportunity to do so much with your newfound wealth.\nNeighbors A: Definitely. It's funny how things can change so quickly. Just a few years ago, I was stuck in a job I hated and now I have all this freedom.\nNeighbors B: Speaking of jobs, have you thought about what you want to do now? You don't really have to work if you don't want to.\nNeighbors A: I know, but I don't think I could ever completely give up working. Plus, I have some ideas for businesses that I want to pursue. I think this money will give me the push I need to start something new.\nNeighbors B: I'm excited to see what you come up with. You're definitely one of the most driven people I know.",
        "memory_text": "Neighbors A made a big career change recently and is much happier now. This change caused Neighbors A to feel stagnant in their current job and look for more growth and challenge. Neighbors A and B had a conversation a couple of years ago about needing a change, which led to Neighbors A taking the leap to make a change and being glad they did.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I appreciate that. I'm really looking forward to this next chapter in my life.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t6",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.\nNeighbors B: I'm sorry to hear that. Have you considered looking for a new job?",
        "memory_text": "Neighbor B shared a childhood memory of their tree house being destroyed due to lack of proper care. This led to Neighbor A helping with their lawn, showcasing mutual support between them. This mutual support is a key characteristic of their relationship as neighbors.\nNeighbor A stressed the significance of maintaining clean outdoor spaces for the future, which Neighbor B agreed with and highlighted the sense of community that arises from assisting each other. This emphasis on mutual help is a core aspect of the bond between Neighbors A and B.\nNeighbor A discussed the importance of cleaning a tree house to prevent insects and spiders from inhabiting it, emphasizing the collaborative nature of their neighborhood where Neighbors A and B assist each other with various tasks. This spirit of reciprocity is valued by Neighbor B, who appreciates the mutual support between them as neighbors.",
        "speaker": "Neighbors A",
        "raw_prediction": "I have thought about it, but I haven't made any decisions yet. It's a tough situation to be in.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t7",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.\nNeighbors B: I'm sorry to hear that. Have you considered looking for a new job?\nNeighbors A: I have, but with the current job market, it's really tough. Plus, I don't have a lot of experience in other fields.",
        "memory_text": "Neighbor A highlighted the importance of taking care of belongings, whether inside or outside, for cost-effectiveness, which resonated with Neighbors B who mentioned the sense of community built through helping each other. This led to both Neighbors A and B being helpful towards each other, with Neighbors B showing support and understanding of Neighbor A's mistake.\n\nNeighbor A emphasized the significance of maintaining clean outside spaces for the future, sparking a conversation about how Neighbors A and B help each other with tasks in the same neighborhood. This made Neighbor A express a desire to rearrange their living room, knowing that Neighbors B has experience with furniture rearrangement.\n\nNeighbor A brought up cleaning a tree house to prevent insects and spiders, leading to Neighbors A and B recalling instances of mutual support like when Neighbor A helped with Neighbors B's lawn. This further highlighted the supportive and understanding dynamic between Neighbors A and B.",
        "speaker": "Neighbors B",
        "raw_prediction": "I understand, job hunting can be challenging. Maybe you could explore opportunities where your current skills can be transferred to a different field.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!",
        "memory_text": "1. Co-worker A, described as having \"Sherlock Holmes-like skills\" and enjoying solving mysteries, did some research on social media to find out that Co-worker B is married. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker A suggests celebrating their detective work with drinks after work, as they are excited about payday and being able to pay off bills. Co-worker B, who is married, had a weekend where they went hiking and had dinner with friends. They also shared happy memories from their time working together.",
        "speaker": "Co-workers A",
        "raw_prediction": "Wow, that's awesome! How did it go?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.",
        "memory_text": "Co-worker A and Co-worker B are both excited about payday and being able to pay off bills. Co-worker A suggests celebrating their detective work with drinks after work. Co-worker B is married and had a weekend where they went hiking and had dinner with friends. Co-worker A and Co-worker B shared happy memories from their time working together. Co-worker A enjoys solving puzzles and mysteries, even considering becoming a detective. Co-worker A has a talent for solving puzzles and mysteries.",
        "speaker": "Co-workers B",
        "raw_prediction": "I'm glad you pushed past the nerves and did it. It must have been a special moment for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t12",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.\nCo-workers B: Oh gosh, yes. I forget sometimes that not everyone knows. But yeah, I've been married for a few years now.",
        "memory_text": "Co-worker A, known for their keen observation skills, found out through social media that Co-worker B was married, which came as a surprise to Co-worker B. \nCo-worker A uncovered that an employee was secretly selling clothes on the side, hindering Co-worker B's store inventory plans.",
        "speaker": "Co-workers A",
        "raw_prediction": "It's always exciting to discover new things about people we work with every day. Your solo performance was definitely a pleasant surprise!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t1",
        "current_dialogue": "Husband: I hung up some more lights and candles today.",
        "memory_text": "1. The husband enjoys hanging out with his friend, finding happiness and contentment in their company, and appreciates being outdoors in the nice weather.\n2. The husband feels supported by his wife in pursuing activities that bring him joy outside of work and family life, and he believes in cherishing meaningful connections like the one he has with his friend.\n3. The husband's strong faith, influenced by his Christian upbringing, drives his involvement in various church ministries, and he is grateful for it.\n4. The husband values trustworthy companionship and looks forward to collaborating on the podcast project, finding happiness and contentment in being with his friend and enjoying the beautiful weather.",
        "speaker": "Wife",
        "raw_prediction": "That sounds lovely! It's great that you're making our home even cozier with those lights and candles.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.",
        "memory_text": "1. The husband had a good time hanging out with his friend, feeling happy and content with their company.\n2. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n3. Both the husband and wife agree that it's the little things that add up and make life meaningful.",
        "speaker": "Husband",
        "raw_prediction": "I'm glad you enjoy it. It makes me happy to create a cozy atmosphere for us.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "The husband enjoys spending quality time with his friend and cherishes their bond, feeling uplifted and at ease in their presence. He also treasures the supportive community of believers at church and is actively engaged in various ministries, finding strength in his faith. \nBoth the husband and wife prioritize the small, meaningful moments in life that contribute to their overall happiness and well-being. \nThe husband values reliability in his relationships and eagerly anticipates collaborating on a podcast project. Additionally, he finds joy in the simple pleasures of life, like making it to the bus on time.",
        "speaker": "Husband",
        "raw_prediction": "Yes, being part of the church community has been truly fulfilling. I find so much joy in giving back and connecting with others through our shared faith.",
        "previous_summary": "Husband is grateful for his Christian upbringing and is passionate about his faith.\nHusband was baptized at eight years old and is involved in different ministries at church.\nWife is supportive of her husband's faith journey and values having a close relationship with him.\nHusband values the supportive community of believers at church and appreciates having his wife by his side.\nThe husband's faith has been strong lately, and he is involved in various church ministries."
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.",
        "memory_text": "1. Co-worker A had an argument with the director about the play they are putting on, which made them hesitant to bring up the problem with their supervisor for fear of being seen as a tattletale. This experience contrasts with a positive encounter with a commander who helped them feel safe.\n\n2. Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director. Meanwhile, Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n\n3. Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director. Additionally, they believe that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests, showing a strong interest in opportunities to earn money.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's a great quality to have. It's wonderful to see how you positively impact those around you.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t6",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?",
        "memory_text": "1. [Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.] - (React) - [Co-worker A had a positive experience with a commander who helped them feel safe.]\n2. [Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.] - (Want) - [Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director.]\n3. [Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.] - (Want) - [Co-worker A values making money and is interested in opportunities to do so.]",
        "speaker": "Co-workers A",
        "raw_prediction": "I've thought about it, but right now I'm really focused on making a difference in my current role.",
        "previous_summary": "Co-worker A prioritizes making money and believes it is the most efficient use of time.\nCo-worker A values making money and is interested in opportunities to do so.\nCo-worker A had an argument with the director about a play but didn't compromise.\nCo-worker A is self-aware about being stubborn and needing to learn to compromise."
    },
    {
        "utter_id": "e23-s5-t1",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.",
        "memory_text": "1. The teacher's praise for the student's bravery in an emergency situation led to offering support and reassurance for the student to talk. This conversation transitioned into discussing retirement plans and the importance of family focus during retirement.\n   \n2. The student felt rewarded by the emergency experience and stressed the importance of quick action in emergencies. This led to appreciating the teacher's support and apologizing for the incident, showcasing their positive and understanding relationship.",
        "speaker": "Student",
        "raw_prediction": "I think I need some water to cool down.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t2",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.",
        "memory_text": "Neighbor A enjoys reading and sharing books with Neighbor B, which leads to Neighbor B admiring Neighbor A's career advancement and expressing interest in borrowing a personal development book. This prompts Neighbor A to offer help to Neighbor B in getting into a workout routine, but Neighbor B offers to be more supportive and check in on Neighbor A more often. \nNeighbor A and Neighbor B went to a concert together in the past, which leads to Neighbor A aspiring to be more important in the company and being promoted to manager after working harder and taking on more responsibility. This results in Neighbor A feeling like they are making a real impact at the company and being driven and motivated, but eventually feeling overwhelmed and stressed due to having a lot on their plate. \nNeighbor A enjoys reading and sharing books with Neighbor B, causing Neighbor A to believe in setting goals, developing a positive attitude, and taking action for personal development and career advancement. This leads to Neighbor A offering help to Neighbor B in getting into a workout routine, and Neighbor B suggests working out together to make it more enjoyable for both of them.",
        "speaker": "Neighbors A",
        "raw_prediction": "I just wanted to make sure we both have a clear understanding, especially with the new landscaping going on.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t1",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.",
        "memory_text": "1. Classmate A confesses their love to Classmate B, who does not feel the same way. This leads to Classmate B appreciating Classmate A's honesty but not returning the romantic feelings.\n2. Classmate B plans to check their schedule to go to the mall with Classmate A. This results in Classmate B feeling relieved that they can still be friends with Classmate A despite the romantic confession.",
        "speaker": "Classmates B",
        "raw_prediction": "I completely agree, it's such a great group of people we have in our class.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t1",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?",
        "memory_text": "1. Co-worker A has been trying to improve their punctuality and cut back on drinking, and as a result, they have been successful in not being late to work for weeks.\n   \n2. Co-worker A has been getting written up for being late to work, which made them react by being successful in not being late to work for weeks.\n   \n3. Co-worker B is concerned about Co-worker A's punctuality and drinking habits, and in reaction, Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable. This led to Co-worker B being supportive and encouraging Co-worker A to give people a chance.",
        "speaker": "Co-workers B",
        "raw_prediction": "No, you didn't! What did you have to do there?",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t8",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.",
        "memory_text": "Co-worker A is trying to improve their punctuality and cut back on drinking, in an effort to be more responsible and avoid late nights out and expensive rides. Both co-workers show a supportive and caring attitude towards each other, with Co-worker B being supportive of Co-worker A's efforts to improve their life. Co-worker A recently moved to a new duplex with two floors, having their bedroom on the first floor and another room on the second floor, indicating that Co-worker A and their ex have both moved on from the breakup.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I'm trying to stay on top of things more now. So, what did you do after the post office?",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t13",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.\nCo-workers A: Wow, that was a long time ago. But I appreciate the compliment. It's nice to be reminded of my successes.\nCo-workers B: Yeah, and even though you had some rough times in your personal life, like that painful breakup, you still managed to pick yourself up and move forward.\nCo-workers A: It wasn't easy, but I had to. And now I try to focus on the positive things in life, like sending packages without any issues.",
        "memory_text": "Co-worker B expresses concern about Co-worker A's punctuality and drinking habits, but is now supportive of Co-worker A's efforts to be more responsible and reliable. This change in attitude is similar to how Co-worker A enjoys the extra space in their new place and values the privacy it provides between living and sleeping areas.\n\nCo-worker B's advice for Co-worker A to be disciplined and plan ahead is reminiscent of Co-worker A's past leadership role in their country, where they contributed to its prosperity and safety. This supportive and caring dynamic between both co-workers highlights the positive impact of their relationship.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's a good mindset to have. It's all about moving forward and focusing on the positive.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t2",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?",
        "memory_text": "Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience. Neighbor A looks forward to playing with Neighbor B again when feeling better. Neighbor A found some of their dog's toys while packing, indicating they have a golden retriever. Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm doing okay, thanks for asking. How's your week been so far?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t7",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.",
        "memory_text": "Neighbor A's positive experience with chiropractic care causes Neighbor B to be interested in it. Neighbor A looks forward to playing with Neighbor B again when feeling better. Neighbor B is familiar with Neighbor A's dog and looking forward to playing with it again. Neighbor A appreciated the support and friendship of Neighbor B.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds like it was a lot of fun. Do you still play music now?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t5",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.",
        "memory_text": "Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A, which led to Co-worker A taking over their family's business a few years ago, resulting in improvements since then. This experience taught Co-worker A the importance of being efficient and proactive.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's great that you were able to apply those lessons to your current role. I'm sure your boss will appreciate the effort you put into the report.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t2",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?",
        "memory_text": "1. The Coach is advising the Athlete on performance and focus, which leads the Athlete to focus on helping the team succeed and displaying leadership qualities during warm-ups and stretches.\n2. The Coach advises the Athlete on nutrition and training, prompting the Athlete to seek approval and praise from the Coach, resulting in taking on more responsibilities and gaining respect from other players.\n3. The Coach advises the Athlete on performance and focus, causing the Athlete to focus on improving performance and energy levels, which leads to taking on more responsibilities and gaining respect from other players.",
        "speaker": "Athlete",
        "raw_prediction": "I'm thinking we should take this highway here, Coach. It seems like the most direct route to our destination.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t9",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?\nAthlete: Yes, Coach. I've been incorporating more nutrient-dense foods like bean sprouts into my diet. And I've noticed a significant improvement in my overall energy levels and performance on the field.\nCoach: That's great to hear. Your dedication to your health and performance is really paying off, Ted. I can't wait to see what you'll accomplish next.\nAthlete: Thanks, Coach. I feel like I've really found my stride and I'm excited for what the future holds.",
        "memory_text": "1. The Coach's advice on performance and focus has led to the Athlete's noticeable improvement and dedication to enhancing skills.\n2. The Coach's reminder about minimizing distractions has motivated both the Athlete and Coach to continue focusing on nutrition and training, highlighting the impact of small dietary changes on performance.\n3. The ongoing advice from the Coach to the Athlete about performance and focus aligns with discussions on pre-game meals, stressing the significance of a well-rounded diet and proper hydration for optimal performance.",
        "speaker": "Coach",
        "raw_prediction": "Your hard work and commitment are truly showing, Ted. Keep up the good work, and remember to stay focused on your goals as you continue to excel.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?",
        "memory_text": "1. Co-worker A's experience of presenting evidence in front of a judge has shaped their determination to present evidence clearly and persuasively in court.\n2. Co-worker A's confidence in the strength of their argument stems from collecting evidence for a case.\n3. Co-worker B admires Co-worker A for standing up and defending their beliefs.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thankfully, I've never been in a physical altercation. I prefer to use words to resolve conflicts whenever possible.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t10",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?\nCo-workers A: Yeah, I remember. But she eventually gave me the cash, and I was able to take care of what I needed to.\nCo-workers B: That's good. And speaking of taking care of things, your carpentry skills are amazing. I loved the house you built for me last year.",
        "memory_text": "Co-worker B is supportive and interested in the evidence collected by Co-worker A. As a result, Co-worker A is a skilled builder who recently completed building a house for Co-worker B.\nCo-worker A has been collecting evidence for a case and is confident in the strength of their argument. This leads to Co-worker B commending Co-worker A for having the courage to stand up and defend their beliefs. Additionally, Co-worker A is willing to take on the project of building a deck for Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you, I'm glad you're enjoying the house. It was a fun project to work on.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t1",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A, which made Classmates A appreciate Classmates B's efforts and support. This led to Classmates B advising Classmates A to drive safely to avoid accidents.\n2. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability, which led to Classmates A being concerned about Classmates B's drinking habits and their impact on their health. This concern resulted in Classmates A and B starting as acquaintances and developing a strong friendship, where they value their friendship and feel comfortable talking to each other about anything.",
        "speaker": "Classmates A",
        "raw_prediction": "That's really kind of you. What did you do to help your neighbor?",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t4",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.",
        "memory_text": "Classmates A appreciates Classmates B's efforts and support, which is why they are looking forward to hanging out outside of school. This mutual appreciation has led to both of them wanting to spend time together.",
        "speaker": "Classmates A",
        "raw_prediction": "Thanks, she was really grateful for the help. It felt good to make a difference.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t7",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.",
        "memory_text": "The husband is inspired by his wife to take action on his dreams and goals. This has led to the husband being excited about his progress on long-awaited plans and putting in a lot of effort to make them a reality. As a result, the husband and wife are committed to each other and excited about their future together. Their discussion of setting specific times for updates on progress and waiting for each other for certain events to avoid similar situations is a way to ensure they are on the same page.",
        "speaker": "Wife",
        "raw_prediction": "I'm excited too, husband. It'll be nice to have some quality time together in a peaceful setting.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t12",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!",
        "memory_text": "The wife's support and encouragement motivate the husband to involve her in his future plans. The husband's long-awaited actions are influenced by his promise to include his wife in his plans. The husband's determination to achieve his dreams causes him to act impulsively, leaving without the wife, reminiscent of a past disappointment when he broke a promise to wait for her.",
        "speaker": "Husband",
        "raw_prediction": "Yes, that was quite the heroic moment, wife. You always manage to handle challenging situations with grace and courage.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t15",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.\nWife: Thanks, husband. And speaking of good times, I had so much fun at the dance a few weeks ago. Dancing with you always puts me in a good mood.\nHusband: Same here, wife. I love spending time with you, and I feel grateful for every moment we get to share. ",
        "memory_text": "The husband's dedication to his dreams fuels his excitement and determination to turn them into reality, which strengthens the bond and commitment between him and his wife. \n\nThe wife's unwavering support and belief in her husband lead to his realization of the importance of keeping promises and involving her in his plans, especially after a past incident where he left without waiting for her.",
        "speaker": "Wife",
        "raw_prediction": "I can't wait for our getaway, husband. It'll be a nice change of scenery for us.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t16",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.\nWife: Thanks, husband. And speaking of good times, I had so much fun at the dance a few weeks ago. Dancing with you always puts me in a good mood.\nHusband: Same here, wife. I love spending time with you, and I feel grateful for every moment we get to share. \nWife: I feel the same way, husband. And, I appreciate you doing the dishes for me today so we could have this conversation.",
        "memory_text": "The wife's continuous support and belief in her husband inspire him to take action on his dreams and goals. \nThe husband's apology and promise to involve his wife in his future plans stem from the wife's reassurance of her support and belief in him. \nThe husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action, all triggered by the wife's reassurance of her continuous support and belief in him. \nThe husband acknowledges his wife's bravery and selflessness, influenced by the wife's reassurance of her continuous support and belief in him.",
        "speaker": "Husband",
        "raw_prediction": "I'm glad I could help out with the dishes, wife. It's the least I could do after all the wonderful moments we've shared together.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t3",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?",
        "memory_text": "1. Classmates A helped Classmates B prepare for a driving test, showing patience and dedication. This act is admired by Classmate B, who sees it as a good example for others.\n2. Classmates A values striving for excellence, taking pride in their work, and producing high-quality results. This leads them to believe in giving 110% effort in everything they do.\n3. Feeling lightheaded and running out of oxygen while stranded in space, Classmate A pushes themselves to do better to improve their skills and learn something new. This emphasizes the importance of hard work and dedication in skill improvement.",
        "speaker": "Classmates B",
        "raw_prediction": "I accidentally spilled my drink all over myself in the cafeteria.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.\nClassmates A: Exactly! That's what you should do too. Own up to it and move on. Don't let it bother you.",
        "memory_text": "1. [Classmates B suggested redirecting the ship towards a nearby planet or moon for help.] - (React) - [Classmates A felt relieved and grateful for the quick thinking and problem-solving skills displayed by Classmates B during a crisis in space.]\n2. [Classmates A and B have shared experiences on field trips to other planets or moons, such as Mars.] - (Want) - [Classmates A and B aspire to be positive role models for each other and their peers, promoting a supportive and encouraging learning environment.]\n3. [Classmates A expressed gratitude for Classmates B's support during a challenging situation.] - (React) - [Classmates B commended Classmates A for their meticulous work ethic and attention to detail, recognizing their remarkable dedication.]",
        "speaker": "Classmates B",
        "raw_prediction": "You're right, I shouldn't let it get to me. Thanks for the reminder, Classmates A.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t12",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.\nClassmates A: Exactly! That's what you should do too. Own up to it and move on. Don't let it bother you.\nClassmates B: You're right. Thanks, Classmates A. You always know how to make me feel better.",
        "memory_text": "1. [Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.] - (React) - [Classmates A feels grateful for the recognition and support from Classmates B in a challenging situation in space.]\n\n2. [Classmates A is patient and helpful in teaching driving material to Classmate B.] - (React) - [Classmates B appreciates Classmates A's dedication and assistance in preparing for a driving test, highlighting their supportive nature.]\n\n3. [Classmate A emphasizes the importance of hard work and dedication in improving skills.] - (React) - [Classmates B acknowledges and admires Classmate A's strong work ethic and attention to detail as qualities worth emulating.]",
        "speaker": "Classmates A",
        "raw_prediction": "No problem, Classmates B. Just remember, we all have embarrassing moments, but it's how we handle them that matters.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t7",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.",
        "memory_text": "Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work. This supportive attitude strengthens their friendly relationship, as they enjoy having coffee and chatting together. Additionally, Neighbors A noticed that Neighbors B's dog has been missing for a few days.",
        "speaker": "Neighbors B",
        "raw_prediction": "I have no doubt that your hard work will pay off. Keep pushing and success will come your way.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t6",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.\nCo-workers B: That's right. It's important to have someone to talk to when you're feeling overwhelmed or upset.",
        "memory_text": "- Co-worker A mentioned a past event involving blowing up a rabbit with dynamite, indicating a history of poor coping mechanisms for frustration, which led to Co-worker B expressing disapproval and suggesting talking to the director to address the stressful situation.\n- Co-worker A felt remorse for what they did and appreciated Co-worker B's understanding during their collaboration, leading to personal growth in empathy and compassion.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm just glad I have you as a supportive colleague to talk to when things get tough.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t1",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?",
        "memory_text": "1. Mentee has found a shelter for people who have been in abusive cults and is planning to escape there. Mentor suggests Mentee volunteer at a local church or religious organization to gain experience. Mentor became a mentor to help others going through similar situations.\n   \n2. Mentee expresses feeling suffocated and eager to leave the cult. Mentee has been thinking about helping others who may be in abusive cults.\n\n3. Both Mentee and Mentor agree to pack their things and get ready to leave without letting anyone know.",
        "speaker": "Mentor",
        "raw_prediction": "Yes, I believe it's important to try to understand different perspectives. It helps us empathize with others and see the world in a more compassionate way.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t5",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.",
        "memory_text": "1. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives. This approach helps Mentee to be more compassionate and understanding towards others, especially in difficult times.\n2. Mentee is currently living in an abusive and controlling cult. Mentor suggests Mentee volunteer at a local church or religious organization to gain experience, aiming to make a positive impact and be supportive of others. This is why Mentor became a mentor, to help those in similar situations.\n3. Mentee is currently living in an abusive and controlling cult. Mentee agrees to teach in a way that allows people to make their own decisions about their beliefs, influenced by Mentor's advice and support.",
        "speaker": "Mentor",
        "raw_prediction": "Absolutely, showing compassion and understanding towards others, especially in challenging times, can make a significant difference in their lives. It's admirable that you're taking this approach, and I believe it will create a positive impact on those around you.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t13",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?\nMentor: I'm originally from Italy.\nMentee: Ah, that's so exciting! I've always wanted to go to Italy and experience the culture there.",
        "memory_text": "1. Mentee expresses gratitude towards Mentor for the advice and shows willingness to try it out, mentioning Mentor's background of being from Italy and having lived in the United States.\n2. Mentee expresses the desire to teach religion to help people find meaning in their lives, wanting to make a positive impact and being thankful for Mentor's support.\n3. Mentor advises Mentee on self-care practices related to listening to their body and setting a bedtime routine, which leads to a discussion on escaping oppressive rules of a cult. Additionally, Mentor encourages Mentee to approach teaching religion with an open mind and heart, leading to Mentor becoming a mentor to help others in similar situations.",
        "speaker": "Mentor",
        "raw_prediction": "Italy is a beautiful country with so much culture and history to explore. If you ever get the chance to visit, I highly recommend it.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.\nNeighbors B: Yes, and I appreciate it so much. It's always nice to have someone you can count on.\nNeighbors A: That's true. And speaking of which, I'm helping another friend move next weekend. It'll be a big job, but I know they'd do the same for me.\nNeighbors B: That's great. And if you need any help, just let me know.",
        "memory_text": "Neighbors A thanked Neighbors B for the suggestion of a new necklace and stumbled upon Neighbors B's shop. Neighbors B offered to help Neighbors A with the apology process.\nNeighbors A bought a necklace from Neighbors B's shop and loves it. Neighbors A has a picture of the dress on their phone and will show it to Neighbors B.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I appreciate that. I'll keep that in mind.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t2",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?",
        "memory_text": "1. Classmates A offered to provide support and stress-relieving massages to Classmates B, which was appreciated. This led to Classmates A offering help and support to Classmates B, showing their compassionate nature.\n2. Classmates A had doubts about trusting Classmates B due to rumors about their reliability, but they discovered a secret that Classmates B has been keeping, leading to a moment where Classmate A admired Classmate B's courage and strength in sharing the secret.\n3. Classmates B assures Classmates A that they will do their part in the group project, which was appreciated by Classmates A, who tends to overthink things and struggles with feeling satisfied with their work.",
        "speaker": "Classmates A",
        "raw_prediction": "I've been feeling a bit overwhelmed with the upcoming group project. Do you think we could meet up to discuss our roles and plan things out together?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?",
        "memory_text": "1. Classmates A and B are working on a group project together, as they are students in the same class. This shared project leads to Classmates A discovering a secret that Classmates B has been keeping. Reflecting on this, Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing the secret, showcasing their supportive and compassionate nature.\n\n2. Classmates B assures Classmates A of their commitment to the group project, which prompts Classmate A to appreciate and value Classmates B's support and advice. This interaction reveals that Classmate A tends to overthink things and struggles with self-criticism, especially when it comes to feeling satisfied with their work.\n\n3. Initially, Classmates A had doubts about trusting Classmates B due to rumors about their reliability. However, as they work together in the same class, Classmate A eventually discovers a secret that Classmate B has been keeping. This discovery leads Classmate A to recall a moment where they admired Classmate B's courage and supportive nature in sharing the secret, strengthening their bond.",
        "speaker": "Classmates A",
        "raw_prediction": "I've noticed how supportive you've been throughout our project, and I truly appreciate it.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.",
        "memory_text": "1. Classmates A and B, while working on a group project together, have developed a strong bond as supportive friends who always have each other's backs during stressful times. This has led to a close relationship with a high level of trust between them. Additionally, Classmate A values maintaining high standards and is reluctant to compromise on them.\n\n2. While collaborating on a group project, Classmates A and B's relationship took a turn when Classmate A uncovered a secret that Classmate B had been keeping. Reflecting on this discovery, Classmate A remembers a moment when they admired Classmate B's bravery and resilience in sharing this secret, showcasing their supportive and empathetic nature.\n\n3. After Classmate B reassured Classmate A about their commitment to the group project, Classmate A, known for overthinking, appreciated the support and guidance provided by Classmate B. Furthermore, Classmate B emphasizes the importance of self-compassion and finding a balance between striving for excellence and being kind to oneself.",
        "speaker": "Classmates A",
        "raw_prediction": "I understand if this is new territory for you. I just wanted to be honest about how I've been feeling.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t13",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. \nClassmates A: Yeah, I guess it does. It’s just that I’ve been hurt before, and I don’t want to lose you as a friend too.\nClassmates B: I understand your concerns,. but I think we can make this work. We've already built a strong foundation of friendship, which is important for any relationship.\nClassmates A: That’s true. I feel like we can take this in any direction that we want.",
        "memory_text": "Classmates A had doubts about trusting Classmates B due to rumors about their reliability, but then Classmates A offered help and support to Classmates B. This was supported by a moment where Classmate A admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n\nWhile working on a group project together, Classmates A and B have shown to be supportive friends who look out for each other during stressful times. They have also built a level of trust between them, with Classmate A valuing setting high standards and being hesitant to lower them. Moreover, both classmates believe in striving to be the best version of themselves while also being kind and compassionate towards themselves and others.",
        "speaker": "Classmates B",
        "raw_prediction": "I agree, we have a solid foundation to build upon. Let's see where this takes us.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t1",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!",
        "memory_text": "Neighbors B recalls a cooking class they took with Neighbors A last year. They also remember Neighbors A teaching a kid a special move, followed by mentioning their struggle with keeping their room tidy and wasting time looking for things. Additionally, Neighbors B expresses concern about the safety of hooking up with strangers and advises caution.",
        "speaker": "Neighbors A",
        "raw_prediction": "I bet you had some incredible experiences there!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t3",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.",
        "memory_text": "1. Classmates A is struggling with feeling competitive and the need to be the best at everything. As a result, Classmates A has not experienced similar pains in the past and is feeling worried about the situation.\n2. Classmates A is always looking to challenge themselves and improve their skills. In response, Classmates B offers support and suggests taking a step back to find a balance. Despite that, Classmates A had a muscle strain in their arm but did not go to the hospital.\n3. Classmates A is experiencing sudden pain in their left arm and is considering going to the hospital after Classmates B offers support and suggests taking a step back to find a balance. However, Classmate B reminds Classmate A to trust their instincts and know when to seek medical attention.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a great approach! It's important to challenge yourself and develop those critical thinking skills. Just remember to take breaks and find a balance to avoid burnout.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t4",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?",
        "memory_text": "1. Classmates A's past experience with tough competition in middle school from a fast girl motivated them to improve, causing them to struggle with feeling competitive and the need to be the best at everything. As a result, Classmates A, who has not experienced similar pains in the past, is feeling worried about the situation.\n\n2. Classmates A, who is always looking to challenge themselves and improve their skills, reacts positively to Classmates B's support and suggestion to take a step back to find a balance. This leads to Classmates B offering to take Classmates A to the hospital, but Classmates A declines, saying they will manage, as they had a muscle strain in their arm but did not go to the hospital. \n\n3. Classmates B's acknowledgment of Classmates A's determination and competitiveness prompts them to offer support and suggest that Classmates A get their arm checked out, which leads to Classmate A having a muscle strain in their arm but not going to the hospital.",
        "speaker": "Classmates A",
        "raw_prediction": "Definitely, I feel like my problem-solving skills have gotten better.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t1",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.",
        "memory_text": "1. Classmates A has matured since acknowledging the mistake and plans to learn from it, showing growth from past mistakes.\n2. Classmates A used to dance a lot in middle school, which makes Classmate A appreciate having friends who are there for them during difficult times. This friendship extends to helping each other with schoolwork.\n3. Acknowledging the mistake, Classmates A is considering taking a dance class for fun.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! It's always rewarding to gain new skills and knowledge. What do you plan to do next with your computer skills?",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t6",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?",
        "memory_text": "- When Classmates A acknowledges the mistake and plans to learn from it, Classmate B is a supportive friend who listens and offers to help. This is hindered by the fact that Classmates A and Classmates B are friends who help each other with schoolwork.\n- After Classmates A got grounded for a week for kicking a door and causing damage, Classmate A is going through a tough time at home due to their parents fighting. In reaction to this, Classmates B supported Classmates A through a tough time by listening to them.\n- While Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility, they used to dance a lot in middle school. Classmate B wants to be a supportive friend who listens and offers to help, but this is hindered by the fact that Classmates A and Classmates B are friends who help each other with schoolwork.",
        "speaker": "Classmates A",
        "raw_prediction": "I also learned about computer security and the importance of keeping my devices and information safe. It was pretty eye-opening.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t9",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?\nClassmates A: Yeah, I also learned some basic coding languages like HTML and CSS. It was challenging but really interesting.\nClassmates B: Wow, that sounds cool. Do you think you'll pursue coding further?\nClassmates A: Maybe, I'm not sure yet. But I definitely want to keep learning about computers and technology. It's such a relevant and useful skill to have nowadays.",
        "memory_text": "1. [Classmates A and B both appreciate having friends who are there for them during difficult times.]\n2. [Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility.]\n3. [Classmates A is considering taking a dance class for fun.]",
        "speaker": "Classmates B",
        "raw_prediction": "That's a great mindset to have! Keeping up with technology is definitely important in today's world.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t1",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.",
        "memory_text": "- Co-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else. This leads to Co-worker B reassuring Co-worker A that making mistakes is okay as long as they learn from them, and then encouraging them to have more confidence.\n- Co-worker A has made mistakes in the past but is trying to be more aware of their actions, causing Co-worker B to move on from their arrest and appreciate Co-worker A's concern and change in behavior. This leads to Co-worker B reminding Co-worker A of their progress and potential for success, as well as being supportive and encouraging towards Co-worker A.",
        "speaker": "Co-workers B",
        "raw_prediction": "I'd love to join you for lunch on Tuesday at the school cafeteria! It'll be nice to catch up outside of work.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t3",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?",
        "memory_text": "Co-worker B complimented Co-worker A's writing skills and reliability as a journalist. They are supportive and encouraging towards Co-worker A. \nCo-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else. In response, Co-worker B reassures Co-worker A that making mistakes is okay as long as they learn from them, and encourages them to have more confidence. Co-worker B also mentioned that Co-worker A is responsible in their work, even if not always in other aspects of life, and reminds them of their progress and potential for success.",
        "speaker": "Co-workers B",
        "raw_prediction": "Noon on Tuesday works for me too. Looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t7",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.",
        "memory_text": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions, which leads to Co-worker B moving on from their arrest and appreciating Co-worker A's concern and change in behavior. This reminds Co-worker B of Co-worker A's progress and potential for success. Co-worker A is adjusting to the night shift schedule and excited for a promotion.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic to hear! I'm really happy for you. It's great to see how much progress you've made.",
        "previous_summary": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions.\nCo-worker A feels remorseful about the situation that led to Co-worker B's arrest.\nCo-worker B points out that Co-worker A doesn't always consider how their actions can affect others.\nCo-worker A is adjusting to the night shift schedule and excited for a promotion.\nCo-worker A is nervous about making mistakes in their new position.\nCo-worker A is a journalist who was recently promoted for being reliable.\nCo-worker A feels guilty about a past mistake involving Co-worker B's arrest.\nBoth Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes."
    },
    {
        "utter_id": "e43-s5-t5",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?\nClassmates B: I'm sorry,, but I can't disclose that information. It's not my place to tell.\nClassmates A: But how did you find out? I haven't told anyone.\nClassmates B: Let's just say I have my ways of finding out things. But don't worry,, it's nothing bad or embarrassing.\nClassmates A: Okay, but it's still bothering me that you know something about me that even my closest friends don't know.",
        "memory_text": "Classmates A admired Classmates B's positive attitude and wanted to be friends with them. Classmates B warned Classmates A about the potential danger of dark alleys, advising them to be careful and aware.",
        "speaker": "Classmates B",
        "raw_prediction": "I understand why you feel that way, but please know that I have no intention of sharing anything without your permission.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t9",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.\nNeighbors B: How about we go for a walk and you can talk to me about everything that's been on your mind?\nNeighbors A: That sounds good. You've always been such a good listener, Neighbor B. Thank you for being there for me.",
        "memory_text": "- Neighbor A and Neighbor B share a close bond and often spend time together outside of their neighborhood, especially going for walks to the park.\n- Neighbor A values the emotional support and understanding provided by Neighbor B during times of grief.\n- Neighbor A and Neighbor B like to grab a meal together after their activities, creating a sense of companionship.\n- Neighbor B used to mention the neighborhood's affluence, but now finds peace in taking walks in the park to clear their mind.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm always here for you, Neighbor A. Let's take that walk and clear your mind.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t4",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?",
        "memory_text": "- [Classmates A and B found a perfect camping spot with a great view and level ground, free of debris, ensuring a comfortable night's sleep.]\n- [Classmate A's active involvement in the community inspires them to seek fun and impactful activities, leading to a decision to prioritize self-care in the future.]\n- [Classmate B admires Classmate A's community engagement and stresses the importance of allergy awareness, preparedness, and prevention.]",
        "speaker": "Classmates A",
        "raw_prediction": "I stumbled upon it while exploring the area earlier today. Just got lucky, I guess!",
        "previous_summary": "Classmates A is actively involved in an action committee focused on improving the community and creating positive change.\nClassmates A is proactive and curious, taking the initiative to research topics of interest.\nClassmates A was part of an action committee in high school to improve the community."
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.\nClassmates B: That's true. You always seem to find the best spots. Like that time we went camping near the lake and had the whole place to ourselves.\nClassmates A: Oh yeah, that was a great spot too. It's always fun to explore and go on new adventures.",
        "memory_text": "Classmates A expresses a desire to find alternative ways to have fun and make a positive impact in the community, leading to their proactive and curious nature in researching topics of interest. This curiosity eventually results in Classmate A experiencing an allergic reaction with symptoms of itchy skin and a tight throat. \nClassmates B, admiring Classmates A's involvement in the community, emphasizes the importance of being cautious with allergies and taking necessary precautions to prevent severe reactions.",
        "speaker": "Classmates B",
        "raw_prediction": "We should definitely plan more camping trips like this in the future. It's always exciting to discover new hidden gems in nature.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t1",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?",
        "memory_text": "1. Classmates A is passionate about pursuing music and finds it rewarding. As a result, Classmates A and B enjoy jamming together and plan to collaborate on music in the future. They also have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n   \n2. Classmates A plays the guitar, takes lessons, and plays in a band. This leads to Classmates A and B enjoying jamming together and planning to collaborate on music in the future. Additionally, Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n\n3. Classmates A and B are both keeping up with the homework in their math class. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams. This leads to them enjoying jamming together and planning to collaborate on music in the future. Furthermore, Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm feeling pretty good, thanks for asking. How about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t9",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.",
        "memory_text": "1. Classmates A and B enjoy playing music together, as they have a friendly and supportive relationship.\n2. Classmates A and B find it awesome to pursue their passions after a conversation about following dreams.\n3. Classmates A and B both enjoy reminiscing about childhood memories, including playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a good idea. I'll start with making that list. Thanks for being so supportive.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t11",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?",
        "memory_text": "- Classmates A and B are both keeping up with the homework in their math class, and Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n- Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "I've been practicing regularly, and it's been really fulfilling. It's great to have a creative outlet like music.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t17",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.\nClassmates B: That sounds like a challenge, but also kind of exciting. I'm in!\nClassmates A: Great, I'm looking forward to seeing you rock out on stage. Hey, remember when we talked about your new car a few hours ago? How's that going?",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences in keeping up with the homework in their math class.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams. This is in line with their shared interest in keeping up with the homework in their math class.\n3. Classmates A, who plays the guitar, takes lessons, and plays in a band, wants to own a Mustang GT, a dream they have had since childhood.",
        "speaker": "Classmates B",
        "raw_prediction": "I've been doing some research on the Mustang GT, and I'm getting closer to making that dream a reality. It's so exciting to see it all coming together.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t6",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?",
        "memory_text": "Neighbor A values their friendship with Neighbor B, describing them as a great neighbor, which prompts Neighbor A to consider using their skills for good instead of evil after Neighbor B's reminder. \nNeighbor A helped Neighbor B build a new house with amazing features, leading Neighbor B to remind Neighbor A of their potential to do good things and referencing the house that Neighbor A built for them. This makes Neighbor A want to believe that plants need sunlight, water, and love to thrive.\nNeighbor A enjoys building houses and finishing them quickly, which changed their belief to make a lot of money without hurting anyone and plan to cover their tracks carefully.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's a good idea, maybe a change of scenery will help me focus better. I'll give it a try.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t11",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. ",
        "memory_text": "Neighbor A's enjoyment of building houses quickly led to them helping Neighbor B build a new house with amazing features. This act made Neighbor B remind Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them. As a result, Neighbor A wanted to ensure plants thrive by providing sunlight, water, and love. \n\nNeighbor A's admiration for Neighbor B prompted them to do something special, resulting in helping Neighbor B build a new house with amazing features. This act also caused Neighbor B to receive a new house from Neighbor A and feel grateful for the extra space. \n\nNeighbor A's passion for building houses quickly resulted in them finding the process of building the new house challenging yet rewarding, especially with the help of friends.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds amazing! I bet it turned out beautifully.",
        "previous_summary": null
    }
]