[
    {
        "utter_id": "e0-s5-t1",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?",
        "memory_text": "Speaker B is excited about Easter weekend and spring break. They want to go on a trip but have not started packing yet. Speaker B recently got a new blue hair color and a new Easter dress. This changed to Speaker B's new car being black, which is their first new car after driving pre-owned cars before. This change caused Speaker B to receive a new car from their mom and plan to drive during spring break. Speaker A is worried about gas mileage and asks about the fuel efficiency of Speaker B's car.",
        "speaker": "Speaker B",
        "raw_prediction": "Not yet, I'm still deciding on whether to drive or fly for the trip.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?",
        "memory_text": "1. Speaker B's new car is black, and it is their first new car after driving pre-owned cars before. Speaker A is worried about gas mileage and asks about the fuel efficiency of Speaker B's car.\n2. Speaker B used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one. Speaker B is going on a trip but has not started packing yet.",
        "speaker": "Speaker A",
        "raw_prediction": "No, I haven't been to Costa Rica. That sounds like an exciting trip! Have you planned out what you're going to do there?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "1. Speaker A mentions having eight grandchildren and already having blue hair. Speaker B has an oldest nephew who is about to turn 14.\n2. Both Speaker A's mother and Speaker A were librarians, but Speaker A is retired. Speaker B asks if the recommended book is fiction or nonfiction.\n3. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one. Speaker A, a retired librarian, recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit.",
        "speaker": "Speaker B",
        "raw_prediction": "He's doing well, thank you for asking. He's getting ready for his birthday, and he's excited to finally be a teenager.",
        "previous_summary": "Speaker A is older and has eight grandchildren.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city."
    },
    {
        "utter_id": "e0-s5-t10",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?",
        "memory_text": "Speaker A and Speaker B both have a sense of humor, as seen by their use of \"lol\" in the conversation.\nSpeaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one.\nSpeaker B is excited about Easter weekend and spring break, and wants to go on a trip but has not started packing yet.",
        "speaker": "Speaker A",
        "raw_prediction": "The weather here has been pretty mild, not too hot or cold. Hopefully, it clears up for your trip to Costa Rica!",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?\nSpeaker A: Sorry for the typo. I meant \"pool\". Weather here is very hot and humid. It is miserable if you don't have air conditioning. Pollen count is also very high, so the air quality is poor. ",
        "memory_text": "Speaker A and Speaker B both have a sense of humor, as seen by their use of \"lol\" in the conversation. Speaker A jokes about the inevitability of grey hair, finding getting old no fun. Speaker B's new dress is blue, but more of a turquoise shade, contrasting with Speaker A's quiet spring breaks in the past. Speaker B dyed their hair with henna and enjoys experimenting with different hair colors, excited about Easter weekend and spring break. Speaker A's granddaughter, who is a cosmetologist, helped dye their hair in streaks.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds rough! Hopefully, the weather will improve soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!",
        "memory_text": "Speaker B enjoys watching swimming movies and wants to listen to punk music while swimming and learning programming.\nSpeaker B is looking forward to eating a pizza burger in a pool with punk music playing. \nSpeaker A enjoys cruising in their car while listening to punk music. Speaker A enjoys the food and the adventure of cruises and wants to discuss the potential of getting on a cruise ship together with Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds awesome! I can't wait to listen to it while we hang out by the pool and then get into our programming studies.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t8",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.",
        "memory_text": "- Speaker A offering to teach Speaker B how to swim and programming because Speaker A knows how to swim since the age of 5.\n- Speaker A planning to travel to the Caribbean for their next trip because Speaker B enjoys cruising in their car while listening to punk music.\n- Speaker A planning to do snorkeling and other activities at their cruise destination because Speaker A knows how to swim since the age of 5.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a plan! I can definitely help you with computer programming as well during our meetup this weekend.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t9",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?",
        "memory_text": "- Speaker A recently started a new job in computer programming and offers to teach Speaker B how to swim and programming.\n- Speaker B enjoys punk music and wants to listen to it while swimming and learning programming. \n- Speaker A has planned to do snorkeling and other activities at their cruise destination, sparking a discussion about the potential of getting on a cruise ship together.",
        "speaker": "Speaker B",
        "raw_prediction": "I don't have a preference yet, but I'm eager to learn more about them.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t10",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.",
        "memory_text": "Speaker B works as a shipping clerk at warehouse for 15 hours a week. Speaker A just started a new job in computer programming. Speaker A offers to teach Speaker B how to swim and programming. \nSpeaker B does not know how to swim but enjoys watching swimming movies. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming. \nSpeaker B enjoys cruising in their car while listening to punk music. Speaker A enjoys the food and the adventure of cruises. Speaker A and Speaker B discuss the potential of getting on a cruise ship together.",
        "speaker": "Speaker A",
        "raw_prediction": "Perfect, we can start with Python, it's a great language to begin with. I'll show you the basics.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t11",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.\nSpeaker A: Sure. I usually like to start with html and css so we can start there. We'll order some pizzaburgers to help us out. ",
        "memory_text": "Speaker A offers to teach Speaker B how to swim and programming, despite Speaker B not knowing how to swim but enjoying watching swimming movies. Speaker B also enjoys punk music and wants to listen to it while swimming and learning programming. Additionally, Speaker A has planned a cruise to the Caribbeans, and both Speaker A and Speaker B discuss the potential of getting on a cruise ship together while enjoying cruising in their car listening to punk music.",
        "speaker": "Speaker B",
        "raw_prediction": "Sounds like a plan! Pizza and programming, can't go wrong with that.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t2",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?",
        "memory_text": "Speaker A is a high school student planning to go to college, achieving straight A's. Speaker B is considering giving up their night job to focus on lab work and school.\nSpeaker B is also a high school student preparing for college, working at a diner at night. Speaker A and Speaker B are involved in different fields of work, cooking and lab research.\nSpeaker B is also a high school student preparing for college, working at a diner at night. Speaker A plans to try the famous hamburgers made by Speaker B at the diner. Speaker A had cheesy ham and potato soup for dinner. Speaker B has invented a chilli dog casserole that Speaker A wants to try.",
        "speaker": "Speaker A",
        "raw_prediction": "Definitely, I'd be curious to try it! It would be interesting to see if there's any difference in taste.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t4",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.",
        "memory_text": "Speaker B works on weekends at a research lab, showing an interest in neuroscience. Speaker A offers to take Sparky for a walk to help out and spend time with the dog. Speaker A is considering getting a dog and already walks Speaker B's dog, Sparky. Speaker B has invented a chilli dog casserole that Speaker A wants to try.",
        "speaker": "Speaker A",
        "raw_prediction": "I've tried a Beyond Burger before, and I have to admit, it was surprisingly close to the real thing!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t7",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?",
        "memory_text": "Speaker B has a deaf dog named Sparky, a beagle breed. Speaker A is considering getting a dog and already walks Speaker B's dog, Sparky. Speaker B has invented a chili dog casserole that Speaker A wants to try. \nSpeaker A and Speaker B are involved in different fields of work, cooking and lab research. Speaker A plans to try the famous hamburgers made by Speaker B at the diner. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce.",
        "speaker": "Speaker B",
        "raw_prediction": "I love mint chocolate chip ice cream! It's so refreshing and has just the right amount of sweetness. What about you, what's your favorite flavor?",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t11",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. \nSpeaker A: Okay, I will see if there are any castles near where we will be. Do you have any plans to go back to sweden?\nSpeaker B: Not in the near future, but I'm hoping to get back next summer. I love hitting up all the local beach spots with my old friends.\nSpeaker A: That sounds nice! So how is your job going?\nSpeaker B: Always interesting, that's for sure! I have been training to nurse on a new floor, so that'll give me a change of scenery.\nSpeaker A: Does that add a lot of extra work to your plate?\nSpeaker B: At the moment, yes. I'll be in Pediatrics, which has always been my passion. It's a completely different environment than the ER.\nSpeaker A: Oh wow! That is so exciting for you. Will you get to stay in pediatrics after the training is complete?",
        "memory_text": "Speaker A has a cousin in Sweden but has not visited the country. Speaker B has not visited Sweden for a long time due to the high expenses. Speaker A and Speaker B plan to travel to Sweden together. Speaker B is from Sweden and mentioned playing tennis and going to church on Sunday. Speaker A is considering visiting their cousin in Sweden and needs to save money for the trip. Speaker A and Speaker B plan to travel to Sweden together.",
        "speaker": "Speaker B",
        "raw_prediction": "I hope so! It's a new challenge, but I am looking forward to the opportunity.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.",
        "memory_text": "Speaker A enjoys reading fantasy books and recommends \"A Game of Thrones\" by George R. R. Martin. Speaker A also enjoyed reading 'Redwall' growing up and keeps an eye out for similar books. Speaker B enjoys reading the Odd Thomas and Dark Tower series and finds inspiration for their artwork during nature walks. Speaker A recommends the new album by Highly Suspect to Speaker B.",
        "speaker": "Speaker A",
        "raw_prediction": "I didn't bring a pet this time, but I can imagine how peaceful it must be to have a furry companion on the trail with you.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t5",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself",
        "memory_text": "Speaker B enjoys listening to Sublime a lot while relaxing on the beach and is looking forward to taking a break from work to go fishing. Speaker B also finds fishing easier than surfing but is interested in trying surfing. Additionally, Speaker B is willing to teach Speaker A how to fish and cook.\n\nSpeaker A was good at writing in school, while Speaker B was bad at math and preferred fishing. This caused Speaker A to be in a band and play music, possibly as a musician. Speaker B, on the other hand, is a passionate cook who enjoys making Italian dishes like pasta, risotto, and pizza.\n\nSpeaker A is in a band where they play the drums and write music, with 4 members including the singer who is their best friend. Their band visited Italy, Uzbekistan, and smaller countries in Central and South America.",
        "speaker": "Speaker B",
        "raw_prediction": "That's awesome that your father taught you how to play drums! Have you ever performed live with your band?",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t10",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.",
        "memory_text": "Speaker A, who grew up in California on the beach, loves morning surfing as a way to escape from daily life. Additionally, Speaker A is preoccupied with not dying when surfing. \nSpeaker B wishes they had time to go surfing and is considering getting lessons at a surf shop. Furthermore, Speaker B finds fishing easier than surfing but is interested in trying surfing, and is willing to teach Speaker A how to fish and cook. \nSpeaker A was good at writing in school, while Speaker B was bad at math and preferred fishing. Speaker B is looking forward to taking a break from work and going fishing.",
        "speaker": "Speaker A",
        "raw_prediction": "You should definitely give surfing a try, even if your friends aren't interested. It's such a great way to relax and have fun in the water.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "Speaker A is a librarian and loves kids, mentioning having 3 children. This leads to Speaker B mentioning having grandkids, implying they are older and have a family of their own. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like. Speaker B has grandkids and enjoys spending time with them at the park. Speaker A's other children are addicted to tablets and phones, unlike the youngest one who is interested in music. Speaker B has grandkids who are more interested in phones and tablets than musical instruments. Speaker A has children and grandchildren, with at least one child interested in learning the flute.",
        "speaker": "Speaker B",
        "raw_prediction": "I can see how that would be challenging with your schedule. It's important to adapt to stay connected with your loved ones.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t4",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? ",
        "memory_text": "Speaker A is a librarian and loves kids, mentioning having 3 children. This makes Speaker A busy with work, unable to spend as much time with them as they would like. Consequently, Speaker B, who has a lot of kids all grown up with kids of their own, enjoys spending time with their grandkids at the park. This led Speaker B to take their grandkids fishing once, with mixed reactions from the kids. Speaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been thinking about it, and I believe it could be a wonderful tradition for all of us. The kids seemed to enjoy it, and it's a great way to bond with nature.",
        "previous_summary": "Speaker B has a lot of kids, all grown up now and with kids of their own.\nSpeaker A has kids and is busy with work, unable to spend as much time with them as they would like.\nSpeaker B mentions having grandkids, implying they are older and have a family of their own.\nSpeaker B has grandkids and enjoys spending time with them at the park.\nSpeaker B took their grandkids fishing once, with mixed reactions from the kids.\nSpeaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature."
    },
    {
        "utter_id": "e7-s5-t6",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? ",
        "memory_text": "Speaker A loves kids and works as a librarian, mentioning having 3 children. Speaker B mentions having grandkids, implying they are older and have a family of their own. Speaker B has grandkids and enjoys spending time with them at the park. Speaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature.\n\nSpeaker B's kids do not go to work by boat like Speaker A. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like. Speaker B has grandkids and enjoys spending time with them at the park. Speaker B took their grandkids fishing once, with mixed reactions from the kids.\n\nSpeaker B has a lot of kids, all grown up now and with kids of their own. Speaker B mentions having grandkids, implying they are older and have a family of their own. Speaker B has grandkids and enjoys spending time with them at the park. Speaker A has children and grandchildren, with at least one child interested in learning the flute.",
        "speaker": "Speaker A",
        "raw_prediction": "Work at the library is busy as usual, but I love helping kids discover new books and stories.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t7",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.",
        "memory_text": "Speaker A and Speaker B are both planning a trip to Alaska. \nSpeaker B is unsure about what activities there are to do in Alaska besides hiking. \nSpeaker A and Speaker B share a sense of humor during their conversation.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll make sure to bring some bear repellent, just in case! I can't wait to try the ice cream and tell you all about it.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t2",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?",
        "memory_text": "1. Speaker A enjoys working at the restaurant despite the busy schedule, which causes Speaker A to enjoy the interaction with people at work and the variety of experiences that come with it.\n\n2. Speaker A owns a restaurant and recently experienced a fire incident but managed to put it out, leading to Speaker A finding it very busy working there. Additionally, Speaker A works at the restaurant and gets two free meals per week, along with taking home leftover baked goods.\n\n3. Speaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners, which is why Speaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.",
        "speaker": "Speaker A",
        "raw_prediction": "It's called \"Mediterranean Stuffed Peppers.\" I think it's going to be a hit with our customers!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t6",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?\nSpeaker B: I haven't! Just karate! Have you been thinking of taking some classes?\nSpeaker A: I want to take some martial art classes at school next year. What do you sggest I try?\nSpeaker B: I mean I always recommend Karate since that's what I study! I can bring you by the dojo sometime if you want to see what it is like. \nSpeaker A: OMG!! That would be so awesome, Yes please.  When is a good time for you?\nSpeaker B: Awesome! Tomorrow afternoon anytime between 3-6 would work for me!",
        "memory_text": "Speaker A is studying marketing and enjoys it. Speaker B practices Karate and holds a green belt, being involved in other activities and considering going back to school for a certificate in IT work. Speaker B signed up for classes at the local college and has a background in football and karate.\nSpeaker B practices Karate and holds a green belt, being involved in other activities and considering going back to school for a certificate in IT work. Speaker B attends football games at their old high school and finds that their football background helps in karate footwork.\nSpeaker B practices Karate and holds a green belt, being involved in other activities and considering going back to school for a certificate in IT work. Speaker B signed up for classes at the local college and has a background in football and karate.",
        "speaker": "Speaker A",
        "raw_prediction": "Tomorrow afternoon between 3-6 sounds perfect for me as well! Can't wait to check out the dojo with you.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t1",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.",
        "memory_text": "Speaker A is working at a pizza shop to pay for college and studying computer science. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics. Speaker B is studying linguistics but mentions feeling limited in job opportunities. \nSpeaker B is majoring in linguistics and hopes to turn it into a practical job. Speaker A is studying computer science and wants to develop apps for differently abled youth. Speaker A is interested in teaching computer science, specifically in the field of robotics.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I have thought about teaching as a potential career path. It seems like a stable and rewarding option.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t4",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.",
        "memory_text": "Speaker A is working at a pizza shop to pay for college and studying computer science, and wants to develop apps for differently abled youth. Speaker A is interested in teaching computer science, specifically in the field of robotics. \nSpeaker A is working at a pizza shop to pay for college and studying computer science. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics. Speaker B is studying linguistics but mentions feeling limited in job opportunities. \nSpeaker B majoring in linguistics causes Speaker A to be interested in teaching computer science, specifically in the field of robotics.",
        "speaker": "Speaker A",
        "raw_prediction": "Thank you! I'm lucky to have supportive parents. How about you, do your parents support your decision to pursue teaching?",
        "previous_summary": "Speaker A is working at a pizza shop to pay for college and studying computer science.\nSpeaker A is living with their grandparents and helps them out."
    },
    {
        "utter_id": "e12-s5-t8",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.",
        "memory_text": "Speaker B, majoring in linguistics and aspiring to turn it into a practical job, causes Speaker A to be interested in teaching computer science, particularly in the field of robotics.\nSpeaker B, living with their mom and currently in college, wants to pursue a masters degree after finishing their bachelors and potentially becoming a college professor in linguistics. This leads Speaker B to feel limited in job opportunities but also sparks an interest in studying linguistics.\nSpeaker B, majoring in linguistics and hoping to turn it into a practical job, wants Speaker A, who is studying computer science and aims to develop apps for differently abled youth, to be interested in teaching computer science, specifically in the field of robotics.",
        "speaker": "Speaker A",
        "raw_prediction": "World War II is such a fascinating period to study. The impact it had on the world is immense. Have you considered specializing in a particular aspect of history for your teaching career?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.\nSpeaker A: For sure! So much happened and it really affected how the world is today. I like learning about the history of places where I have lived, it's really interesting.\nSpeaker B: That sounds really cool! What have you learned about where you currently live?\nSpeaker A: Oh, I found out that the big sports field used to be a farm where they grew wheat and raised cows! It's really cool to see places in old photos and see how they have changed.",
        "memory_text": "Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics. Speaker B mentions feeling limited in job opportunities and is studying linguistics. Speaker A is studying computer science and wants to develop apps for differently abled youth, as well as being interested in teaching computer science, specifically in the field of robotics.",
        "speaker": "Speaker B",
        "raw_prediction": "That's fascinating! It's amazing to see how much history is right beneath our feet.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?",
        "memory_text": "Speaker A enjoys visiting the zoo and grew up in big cities. Speaker B's child wants to visit the zoo, particularly to see the monkeys. Speaker A is offering advice and seems to have experience with children. \n\nSpeaker A compares having a kitten to being a grandparent and mentions starting their own zoo. Speaker B expresses concern about leaving a kitten alone during their family camping adventures. \n\nSpeaker A suggests taking the pets to the zoo and mentions that most major cities have good zoos. Speaker B's child wants to visit the zoo, particularly to see the monkeys. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.",
        "speaker": "Speaker B",
        "raw_prediction": "One of our favorite camping spots is near the beach. The sound of the waves at night is so peaceful. Where do you usually camp?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t11",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?\nSpeaker A: I think the Bronx Zoo is one of the best in the country.   Yes, I did see Joshua.  Did you use a season pass for the zoo or just a one time ticket?\nSpeaker B: One time. I was just there visititng family. What is your favorite zoo to visit?\nSpeaker A: I think the Ashville Zoo is nice. What are your plans for the next weekend?",
        "memory_text": "Speaker A frequently visits the zoo and enjoys seeing tigers and monkeys. Speaker B's daughter also likes monkeys and is asserting her independence. Speaker A, who grew up in big cities, has a kitten and loves visiting the zoo to see the tiger named Joshua. Speaker B's child wants to visit the zoo to see the monkeys, which was caused by Speaker A suggesting taking pets to the zoo. Speaker B, a parent, is advocating for their daughter's school to have a field trip to the zoo.",
        "speaker": "Speaker B",
        "raw_prediction": "We're thinking of taking our daughter to the zoo again since she loved it so much. How about you, any plans for the weekend?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t2",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?",
        "memory_text": "Speaker B enjoys watching movies with her kids. This includes romance and horror movies, which their kids do not enjoy. Speaker B also finds Disney movies good, especially as a small escape into a new world. Speaker B's husband, on the other hand, enjoys Disney sports movies like 'Miracle'.\nSpeaker B is a stay-at-home mom, which causes her kids to enjoy watching Disney movies, something that Speaker B also finds good. The movie 'Miracle' is about the 1980 U.S. hockey team.",
        "speaker": "Speaker A",
        "raw_prediction": "We've been watching some classic comedies lately, trying to mix things up a bit. How about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t5",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?",
        "memory_text": "Speaker B enjoys watching movies with her kids, which is why Speaker B's kids enjoy watching Disney movies, which Speaker B also finds good. This made Speaker A watch the Disney movie 'Luca' recently. \n\nSpeaker B is a stay-at-home mom who used to prefer romance and horror movies, but now her kids enjoy watching movies like 'Luca' which they find good. \n\nSpeaker B enjoys watching movies with her kids, and because of this, her kids enjoy watching Disney movies, which Speaker B also finds good. This is evident from the fact that 'Miracle' and 'Remember the Titans' are available on Disney Plus.",
        "speaker": "Speaker B",
        "raw_prediction": "My kids would love to visit Italy with me someday. They are always up for a new adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t8",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.",
        "memory_text": "Speaker B's kids enjoy watching Disney movies, which Speaker B also finds good, causing Speaker A to have seen the Disney movie 'Luca' recently. \nSpeaker B enjoys watching movies with her kids, which leads Speaker B's kids to enjoy watching Disney movies and find them good, resulting in Speaker B's kids enjoying watching 'Luca' and saying it was good. \nSpeaker B enjoys watching movies with her kids, leading Speaker A to enjoy watching sunsets and mention seeing a great sunset recently, wanting to experience it more, resulting in Speaker A booking a \"Hawaii Sunset\" tour for next month and being excited about it being their first time.",
        "speaker": "Speaker A",
        "raw_prediction": "I haven't had Hawaiian food before, but I've heard it's delicious. I'll definitely make sure to try as much as I can while I'm there. I can't wait to experience everything Hawaii has to offer!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.",
        "memory_text": "Speaker A has blue eyes and blonde hair, while Speaker B is balding and overweight. Speaker A plans to take Speaker B on tours and attend folk concerts during the visit. Speaker A drives a smart car and used to have a long commute in Alaska. Speaker A has visited Alaska and describes it as beautiful, suggesting cheap flights to Anchorage. Speaker A's family is from the north, and they prefer the warmth of the south. Speaker B found flights that work for their schedule and price and will be visiting Speaker A in a couple of weeks.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds great! I'll keep an eye out for the flights and let you know as soon as I book them.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t10",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?\nSpeaker A: I think I'm more afraid of the wildlife than my dogs are. If I had to, I think I could muster the courage to face the animals out here, but I will happily avoid them when possible. With you around, I'd feel much better, as well. How do you feel about being that close to wildlife?\nSpeaker B: Well I don't have a lot of experience with that but I guess I'd be ok as long as I knew what to do. Most of the wildlife I see is squirrels, pigeons, and the occasional possum. ",
        "memory_text": "Speaker A used to have a long commute in Alaska, and now drives a smart car. They described Alaska as beautiful, suggesting cheap flights to Anchorage, which caused Speaker A to invite Speaker B to visit and look into flights. This led to Speaker B planning to visit Speaker A, interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n\nSpeaker A used to have a long commute in Alaska, and now drives a smart car. They mentioned the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer, as well as the wildlife like elk and wolves. This caused Speaker A to mention making poached eggs for breakfast and taking sleds pulled by dogs.",
        "speaker": "Speaker A",
        "raw_prediction": "It's definitely a different experience being around larger wildlife compared to squirrels and pigeons. I'll make sure to give you some tips on what to do in case you do encounter any animals during your visit.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t3",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.",
        "memory_text": "Speaker A enjoys Mexican food and drinks, and plays music for fun. This interest leads to Speaker A frequenting live band venues and playing music at home. The topic of music is also shared with Speaker B, as both Speaker A and Speaker B enjoy bluegrass music.\n\nSpeaker A owns a Subaru Legacy and mentions having a baby on the way, causing Speaker B's wife to be pregnant and currently in the second trimester while still working. Due to the pregnancy, Speaker B's wife is considering attending a local festival for just a day. This topic of family planning is further explored when Speaker A expresses uncertainty about settling down with a partner and having kids.\n\nEven though Speaker A does not live in Mexico, they enjoy Mexican food and women. This preference contrasts with Speaker B, who is not going out drinking much due to their wife's pregnancy. Both Speaker A and Speaker B, however, engage in discussions about the logistics of attending a festival with a small baby.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a great plan! It'll be nice to have everyone together for the festival.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t6",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.",
        "memory_text": "1. Speaker B is a mechanic who enjoys working on cars, while Speaker A frequents live band venues, plays music at home, and both enjoy bluegrass music.\n2. Speaker A owns a Subaru Legacy and mentions having a baby on the way, causing Speaker B to not go out drinking much due to their wife's pregnancy. As a result, Speaker B's wife is pregnant, so they are considering attending a local festival for just a day, which is a topic where Speaker A is not sure if they will ever settle down with a partner and have kids.\n3. Speaker A does not live in Mexico but likes Mexican food and women, which changed to enjoying going to bars and loving the ladies. Speaker B, on the other hand, dislikes public transportation and enjoys going to festivals but misses doing so.",
        "speaker": "Speaker A",
        "raw_prediction": "Thanks, I'll keep that in mind. Who knows, maybe I'll find someone who loves bluegrass music as much as I do.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t3",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?",
        "memory_text": "Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe because Speaker B's grandmother was the matriarch of the family, known for cooking large meals for family gatherings. \nSpeaker A likes cooking new dishes and following recipes occasionally as a change from preferring surfing and growing up in a beach town.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a plan! I'd be happy to show you how to make spicy fried rice.",
        "previous_summary": "Speaker B is going to buy their first new car and got fired from Cisco for their singing.\nSpeaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking."
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "Speaker A finds cooking helpful for stress relief, while Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker A wakes up early in the morning to catch waves, while Speaker B likes to eat huge steaks after snowboarding.",
        "speaker": "Speaker A",
        "raw_prediction": "I recently tried making some spicy shrimp tacos with homemade salsa. They turned out pretty good!",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t3",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?",
        "memory_text": "Speaker A used to work part-time at a supermarket, but now plays soccer as a striker and has a match next week. Despite not being into music, Speaker A is a member of a soccer team and enjoys playing in tournaments. \nSpeaker A is a college student studying Humanities and wants to finish college before looking for a job, expressing interest in working in HR and appreciating the recommendation.",
        "speaker": "Speaker B",
        "raw_prediction": "I do miss it sometimes, but it's definitely a lot of pressure being a goalkeeper.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.",
        "memory_text": "1. Speaker A, a college student majoring in Humanities and not currently employed, used to work part-time at a supermarket. Now, Speaker A is a member of a soccer team and enjoys playing in tournaments.\n2. Speaker A, a college student majoring in Humanities and not currently employed, used to work part-time at a supermarket. Now, Speaker A plays soccer as a striker and has a match next week. This has led to Speaker A scoring well in soccer recently.\n3. Speaker A, who enjoys playing soccer but is not into music, now plays soccer as a striker and has a match next week. This has resulted in Speaker A scoring well in soccer recently.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a plan! Let's get a friendly match going soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t6",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?",
        "memory_text": "Speaker A used to surf when they were younger and is trying to get back into it. Speaker B is currently not good at surfing but is interested in sports medicine and enjoys surfing. \nSpeaker B is a college student studying sports medicine, playing soccer with other students, and looking to join their college team in the future. Speaker B's professors have been supportive in writing letters for an internship application. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field. \nSpeaker A enjoys hiking along the coast, collecting shells, and mentions that their knees can't handle much else.",
        "speaker": "Speaker A",
        "raw_prediction": "I haven't traveled as much as I would have liked to, but I have a few trips under my belt. Greece sounds amazing, I bet the shells there are beautiful!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t7",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?",
        "memory_text": "Speaker B is studying sports medicine and plays soccer, looking to join their college team in the future. Speaker B's professors have been supportive in writing letters for an internship application. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n\nSpeaker B has been going to the beach a lot and is learning to surf from friends in Jersey. Speaker A used to surf and is trying to get back into it. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.",
        "speaker": "Speaker B",
        "raw_prediction": "I haven't made it to Europe yet, but I hope to travel there someday. It's great to hear about your experiences there.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "Speaker A works as a zookeeper and loves animals, especially white tigers. Speaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one. \n\nSpeaker B has two terrier dogs as pets. Speaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature. Speaker B asks Speaker A if they have had a pet raccoon before. \n\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker A has a pet raccoon and has a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "It's all about finding a good balance and making sure their needs are met. I'm sure your terriers are loving the extra time with you now!",
        "previous_summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations."
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.",
        "memory_text": "Speaker B has two terrier dogs as pets. Speaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.\nSpeaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature. Speaker B asks Speaker A if they have had a pet raccoon before.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, leaving my part-time job has been a nice change. It's good to have this time with my dogs before starting something new.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t8",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!",
        "memory_text": "Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one. \nSpeaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker A works at a zoo and is willing to help Speaker B get an entry-level position there. \nSpeaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker B is grateful for the opportunity and is looking forward to playing music for the animals, starting with something safer than the white tiger.",
        "speaker": "Speaker A",
        "raw_prediction": "Taking time off to spend with your dogs sounds like a great idea. I hope you find a job that you'll enjoy more.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t11",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!\nSpeaker A: That is understandable. I didn't always think I would end up a zookeeper. Do you have anything in mind?\nSpeaker B: Well, I really enjoy animals so I might think of applying to work in a zoo aswell! Is it a super busy job?\nSpeaker A: That sounds like a great idea! You would be surprised how busy it can be. Not every job is high demanding and you don't have to work with all the animals either. Is there anything you don't like to do?",
        "memory_text": "Speaker A enjoys working with animals at the zoo, including penguins, and offers Speaker B a chance to help out. Speaker B, who has two terrier dogs as pets, is excited about the opportunity at the zoo and is looking for a new job. Speaker A is willing to help Speaker B get an entry-level position at the zoo, mentioning that it involves cleaning enclosures and feeding less dangerous animals but offers decent pay, training, benefits, and assistance with schooling.",
        "speaker": "Speaker B",
        "raw_prediction": "I don't mind getting my hands dirty, so I'm open to any tasks at the zoo! What's the most challenging part of working there, in your opinion?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?",
        "memory_text": "Speaker A is interested in adopting a rescue kitten and has a parrot named Tasha who speaks Mandarin. Speaker B has two sick kitties and recently received a rescue, and is considering giving them Mandarin names based on their personalities. Speaker A has a pet parrot named Tasha and has red hair that makes them stand out. Speaker B has an older mellow cat and is concerned about training the new energetic kittens.",
        "speaker": "Speaker A",
        "raw_prediction": "Oreo sounds like a cute name! Have you thought of a name for the other kitten yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t6",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!",
        "memory_text": "Speaker A has a pet parrot named Tasha and is interested in adopting a rescue kitten. Speaker A is a country girl who loves animals and is considering adopting a rescue kitten despite having a parrot. Speaker A is interested in training tips for the kittens and is open to adopting one despite having a parrot. Speaker B has an older mellow cat and is concerned about training the new energetic kittens.",
        "speaker": "Speaker A",
        "raw_prediction": "I haven't been hiking much lately, but I agree, this summer heat is intense!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.\nSpeaker B: That is funny. And impressive that you're learning. The closest I can get to another language is doing a bad New York accent LOL",
        "memory_text": "Speaker B loves animals, lives in the city they grew up in, and has a cat that recently had a kitten. This led Speaker B to have two sick kitties and recently receive a rescue. Speaker A, on the other hand, has a parrot named Tasha and is interested in adopting a rescue kitten. Speaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\n\nSpeaker A, a country girl who loves animals and is a lacto-ovo vegetarian, now has a pet named Tasha who speaks Mandarin. As a result, Speaker A has been learning Mandarin, and Tasha has started saying Chinese phrases instead of English ones. This has led Speaker A to be interested in adopting a rescue kitten, similar to Speaker B.",
        "speaker": "Speaker A",
        "raw_prediction": "Haha, well, at least a New York accent adds some flair! I'm sure Tasha finds your Mandarin quite entertaining.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t2",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?",
        "memory_text": "Speaker A enjoys camping and hiking as free activities, which has led to them planning several camping trips for the summer and doing a part of the Appalachian Trail. Speaker A, who works as a personal trainer leading hikes, is nervous about the Appalachian Trail hike as they don't usually do full day hikes. Speaker B recently went on a long hike and enjoyed it, which is similar to Speaker A's love for camping and hiking.",
        "speaker": "Speaker A",
        "raw_prediction": "Not lately, but I'm planning a few camping trips for the summer.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t4",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?",
        "memory_text": "Speaker A enjoys going on camping trips and hiking trails in parks. This has led to Speaker A planning several camping trips for the summer and deciding to do a part of the Appalachian Trail. Speaker A enjoys camping and hiking as free activities, and this aligns with their interest in looking for wild animals in the woods.",
        "speaker": "Speaker A",
        "raw_prediction": "They did have a good time, despite getting tired quickly. It was nice to share my love for hiking with them.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t10",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.",
        "memory_text": "Speaker A recently moved to a new city and has two older brothers. This experience has made job searching challenging, but Speaker A is excited about the upcoming interview and hopes to settle in the new city soon with a steady income.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I have been doing a lot of research on the company. It's important to show that you're genuinely interested in the position. Thanks for the advice!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t3",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.",
        "memory_text": "1. Speaker B is dedicated to studying sports medicine on the way to college, resulting in all A's in the sports medicine class, while Speaker A struggles with maintaining good grades and excels only in gym.\n2. Speaker B is focused on sports medicine training and is preparing for an exam in that subject, feeling pressured to maintain straight A's to avoid embarrassing their mother who runs the school.\n3. Speaker B is studying sports medicine in college, while Speaker A finds history class boring and challenging, both feeling overwhelmed by external pressures and expectations.",
        "speaker": "Speaker B",
        "raw_prediction": "Nice job on getting a B! Studying more always helps. Just keep pushing through, you got this.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t8",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.",
        "memory_text": "Speaker B has been to Italy in the past and enjoyed the food there, while Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\n\nSpeaker A is planning for a spring break trip and recently bought a dress for Easter, while Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.\n\nSpeaker B suggests California as a destination for Speaker A's trip, mentioning that they have tried surfing before but are not very good at it. Additionally, Speaker B expresses interest in visiting Greece for the history and Greek mythology, which aligns with Speaker A's fascination with the architecture of Italy and passion for studying history.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll definitely pack my walking boots and sun cream for Greece! It would be amazing to have you as my guide. I can't wait to explore the history and mythology together.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t2",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?",
        "memory_text": "Speaker A enjoys cooking and baking, possibly considering turning it into a business. Speaker A primarily cooks Indian food and bakes a lot of rice dishes. Speaker A owns a farm and enjoys cooking and baking. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.\nSpeaker B's husband is an avid cook who enjoys making Asian food with lots of prep work. Speaker B's husband is a great cook and Speaker B is not skilled in cooking. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker. Speaker B also mentions having a farm with animals like chickens, ducks, pigs, goats, and growing crops like corn, strawberries, and pumpkins.",
        "speaker": "Speaker A",
        "raw_prediction": "I would recommend starting with a simple and delicious recipe like a chicken curry or a vegetable stir-fry. It's a great way to get comfortable using the pressure cooker.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t5",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  ",
        "memory_text": "Speaker A enjoys cooking and baking, possibly considering turning it into a business. This is similar to Speaker B's husband, who is a great cook and enjoys making Asian food with lots of prep work. Speaker B, on the other hand, is not skilled in cooking but is interested in learning about cooking with a pressure cooker. In addition, Speaker B also mentions having a farm with animals like chickens, ducks, pigs, goats, and growing crops like corn, strawberries, and pumpkins. This resonates with Speaker A, who owns a farm and enjoys cooking and baking. This has led Speaker A to become a cook and enjoy using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds perfect! I'll definitely give the shrimp fried rice a try, especially with our fresh eggs. Thanks for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.",
        "memory_text": "Speaker B lives in a rural area with a farm and can relate to cooking. This allows Speaker B to easily understand the cooking process and ingredients. Speaker A bakes muffins and bread but is conscious of their impact on their weight, showing a consideration for healthy eating habits. Speaker A is interested in running a business with their cooking skills, indicating a potential entrepreneurial spirit. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker, showing a willingness to explore new culinary techniques. \n\nSpeaker A is from the south of India and prefers warm summer weather, influencing their cooking preferences towards Indian cuisine and rice dishes. Speaker A primarily cooks Indian food and bakes a lot of rice dishes, showcasing their culinary expertise in these specific areas. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken, highlighting their diverse cooking skills and preferences.\n\nSpeaker B does not cook, but enjoys listening to country music and drives trucks for a living. This contrasts with Speaker B's husband, who is a skilled cook specializing in Asian cuisine with extensive prep work.",
        "speaker": "Speaker A",
        "raw_prediction": "I would love to join you on your haul next Wednesday. It sounds like a fun adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t11",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.\nSpeaker A: Sure, I'm free that day.  What time do I need to meet you?",
        "memory_text": "Speaker B, who lives in a rural area with a farm and can relate to cooking, causes Speaker A to be interested in running a business with their cooking skills. Speaker B, who is not a cook but is interested in learning about cooking with a pressure cooker, also sparks Speaker A's interest in running a business with their cooking skills. \nSpeaker B, who does not cook but enjoys listening to country music and drives trucks for a living, also mentions having a farm with animals like chickens, ducks, pigs, goats, and growing crops like corn, strawberries, and pumpkins, which is a topic discussed by Speaker A who has 14 chickens and uses their eggs for baking.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll pick you up at 8 am next Wednesday. It'll be a fun ride!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t3",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?",
        "memory_text": "Speaker A enjoys hot latina salsa and mentioned it while talking about Brazilian foods with their brother.\nSpeaker B prefers to keep holidays local with their brother instead of having big family gatherings, after expressing interest in trying healing methods mentioned by Speaker A.\nSpeaker A enjoys salsa dancing and is planning to go out dancing, which causes Speaker B to express interest in trying healing methods mentioned by Speaker A.",
        "speaker": "Speaker B",
        "raw_prediction": "I've seen a couple of the Marvel Avengers movies, but not Black Widow specifically. What did you enjoy most about it?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t10",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!\nSpeaker A: Yes, in fact I consider almost all foods to either be healing, harmful or neutral. In my opinion people should choose foods based on how they want to feel. Sushi is fresh and healthy so I considerate it to be very healing.\nSpeaker B: That is very wise thinking. Which vegetables do you feel are the best for healing? Are there any that should be avoided?",
        "memory_text": "Speaker B expressed interest in trying healing methods mentioned by Speaker A, such as self-massage, essential oils, and meditation. Speaker A is a Reiki practitioner who also works with meditation.",
        "speaker": "Speaker A",
        "raw_prediction": "I believe that leafy greens like spinach and kale are excellent for healing. As for vegetables to avoid, I try to steer clear of processed or fried options. What are some of your favorite vegetables?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t11",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?\nSpeaker A: Ok! I am putting my fate in your hands on this one. School is fine. I don't really pay attention to anything except band class.",
        "memory_text": "Speaker B is knowledgeable about plants and gardening, with a thriving garden. - (Want) - Speaker B mentions weight gain from spending time at the computer and plans to work in the garden more.",
        "speaker": "Speaker B",
        "raw_prediction": "It's great that you're excited about starting your garden! Just take it one step at a time, and I'm sure you'll do great.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t3",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?",
        "memory_text": "Speaker B has visited 20 countries and enjoys the color turquoise. Speaker B enjoys traveling and visiting gardens. Speaker A is interested in trying to make a lotus origami next. Speaker A enjoys origami and tried making a Lotus flower successfully. \nSpeaker A enjoys art and music, specifically painting. Speaker A is working on painting projects in their craft room. Speaker A is interested in trying to make a lotus origami next. Speaker A learned origami by themselves in their craft room.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm glad you're proud of your achievement! I might give origami a try soon, it sounds like a fun and rewarding hobby.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!",
        "memory_text": "Speaker A enjoys art and music, specifically painting. They are currently working on painting projects in their craft room. Additionally, Speaker A is interested in trying to make a lotus origami next. They enjoy origami and have successfully tried making a Lotus flower. \nSpeaker A finds meaning and fulfillment in doing volunteer work. This led them to be busy with gardening and volunteering at the hospital. Their volunteering experience inspired them to start making origami crafts, specifically a 3D modular swan with glue. Speaker A also learned origami by themselves in their craft room. \nSpeaker A, who enjoys art and music, specifically painting, is currently working on painting projects in their craft room. They are interested in trying to make a lotus origami next and have offered to teach Speaker B origami in a few weeks.",
        "speaker": "Speaker B",
        "raw_prediction": "That's interesting, I didn't know origami could be used in the hospital for breathing apparatus. It definitely seems like there's a lot more to origami than meets the eye!",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t7",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?",
        "memory_text": "Speaker A is interested in trying to make a lotus origami next and learned origami by themselves in their craft room. Speaker A volunteers at a hospital and enjoys making origami crafts, specifically a 3D modular swan with glue, and offered to teach Speaker B origami in a few weeks. Speaker B keeps a turquoise lotus origami on their desk from Japan and enjoys origami, having tried making a Lotus flower successfully.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I saw some beautiful origami pieces in Japan. The attention to detail and precision in their folding was truly remarkable.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t7",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. ",
        "memory_text": "Speaker B used to teach Film Studies and carefully chooses what movies to watch. This is how Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\n\nSpeaker B has kids and enjoys watching movies with them. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman.",
        "speaker": "Speaker B",
        "raw_prediction": "I appreciate your kind words. It's truly fulfilling to see students passionate about film. I'm glad to hear that your programmer job is going well too. Let me know how you find \"Girl Next\" when you watch it!",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?",
        "memory_text": "Speaker B, who used to teach Film Studies and carefully chooses what movies to watch, has a sister who shares the same opinion about age as Speaker A. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman. \nSpeaker B, who has kids and enjoys watching movies with them, enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy. Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\nSpeaker B, who used to teach Film Studies and carefully chooses what movies to watch, highlighted Eddie Murphy's success in cop roles in movies like Beverly Hills Cop trilogy and \"I-SPY.\"",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I did find Pulp Fiction funny, and as for the violence, I think it might be a bit too intense for kids to watch.",
        "previous_summary": "Speaker B has kids and enjoys watching movies with them.\nSpeaker B allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s.\nSpeaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences."
    },
    {
        "utter_id": "e31-s5-t9",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? ",
        "memory_text": "Speaker A enjoys programming and plans to go for a long run after work. Speaker B enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman. Speaker B used to teach Film Studies and carefully chooses what movies to watch. Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences. Speaker B has a sister who shares the same opinion about age as Speaker A.",
        "speaker": "Speaker B",
        "raw_prediction": "I agree, Pulp Fiction definitely has some funny moments, but I also think it's too violent for kids. Parents should have the final say on what their children watch.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t10",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.",
        "memory_text": "Speaker B, who has kids and enjoys watching movies with them, used to teach Film Studies and carefully chooses what movies to watch. Speaker B, who just turned 40 and considers themselves too old for certain activities, allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s, causing Speaker B to recommend \"Coming 2 America\" and \"I-SPY\" starring Eddie Murphy.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a good point. It's all about the context and the discussion around it. So, have you seen any good comedies lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t11",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.\nSpeaker A: Yes exactly. I think all kids should learn that. I know my grandkids love to watch all genre’s of movies and I think kids should learn what they like to watch. ",
        "memory_text": "Speaker B used to teach Film Studies and carefully chooses what movies to watch, and Speaker B has a sister who shares the same opinion about age as Speaker A.\nSpeaker B just turned 40 and considers themselves too old for certain activities, but Speaker B allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s.",
        "speaker": "Speaker B",
        "raw_prediction": "It's great that your grandkids enjoy watching different genres of movies. It's important for kids to explore different types of films and find what they like.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t5",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?",
        "memory_text": "1. Speaker A's strong connection to jello, especially cherry flavor, stems from their grandma making it at family dinners, leading to Speaker A learning various jello recipes from their grandmother.\n2. Speaker A's favorite jello eating habit transformed into a family tradition after learning how to make jello from their grandma, suggesting Speaker B to involve their grandmother in learning jello recipes.\n3. Speaker A's upbringing by two non-meat eater moms shifted into a family tradition of learning jello recipes from their grandma.",
        "speaker": "Speaker B",
        "raw_prediction": "It's been a bit challenging, but I'm enjoying the process of learning to bake healthier alternatives.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t10",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. \nSpeaker A: Boating is so fun. You could go wakeboarding more often if you had your own boat. And no more boat rental fees or hassle.\nSpeaker B: I actually saw a drone the at will pull you in the water. It's the craziest thing.  ",
        "memory_text": "Speaker B recently quit their job at Cisco to pursue snowboarding. As summer approaches, Speaker B enjoys snowboarding but will focus on wakeboarding. Excited to join Speaker A's family for a water skiing trip, Speaker B wants to learn from Speaker A's kids.\n\nSpeaker B values following their passions for snowboarding and music. Wanting to try water skiing next, Speaker B expresses interest. Speaker A loves boating and water sports, mentioning they are better at water skiing than wakeboarding. Considering living in a houseboat when old and retired, Speaker B is Reacting to this idea.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a cool gadget! Have you ever tried it before?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t4",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?",
        "memory_text": "Speaker A enjoys playing Jurassic Park: World but mentions its lack of multiplayer and outdated graphics.\nSpeaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\nSpeaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.",
        "speaker": "Speaker A",
        "raw_prediction": "I enjoy a mix of simulation and strategy games. Anything with a good story usually catches my interest.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t5",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?",
        "memory_text": "Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\nSpeaker A prefers tamer video games and is not a fan of horror movies. Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\nSpeaker B is interested in trying the Jurassic Park game.",
        "speaker": "Speaker B",
        "raw_prediction": "I enjoy reading or watching movies when it's rainy. It's a good time to relax and unwind. What about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t6",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?",
        "memory_text": "Speaker A prefers tamer video games and is not a fan of horror movies. Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil. \nSpeaker A and Speaker B both enjoy playing video games in their free time. Speaker A and Speaker B plan to meet next week Friday at 6 pm to play games and order pizza.",
        "speaker": "Speaker A",
        "raw_prediction": "I've heard of Ring Fit Adventure, but I haven't tried it yet. It sounds like a fun way to stay active while gaming. I might give it a shot since the stormy weather is keeping me indoors.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t7",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?",
        "memory_text": "- Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\n- Speaker B plays Resident Evil VIII alone in the dark to make it scarier and provides some tips for playing it.\n- Speaker B is interested in playing Jurassic Park: World but has not played it yet.",
        "speaker": "Speaker B",
        "raw_prediction": "I do enjoy a variety of genres, but horror games like Resident Evil are my favorite. I also like action-adventure games and RPGs. Do you have any favorite RPGs or action-adventure games you'd recommend?",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t2",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month",
        "memory_text": "1. Speaker B enjoys visiting the zoo and has a cat that recently had a kitten. Speaker B is considering adopting a kitten from a friend.\n2. Speaker A's sister recently got married, which was exciting for them. Speaker B's girlfriend enjoys pandas and penguins at the zoo and they go to the zoo every few weeks. Speaker B wants to get a kitten from Speaker A's friend. Speaker A prefers cockatoos over kittens as pets.\n3. Speaker B enjoys visiting the zoo and has a cat that recently had a kitten. Speaker B's girlfriend owns a cockatoo named John.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a good plan. It's important to make sure you have enough time to settle in the new kitten.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t6",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.",
        "memory_text": "Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo. Speaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks. Speaker A has been to the zoo before and enjoys seeing exotic birds. Speaker A prefers cockatoos over kittens as pets. \nSpeaker B has a cat that recently had a kitten and enjoys visiting the zoo. Speaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks. Speaker B's girlfriend has a cockatoo that makes a lot of noise. Speaker B is considering adopting a kitten from a friend.",
        "speaker": "Speaker A",
        "raw_prediction": "San Diego sounds like a fun trip! Make sure to say hi to the pandas for me when you visit the zoo.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t9",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.",
        "memory_text": "Speaker A's sister recently got married, which was exciting for them. This event causes Speaker A to enjoy seeing pandas and penguins at the zoo and goes with their sister. Speaker A's sister is a dog person with a yellow lab, even though it changed to Speaker A has a sister who owns a corgi.\n\nSpeaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo. Speaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks, which makes Speaker B want his girlfriend to have a cockatoo that makes a lot of noise. Speaker B is considering adopting a kitten from a friend because his girlfriend has a cockatoo named John.",
        "speaker": "Speaker B",
        "raw_prediction": "Maybe your sister's dog just needs a little socialization. It could be a fun adventure for all of you!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t3",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.",
        "memory_text": "Speaker A is saving up for their next tattoo while working at a coffee shop that their mom owned, planning to get a portrait of their father's face next to a slogan already tattooed on their chest. Speaker A's favorite tattoo is dedicated to their late father, and they want to add another one with their father's portrait and a slogan.",
        "speaker": "Speaker B",
        "raw_prediction": "I've thought about a classic script font for the names and birth dates. It's important to choose something that feels meaningful to you.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t8",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?",
        "memory_text": "1. Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest because Speaker A works at a coffee shop that their mom owned.\n2. Speaker A wants to work at a coffee shop and is saving up for their next tattoo because Speaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father.\n3. Speaker A wants to get a portrait of their father's face next to a slogan they already have tattooed on their chest because Speaker A's favorite tattoo is the one dedicated to their late father, saying \"for you I shall live\".",
        "speaker": "Speaker A",
        "raw_prediction": "I'm not married, but I have seen firsthand how important communication is in a relationship, especially when it comes to tattoos.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.",
        "memory_text": "Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest. They enjoy getting tattoos and have 5 so far, with one dedicated to their late father. They work at a coffee shop and are saving up for their next tattoo. Their favorite tattoo is the one dedicated to their late father, saying \"for you I shall live.\"",
        "speaker": "Speaker B",
        "raw_prediction": "That's understandable. Focusing on your artwork sounds like a great way to channel your energy and creativity.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t11",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?\nSpeaker A: I probably shouldn't be saying this, but I put up a large mural on the side of the local Community Center.  People seem to like it - at least everyone except the administrators of the center.  Everyone is trying to figure out who did it.  ",
        "memory_text": "Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest. They enjoy getting tattoos and have 5 so far, with one dedicated to their late father. They work at a coffee shop and are saving up for their next tattoo. Their favorite tattoo is the one dedicated to their late father, saying \"for you I shall live.\"",
        "speaker": "Speaker B",
        "raw_prediction": "That's quite the secret artist you are! It must be exciting seeing people's reactions to your work.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.",
        "memory_text": "Speaker A enjoys reading books and watching Netflix, while Speaker B has a son and prefers reading books about animals. Speaker B is preparing to purchase school supplies for their son as he is about to start school soon.",
        "speaker": "Speaker B",
        "raw_prediction": "That's exciting! Maybe once it's on Netflix, I'll give it a watch too.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.",
        "memory_text": "Speaker B is involved with Boy Scouts for 7-8 years, currently a Life Scout. \nSpeaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat. \nSpeaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a great way for kids to learn important life skills while having fun outdoors. I'll look into signing them up for Boy Scouts.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!",
        "memory_text": "Speaker A wants more children and feels lonely due to their husband's frequent traveling. Speaker A suggested that Speaker B join one of the church retreats in the future. Speaker B appreciates Speaker A's involvement with the scout troop and invites them to a youth retreat. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n\nSpeaker B is not yet in college but hopes to become an Eagle Scout. Speaker A is involved in church activities and mentioned a church retreat. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n\nSpeaker B is not yet in college but hopes to become an Eagle Scout. Speaker B has not taken any vacations recently but has vacation days saved up. Speaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat. Speaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker A",
        "raw_prediction": "Wow, that sounds like quite the adventure! I'm sure your scouting experiences will make for great stories to share with the kids.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t10",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!\nSpeaker A: Wow, that sounds like such an adventure! I love to visit Canada. I have seen moose but never a bear! That must have been scary!\nSpeaker B: Yes, it is quite scary. We could also hear the wolves howling at night, luckily we didn't come across them though. One thing to note about bears, is they just want to come and scrounge for our food, so we learned to safely pack it away and hang it up high in a tree.\nSpeaker A: Yes, I've heard that it's important to be careful in bear country! I would love to see one in person though. Do you take lots of photos on your trips?\nSpeaker B: Yes, I took quite a few. The scenery was stunning. Would you like me to send you some photos? I know they are uninteresting to some people.",
        "memory_text": "Speaker B's involvement with the scout troop and work at a fast food place leads Speaker A to appreciate it and invite Speaker B to a youth retreat. As a result, Speaker B, who has been in Boy Scouts for 7-8 years and is currently a Life Scout, wants to attend the retreat. \nSpeaker B's aspiration to become an Eagle Scout and not being in college yet is related to Speaker A's involvement in church activities and mentioning a church retreat. This connection leads Speaker A to appreciate Speaker B's scout involvement and invite them to a youth retreat, which Speaker B wants to attend. \nSpeaker B's desire to become an Eagle Scout and having saved vacation days, along with being busy with various activities, makes them willing to use the saved vacation days for the retreat. This decision is influenced by considering attending a local community college for the first couple of years.",
        "speaker": "Speaker A",
        "raw_prediction": "I would love to see the photos! It sounds like you had an amazing adventure.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t5",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. ",
        "memory_text": "Speaker A is a college student who teaches jiu-jitsu and is lactose intolerant. They are enrolled in a class on the history of martial arts and are majoring in athletic training. Speaker A is taking a history of martial arts class and enjoys it. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts. \nSpeaker A is a college student who teaches jiu-jitsu and is lactose intolerant. They are taking a history of martial arts class and enjoy it. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things. \nSpeaker A is planning to take summer courses soon and is very active, enjoying martial arts. They are enrolled in a class on the history of martial arts and are majoring in athletic training. Speaker A is taking a history of martial arts class and enjoys it. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great that you got to experience a different style of martial arts as a student today. How was the taekwondo class compared to your usual jiu-jitsu sessions?",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t6",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. ",
        "memory_text": "Speaker A is planning to take summer courses soon and is very active, enjoying martial arts. Speaker A is enrolled in a class on the history of martial arts and is majoring in athletic training. Speaker A is taking a history of martial arts class and enjoys it. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.\nSpeaker A is a college student who teaches jiu-jitsu and is lactose intolerant. Speaker A is taking a history of martial arts class and enjoys it. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things.",
        "speaker": "Speaker A",
        "raw_prediction": "My class on martial art history is fascinating! I'd be happy to share some interesting facts with you sometime.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t11",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.\nSpeaker A: Thanks for letting me know! I'll have to check that out soon!",
        "memory_text": "Speaker A, who is a college student teaching jiu-jitsu and is lactose intolerant, is now enrolled in a class on the history of martial arts and is majoring in athletic training. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts. \nSpeaker A, who is planning to take summer courses soon and is very active in martial arts, wants to visit England as they have never been out of the United States. Speaker B, who is from London, England and misses it, enjoys fancy restaurants and mentioned Sufi as their favorite in London.",
        "speaker": "Speaker B",
        "raw_prediction": "Donairs are a must-try, especially if you enjoy Sufi's cuisine. Let me know how you like them when you get the chance!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t8",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.",
        "memory_text": "Speaker A and Speaker B are both discussing furniture and home decor choices, planning to meet up to exchange ideas. Speaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company. \nSpeaker B is renovating their house to meet their living standards with their pets, planning to grill steaks this weekend using an old charcoal grill. Speaker A is excited about spending quiet evenings outside during the summer, possibly grilling most nights. \nSpeaker A likely lives on a corn farm.",
        "speaker": "Speaker A",
        "raw_prediction": "Sure, I can definitely play some Miranda Lambert songs for you at the barbecue. I'll make sure to grab some corn too!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t7",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol",
        "memory_text": "Speaker B enjoys fishing and the outdoors, while Speaker B has run a marathon before and found it tough but rewarding. Speaker A is training for marathons and seeking advice on how to recover, and Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600. \nSpeaker A dislikes traveling but has visited 20 countries, and Speaker A is working on improving their mile time and training for a marathon, which causes Speaker A to seek advice on recovery. Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600. \nSpeaker A dislikes traveling but has visited 20 countries, and Speaker B has run a marathon before and found it tough but rewarding. Speaker A is training for marathons and seeking advice on how to recover, while Speaker B is considering running a marathon and mentioned fishing and feeling depressed.",
        "speaker": "Speaker B",
        "raw_prediction": "Nope, no turning back now! You're in this for the long run, pun intended. You won't regret it!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?",
        "memory_text": "Speaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality. Speaker A plans to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip. Speaker A applied to work at a grocery store near a hiking trail.\nSpeaker B does not vote and wants their neighbor John to know about their stance on group equality. Speaker B's neighbor, John, is getting divorced and selling top-of-the-line camping gear. Speaker B's friend worked at the same store and enjoyed the people there.\nSpeaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs. Speaker A plans to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip. Speaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail. There is a lake at the hiking trail, and Speaker A suggests swimming in it, warning that the water may be cold.",
        "speaker": "Speaker B",
        "raw_prediction": "I've been doing odd jobs here and there, nothing too steady. But I'm glad to hear you're excited about the job offer! It's great when you enjoy the people you work with.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t1",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.",
        "memory_text": "1. Speaker A and Speaker B both bought lotto tickets for a big jackpot, hoping to change their luck.\n2. Speaker A bought 50 lotto tickets with different numbers to increase their chances of winning, despite Speaker B's belief that luxurious items distract from the value of their family.\n3. Speaker B leads a hectic life but is interested in attending the concert with their kids during winter break, even though they believe that luxurious items distract from the value of their family. This interest may have been influenced by Speaker B's children being sick and Speaker B having a fever, leading them to buy 20 lotto tickets.",
        "speaker": "Speaker B",
        "raw_prediction": "That's nice, I hope you're enjoying your new phone.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t10",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though\nSpeaker B: Yeah I understand that. Have you listened to any new blues songs lately?",
        "memory_text": "Speaker A expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm. Speaker B shares the same desire and dreams of having a city and country house or a summer and winter home.",
        "speaker": "Speaker A",
        "raw_prediction": "Not recently, but I should check out some new releases soon. Have you discovered any new artists yourself?",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t1",
        "current_dialogue": "Speaker A: When is your first music concert this summer?",
        "memory_text": "Speaker B drove over 1000 miles to see their favorite band, Three Dog Night. This caused Speaker B to enjoy living in the city for the accessibility to food and live music. Speaker A enjoys going to museums and trying different foods. Speaker A and their boyfriend also look forward to having some refreshing beers by the beach.\nSpeaker B drove over 1000 miles to see their favorite band, Three Dog Night. This caused Speaker B to enjoy living in the city for the accessibility to food and live music. Speaker B is waiting for bands to announce their summer tour schedule to plan which shows to attend.\nSpeaker B has 2 older and 1 younger brother, and their father used to be a farmer. Speaker B was born in Brazil, specifically in Sao Paulo. Speaker A is interested in music concerts and planning a trip to Sao Paulo. This causes Speaker A to plan to visit the Museum of Art of Sao Paulo next week with their boyfriend.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm still waiting for the bands to announce their summer tour schedule. Can't wait to see who's coming to town!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t2",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?",
        "memory_text": "Speaker A enjoys living in a big city for the accessibility to food, live music, museums, and trying different foods. They and their boyfriend also look forward to having some refreshing beers by the beach.\nSpeaker B has 2 older and 1 younger brother, and their father used to be a farmer. They were born in Brazil, specifically in Sao Paulo. Speaker A is interested in music concerts and planning a trip to Sao Paulo to do lots of shopping. Speaker B enjoys living in the city for the accessibility to food and live music, and is waiting for bands to announce their summer tour schedule to plan which shows to attend.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm planning on visiting a contemporary art museum next, do you have any recommendations?",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t4",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?",
        "memory_text": "Speaker B drove over 1000 miles to see their favorite band, Three Dog Night. Speaker B enjoys living in the city for the accessibility to food and live music. Speaker A enjoys going to museums and trying different foods. Speaker A and their boyfriend also look forward to having some refreshing beers by the beach.\n\nSpeaker B drove over 1000 miles to see their favorite band, Three Dog Night. Speaker B enjoys living in the city for the accessibility to food and live music. Speaker A is interested in music concerts and planning a trip to Sao Paulo. Speaker A plans to do lots of shopping during their trip.\n\nSpeaker A loves Disney music. Speaker B enjoys living in the city for the accessibility to food and live music. Speaker B recommends visiting the Museum of Art of São Paulo in the city. Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend.",
        "speaker": "Speaker A",
        "raw_prediction": "No, I haven't seen the fireworks at the Disney castle, but it sounds magical. I hope to experience it someday.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t7",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.",
        "memory_text": "Speaker A enjoys being around people, going to museums, trying different foods, and loves Disney music.\nSpeaker B enjoys living in the city for the accessibility to food and live music, has brothers, their father used to be a farmer, and was born in Brazil.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like quite the adventure on the Pirates of the Caribbean ride! I hope you still had a good time overall at Disney World.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t8",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?",
        "memory_text": "Speaker B enjoys living in the city for the accessibility to food, live music, and museums. This is why Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend. \nSpeaker B enjoys living in the city for the accessibility to food, live music, and museums. Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend. \nSpeaker B is waiting for bands to announce their summer tour schedule to plan which shows to attend because they love Disney music.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, my boyfriend came with me to Disney World. He loved the roller coasters, but not so much the long lines.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t2",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  ",
        "memory_text": "Speaker A, an inventor working on a time machine, enjoys teleporting worldwide and loves animals, especially puppies. They frequently visit shelters in different cities to care for dogs and cats, particularly excited about new puppies. \nSpeaker B, a 26-year-old workaholic unsure about their career, is interested in volunteering and leans towards cats, especially kittens, over dogs. They don't have strong opinions on puppies.",
        "speaker": "Speaker A",
        "raw_prediction": "Puppies have a special energy and playfulness that I find irresistible.",
        "previous_summary": null
    }
]