[
    {
        "utter_id": "e0-s5-t1",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " Not yet, I haven't purchased my plane tickets. I'm still deciding on the best time to go. By the way, have you thought about which book to bring for your beach visit? I remember you were looking for some recommendations.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I haven't been to Costa Rica yet, but I can imagine all the vibrant colors and nature there must be so inspiring for my next hair dye experiment! Maybe I'll come back with some tropical-inspired hues to match the scenery.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " That book sounds interesting, but I'm more into fiction. Have you read \"Where the Crawdads Sing\"? It's a great beach read, perfect for your upcoming trip to Costa Rica! And speaking of your trip, have you thought about trying a new hair color to match the tropical vibes? Maybe purple or blue would be a fun change!",
        "previous_summary": "Speaker A is older and has eight grandchildren.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city."
    },
    {
        "utter_id": "e0-s5-t10",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a fun idea! I can picture you rocking a bright green hair color. It's great that you're always open to trying new things and expressing yourself creatively through your hair. I can't wait to see how it turns out!",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?\nSpeaker A: Sorry for the typo. I meant \"pool\". Weather here is very hot and humid. It is miserable if you don't have air conditioning. Pollen count is also very high, so the air quality is poor. ",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " That's a great suggestion! I actually recently dyed my hair turquoise and I love it. Purple or blue could be a fun change for the summer. My daughter is really passionate about cosmetology, so I'll have to get her opinion on it. Thank you for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great playlist! I'm excited for our meetup this weekend. I can't wait to try out the fun music by the pool and dive into our programming studies with some steady tunes. And of course, pizza burgers are always a good idea. Looking forward to our swimming lessons too - maybe one day we'll be cruising in the Caribbean together!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t8",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a great plan! I can definitely teach you some programming skills while we're on the cruise. And don't worry about the swimming, I'll help you overcome your fears and hopefully you'll enjoy it more. Maybe we can even watch some swimming movies together to get you more comfortable in the water. And of course, we can grab some pizzaburgers on the way back, your favorite!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t9",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm really looking forward to our meetup this weekend! I can't wait to learn more about programming from you and maybe even try swimming. And cruising in the Caribbean sounds amazing, I hope I can join you on one of your adventures in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t10",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a great plan! I can definitely show you some programming languages that I prefer and we can start learning together. Maybe we can grab some pizzaburgers after our lesson, it's my favorite stress-relief food too. And don't worry, we can take it slow with the swimming lessons. I'll make sure you feel comfortable in the pool before we start.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t11",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.\nSpeaker A: Sure. I usually like to start with html and css so we can start there. We'll order some pizzaburgers to help us out. ",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm really looking forward to our meetup this weekend. Learning programming from you and getting some swimming lessons sounds like a great way to spend the day. And I can't wait to try out some pizzaburgers as well!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t2",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?",
        "memory_text": "User Description:\nSpeaker B is a hardworking student ahead of college, working at a diner cooking hamburgers. They are interested in neuroscience, have a deaf dog named Sparky, and are planning to major in molecular biology. Speaker B is known for inventing a chili dog casserole and may take summer classes to get a head start on college.\n\nRelationship Description:\nSpeaker A and Speaker B share a close bond, discussing their love for dogs and food. Speaker A compliments Speaker B on being a great dog owner and offers to walk Sparky. They also plan to try Speaker B's famous hamburgers at the diner.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing their dogs, sharing dinner choices, and talking about future plans. Speaker B invents a chili dog casserole and plans to clone a jersey cow. Speaker A recommends taking summer classes to get ahead in college.",
        "speaker": "Speaker A",
        "raw_prediction": " I really hope I can continue working in the lab even when classes get tough. I'm really excited about the cloning project! And yeah, I would totally eat a hamburger from a cloned cow. It's all about advancing science and innovation, right? Plus, I bet it would taste just as delicious as the ones I make at the diner!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t4",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.",
        "memory_text": "User Description:\nSpeaker B is a hardworking student ahead of college, working at a diner cooking hamburgers. They are interested in neuroscience, have a deaf dog named Sparky, and are planning to major in molecular biology. Speaker B is known for inventing a chili dog casserole and may take summer classes to get a head start on college.\n\nRelationship Description:\nSpeaker A and Speaker B share a close bond, discussing their love for dogs and food. Speaker A compliments Speaker B on being a great dog owner and offers to walk Sparky. They also plan to try Speaker B's famous hamburgers at the diner.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing their dogs, sharing dinner choices, and talking about future plans. Speaker B invents a chili dog casserole and plans to clone a jersey cow. Speaker A recommends taking summer classes to get ahead in college.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear you're planning to continue working in the lab! I have no doubt you'll be able to balance classes and your job. And thank you for the offer to try a Beyond burger or plant-based version, I would definitely be willing to give that a try. It's important to explore all options, especially when it comes to food and sustainability.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t7",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " My favorite ice cream flavor is definitely cookies and cream! I love the combination of the creamy vanilla base with the crunchy cookie pieces mixed in. It's the perfect treat after a long day at the lab. What about you, what's your go-to ice cream flavor?",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t11",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. \nSpeaker A: Okay, I will see if there are any castles near where we will be. Do you have any plans to go back to sweden?\nSpeaker B: Not in the near future, but I'm hoping to get back next summer. I love hitting up all the local beach spots with my old friends.\nSpeaker A: That sounds nice! So how is your job going?\nSpeaker B: Always interesting, that's for sure! I have been training to nurse on a new floor, so that'll give me a change of scenery.\nSpeaker A: Does that add a lot of extra work to your plate?\nSpeaker B: At the moment, yes. I'll be in Pediatrics, which has always been my passion. It's a completely different environment than the ER.\nSpeaker A: Oh wow! That is so exciting for you. Will you get to stay in pediatrics after the training is complete?",
        "memory_text": "User Description: Speaker A is a scientist who is considering taking a second part-time job to save money for a trip to Sweden to visit their cousin. They enjoy decompressing and being active in their free time. \n\nRelationship Description: Speaker A has been talking to their cousin in Sweden and needs to start saving money to visit. Speaker B's parents live in Sweden, and their job at the hospital offers flexible hours. \n\nEvent Description: Speaker A likes to check out local music and coffee shops for conversations. Speaker B loves coffee shops and grew up in Sweden, enjoying good coffee and chocolates. They both share a love for music, with Speaker A recommending American hip hop artists to Speaker B. Speaker A is also interested in jamband music and classic reggae. Speaker B misses Sweden and has many great memories there.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm excited to hear about your trip planning to Sweden! It sounds like it will be an amazing experience. Have you thought about any part-time job options to help save up for the trip?",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I didn't bring a pet this time. But I can imagine how peaceful it must be to do the harder trails with your dog. Nature walks are definitely a great way to get away from everything and find some inspiration. I'm glad you enjoy them with your furry companion!",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t5",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself",
        "memory_text": "User Description:\nSpeaker A, also known as Frank, grew up in California on the beach. He is in a band where he plays the drums and writes music. Frank is good at writing and his favorite activity is morning surfing. He loves the band Sublime and wants to see them live. His dad owns a surf shop and he is called \"lil fishie\" by Speaker B.\n\nRelationship Description:\nSpeaker A and Speaker B have a close relationship where they share a love for music, surfing, and fishing. Speaker B works in a doctor's office and enjoys loud music as a break from work. They have a mutual respect for each other's interests and hobbies.\n\nEvent Description:\nSpeaker A booked a concert in Denver and Speaker B wants to watch him play. Speaker A caught a small fish while Speaker B caught a huge trout. They both enjoy fishing and are planning to go fishing together. Speaker A's band has toured various countries and encountered dangerous situations, but Speaker B supports his passion for music. Speaker A is allergic to strawberries while Speaker B loves Italian food and cooking. Speaker A's band has a following in Italy and they have toured Uzbekistan, Central, and South America. Speaker B values the experiences gained from traveling on the road with the band.",
        "speaker": "Speaker B",
        "raw_prediction": " I've never seen Aerosmith live, but I would love to someday! That's amazing that you've been playing drums since you were a kid. Your dad must be a great teacher. By the way, when are we going fishing again? I can't wait to catch another huge trout like last time!",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t10",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.",
        "memory_text": "User Description: Speaker B is a doctor working at a doctor's office who loves fishing and spending time near the ocean. They prefer fishing over math and listen to Sublime a lot when relaxing on the beach. Speaker B caught a huge trout and enjoys being near the ocean.\n\nRelationship Description: Speaker B offers to teach Speaker A everything they know about fishing, showing a willingness to share their interests and knowledge with the robot. Speaker A decides to take Speaker B up on the offer, indicating a growing bond between the two.\n\nEvent Description: Speaker A's band booked a concert in Denver, and Speaker B expresses interest in watching them play. Speaker A's band has toured Italy and Uzbekistan, facing dangers like kidnapping and shooting. Speaker B loves cooking Italian food and is passionate about cooking, while Speaker A struggles with cooking and is allergic to strawberries. Speaker B imagines the life of being in a band can be dangerous and tiring but worth it for the experience. Speaker B and Speaker A plan to go fishing together, with Speaker B suggesting trying to catch trout.",
        "speaker": "Speaker A",
        "raw_prediction": " I love fishing too! It's so relaxing to be near the ocean. Have you ever tried fishing before? Maybe we can go together sometime and catch some trout.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "User Description:\nSpeaker A is a librarian with three children, who are now grown up and have kids of their own. Speaker A loves playing the flute but it is not their profession. They feel that kids nowadays do not read enough and have seen libraries change over the years.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, discussing personal and professional experiences. They seem to have a level of intimacy that allows them to share stories about their families and interests.\n\nEvents Description:\n1. Speaker A spent time with kids while Speaker B went to the park.\n2. Speaker B cherishes moments with family while Speaker A's work keeps them away from kids.\n3. Speaker B's mom was a librarian, and Speaker A finds their work rewarding.\n4. Speaker A and Speaker B discuss how libraries are evolving with new technologies to engage kids.\n5. Speaker A teaches their youngest child the flute, while Speaker B took their grandkids fishing. They plan an annual fishing trip together.",
        "speaker": "Speaker B",
        "raw_prediction": " I completely understand where you're coming from, Speaker B. Technology can be overwhelming sometimes. I remember when my youngest child was learning the flute, it was such a special bonding experience for us. Just like how you enjoy taking your grandkids fishing, it's those simple moments that really make a difference, isn't it?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t4",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? ",
        "memory_text": "User Description: Speaker B is a librarian who had a good day playing with his son's kids. He cherishes moments spent with his children and grandchildren. Speaker B's mother had the same profession as Speaker A. Speaker B has 3 grown-up children who mostly take the subway to work.\n\nRelationship Description: Speaker B and Speaker A share a mutual understanding and agreement on the challenges and rewards of being a librarian. They discuss the importance of libraries and the decline in children's interest in reading. Speaker A is proud to teach his youngest child the flute, which Speaker B finds interesting.\n\nEvent Description: Speaker B had a great time with his son and grandkids at the park. Speaker A thought about taking his grandkids to a library, and they discussed the relevance of paper books in the digital age. Speaker A's youngest child asked to learn the flute, inspired by Lizzo. Speaker B enjoys the creative ways libraries are staying relevant and mentioned a trip to the park with his grandkids.",
        "speaker": "Speaker A",
        "raw_prediction": " I have been thinking a lot about our annual fishing trip, it would be a great opportunity to spend quality time with my grandkids. They always enjoy our outdoor adventures. Plus, it's a nice break from the hustle and bustle of the library.",
        "previous_summary": "Speaker B has a lot of kids, all grown up now and with kids of their own.\nSpeaker A has kids and is busy with work, unable to spend as much time with them as they would like.\nSpeaker B mentions having grandkids, implying they are older and have a family of their own.\nSpeaker B has grandkids and enjoys spending time with them at the park.\nSpeaker B took their grandkids fishing once, with mixed reactions from the kids.\nSpeaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature."
    },
    {
        "utter_id": "e7-s5-t6",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? ",
        "memory_text": "User Description: Speaker B is a librarian who had a good day playing with his son's kids. He cherishes moments spent with his children and grandchildren. Speaker B's mother had the same profession as Speaker A. Speaker B has 3 grown-up children who mostly take the subway to work.\n\nRelationship Description: Speaker B and Speaker A share a mutual understanding and agreement on the challenges and rewards of being a librarian. They discuss the importance of libraries and the decline in children's interest in reading. Speaker A is proud to teach his youngest child the flute, which Speaker B finds interesting.\n\nEvent Description: Speaker B had a great time with his son and grandkids at the park. Speaker A thought about taking his grandkids to a library, and they discussed the relevance of paper books in the digital age. Speaker A's youngest child asked to learn the flute, inspired by Lizzo. Speaker B enjoys the creative ways libraries are staying relevant and mentioned a trip to the park with his grandkids.",
        "speaker": "Speaker A",
        "raw_prediction": " Oh, that's great to hear! We actually had a wonderful time at the park last weekend. My grandkids always bring so much joy to my life. I'm glad to hear your grandkids are enjoying the library too.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t7",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " I will definitely need some serious gear if I encounter any grizzlies! Maybe I can teleport away if I see one coming haha. But seriously, I will make sure to be prepared. And I'll ask my friend about the bears too. I'll make sure to pack some essentials to keep me safe. And don't worry, I'll bring back some delicious ice cream for you to try too!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t2",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " The dish is called Mediterranean Seafood Paella! It's supposed to be really good. I'll definitely send you a pic as soon as I try it. And hey, we should plan a rock climbing session soon, I think you'd enjoy it!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t6",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?\nSpeaker B: I haven't! Just karate! Have you been thinking of taking some classes?\nSpeaker A: I want to take some martial art classes at school next year. What do you sggest I try?\nSpeaker B: I mean I always recommend Karate since that's what I study! I can bring you by the dojo sometime if you want to see what it is like. \nSpeaker A: OMG!! That would be so awesome, Yes please.  When is a good time for you?\nSpeaker B: Awesome! Tomorrow afternoon anytime between 3-6 would work for me!",
        "memory_text": "User Description:\nSpeaker B is a lifeguard who is currently in a serious committed relationship. They enjoy watching horror movies, practicing karate, and are looking for the perfect career. Speaker B's personality traits include being a football fan, captain of a team, and having a love for the ocean.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, with Speaker A recommending movies and discussing food preferences with Speaker B.\n\nEvent Description:\n1. Speaker B mentioned a career change in the IT sector and plans to go back to school for a certificate in IT work.\n2. Speaker A recommended the movie \"The Life Ahead\" to Speaker B.\n3. Speaker B stays in good shape as a lifeguard and enjoys watching romantic comedies with their partner.\n4. Speaker B is taking French classes, finds French not too difficult, and goes to every home football game for their old high school team.\n5. Speaker A recommended clams from Quebec at the grocery store and mentioned taking French classes to learn French.",
        "speaker": "Speaker A",
        "raw_prediction": " Tomorrow afternoon between 3-6 works for me! I can bring you by the dojo after my French class. Let's meet up at the football game next week and discuss more about karate!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t1",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.",
        "memory_text": "User Description:\nSpeaker A is a kind individual who helps out his grandparents as they are getting older. He works at a pizza shop and is living with his grandparents. Speaker A used to play football a lot and enjoys hanging out with friends or playing video games like Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros. Series.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship, as they engage in conversations about their respective interests in football and soccer. They also offer each other suggestions for new games to try and discuss their aspirations for the future.\n\nEvent Description:\n1. Speaker A had a great first practice with the intramural football league.\n2. Speaker A and Speaker B talk about their experiences with football and soccer, showing their shared interest in sports.\n3. Speaker A plans to teach courses in computer science at a community college and get involved with robotics.\n4. Speaker B is studying Linguistics and expresses a desire to find job opportunities in the field.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't talked to my advisor yet, but I'm considering teaching as a career option. I've always enjoyed helping others, just like how you help your grandparents. Teaching computer science at a community college and getting involved with robotics sounds like a great plan. Maybe we can even collaborate on some projects in the future!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t4",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you for your kind words! I really appreciate your support. Teaching robotics sounds amazing, and I'm sure you would excel at it. Have you thought about combining your passion for teaching with your interest in developing apps for differently abled youth? It could be a great way to make a positive impact in the world.",
        "previous_summary": "Speaker A is working at a pizza shop to pay for college and studying computer science.\nSpeaker A is living with their grandparents and helps them out."
    },
    {
        "utter_id": "e12-s5-t8",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " I can see how teaching English or history could be a great fit for you. With your passion for linguistics and interest in history, you would make a fantastic college professor. And your love for volunteer work would definitely be an asset in the education field. Have you thought about incorporating your gaming experiences into your teaching methods? It could make learning even more engaging for your students!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.\nSpeaker A: For sure! So much happened and it really affected how the world is today. I like learning about the history of places where I have lived, it's really interesting.\nSpeaker B: That sounds really cool! What have you learned about where you currently live?\nSpeaker A: Oh, I found out that the big sports field used to be a farm where they grew wheat and raised cows! It's really cool to see places in old photos and see how they have changed.",
        "memory_text": "User Description:\nSpeaker A is a kind individual who helps out his grandparents as they are getting older. He works at a pizza shop and is living with his grandparents. Speaker A used to play football a lot and enjoys hanging out with friends or playing video games like Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros. Series.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship, as they engage in conversations about their respective interests in football and soccer. They also offer each other suggestions for new games to try and discuss their aspirations for the future.\n\nEvent Description:\n1. Speaker A had a great first practice with the intramural football league.\n2. Speaker A and Speaker B talk about their experiences with football and soccer, showing their shared interest in sports.\n3. Speaker A plans to teach courses in computer science at a community college and get involved with robotics.\n4. Speaker B is studying Linguistics and expresses a desire to find job opportunities in the field.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really interesting! It's cool to learn about the history of where you live. Did you know that my grandparents used to have a farm where they grew wheat and raised cows? It's amazing how things change over time.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": "One of my favorite places to camp is actually near a zoo! I love being surrounded by nature and hearing the animals at night. It's like falling asleep to a lullaby of nature's symphony. Have you ever been camping near a zoo before? It's quite a unique experience!",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t11",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?\nSpeaker A: I think the Bronx Zoo is one of the best in the country.   Yes, I did see Joshua.  Did you use a season pass for the zoo or just a one time ticket?\nSpeaker B: One time. I was just there visititng family. What is your favorite zoo to visit?\nSpeaker A: I think the Ashville Zoo is nice. What are your plans for the next weekend?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! I would love to help you out with that. Let's plan a day to visit the Ashville Zoo and discuss your zoo plans.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t2",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?",
        "memory_text": "User Description:\nSpeaker B is a stay-at-home mom living in California. She enjoys cooking healthy food, watching movies with her kids, and finds water therapeutic. Speaker B loves Disney movies, sloppy romance movies, and occasionally watches horror movies with her kids. She has watched a lot of Disney movies with her kids and her husband enjoys Disney sports movies.\n\nRelationship Description:\nSpeaker A and Speaker B share an intimate relationship as they discuss personal preferences, family activities, and future plans. Speaker A expresses excitement for a Hawaii Sunset tour and wishes Speaker B could join. Speaker A values Speaker B's freedom and acknowledges the responsibilities of being a stay-at-home mom.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about new romance and Disney movies, specifically the movie \"Luca\" and the sports movie \"Miracle.\" Speaker B's family watched \"Luca\" and enjoyed it, while her husband appreciates Disney sports movies like \"Miracle.\" Speaker A shows interest in watching \"Miracle\" and seeks recommendations from Speaker B, who recommends watching it on Disney Plus. Speaker B also recommends watching \"Remember the Titans\" on the Disney Plus app.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm so glad you all enjoyed \"Miracle\"! It's always nice to find a movie that everyone in the family loves. Lately, we've been watching a lot of Disney movies too, \"Luca\" was a big hit in our household. Have you seen \"Remember the Titans\"? It's another great sports movie on Disney Plus that your husband might enjoy! And I wish I could join you on that Hawaii Sunset tour, it sounds amazing.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t5",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": " I have never been to Italy before, but I would love to go someday and spend a whole month there. It sounds like a dream. Maybe one day when things settle down with work, I can make that happen. Would your kids be excited to go on a trip to Italy too?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t8",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.",
        "memory_text": "User Description:\nSpeaker B is a stay-at-home mom living in California. She enjoys cooking healthy food, watching movies with her kids, and finds water therapeutic. Speaker B loves Disney movies, sloppy romance movies, and occasionally watches horror movies with her kids. She has watched a lot of Disney movies with her kids and her husband enjoys Disney sports movies.\n\nRelationship Description:\nSpeaker A and Speaker B share an intimate relationship as they discuss personal preferences, family activities, and future plans. Speaker A expresses excitement for a Hawaii Sunset tour and wishes Speaker B could join. Speaker A values Speaker B's freedom and acknowledges the responsibilities of being a stay-at-home mom.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about new romance and Disney movies, specifically the movie \"Luca\" and the sports movie \"Miracle.\" Speaker B's family watched \"Luca\" and enjoyed it, while her husband appreciates Disney sports movies like \"Miracle.\" Speaker A shows interest in watching \"Miracle\" and seeks recommendations from Speaker B, who recommends watching it on Disney Plus. Speaker B also recommends watching \"Remember the Titans\" on the Disney Plus app.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you enjoyed Luca! Italy is definitely on my bucket list too. I haven't been to Italy before, but I would love to explore all the beautiful cities and try the delicious food. If I do go, I'll definitely bring my kids along for the adventure. Maybe we can compare notes on our travel experiences when you get back from your Hawaii sunset tour. Have a great time and make sure to take lots of pictures!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.",
        "memory_text": "User Description:\nSpeaker A has blue eyes and blonde hair, prefers warmth, plans to retire down south on a beach, and enjoys eggs. Their favorite egg dish is egg benedict.\n\nRelationship Description:\nSpeaker A really likes their smart car, while Speaker B is a stereotypical old plumber who likes poached eggs. Speaker A suggested that Speaker B should seriously consider getting a smart car. They also discussed visiting Alaska and shared their excitement about the trip.\n\nEvent Description:\nSpeaker A had eggs for breakfast, thought of Speaker B when having eggs, and recommended looking into flights. They discussed airline fees, music festivals, and planned activities for the trip to Alaska, including petting wolves and going on a glacier tour. Speaker A and Speaker B are looking forward to spending time together and having a great experience.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you're keeping an eye on those airfare prices! The weather here is perfect for a visit, clear skies and sunshine every day. There's a folk music concert coming up in about 4 weeks that I think you'll enjoy. Maybe we can plan to go see it together. And don't forget, I'll make sure we have some delicious eggs benedict for breakfast while you're here!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t10",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?\nSpeaker A: I think I'm more afraid of the wildlife than my dogs are. If I had to, I think I could muster the courage to face the animals out here, but I will happily avoid them when possible. With you around, I'd feel much better, as well. How do you feel about being that close to wildlife?\nSpeaker B: Well I don't have a lot of experience with that but I guess I'd be ok as long as I knew what to do. Most of the wildlife I see is squirrels, pigeons, and the occasional possum. ",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " I have to admit, the thought of running into a wolf is a bit intimidating for me. I'm more used to dealing with pesky squirrels and pigeons in my neck of the woods. But hey, I'm up for a little adventure! And I can't wait to see the beautiful scenery and wildlife in Alaska. The folk concert sounds like a blast, and I'm definitely looking forward to exploring with you. Maybe I can bring some eggs with me to share for breakfast, since I hear you make a mean poached egg!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t3",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.",
        "memory_text": "User Description:\nSpeaker A is a music-loving individual who enjoys playing all styles of music at home. They have a Subaru that is currently making a funny noise. Speaker A also mentioned the need for money and Mexican food for a baby. They are a nightclubber who frequents live band venues and loves interacting with women. Their car has been running smoothly, and they try to attend live events weekly. Speaker A plays the guitar daily but hasn't had much time for it recently.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker B, who is a mechanic, offered to look at Speaker A's Subaru to fix the issue. Speaker B also mentioned needing money for the baby on the way and shared concerns about his wife's pregnancy. They plan to attend a local festival together and enjoy bluegrass music.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning to attend a bluegrass band concert, discussing the expenses of having a new baby, and preparing for the upcoming festival. Speaker B will take time off when the baby is born and is excited about the food and drinks at festivals. They are supportive of each other's interests and willing to help out whenever needed.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great plan! It'll be nice to have a comfortable place to stay for the festival. And I'm glad you're thinking of heading out that way too. Hopefully, we can all enjoy the music together and have a good time camping out. Let me know if your Subaru is still making that noise, maybe my friend can take a look at it while we're there. And if you need any help with the baby expenses, just let me know. It's always good to support each other, especially during exciting times like this.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t6",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.",
        "memory_text": "User Description:\nSpeaker B is a mechanic who prefers drinks over food. He is married and his wife is currently pregnant, in the second trimester of pregnancy, and still working. Speaker B is focused on taking care of his wife and the baby, and is willing to help Speaker A with his car any time. He enjoys bluegrass music and values jam time over social time.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly relationship, where Speaker B is willing to help Speaker A with his car and Speaker A values their jam time together.\n\nEvent Description:\n- Speaker B fixed Speaker A's car quickly and mentioned that Subarus are great cars.\n- Speaker A recommended the American version of Mexican food, likes to play music, goes to live band venues, and loves the ladies.\n- Speaker B had to pull out of going to a local festival due to his wife's sudden morning sickness and is currently building cribs for the baby. Speaker B's wife and the baby are his main priority, and he plans to take two months off when the baby is born.\n- Speaker A doubts settling down due to lifestyle preferences and still enjoys going out to bars and live music venues.",
        "speaker": "Speaker A",
        "raw_prediction": " Sounds like a fun time at the festival with Drunky! Just remember to take it easy with the ladies, we don't want any distractions from jam time. Enjoy the music and take care of yourself out there!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t3",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?",
        "memory_text": "User Description: Speaker A, also known as Jim, is a member of a music band who grew up in a beach town. He has a strong passion for writing songs, surfing, and cooking, particularly enjoying making food for others and receiving compliments. Jim's father used to work at Cisco, and he wakes up early in the morning to catch waves.\n\nRelationship Description: Jim and Jehosaphat, also known as Speaker B, share a friendly and casual relationship. They bond over their shared interests in activities like snowboarding, surfing, and skateboarding. They also enjoy discussing food preferences and cooking recipes.\n\nEvent Description: Jim shared his grandmother's recipes with Speaker B, who was happy to reciprocate by sharing his favorite garlic chicken recipe. They also talked about surfing, with Jim offering to give surfing lessons to Speaker B. The two are considering meeting up, with Speaker B possibly visiting Jim for a weekend in the fall. They also discussed their experiences with snowboarding and surfing, showing a mutual interest in each other's hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " Absolutely, Jim! I'd love to teach you how to make spicy fried rice. It's a dish that always brings back memories of my grandmother's cooking. And hey, maybe after we cook up a storm, we can hit the waves together and catch some early morning surf sessions. What do you say?",
        "previous_summary": "Speaker B is going to buy their first new car and got fired from Cisco for their singing.\nSpeaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking."
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't tried any new foods lately, but I did make my grandmother's garlic chicken recipe last week. It turned out great! I think you'll really enjoy learning how to make it. And I can't wait to try your spicy fried rice when you come over. Maybe we can even cook together and share some family recipes. Looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t3",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " I do miss being on the field sometimes, especially the adrenaline rush of making a crucial save. But I've found a new passion in my job as a law clerk, researching and writing briefs. It's a different kind of excitement, you know? How about you, still tearing up the field as a striker?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! I could use some exercise too. It would be fun to get back into playing real games. Maybe we can even grab some burgers after, like old times.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t6",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a fantastic plan! Collecting shells and hanging out at the beach with you would be a great way to relax after all the hard work during your last year of college. I haven't traveled much, but maybe we can start exploring together once you graduate. Who knows, maybe we'll find some unique shells for your collection along the way!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t7",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " It's amazing that you used to surf, I would love to see you back out on the waves! I've been working on building up my stamina and reflexes for soccer, so maybe we can hit the beach together and do some surfing and soccer drills. It would be a great way to stay active and enjoy the beach together.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " I've never thought about taking my animals on a cruise, but I'm sure they would enjoy the adventure! Maybe I'll have to reconsider my stance on cruises and give it a try. It could be a fun experience for all of us.",
        "previous_summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations."
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear that you're spending more time with your dogs now! It must be nice for them to have you around more often. And it sounds like Sid and Journey are quite the characters. How did the pet concert go with your white tigers at the zoo? I bet they loved your music!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t8",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that you're able to spend more time with your dogs now that you've left your previous job. It sounds like a well-deserved break for both you and your furry friends. Taking a Disney cruise sounds like a great way to relax and enjoy some quality time with your dogs. Just make sure to bring some treats for your terriers to keep them happy during the cruise!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t11",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!\nSpeaker A: That is understandable. I didn't always think I would end up a zookeeper. Do you have anything in mind?\nSpeaker B: Well, I really enjoy animals so I might think of applying to work in a zoo aswell! Is it a super busy job?\nSpeaker A: That sounds like a great idea! You would be surprised how busy it can be. Not every job is high demanding and you don't have to work with all the animals either. Is there anything you don't like to do?",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you have such a fulfilling job at the zoo! I can't wait to join you there and start working with the animals. I'm excited to see what kind of music they enjoy and maybe even have a pet concert with your white tigers one day! And you know, I think our dogs would love a playdate with Journey and Sid too. Let's plan something fun for them soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a cute idea to name one of the kittens Oreo! Since you're considering giving them Mandarin names, maybe you could also consider naming one of them Zhao, like Speaker A suggested. I think it's great that all the kittens are feeling better now. And don't worry, with proper training and introductions, cats and parrots can definitely get along. I can share some tips with you on how to help Taisha and the kittens get along!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t6",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": " I actually haven't been hiking lately, but I've been keeping busy with the new kittens. They're all healthy now, and I've been trying to get to know their personalities before naming them. I think giving them Mandarin names is a great idea! And don't worry about Tasha and the kittens not getting along, I'm sure they'll find a way to coexist. Plus, I'd love to hear any training tips you have for Taisha!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.\nSpeaker B: That is funny. And impressive that you're learning. The closest I can get to another language is doing a bad New York accent LOL",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": " I love it! Zhao and Oreo would make a perfect pair. I'm glad to hear all the kittens are feeling better now. If you need any training tips for them, just let me know.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t2",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?",
        "memory_text": "User Description:\nSpeaker B is a computer programmer who recently got a new job. They love taking cruises but are not big on animals or the outdoors. They recommend trying a cruise and believe that computer programming becomes second nature once you get used to it.\n\nRelationship Description:\nSpeaker B recommends trying a cruise, which shows a level of intimacy in the dialogue with Speaker A.\n\nEvent Description:\nSpeaker A enjoys looking for wild animals in the woods and finds it fascinating to see them in their natural habitat. Speaker B loves cruises and is not into the outdoors, but they have gone back and forth on liking camping and hiking. Speaker A went on a hike with friends and spotted a rare hawk, while also planning trips and blocking off time for an Appalachian Trail hike. Speaker A is nervous about full-day hikes but is in good shape and will do a 10-day hike. Speaker B hates mosquitos and uses multiple sprays to repel them, as well as bugs in general.",
        "speaker": "Speaker A",
        "raw_prediction": " That's great to hear! I'm glad you're taking precautions against those pesky mosquitoes. Have you considered going on a cruise to explore new destinations without worrying about bugs or animals? It could be a relaxing way to unwind and enjoy some time away from the outdoors.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t4",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?",
        "memory_text": "User Description:\nSpeaker B is a computer programmer who recently got a new job. They love taking cruises but are not big on animals or the outdoors. They recommend trying a cruise and believe that computer programming becomes second nature once you get used to it.\n\nRelationship Description:\nSpeaker B recommends trying a cruise, which shows a level of intimacy in the dialogue with Speaker A.\n\nEvent Description:\nSpeaker A enjoys looking for wild animals in the woods and finds it fascinating to see them in their natural habitat. Speaker B loves cruises and is not into the outdoors, but they have gone back and forth on liking camping and hiking. Speaker A went on a hike with friends and spotted a rare hawk, while also planning trips and blocking off time for an Appalachian Trail hike. Speaker A is nervous about full-day hikes but is in good shape and will do a 10-day hike. Speaker B hates mosquitos and uses multiple sprays to repel them, as well as bugs in general.",
        "speaker": "Speaker A",
        "raw_prediction": " Sounds like your friends had a good time despite getting tired quickly. Maybe next time you can convince them to join you on a cruise instead, it's a great way to relax and enjoy the outdoors without all the hiking!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t10",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.",
        "memory_text": "User Description:\nSpeaker B is an individual who works in a cushy government job, with 15 years of experience in the field. They excel in staying calm and composed, even in stressful situations. Speaker B has a passion for painting and enjoys taking naps. They have two kids and are skilled in driving, but prefer to be a passenger and nap during long journeys. Speaker B's favorite movies are in the horror genre, and they have helped their father produce horror movies in the past.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is characterized by mutual admiration and curiosity. Speaker A looks up to Speaker B's job stability and wishes to have a similar career. Speaker A engages in creative conversations with Speaker B about movie plot ideas, showcasing a shared interest in the entertainment industry.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include preparing for an interview, where Speaker A seeks guidance and reassurance from Speaker B. Speaker A role-plays the interview scenario with a friend, demonstrating a proactive approach to job search. Speaker B expresses a desire to work in interior design, highlighting aspirations beyond their current job. The two bond over shared interests in mid-century design, horror movies, and creative brainstorming sessions. Speaker A wishes for Speaker B's father to achieve success in producing Hollywood movies, reflecting a sense of optimism and support in their relationship.",
        "speaker": "Speaker A",
        "raw_prediction": " That's really kind of you. I'll definitely keep that in mind. Maybe we can collaborate on a project in the future. Who knows, maybe we'll make the next big horror hit together!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t3",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.",
        "memory_text": "User Description:\nSpeaker A is a sports enthusiast who enjoys activities like hiking and playing soccer. They have a friend named Dave who twisted his ankle during a hike, but still wants to play soccer. Speaker A is concerned about not getting too sore to play and seeks tips for sore muscles. They have expressed frustration with political candidates and did not vote in the last election. Speaker A hopes to get a soccer scholarship and admires their sister's teaching job. They have a positive outlook on academic success, hoping to surprise themselves with good grades.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal goals and offer support and encouragement to each other. Speaker B shows interest in attending Speaker A's soccer games and offers advice on managing sore muscles. Speaker A reassures Speaker B about their studies and encourages prioritizing happiness and peace of mind.\n\nEvents Description:\nSpeaker A finished a 5-mile hike with a rough trail and great view, while Speaker B expressed interest in joining a soccer game on Saturday. Speaker A advised bringing water due to the funny taste of fountain water, and Speaker B planned to bring a cooler with bottled water. Speaker A sought tips for sore muscles and mentioned going on a trail with Dave. Speaker B suggested rest and reassured Speaker A about hiking. They discussed academic achievements and Speaker B's desire to address his feelings towards his mother. Speaker A encouraged Speaker B to prioritize personal well-being.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad to hear your history exam went well, getting a B is still a great achievement! I'm sure with a little more studying, you'll get that A next time. And don't worry about your upcoming exams, you've got this! Remember to take breaks and prioritize your well-being, just like we discussed when we were talking about sore muscles. Just like how you encouraged me to prioritize happiness and peace of mind, I believe in you. Keep up the hard work!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t8",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.",
        "memory_text": "User Description:\nSpeaker B is a 30-year-old individual who recently turned 30 and lives in Cali. They have a daughter who is 5 years old and loves the beach. Speaker B enjoys the sunny weather and beaches in Cali, where they have been living for 30 years. They have tried surfing before and talk about their daughter swimming and playing in the sand.\n\nRelationship Description:\nSpeaker B and the robot have a friendly and engaging relationship, discussing topics such as moving to Cali, the beach, and running on sand. Speaker A compliments Speaker B's daughter and expresses envy for living near the beach. They also talk about Spring break plans and share preferences for traveling, running, Greek mythology, and Italian food.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include planning a spring break trip, changing hair color to blue, living in different locations (Indiana and Cali), discussing the beach, weather, and running on sand. They also talk about Italy, with Speaker A expressing love for Italian architecture, history, and food. Speaker B recommends good pasta in Italy and asks about Speaker A's favorite part of Italy and their major in History. Speaker B also shares their interest in Greek mythology, studying Poseidon, and asking about historical events.",
        "speaker": "Speaker A",
        "raw_prediction": " It will be a great experience for sure! I'm looking forward to sharing my passion for Greek mythology with you. And I'm sure we'll have a fantastic time exploring Greece together. Let's make sure to plan it out and enjoy every moment of it!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t2",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " I think I'll start with the Asian food recipe. My husband will love that! I can't wait to try it out. Thank you again for all the great suggestions!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t5",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  ",
        "memory_text": "User Description:\nSpeaker A is a passionate cook who loves to bake, especially Indian cuisine. They are considering turning their cooking skills into a business. Speaker A also enjoys playing tennis and admires Serena Williams. They own chickens and enjoy cooking and baking.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker A offers cooking advice and recommendations to Speaker B, showing a level of familiarity and willingness to help.\n\nEvents Description:\n1. Speaker A plans to make dahl, pilaf rice, and tandoori chicken using a pressure cooker.\n2. Speaker A explains the use of pressure cookers for various dishes and recommends one for beginner cooks.\n3. Speaker A suggests involving Speaker B's husband in cooking Asian food while she handles the main dish using the pressure cooker.\n4. Speaker B's husband is a great cook and enjoys cooking Asian food, with Speaker B enjoying the end results of his cooking.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds perfect! I'll definitely start with shrimp fried rice then. I can use our fresh eggs from our chickens. Thank you for the recommendation, I can't wait to try it out!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really looking forward to trying out the shrimp fried rice recipe with our fresh eggs! It sounds like a fun and easy dish to start with. And I would love to have you ride along with me on my next haul next Wednesday. It will be a long drive, but we can listen to some country music and rock tunes along the way. It'll be a great time!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t11",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.\nSpeaker A: Sure, I'm free that day.  What time do I need to meet you?",
        "memory_text": "User Description:\nSpeaker A is a passionate cook who loves to bake, especially Indian cuisine. They are considering turning their cooking skills into a business. Speaker A also enjoys playing tennis and admires Serena Williams. They own chickens and enjoy cooking and baking.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker A offers cooking advice and recommendations to Speaker B, showing a level of familiarity and willingness to help.\n\nEvents Description:\n1. Speaker A plans to make dahl, pilaf rice, and tandoori chicken using a pressure cooker.\n2. Speaker A explains the use of pressure cookers for various dishes and recommends one for beginner cooks.\n3. Speaker A suggests involving Speaker B's husband in cooking Asian food while she handles the main dish using the pressure cooker.\n4. Speaker B's husband is a great cook and enjoys cooking Asian food, with Speaker B enjoying the end results of his cooking.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to try making shrimp fried rice with our fresh eggs! I'm sure my husband will love it too. I'll definitely cook the rice the day before to make sure it's cool enough. And yes, I remember you mentioning that the rice tends to stick if it's warm. Thank you for the reminder. \nI'm looking forward to having you ride along with me next Wednesday on the haul. What time should I pick you up?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t3",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?",
        "memory_text": "User Description:\nSpeaker A is a person who values family and enjoys activities like healing clients, salsa dancing, and going to Brazilian steakhouse with their brother. They are interested in healing methods such as self-massage, essential oils, reiki, meditation, and self-awareness.\n\nRelationship Description:\nSpeaker B shows a level of intimacy with Speaker A by engaging in conversations about their family, activities, and interests. They express interest in trying out healing methods suggested by Speaker A and enjoy spending time on the water with their sister.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include going salsa dancing, dining at a Brazilian steakhouse, sailing with siblings, watching movies with family, and experiencing a heat wave. Speaker A plans on taking their clients salsa dancing soon, while Speaker B enjoys meeting different people and dancing under the stars on a boat.",
        "speaker": "Speaker B",
        "raw_prediction": " Black Widow is one of the characters in the Marvel Avengers movies, similar to Thor and Captain America. It's about her journey and missions as a trained spy and assassin. The movie was action-packed and had some great fight scenes. If you enjoy superhero movies, you might like it! Have you seen any of the other Marvel movies like Thor or Captain America?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t10",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!\nSpeaker A: Yes, in fact I consider almost all foods to either be healing, harmful or neutral. In my opinion people should choose foods based on how they want to feel. Sushi is fresh and healthy so I considerate it to be very healing.\nSpeaker B: That is very wise thinking. Which vegetables do you feel are the best for healing? Are there any that should be avoided?",
        "memory_text": "User Description: Speaker B is a bartender who enjoys bartending and interacting with different people. They have a busy schedule but still finds time to relax and enjoy activities such as sailing and spending time on their houseboat. Speaker B has a close-knit family, including a little brother whom they spend time with on the houseboat.\n\nRelationship Description: The relationship between Speaker B and the robot (Speaker A) is interactive and friendly. They share personal information about their families, work, and interests, showing a level of intimacy in their conversations.\n\nEvent Description: Speaker B and Speaker A have shared events such as salsa dancing, going out for dinner, watching movies, and enjoying time with family. They also discuss self-care practices like massage, meditation, and essential oils, showing a mutual interest in wellness and relaxation. Speaker B enjoys sailing and spending time on their houseboat, while Speaker A plans to take their clients salsa dancing for fun. Both enjoy meeting new people and engaging in enjoyable activities like dancing under the stars on a boat.",
        "speaker": "Speaker A",
        "raw_prediction": " When it comes to healing vegetables, I think dark leafy greens like kale and spinach are fantastic options. They are packed with nutrients and antioxidants that are great for the body. As for vegetables to avoid, I would say maybe stay away from processed and fried foods, as they can be harmful to your health in the long run. What are your thoughts on that?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t11",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?\nSpeaker A: Ok! I am putting my fate in your hands on this one. School is fine. I don't really pay attention to anything except band class.",
        "memory_text": "User Description:\nSpeaker A is a young girl who enjoys playing the clarinet in the marching band. She has a keen interest in music and energy-related topics, particularly in renewable energy and nuclear generators. Speaker A is also fascinated by space exploration and has a curiosity about teleportation machines.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is playful and engaging. They share a mutual interest in music, plants, and space exploration. Speaker A respects Speaker B's inventions and is intrigued by the teleportation machine being developed.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed the possibilities of sending weeds into space, the impact of music on plants, and the potential benefits of renewable energy sources. They also shared their aspirations for future space travel and innovative technology. The dialogue between them is filled with curiosity, humor, and a shared passion for exploring new frontiers.",
        "speaker": "Speaker B",
        "raw_prediction": " Speaking of school, band class is going great! I'm really loving playing the clarinet and being a part of the marching band. It's such a fun and energetic environment. How about you, have you been working on any new inventions lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t3",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?",
        "memory_text": "User Description:\nSpeaker A is someone who loves art, music, and painting. They prefer the color red and enjoy volunteer work, finding it meaningful and fulfilling. They have a fortunate upbringing and think travel and meeting new people are awesome. \n\nRelationship Description:\nSpeaker A and Speaker B share a level of intimacy in their dialogue, discussing personal interests and experiences such as painting, origami, and travel. They also express admiration for each other's activities like volunteering and singing.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include volunteering at the hospital, creating origami, and discussing their favorite colors. Speaker A is busy with work and gardening, while Speaker B has traveled extensively and enjoys singing. They both appreciate art and cultural experiences, finding meaning and fulfillment in their activities.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really impressive, congratulations on winning 3rd place! Your talent for art really shines through in your origami work. Maybe we can try making some together sometime, I think you would enjoy it!",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!",
        "memory_text": "User Description:\nSpeaker A is someone who loves art, music, and painting. They prefer the color red and enjoy volunteer work, finding it meaningful and fulfilling. They have a fortunate upbringing and think travel and meeting new people are awesome. \n\nRelationship Description:\nSpeaker A and Speaker B share a level of intimacy in their dialogue, discussing personal interests and experiences such as painting, origami, and travel. They also express admiration for each other's activities like volunteering and singing.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include volunteering at the hospital, creating origami, and discussing their favorite colors. Speaker A is busy with work and gardening, while Speaker B has traveled extensively and enjoys singing. They both appreciate art and cultural experiences, finding meaning and fulfillment in their activities.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really impressive that you won 3rd place in the origami contest! It's great to see your passion for art shining through in different ways. I'd love to learn some origami techniques from you, especially since you mentioned there's special paper for it. It's fascinating how something as simple as folding paper can turn into intricate designs. And it's amazing to hear that origami has practical uses, like in hospitals for breathing apparatus. Art truly has so many dimensions to explore!",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t7",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?",
        "memory_text": "User Description:\nSpeaker A is someone who loves art, music, and painting. They prefer the color red and enjoy volunteer work, finding it meaningful and fulfilling. They have a fortunate upbringing and think travel and meeting new people are awesome. \n\nRelationship Description:\nSpeaker A and Speaker B share a level of intimacy in their dialogue, discussing personal interests and experiences such as painting, origami, and travel. They also express admiration for each other's activities like volunteering and singing.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include volunteering at the hospital, creating origami, and discussing their favorite colors. Speaker A is busy with work and gardening, while Speaker B has traveled extensively and enjoys singing. They both appreciate art and cultural experiences, finding meaning and fulfillment in their activities.",
        "speaker": "Speaker B",
        "raw_prediction": " Wow, that's incredible! I had no idea origami could be used in such a meaningful way. It's amazing how art can be so versatile and impactful. I actually haven't seen origami in Japan, but I've heard it's a big part of their culture. I would love to learn more about it and maybe even try my hand at it someday.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t7",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " It's great to hear that your Film Studies job is going so well! Your passion for movies really shows through in your recommendations. I'm glad to hear that things are going better for me at work too. And yes, I'm still enjoying going for those long runs and treating myself to a big steak dinner after, just like we talked about before.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely agree with you. The humor in Pulp Fiction is dark and witty, and the violence is definitely not something I would recommend for kids. It's a movie that's more suited for mature audiences who can appreciate the complexity of the story and characters. I'm glad you enjoyed it though, it's a classic for a reason.",
        "previous_summary": "Speaker B has kids and enjoys watching movies with them.\nSpeaker B allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s.\nSpeaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences."
    },
    {
        "utter_id": "e31-s5-t9",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " I think \"Girl Next\" might be a bit too intense for kids, given that it's a horror genre movie. It's probably best suited for adults who enjoy that kind of genre. But I'm sure you'll enjoy it if you're into horror films. And I'm glad to hear your job as a programmer is going well. It's great to see you getting into the swing of things!",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t10",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely agree with you about letting parents decide if Pulp Fiction is suitable for kids. It's important for children to understand the difference between fiction and reality when it comes to violent content in movies. So, it's great that you're mindful of that. I'm glad to hear your job is going well and that you're enjoying it. Hope you enjoy watching \"Girl Next\" tonight!",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t11",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.\nSpeaker A: Yes exactly. I think all kids should learn that. I know my grandkids love to watch all genre’s of movies and I think kids should learn what they like to watch. ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " You're welcome! I think you'll really enjoy Coming 2 America, it's a fun and entertaining movie. And I'm glad to hear your job is going well, it's always great to find your groove in a new role. Let me know what you think of the movie after you watch it!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t5",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?",
        "memory_text": "User Description:\nSpeaker A is a person who enjoys eating jello, with their favorite flavors being cherry and grape. They have a family tradition of making jello with their grandma, who taught them how to make it. Speaker A has a passion for water sports, particularly water skiing, and has been doing it for 15 years. They have three kids who also enjoy water skiing. Speaker A is excited about boating and wishes to own a houseboat. They have a friendly and welcoming personality, as they look forward to meeting new people and sharing experiences with them.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is one of mutual interest and shared experiences. They have engaged in conversations about their favorite activities, such as snowboarding and water skiing, showing a willingness to learn from each other. Speaker B expresses a desire to steal Speaker A's jello recipe, indicating a playful and light-hearted dynamic between them.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about their favorite jello flavors, water skiing experiences, and aspirations for future activities. Speaker A expressed excitement about teaching Speaker B how to water ski and potentially sharing their jello recipe. Speaker B shared their interest in learning water skiing tricks and wakeboarding. Both speakers enjoy engaging in outdoor activities and have a shared passion for exploring new hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " Learning to bake has been quite the adventure, especially now that I'm steering clear of desserts. It's been eye-opening to see just how much sugar goes into those sweet treats! But I'm enjoying the challenge of trying out new recipes and techniques. Who knows, maybe I'll come up with a healthier version of my grandma's jello recipe for us to try out next time!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t10",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. \nSpeaker A: Boating is so fun. You could go wakeboarding more often if you had your own boat. And no more boat rental fees or hassle.\nSpeaker B: I actually saw a drone the at will pull you in the water. It's the craziest thing.  ",
        "memory_text": "User Description:\nName: Speaker B\nOccupation: Snowboarder\nLikes: Charlie Parker, Meat, Snowboarding\nMemory: Loves meat, quit job at Cisco to pursue snowboarding and passion for Charlie Parker\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and engaging. They share personal stories and memories, showing a level of mutual interest and connection.\n\nEvent Description:\n1. Speaker A suggested rock music on the radio to Speaker B.\n2. Speaker B shared their favorite artist, Charlie Parker, with Speaker A.\n3. Speaker B bought their first new car.\n4. Speaker A had awesome grape jello and Speaker B talked about their grandma making jello at family dinners.\n5. Speaker A taught Speaker B how to make jello recipes.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great that you're learning to bake, even with the sugar concerns. Maybe you could try making some healthier desserts with less sugar, like fruit-based options. And speaking of trying new things, have you had any chance to hit the slopes recently for some snowboarding?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t4",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?",
        "memory_text": "User Description: Speaker B is an individual who enjoys playing video games, particularly horror games like Resident Evil VIII. They also have an interest in hunting and have played Jurassic Park: World. Speaker B is eager to play games late at night and spends most of their free time gaming. They also enjoy golfing and plan to alternate between golfing and hunting with Speaker A.\n\nRelationship Description: Speaker B and the robot have a close relationship, as they plan to play games together, with Speaker B teaching the robot how to hunt and the robot teaching Speaker B how to golf.\n\nEvent Description: Some shared events between Speaker B and the robot include playing Resident Evil VIII late at night, planning to play games and order pizza together, and the robot helping Speaker B get used to the UI of Resident Evil.",
        "speaker": "Speaker A",
        "raw_prediction": " Since you're not a fan of scary games, how about trying out some adventure or puzzle games? You might enjoy games like The Legend of Zelda or Portal. They're fun and challenging without being too scary. And hey, if you ever change your mind, I can always help you get through the spooky parts!",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t5",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?",
        "memory_text": "User Description: Speaker A enjoys hunting deer in their free time and is concerned about deer overpopulation. They like sneaking up on deer in the wild and play calm video games. Speaker A hunts on both family land and state hunting sites.\n\nRelationship Description: Speaker A and Speaker B plan to play games together, showing a mutual interest in gaming. Speaker A invited Speaker B to play the Jurassic Park game and suggested playing Resident Evil together. Speaker B agreed to play Resident Evil with Speaker A.\n\nEvent Description: Speaker A got back from a hunting trip and checked out the conditions for animals living in the area. Speaker B spent all night playing League of Legends and bought Resident Evil VIII. Speaker B is looking forward to playing Resident Evil VIII and usually waits for a sale before buying games. Speaker B plays Resident Evil VIII by himself and turns the lights out to make it scarier. Speaker A and Speaker B are planning to play games together next week Friday after work. Speaker A mentioned that it may take bravery to play Resident Evil. Speaker B mentioned that Resident Evil is definitely scary and the UI is a little hard to get used to.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't tried it yet, but it sounds like a nice change of pace from the intense games like Resident Evil. I'll definitely check it out, thanks for the suggestion! And hey, maybe we can play it together next time we hang out after work.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t6",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?",
        "memory_text": "User Description: Speaker B is an individual who enjoys playing video games, particularly horror games like Resident Evil VIII. They also have an interest in hunting and have played Jurassic Park: World. Speaker B is eager to play games late at night and spends most of their free time gaming. They also enjoy golfing and plan to alternate between golfing and hunting with Speaker A.\n\nRelationship Description: Speaker B and the robot have a close relationship, as they plan to play games together, with Speaker B teaching the robot how to hunt and the robot teaching Speaker B how to golf.\n\nEvent Description: Some shared events between Speaker B and the robot include playing Resident Evil VIII late at night, planning to play games and order pizza together, and the robot helping Speaker B get used to the UI of Resident Evil.",
        "speaker": "Speaker A",
        "raw_prediction": " Breath of the Wild or Super Mario Odyssey. They are both immersive and fun to play, and they might be a nice change of pace from the horror games you're used to. As for me, I enjoy playing games like Mario Kart or Animal Crossing on rainy days. It's a nice way to relax and unwind. And yes, I'm familiar with Ring Fit Adventure! It's a great way to stay active when you've been sitting for too long. Let's plan a gaming session soon and maybe we can try out some new games together.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t7",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?",
        "memory_text": "User Description: Speaker A enjoys hunting deer in their free time and is concerned about deer overpopulation. They like sneaking up on deer in the wild and play calm video games. Speaker A hunts on both family land and state hunting sites.\n\nRelationship Description: Speaker A and Speaker B plan to play games together, showing a mutual interest in gaming. Speaker A invited Speaker B to play the Jurassic Park game and suggested playing Resident Evil together. Speaker B agreed to play Resident Evil with Speaker A.\n\nEvent Description: Speaker A got back from a hunting trip and checked out the conditions for animals living in the area. Speaker B spent all night playing League of Legends and bought Resident Evil VIII. Speaker B is looking forward to playing Resident Evil VIII and usually waits for a sale before buying games. Speaker B plays Resident Evil VIII by himself and turns the lights out to make it scarier. Speaker A and Speaker B are planning to play games together next week Friday after work. Speaker A mentioned that it may take bravery to play Resident Evil. Speaker B mentioned that Resident Evil is definitely scary and the UI is a little hard to get used to.",
        "speaker": "Speaker B",
        "raw_prediction": " That's interesting! I've never been hunting before. It sounds like a unique experience. I'm glad you enjoy it. I usually stick to games like Resident Evil, but I'm open to trying new genres. Let's plan to play some games together next week Friday after work. How about we start with Resident Evil VIII and see how it goes?",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t2",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm still considering getting one of your friend's kittens, but I think it might be best to wait until after my vacation next month. I want to make sure I can give the kitten all the attention it deserves. Plus, I'll have more time to read some poetry and maybe even try out those audiobooks I've been thinking about.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t6",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " I've never been to the San Diego Zoo before, but I've heard great things about it! I can't wait to see the lions there, they're always my favorite. Maybe I'll even find some inspiration for poetry while I'm there. Have you ever been to the San Diego Zoo?",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t9",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.",
        "memory_text": "User Description: Speaker A is a hard-working individual who works at a local fast food restaurant. They enjoy reading and gardening, and have a preference for visiting the zoo. Speaker A has a sister who recently got married and they like to see pandas, penguins, and exotic birds at the zoo. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, as seen when Speaker A suggested Speaker B to adopt a kitten and they discussed their preferences regarding pets. They also share a love for animals and enjoy visiting the zoo together.\n\nEvent Description: Speaker A's sister got married, Speaker B's cat had a kitten, Speaker A and Speaker B discussed their preferences for pets, Speaker B's girlfriend got a cockatoo, Speaker B mentioned about giving away kittens, Speaker A compared having children to having pets, and Speaker B's sister's cockatoo named John behaves in a funny way.",
        "speaker": "Speaker B",
        "raw_prediction": " Maybe you can take your sister's dog to the zoo with you! It might be a fun experience for her to see all those animals, even if she does bark a lot. Plus, it could be a nice bonding experience for both of you.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t3",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " That's a beautiful idea to add their birth dates to your tattoo. It's such a personal touch. I'll definitely take your advice and think about the font carefully. By the way, your trip to Humboldt County sounds amazing! I'll have to add it to my list of places to visit. Thanks for the recommendations!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t8",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?",
        "memory_text": "User Description: Speaker B is an avid fisherman who enjoys traveling for work. His favorite food is fries, and he recently went fishing for a 30-pound muskie in Michigan during a sales convention. Speaker B's family also enjoys fishing, and his wife was shocked when shown a picture of the fish he caught.\n\nRelationship Description: Speaker B and the robot, Speaker A, have a friendly and engaging relationship, discussing fishing trips and sharing recommendations for places to visit and activities to do.\n\nEvent Description: Speaker B and Speaker A are planning fishing trips off the California coast, specifically mentioning locations like Humboldt County, Eureka, Arcata, and the redwood forest. Speaker A warns about car burglaries in the area, and Speaker B acknowledges the risk. They also discuss visiting Fort Humboldt State Park, Sequoia Park Forest and Garden, and Carson Mansion. Speaker B's goal is to visit every national park in the US, showing a shared interest in outdoor activities and exploration. Speaker A is working hard to save up for a tattoo of their father's face next to a slogan, planning to get it at the same place.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm not married, but I have a partner who was definitely shocked when she saw the picture of that massive muskie I caught in Michigan. She couldn't believe it! But yeah, I definitely agree with you about discussing big decisions like tattoos with your significant other. It's always better to be on the same page. And hey, speaking of fishing, when are we planning our next trip off the California coast? I can't wait to explore those beautiful spots we talked about!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a good plan. Focusing on your artwork and exploring different places seems like a fulfilling way to spend your time. Maybe you'll find someone who shares your passion for tattoos and art along the way.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t11",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?\nSpeaker A: I probably shouldn't be saying this, but I put up a large mural on the side of the local Community Center.  People seem to like it - at least everyone except the administrators of the center.  Everyone is trying to figure out who did it.  ",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " That would be amazing! I'll definitely be the first in line to see your exhibit. Keep following your passion, and great things will come your way.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " I can see why you're enjoying the crime drama, it sounds really intriguing. Maybe I'll give it a try sometime. But you know me, I'll always have a soft spot for those animal books. Speaking of which, have you heard about the new documentary on Netflix about wildlife conservation? I think you'd really enjoy it, considering your love for both books and your grandkids!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.",
        "memory_text": "User Description: Speaker B works at a fast food place and loves ice cream. Speaker B hasn't started college yet but hopes to become an Eagle Scout. Speaker B uses scouts to make friends and has been involved with Boy Scouts for 7-8 years. \n\nRelationship Description: Speaker B is interested in volunteering at Speaker A's church and has done a lot of volunteer work in Boy Scouts. Speaker B wants to come to the church retreat and thinks twins are little angels. \n\nEvent Description: Speaker A manages work, school, and scouts. Speaker A wants triplets for the choir and needs more volunteers for the retreat. Speaker A mentions a youth retreat next month and bringing babies to the retreat. Speaker B's work is going well, and the hardest part is managing scouts, work, and school. Speaker B plans to attend the local community college and get his Eagle Scout badge.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't started college yet, but I've been involved with Boy Scouts for about 7-8 years now. It's been a great experience for me, not only for learning survival skills like setting up shelter and starting a fire, but also for developing social skills. Working together and compromising are key aspects of being a Scout. I think your kids would really enjoy it, and it's a great way for them to learn and have fun at the same time.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!",
        "memory_text": "User Description: Speaker B works at a fast food place and loves ice cream. Speaker B hasn't started college yet but hopes to become an Eagle Scout. Speaker B uses scouts to make friends and has been involved with Boy Scouts for 7-8 years. \n\nRelationship Description: Speaker B is interested in volunteering at Speaker A's church and has done a lot of volunteer work in Boy Scouts. Speaker B wants to come to the church retreat and thinks twins are little angels. \n\nEvent Description: Speaker A manages work, school, and scouts. Speaker A wants triplets for the choir and needs more volunteers for the retreat. Speaker A mentions a youth retreat next month and bringing babies to the retreat. Speaker B's work is going well, and the hardest part is managing scouts, work, and school. Speaker B plans to attend the local community college and get his Eagle Scout badge.",
        "speaker": "Speaker A",
        "raw_prediction": " The last camping trip I went on was up to an island in the middle of nowhere in Canada. It was such a great experience, surrounded by nature and wildlife. We even saw bears and huge moose roaming around, it was amazing!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t10",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!\nSpeaker A: Wow, that sounds like such an adventure! I love to visit Canada. I have seen moose but never a bear! That must have been scary!\nSpeaker B: Yes, it is quite scary. We could also hear the wolves howling at night, luckily we didn't come across them though. One thing to note about bears, is they just want to come and scrounge for our food, so we learned to safely pack it away and hang it up high in a tree.\nSpeaker A: Yes, I've heard that it's important to be careful in bear country! I would love to see one in person though. Do you take lots of photos on your trips?\nSpeaker B: Yes, I took quite a few. The scenery was stunning. Would you like me to send you some photos? I know they are uninteresting to some people.",
        "memory_text": "User Description: Speaker B works at a fast food place and loves ice cream. Speaker B hasn't started college yet but hopes to become an Eagle Scout. Speaker B uses scouts to make friends and has been involved with Boy Scouts for 7-8 years. \n\nRelationship Description: Speaker B is interested in volunteering at Speaker A's church and has done a lot of volunteer work in Boy Scouts. Speaker B wants to come to the church retreat and thinks twins are little angels. \n\nEvent Description: Speaker A manages work, school, and scouts. Speaker A wants triplets for the choir and needs more volunteers for the retreat. Speaker A mentions a youth retreat next month and bringing babies to the retreat. Speaker B's work is going well, and the hardest part is managing scouts, work, and school. Speaker B plans to attend the local community college and get his Eagle Scout badge.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you enjoyed hearing about my camping trip! It was definitely an adventure. I actually took some photos of the bears and moose, I can send them to you if you'd like. And yes, I do love ice cream, it's my guilty pleasure after a long day at work. I'm really looking forward to getting my Eagle Scout badge and hopefully volunteering at your church retreat. It sounds like it will be a great opportunity to make new friends and give back to the community.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t5",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. ",
        "memory_text": "User Description:\nSpeaker A is a college student who loves teaching and learning. They are regretting eating ice cream due to being lactose intolerant. Speaker A also teaches jiu-jitsu and is planning to take summer courses soon. They are taking a class on the history of martial arts and want to get an athletic training degree.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker A mentioning events and activities that may interest Speaker B. Speaker B, a software tech from England, is busy with work and misses dogs. They both share a love for martial arts and have discussed running a half marathon together.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning a trip to England, considering adopting a dog, discussing favorite restaurants in London, and signing up for online classes. Speaker A mentioned a half marathon coming up and Speaker B is considering running it despite their busy work schedule. Speaker B plans to travel back to England to visit family, friends, and dogs.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you had a great time as a student! I can imagine how refreshing it must have been to switch things up. And I bet learning a different martial art brought some new perspectives to your practice.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t6",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. ",
        "memory_text": "User Description:\nSpeaker B is a software tech from England who is very active and loves running marathons. They also teach jiu-jitsu and have a foster home for dogs. Speaker B is planning to take summer courses soon and has considered adopting a dog in the states, but feels it would be disloyal to their dogs in England. They miss their dogs and London very much, and their favorite restaurant in London is Sufi.\n\nRelationship Description:\nSpeaker B and Speaker A have been working on the same project and have discussed planning a trip to England together. Speaker A enrolled in a class on the history of martial arts, which Speaker A thinks Speaker B would enjoy. They have shared information about their favorite restaurants, with Speaker A loving Taco Bell.\n\nEvent Description:\nSpeaker B is busy with software work and has not had much time to do other activities. They are considering planning a trip to England to visit family and friends, as well as their dogs. Speaker B recently signed up for a class teaching the history of martial arts, while Speaker A is studying for an athletic training degree. Speaker A loves teaching and learning, especially about the history of martial arts.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you're enjoying your software work, but I'd be happy to teach you some martial arts history when you have time. And if you ever need a break from all that coding, maybe we can plan a trip to England together to visit your dogs and favorite restaurant in London, Sufi.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t11",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.\nSpeaker A: Thanks for letting me know! I'll have to check that out soon!",
        "memory_text": "User Description:\nSpeaker A is a college student who loves teaching and learning. They are regretting eating ice cream due to being lactose intolerant. Speaker A also teaches jiu-jitsu and is planning to take summer courses soon. They are taking a class on the history of martial arts and want to get an athletic training degree.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker A mentioning events and activities that may interest Speaker B. Speaker B, a software tech from England, is busy with work and misses dogs. They both share a love for martial arts and have discussed running a half marathon together.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning a trip to England, considering adopting a dog, discussing favorite restaurants in London, and signing up for online classes. Speaker A mentioned a half marathon coming up and Speaker B is considering running it despite their busy work schedule. Speaker B plans to travel back to England to visit family, friends, and dogs.",
        "speaker": "Speaker B",
        "raw_prediction": " I have no doubt you'll ace that class with flying colors. I'm looking forward to learning from you! And don't worry about the finals too much, you'll do great. Let's focus on getting through them first. And hey, after all that studying, we can celebrate with some delicious Donairs from that restaurant!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t8",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.",
        "memory_text": "User Description:\nSpeaker B is searching for a furniture shop to buy furniture but is struggling with choosing new furniture due to doubts about the colors. They painted the room light green before buying purple sofas and are willing to add vibrant colors suggested by Speaker A to create a hippy feel in the room. Speaker B loves pets and is buying furniture safe for their two dogs. They work near a mall by their house and love to barbecue, especially grilling steak and hotdogs. Speaker B prefers grilling corn straight from the farm and using a charcoal grill over a gas grill. They plan to meet Speaker A in person once they are done renovating their house.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy as they plan to meet in person and help each other with furniture choices and grilling preferences. Speaker A invites Speaker B over to help break in new furniture and enjoy grilling and eating outside together.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A getting new furniture like a couch, recliner, and patio furniture, hoping to enjoy more quiet evenings outside. They plan to grill and eat outside most nights with the new furniture, even on busy nights. Speaker B plans to bring marinated meat and a six pack to Speaker A's place and use bug spray to keep bugs away. Speaker A has things set up to play music, enjoy food, and company without worrying about bugs, using lamps and other devices for bug control. Speaker A suggests grilling corn with mayo and cheese and recommends using a smoker for grilling. Speaker B prefers grilling corn with fresh ingredients and loves the flavor of meat cooked on charcoal. Speaker B is willing to give all purple furniture to Speaker A and plans to get rid of the green and purple scheme.",
        "speaker": "Speaker A",
        "raw_prediction": " I love the idea of adding vibrant colors to create a hippy feel in your living room! It sounds like it will be a cozy and inviting space. As for patio furniture, an umbrella table with chairs or a screened-in gazebo with a fire pit in the middle would be perfect for enjoying the outdoors. And I'll definitely bring the corn for the barbecue, along with some Miranda Lambert songs on the guitar! I can't wait to see how your house turns out.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t7",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol",
        "memory_text": "User Description: Speaker A is from Venice Beach and has traveled to 20 countries, despite hating traveling but loving running. They picked up a yodel in their travels and come from a musical background, as their parents met in a high school choir. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, with Speaker B providing motivational speeches and encouragement to Speaker A in their running goals. \n\nEvent Description: Speaker A and Speaker B have shared moments of discussing marathon training, dealing with injuries like a sprained ankle, and planning to run together for the Alps marathon. Speaker A has also shared their love for singing and active lifestyle recommendations for Speaker B when feeling down. Speaker B mentioned missing his family while traveling for work and finding solace in nature and motivational speeches.",
        "speaker": "Speaker B",
        "raw_prediction": " Don't worry, I'll make sure the yodeling marathon training sessions are worth it! Maybe we can incorporate some musical elements into our runs to keep things interesting. And hey, if you need a break from the early morning motivational quotes, just let me know. We're in this together, remember?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great news! I'm so happy for you. I remember you mentioning how much you enjoy being outdoors, so working at a grocery store near a nice location sounds like a perfect fit for you. As for me, I've been doing some freelance work here and there, but nothing too exciting. Let's definitely plan that hike we talked about and bring some veggie sandwiches for a picnic at the top of the mountain. I can't wait to spend some time outdoors with you!",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t1",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " I understand that the new iPhone was expensive, but I'm glad you treated yourself to something nice. Maybe we can listen to some country music on it when you come over to the farm.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t10",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though\nSpeaker B: Yeah I understand that. Have you listened to any new blues songs lately?",
        "memory_text": "User Description: Speaker B is a city dweller who appreciates a peaceful and quiet life, with a preference for winter and a dislike for country music. They have kids who are picky about milk and enjoy the convenience of city living, but also miss the culture and late-night availability of products in the city. Speaker B dreams of owning a city and country house and enjoys fresh produce and fresh air.\n\nRelationship Description: Speaker A suggests a band show for Speaker B to attend during winter break and invites them to stay over at the farm. They joke about kids asking for a cow if they enjoy milking them and agree on the importance of kids understanding where food comes from.\n\nEvent Description: Speaker A buys lottery tickets with Speaker B, who buys 20 tickets with the same numbers for a big jackpot. Speaker A buys 50 tickets with different numbers, and Speaker B has a crazy idea to increase their chances of winning. Despite the difference in approach, Speaker A and Speaker B bond over the excitement of potentially winning the jackpot.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't listened to any new blues songs lately, but I did come across a jazz album that I really enjoyed. It's nice to switch things up every now and then.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t1",
        "current_dialogue": "Speaker A: When is your first music concert this summer?",
        "memory_text": "User Description:\nSpeaker A was born in Brazil and likes going to museums. They used to live in Los Angeles and loved the food there. Speaker A enjoys Disney music and could eat lengua tacos all day, everyday. They think sauerkraut is important. Speaker A has no Profile and Preference information available.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, sharing their love for music and different food preferences. They engage in conversations about their favorite bands and songs, showing a level of comfort and familiarity.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with their boyfriend. They look forward to shopping, enjoying the nightlife, and having refreshing beers by the beach. Speaker B recommends visiting the Museum of Art of São Paulo and mentions the variety of beaches in São Paulo. They also discuss shopping options and bargains in the city.",
        "speaker": "Speaker B",
        "raw_prediction": " Your first music concert this summer sounds like a fun time! I hope you have a great experience at the Museum of Art of São Paulo next week. Don't forget to check out the beaches and enjoy some refreshing beers by the beach. It sounds like a perfect summer plan!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t2",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?",
        "memory_text": "User Description:\nSpeaker B is from Brazil, specifically from the big city of San Paulo. They have 2 older brothers and 1 younger brother. Speaker B enjoys the city life, live music, street hot dogs with specific toppings, and discovering amazing food. They have a love for Rock or metal music and have seen Three Dog Night in concert. Speaker B is eagerly waiting for bands to announce their summer tour schedule for future plans.\n\nRelationship Description:\nSpeaker B and the robot have engaged in a conversation about music preferences, favorite bands, and upcoming events. The dialogue shows a friendly and casual relationship between the two, with shared interests in music and cultural activities.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with her boyfriend. They also plan to do lots of shopping and enjoy the nightlife in the city, including having refreshing beers by the beach. Speaker B mentions the various types of beaches in São Paulo, showing their knowledge and willingness to share information with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you enjoyed the concert on the fourth of July! I'm actually planning to visit the Museum of Art of São Paulo next week. I heard they have some amazing exhibits. And after that, maybe I'll check out one of the beaches you mentioned. Do you have any recommendations for places to eat in the area?",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t4",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?",
        "memory_text": "User Description:\nSpeaker B is from Brazil, specifically from the big city of San Paulo. They have 2 older brothers and 1 younger brother. Speaker B enjoys the city life, live music, street hot dogs with specific toppings, and discovering amazing food. They have a love for Rock or metal music and have seen Three Dog Night in concert. Speaker B is eagerly waiting for bands to announce their summer tour schedule for future plans.\n\nRelationship Description:\nSpeaker B and the robot have engaged in a conversation about music preferences, favorite bands, and upcoming events. The dialogue shows a friendly and casual relationship between the two, with shared interests in music and cultural activities.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with her boyfriend. They also plan to do lots of shopping and enjoy the nightlife in the city, including having refreshing beers by the beach. Speaker B mentions the various types of beaches in São Paulo, showing their knowledge and willingness to share information with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I haven't seen the fireworks at the Disney castle, but it sounds amazing! I'll have to add that to my bucket list. Speaking of concerts, I can't wait for the summer tour schedule to be announced. Hopefully, I'll get to see some of my favorite rock or metal bands perform live.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t7",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.",
        "memory_text": "User Description:\nSpeaker A was born in Brazil and likes going to museums. They used to live in Los Angeles and loved the food there. Speaker A enjoys Disney music and could eat lengua tacos all day, everyday. They think sauerkraut is important. Speaker A has no Profile and Preference information available.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, sharing their love for music and different food preferences. They engage in conversations about their favorite bands and songs, showing a level of comfort and familiarity.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with their boyfriend. They look forward to shopping, enjoying the nightlife, and having refreshing beers by the beach. Speaker B recommends visiting the Museum of Art of São Paulo and mentions the variety of beaches in São Paulo. They also discuss shopping options and bargains in the city.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't been to Disneyland, but I did visit Disney World in Florida. Unfortunately, we didn't get to see any live Disney music performances, but we did have some interesting experiences on the rides. It sounds like you enjoy fireworks as much as I do!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t8",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?",
        "memory_text": "User Description:\nSpeaker B is from Brazil, specifically from the big city of San Paulo. They have 2 older brothers and 1 younger brother. Speaker B enjoys the city life, live music, street hot dogs with specific toppings, and discovering amazing food. They have a love for Rock or metal music and have seen Three Dog Night in concert. Speaker B is eagerly waiting for bands to announce their summer tour schedule for future plans.\n\nRelationship Description:\nSpeaker B and the robot have engaged in a conversation about music preferences, favorite bands, and upcoming events. The dialogue shows a friendly and casual relationship between the two, with shared interests in music and cultural activities.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with her boyfriend. They also plan to do lots of shopping and enjoy the nightlife in the city, including having refreshing beers by the beach. Speaker B mentions the various types of beaches in São Paulo, showing their knowledge and willingness to share information with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": " No, my boyfriend didn't go to Disney World with me. He's not a fan of theme parks. But we did enjoy the beaches in São Paulo together. I can't wait to show him the art museum and all the galleries. And hopefully, we won't have any ride mishaps like we did at Disney World!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t2",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  ",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old workaholic who is starting their career. They enjoy grilling and have not yet settled on a specific career path. Speaker B doesn't have a strong opinion on puppies, but they are interested in trying new things and exploring different cuisines.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship. They discuss various topics such as career recommendations, cooking, and volunteering at animal shelters. Speaker A shows interest in Speaker B's career choices and preferences, suggesting ideas like starting a band or working on a time machine together.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B talk about grilling delicious dishes like grilled corn and stuffed burgers. They also discuss cooking different types of cuisines while teleporting around the world. Speaker A shares their love for Mexican food and seafood, while Speaker B expresses interest in becoming a chef and trying out new recipes. Additionally, Speaker A mentions their volunteer work at animal shelters, particularly with dogs and cats, while Speaker B shows interest in volunteering and prefers cats over puppies. Speaker B also mentions their project of building a resume and applying for companies, while Speaker A suggests considering a career switch for more free time.",
        "speaker": "Speaker A",
        "raw_prediction": " I think puppies and kittens are both adorable in their own ways, but I have a soft spot for cats. Maybe it's because they're more independent and have their own unique personalities. Plus, I've heard that having a cat can be relaxing after a long day at work. But hey, maybe I should try volunteering at an animal shelter and see if puppies can win me over! And speaking of trying new things, have you ever grilled Mexican food? I heard it's delicious!",
        "previous_summary": null
    }
]