[
    {
        "utter_id": "e0-s5-t3",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you've been to Canada and Mexico, those must have been amazing trips! I plan to stay in Costa Rica for about two weeks, I'm really looking forward to exploring the rainforests and soaking up the sun on the beautiful beaches. Do you have any book recommendations for my beach visit?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm doing well, thank you for asking! I haven't read any good books lately, but I've been thinking about trying out a new hair color. Maybe I'll go for that grey look we joked about! Have you ever considered dyeing your hair a bold color like turquoise or red?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " That book sounds interesting, but I'm more into fiction. Have you read \"Where the Crawdads Sing\"? It's a great beach read, perfect for your upcoming trip to Costa Rica! And speaking of your trip, have you thought about trying a new hair color to match the tropical vibes? Maybe purple or blue would be a fun change!",
        "previous_summary": "Speaker A is older and has eight grandchildren.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city."
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?\nSpeaker A: Sorry for the typo. I meant \"pool\". Weather here is very hot and humid. It is miserable if you don't have air conditioning. Pollen count is also very high, so the air quality is poor. ",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " That's a great suggestion! I actually recently dyed my hair turquoise and I love it. Purple or blue could be a fun change for the summer. My daughter is really passionate about cosmetology, so I'll have to get her opinion on it. Thank you for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great playlist! I'm excited for our meetup this weekend. I can't wait to try out the fun music by the pool and dive into our programming studies with some steady tunes. And of course, pizza burgers are always a good idea. Looking forward to our swimming lessons too - maybe one day we'll be cruising in the Caribbean together!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so kind of you to offer swimming lessons! I'm really excited to learn from you. And I can't wait to enjoy the punk music and programming studies with you this weekend. It's going to be a great time!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t6",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really looking forward to our meetup this weekend. I may not be the best swimmer, but I'm excited to learn. And thanks for offering to teach me. Maybe after our swimming and programming lessons, we can grab some pizzaburgers together. I could use a stress-reliever after all the swimming practice!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I completely understand where you're coming from. It's important to prioritize your studies. And I agree, plant-based burgers are a great alternative. I'll have to try one soon! And speaking of trying new things, have you heard any interesting songs lately that you can recommend? Music always helps me relax after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t10",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,\nSpeaker B: Yes, ice cream shops are the best! They have stir-ins, and the smells are heavenly! Ben and Jerry's used to have a blueberry cheesecake that was amazing! I have only had that and their strawberry flavors. Both were great!",
        "memory_text": "User Description:\nSpeaker B is a hardworking student ahead of college, working at a diner cooking hamburgers. They are interested in neuroscience, have a deaf dog named Sparky, and are planning to major in molecular biology. Speaker B is known for inventing a chili dog casserole and may take summer classes to get a head start on college.\n\nRelationship Description:\nSpeaker A and Speaker B share a close bond, discussing their love for dogs and food. Speaker A compliments Speaker B on being a great dog owner and offers to walk Sparky. They also plan to try Speaker B's famous hamburgers at the diner.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing their dogs, sharing dinner choices, and talking about future plans. Speaker B invents a chili dog casserole and plans to clone a jersey cow. Speaker A recommends taking summer classes to get ahead in college.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you! I'm glad you're excited to try it. And that's a great idea about using cloning in neuroscience research. I haven't really thought about it, but it's definitely something worth exploring. Maybe I can incorporate that into my future studies!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t3",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.",
        "memory_text": "User Description:\nSpeaker A is a city dweller who prefers rock music, enjoys pilates, and goes through a novel each week. They have a brother and have a preference for sci-fi books but have been craving a good mystery recently. Speaker A also liked Harry Potter and political books growing up.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing book recommendations and discussing their preferences in genres like fantasy and mystery. They also exchange thoughts on different authors and series, showing a level of intimacy in their conversations.\n\nEvent Description:\nSpeaker A finished their most recent book and is looking for their next read, with Speaker B suggesting Dan Brown's 'Da Vinci Code' series as thrilling mysteries. Speaker A has read all of Dan Brown's books and enjoys how he breaks down puzzles to keep readers engaged. They also share memories of reading Redwall by Brian Jacques and discuss their favorite books growing up and views on today's political climate. Additionally, Speaker A recommends Game of Thrones by George R R Martin to Speaker B, with discussions about the books being better than the TV show. They also talk about Pilates and exercise preferences, as well as music and audiobooks. Speaker A starts the next book in the Game of Thrones series, while Speaker B plans to re-read the Dark Tower series and continues to work on new art pieces.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a lovely walk along the river! I can picture the scenery now. Have you thought about bringing a mystery novel with you on your next hike? It could add an extra element of excitement to your adventure. Speaking of mysteries, have you read any Agatha Christie lately? Her stories always keep me on the edge of my seat!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " It's so important to have that escape, especially with your busy schedule. I'm glad Kyrie can provide you with that companionship and adventure. Maybe one day I'll join you on one of your nature walks, with or without my future cats!",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t2",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!",
        "memory_text": "User Description: Speaker B is a librarian who had a good day playing with his son's kids. He cherishes moments spent with his children and grandchildren. Speaker B's mother had the same profession as Speaker A. Speaker B has 3 grown-up children who mostly take the subway to work.\n\nRelationship Description: Speaker B and Speaker A share a mutual understanding and agreement on the challenges and rewards of being a librarian. They discuss the importance of libraries and the decline in children's interest in reading. Speaker A is proud to teach his youngest child the flute, which Speaker B finds interesting.\n\nEvent Description: Speaker B had a great time with his son and grandkids at the park. Speaker A thought about taking his grandkids to a library, and they discussed the relevance of paper books in the digital age. Speaker A's youngest child asked to learn the flute, inspired by Lizzo. Speaker B enjoys the creative ways libraries are staying relevant and mentioned a trip to the park with his grandkids.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely understand where you're coming from. There's something special about the simplicity of a phone call that can't be replaced by text messages. Speaking of parks, I had a wonderful time with my grandkids at the park recently. It's moments like those that make me appreciate the beauty of spending time with family.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "User Description:\nSpeaker A is a librarian with three children, who are now grown up and have kids of their own. Speaker A loves playing the flute but it is not their profession. They feel that kids nowadays do not read enough and have seen libraries change over the years.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, discussing personal and professional experiences. They seem to have a level of intimacy that allows them to share stories about their families and interests.\n\nEvents Description:\n1. Speaker A spent time with kids while Speaker B went to the park.\n2. Speaker B cherishes moments with family while Speaker A's work keeps them away from kids.\n3. Speaker B's mom was a librarian, and Speaker A finds their work rewarding.\n4. Speaker A and Speaker B discuss how libraries are evolving with new technologies to engage kids.\n5. Speaker A teaches their youngest child the flute, while Speaker B took their grandkids fishing. They plan an annual fishing trip together.",
        "speaker": "Speaker B",
        "raw_prediction": " I completely understand where you're coming from, Speaker B. Technology can be overwhelming sometimes. I remember when my youngest child was learning the flute, it was such a special bonding experience for us. Just like how you enjoy taking your grandkids fishing, it's those simple moments that really make a difference, isn't it?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t8",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway",
        "memory_text": "User Description: Speaker B is a librarian who had a good day playing with his son's kids. He cherishes moments spent with his children and grandchildren. Speaker B's mother had the same profession as Speaker A. Speaker B has 3 grown-up children who mostly take the subway to work.\n\nRelationship Description: Speaker B and Speaker A share a mutual understanding and agreement on the challenges and rewards of being a librarian. They discuss the importance of libraries and the decline in children's interest in reading. Speaker A is proud to teach his youngest child the flute, which Speaker B finds interesting.\n\nEvent Description: Speaker B had a great time with his son and grandkids at the park. Speaker A thought about taking his grandkids to a library, and they discussed the relevance of paper books in the digital age. Speaker A's youngest child asked to learn the flute, inspired by Lizzo. Speaker B enjoys the creative ways libraries are staying relevant and mentioned a trip to the park with his grandkids.",
        "speaker": "Speaker A",
        "raw_prediction": " That's a great idea, I think they would really enjoy exploring the library and picking out some new books to read. I'll definitely plan a trip soon. Thank you for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t10",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway\nSpeaker A: I will keep that in mind as we do have volunteer hours available. How is your family doing these days?\nSpeaker B: Well I would be happy to help. My family are all great thank you for asking I took the grandkids to the park again we had a great time. How's your family doing? ",
        "memory_text": "User Description: Speaker B is a librarian who had a good day playing with his son's kids. He cherishes moments spent with his children and grandchildren. Speaker B's mother had the same profession as Speaker A. Speaker B has 3 grown-up children who mostly take the subway to work.\n\nRelationship Description: Speaker B and Speaker A share a mutual understanding and agreement on the challenges and rewards of being a librarian. They discuss the importance of libraries and the decline in children's interest in reading. Speaker A is proud to teach his youngest child the flute, which Speaker B finds interesting.\n\nEvent Description: Speaker B had a great time with his son and grandkids at the park. Speaker A thought about taking his grandkids to a library, and they discussed the relevance of paper books in the digital age. Speaker A's youngest child asked to learn the flute, inspired by Lizzo. Speaker B enjoys the creative ways libraries are staying relevant and mentioned a trip to the park with his grandkids.",
        "speaker": "Speaker A",
        "raw_prediction": " That's wonderful to hear! It's always great to see kids taking an interest in music. Maybe they can come to the library and check out some flute music books. The library is a great place for learning and exploring new interests.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that the portrait is coming along well! As for the little furries, they are all doing great. I must say, painting your great dane next to your pet rat sounds like quite the unique idea! As for getting a new cat, I'm actually thinking of adopting one from a local shelter. Rescuing pets is really important to me.",
        "previous_summary": "Speaker B is in college, paints on the side, and has five dogs and three rats.\nSpeaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\nSpeaker B has five dogs and enjoys taking them to the park.\nSpeaker B is working on other portraits and taking care of a sick dog.\nSpeaker B likes Persian cats and imagines their pets having interesting interactions."
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! I can imagine you sledding with dogs under the northern lights, it would be like a magical teleportation to another world. And if it's dark, camping under the stars would definitely be an unforgettable experience. Alaska's unique daylight and darkness patterns would make it an even more enchanting trip for you. Have fun planning your adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t11",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?\nSpeaker A: I think it could be a good idea, especially with all the large animals in Alaska and the terrain. I wouldn't rely on your friend and have someone more professional that knows a lot just in case. I'm sure the guide could also give you tons of suggestions of things to do while in the area, and maybe even the best ice cream places lol!",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " If you're worried about encountering grizzlies, maybe you can use your teleportation powers to escape if needed! Just kidding, but it's always good to be prepared. And if you do hire a hiking guide, maybe they can teach you some survival skills just in case. And who knows, maybe they know a secret ice cream spot too!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t5",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?",
        "memory_text": "User Description:\nSpeaker A is a restaurant worker who loves taking long walks on the beach, rock climbing, and listening to the band 21 pilots. Speaker A is an omnivore who enjoys interacting with people and has a resilient attitude towards challenging situations. Speaker A has grandchildren and is knowledgeable about different music genres, including Kpop and classic rock bands like Aerosmith.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and engaging relationship, discussing topics ranging from music preferences to family interactions. They show mutual interest and respect for each other's experiences, with Speaker B expressing admiration for Speaker A's work ethic and Speaker A appreciating Speaker B's family dynamics.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include moments of bonding over music, such as attending concerts and discussing favorite songs. They also share personal experiences, like dealing with a fire at Speaker A's restaurant and spending time with grandchildren. Speaker A educates Speaker B about different music genres, while Speaker B jokes about teleporting to a concert and admires the perks of working at a restaurant. Overall, their interactions are filled with warmth, humor, and shared interests.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh, those dessert options sound amazing! I think I would go for the tres leches cake with fresh raspberry jam sauce and lemon drizzle. It sounds like a perfect combination of sweet and tangy flavors. Enjoy your meal, and don't forget to send me a pic of that delicious Chicken parmesan dish!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t1",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?",
        "memory_text": "User Description:\nSpeaker A is a marketing student who loves seafood and foreign language movies. They are passionate about creating ads for movies and see a future in IT and AI. Speaker A enjoys learning new languages regularly and has a particular interest in French and Spanish. They recently watched and recommended the movie \"The Life Ahead\" featuring Sophia Lauren. Speaker A is ambitious and driven towards their career goals.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing movie recommendations and discussing their respective interests. Speaker B shows interest in Speaker A's preferences and activities, asking questions and engaging in conversations about movies, seafood, and education.\n\nEvent Description:\n- Speaker A ordered a big seafood platter and recommended a movie to Speaker B.\n- Speaker B thanked Speaker A for the movie recommendation and mentioned their interest in karate and IT work.\n- Speaker A went to the beach and tanned, while Speaker B mentioned their love for the ocean and water activities.\n- Speaker A recommended clams from Quebec and is taking French classes, while Speaker B signed up for classes at the local college.\n- Speaker B and their girlfriend attend every home football game, benefiting from their football background in studying karate.",
        "speaker": "Speaker B",
        "raw_prediction": " Yes, I've dabbled in a few other martial arts in the past, but my main focus has always been on creating ads for movies and exploring the world of IT and AI. It's fascinating how technology is shaping the future of marketing. Have you found any connections between your love for karate and your IT work?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t2",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " \nI can understand how stressful it must be to make such a big decision about your career. It's great that you talked to your advisor, and teaching definitely sounds like a stable option for you. With your passion for linguistics and volunteer work in education-related fields, becoming a college professor could be a rewarding path for you. Plus, you could incorporate your love for games like Legend of Zelda and Super Mario Bros into your teaching style to engage your students!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t6",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " I've been thinking about teaching English or history, but I also have a passion for linguistics. I feel like it would be a great fit for me since I love language and communication. Plus, I could incorporate my interest in volunteer work by helping students improve their language skills. It's definitely something I'm considering for my future career path.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t7",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?",
        "memory_text": "User Description:\nSpeaker A is a kind individual who helps out his grandparents as they are getting older. He works at a pizza shop and is living with his grandparents. Speaker A used to play football a lot and enjoys hanging out with friends or playing video games like Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros. Series.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship, as they engage in conversations about their respective interests in football and soccer. They also offer each other suggestions for new games to try and discuss their aspirations for the future.\n\nEvent Description:\n1. Speaker A had a great first practice with the intramural football league.\n2. Speaker A and Speaker B talk about their experiences with football and soccer, showing their shared interest in sports.\n3. Speaker A plans to teach courses in computer science at a community college and get involved with robotics.\n4. Speaker B is studying Linguistics and expresses a desire to find job opportunities in the field.",
        "speaker": "Speaker B",
        "raw_prediction": " It's really interesting to hear about your plans to teach computer science and robotics. I'm sure you'll be great at it! Teaching English or history seems like a good fit for me, but I'll have to see where my studies take me. It's nice to have options.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": "One of my favorite places to camp is actually near a zoo! I love being surrounded by nature and hearing the animals at night. It's like falling asleep to a lullaby of nature's symphony. Have you ever been camping near a zoo before? It's quite a unique experience!",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t6",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " No, we didn't go to the zoo last weekend, but we are planning to go soon. My daughter is really excited to see the tigers and monkeys, especially her favorite tiger, Joshua. Have you taken your child to the zoo recently?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t9",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.\nSpeaker A: No, I acctually haven't. I'm expecting pineapple and ham on everything, but I know they will having some amazing cultural food that is probably going to blow my mind! Is there a specific dish you would recommend",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you're excited about the sunset tour! It sounds like it will be a much-needed break for you. As for Hawaiian food, I highly recommend trying the poke bowls. They are delicious and a must-try when you're in Hawaii. Enjoy your trip and make sure to take lots of pictures to share with me!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear the weather is lovely there this week! I can't wait to experience the clear skies and sunshine myself. And I'm definitely looking forward to the folk music concert you mentioned. As for transportation, I think I'll be fine with walking or biking around. I could use the exercise after all those eggs!",
        "previous_summary": "Speaker A drives a smart car and used to have a long commute in Alaska.\nSpeaker A mentions the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer.\nSpeaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\nSpeaker A plans to take Speaker B on tours and attend folk concerts during the visit."
    },
    {
        "utter_id": "e16-s5-t1",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. ",
        "memory_text": "User Description:\nSpeaker A is a music-loving individual who enjoys playing all styles of music at home. They have a Subaru that is currently making a funny noise. Speaker A also mentioned the need for money and Mexican food for a baby. They are a nightclubber who frequents live band venues and loves interacting with women. Their car has been running smoothly, and they try to attend live events weekly. Speaker A plays the guitar daily but hasn't had much time for it recently.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker B, who is a mechanic, offered to look at Speaker A's Subaru to fix the issue. Speaker B also mentioned needing money for the baby on the way and shared concerns about his wife's pregnancy. They plan to attend a local festival together and enjoy bluegrass music.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning to attend a bluegrass band concert, discussing the expenses of having a new baby, and preparing for the upcoming festival. Speaker B will take time off when the baby is born and is excited about the food and drinks at festivals. They are supportive of each other's interests and willing to help out whenever needed.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! Staying at your friend's cabin would definitely be more comfortable for my wife, especially with the baby on the way. Thank you so much for offering, I'll talk to my wife and let you know. It's really kind of you to think of us like that.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t2",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.",
        "memory_text": "User Description:\nSpeaker B is a mechanic who prefers drinks over food. He is married and his wife is currently pregnant, in the second trimester of pregnancy, and still working. Speaker B is focused on taking care of his wife and the baby, and is willing to help Speaker A with his car any time. He enjoys bluegrass music and values jam time over social time.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly relationship, where Speaker B is willing to help Speaker A with his car and Speaker A values their jam time together.\n\nEvent Description:\n- Speaker B fixed Speaker A's car quickly and mentioned that Subarus are great cars.\n- Speaker A recommended the American version of Mexican food, likes to play music, goes to live band venues, and loves the ladies.\n- Speaker B had to pull out of going to a local festival due to his wife's sudden morning sickness and is currently building cribs for the baby. Speaker B's wife and the baby are his main priority, and he plans to take two months off when the baby is born.\n- Speaker A doubts settling down due to lifestyle preferences and still enjoys going out to bars and live music venues.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a wonderful offer, thank you! We would definitely appreciate staying at your friend's cabin for the Bluegrass show. It would be a much more comfortable option for my wife, especially with her being in the second trimester of pregnancy. We are more than willing to pay your friend for the use of the cabin. Thank you again for thinking of us!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't tried any new foods lately, but I did make my grandmother's garlic chicken recipe last week. It turned out great! I think you'll really enjoy learning how to make it. And I can't wait to try your spicy fried rice when you come over. Maybe we can even cook together and share some family recipes. Looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " Oh, I'm glad you enjoyed the street tacos! Mexican food is definitely a favorite of mine. I haven't tried al pastor, but marinated pork tacos sound delicious. Maybe we can try making them together sometime! And I'd love to share my grandmother's garlic chicken recipe with you too. It's a family favorite.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " I remember you were quite the striker back in college! Scoring all those goals must have been exhilarating. Have you considered pursuing a career in soccer after college, or are you leaning towards humanities or teaching like we discussed before?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t8",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old law clerk who works 12 hours a day and wishes to be back in college. They are a Black Sabbath junkie with a background in Humanities and now working at a law firm. Speaker B would rather be a film reviewer and is in debt despite working hard.\n\nRelationship Description:\nSpeaker B shows interest in discussing career prospects with Speaker A, who loves playing soccer. Speaker A asked Speaker B to connect with their neighbor Cynthia, who works as a human resources specialist. Speaker B will text Cynthia's number to Speaker A later. Speaker B accidentally responded to Speaker A due to a spider landing on their keyboard, revealing their fear of spiders. Speaker A also has arachnophobia.\n\nEvent Description:\nSpeaker A and Speaker B shared a conversation about career paths and humanities. Speaker B recommended a guidance counselor to Speaker A. Speaker A has a soccer tournament coming up and loves Arsenal. Speaker B enjoys researching and writing briefs for their job at the law firm. Speaker B was once pranked with a spider by their boss at work and is considering asking for a raise. Speaker B likes Manchester United.",
        "speaker": "Speaker A",
        "raw_prediction": " Definitely, I could use the exercise. Let's plan something soon, maybe we can even catch an Arsenal game together afterwards.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " No problem at all, it'll be great to have you back playing with us. Plus, it's always good to stay active and enjoy the game we both love.",
        "previous_summary": "Speaker B is 26 years old, works 12 hours a day, has a background in Humanities but now works as a law clerk.\nSpeaker B is currently working and mentioned the importance of taking breaks from work.\nSpeaker B is considering looking for a new job for higher pay but is comfortable at the current job."
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear about your experience as a physician assistant, and I'm glad you're finding relief for your knees at the beach. As for my internship search, I'm really excited about the opportunity with the athletic trainer's wife. I'll make sure to reach out to them for more information. And I'll definitely keep surfing to stay connected with doctors in the field, maybe I'll even get some tips on how to stand out in the job market. Thanks for all your support, it means a lot to me!",
        "previous_summary": "Speaker A is retired and spends most days hiking.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B is interested in sports medicine and enjoys surfing."
    },
    {
        "utter_id": "e19-s5-t9",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? ",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so cool that you've been to so many European countries! I've only been to France and Ireland, but I would love to explore more. As for settling down after graduation, I'm not really sure yet. I'm open to different opportunities and locations, depending on where the job market takes me. How about you? Have you always lived near the beach or have you moved around a lot in your life?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh no, Journey is quite the foodie, isn't she? I remember when we had that pet concert with my dogs and your terriers, she was eyeing the treats the whole time! Maybe we should have a playdate soon to keep her entertained. It's always a joy watching our animals interact and have fun together.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t2",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " Have you tried using vinegar to keep Journey away from the food? I remember you mentioning it as a solution for neutralizing odors at home. Maybe that could help with keeping her from eating the pizza next time!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t4",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " Sid isn't too interested in food, he's more of a fan of basking in the sun or hunting for bugs in the backyard. But I do have to be careful with leaving any snacks out, he's got quite the appetite for anything he can find! It's a good thing your pets are so well-behaved, I'm sure they would get along great with my Zen masters on our playdate. And hey, a Disney cruise sounds like a fun break, you deserve it after all these years of hard work at your job!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t5",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " That's good to hear that Sid is well-behaved with food! My dogs are doing well, they're always full of energy and mischief. I can't wait for that pet concert with your guitar, it's going to be so much fun! And I'm still excited about the opportunity at the zoo, thanks again for your help. Let's plan that playdate soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " I've never thought about taking my animals on a cruise, but I'm sure they would enjoy the adventure! Maybe I'll have to reconsider my stance on cruises and give it a try. It could be a fun experience for all of us.",
        "previous_summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations."
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a cute idea to name one of the kittens Oreo! Since you're considering giving them Mandarin names, maybe you could also consider naming one of them Zhao, like Speaker A suggested. I think it's great that all the kittens are feeling better now. And don't worry, with proper training and introductions, cats and parrots can definitely get along. I can share some tips with you on how to help Taisha and the kittens get along!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t7",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.",
        "memory_text": "User Description: Speaker A is a country girl with red hair who loves animals, particularly their pet parrot named Tasha. They are a locto-ovo vegetarian and enjoy hiking. Speaker A is planning a trip to China and wants to visit New York City first.\n\nRelationship Description: Speaker A and Speaker B have a friendly and intimate relationship, sharing stories about their pets and discussing travel plans together. They show concern for each other's animals and are open to adopting rescue kittens.\n\nEvent Description: Speaker A is planning to visit Speaker B and stay for a couple of days. They discuss bringing their parrot, Tasha, and are willing to adopt one of Speaker B's rescue kittens. Speaker A also shares that Tasha speaks Mandarin and has picked up the language from them. Speaker B is enthusiastic about helping Speaker A train the kittens to get along with Tasha. Speaker B has a playful sense of humor, suggesting the parrot could teach the kittens Mandarin.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to visit you and introduce Tasha to the kittens. I think they'll get along just fine, especially with your help in training them. And who knows, maybe Tasha can teach them a little Mandarin while we're there!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.\nSpeaker B: That is funny. And impressive that you're learning. The closest I can get to another language is doing a bad New York accent LOL",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": " I love it! Zhao and Oreo would make a perfect pair. I'm glad to hear all the kittens are feeling better now. If you need any training tips for them, just let me know.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.",
        "memory_text": "User Description:\nSpeaker A is a personal trainer who loves going on camping trips, hiking, and looking for wild animals in the woods. Speaker A also enjoys cruising, with Cuba being a favorite destination. Speaker A is in good shape and leads hikes for camping groups. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker B suggesting Speaker A try a cruise and recommending healthy and delicious food options. Speaker A invited Speaker B to join the gym, showing a level of casual interaction in the dialogue.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A spotting a rare hawk on a hike, planning trips on the Appalachian Trail, and being nervous about full-day hikes. Speaker B, a computer programmer, suggested using mosquito repellent sprays with DEET to help Speaker A repel mosquitoes while hiking. Speaker B loves cruising and being outdoors but is scared of bugs and creepy crawlies. Speaker B recently got a new job working with computers.",
        "speaker": "Speaker B",
        "raw_prediction": " Yeah, I've been hiking quite a bit lately. I actually led a group of friends on a local trail last weekend. They got tired pretty quickly though, they're not used to hiking like I am. It was a good workout!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t1",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " I have thought about taking a chance and pursuing something more creative full time. I've always had a passion for horror movies and interior design, so maybe I could explore those avenues further. I remember how you offered to help paint my house, and I really appreciate that gesture. Maybe we could collaborate on some creative projects together in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t2",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.",
        "memory_text": "User Description:\nSpeaker B is an individual who works in a cushy government job, with 15 years of experience in the field. They excel in staying calm and composed, even in stressful situations. Speaker B has a passion for painting and enjoys taking naps. They have two kids and are skilled in driving, but prefer to be a passenger and nap during long journeys. Speaker B's favorite movies are in the horror genre, and they have helped their father produce horror movies in the past.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is characterized by mutual admiration and curiosity. Speaker A looks up to Speaker B's job stability and wishes to have a similar career. Speaker A engages in creative conversations with Speaker B about movie plot ideas, showcasing a shared interest in the entertainment industry.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include preparing for an interview, where Speaker A seeks guidance and reassurance from Speaker B. Speaker A role-plays the interview scenario with a friend, demonstrating a proactive approach to job search. Speaker B expresses a desire to work in interior design, highlighting aspirations beyond their current job. The two bond over shared interests in mid-century design, horror movies, and creative brainstorming sessions. Speaker A wishes for Speaker B's father to achieve success in producing Hollywood movies, reflecting a sense of optimism and support in their relationship.",
        "speaker": "Speaker A",
        "raw_prediction": " That's great to hear that you enjoy producing horror movies! It sounds like you've found your creative outlet in the film industry. Maybe you could incorporate your passion for painting into your movie sets to add a personal touch. Have you thought about combining your skills in painting houses with your love for horror movies to create some unique and spooky set designs? It could be a fun way to further explore your creativity and make your mark in the industry.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t3",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh, I have so many interesting stories from the set of our horror movies! One time, we had a special effects mishap that ended up being even scarier than what we had planned. It was a chaotic but thrilling experience. And the creative conversations with my family to come up with movie plots always lead to some wild and unexpected ideas. It's definitely a fascinating process that I enjoy being a part of.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t11",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.\nSpeaker A: Yes. Thanks for the reminder.  I have a couple of more companies to research today.  Of course, it is always interesting to figure out what a company's corporate culture is. ",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you're really prepared for your interview! I'm sure you'll do great. Remember to stay calm and showcase your strengths. And if you need any help with interview practice or tips, feel free to ask me or your brothers for assistance. Good luck!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t6",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?",
        "memory_text": "User Description:\nSpeaker B is a 30-year-old individual who recently turned 30 and lives in Cali. They have a daughter who is 5 years old and loves the beach. Speaker B enjoys the sunny weather and beaches in Cali, where they have been living for 30 years. They have tried surfing before and talk about their daughter swimming and playing in the sand.\n\nRelationship Description:\nSpeaker B and the robot have a friendly and engaging relationship, discussing topics such as moving to Cali, the beach, and running on sand. Speaker A compliments Speaker B's daughter and expresses envy for living near the beach. They also talk about Spring break plans and share preferences for traveling, running, Greek mythology, and Italian food.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include planning a spring break trip, changing hair color to blue, living in different locations (Indiana and Cali), discussing the beach, weather, and running on sand. They also talk about Italy, with Speaker A expressing love for Italian architecture, history, and food. Speaker B recommends good pasta in Italy and asks about Speaker A's favorite part of Italy and their major in History. Speaker B also shares their interest in Greek mythology, studying Poseidon, and asking about historical events.",
        "speaker": "Speaker A",
        "raw_prediction": " My daughter is doing great, thank you for asking! She's really taken a liking to Greek mythology, especially the stories about Poseidon. We've been exploring the history together, and she's building quite the passion for it. And yes, my hair is still blue! It's been a fun change. How about you, any new hair colors planned for your Italy trip?",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t2",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " I think I'll start with the Asian food recipe. My husband will love that! I can't wait to try it out. Thank you again for all the great suggestions!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t4",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?",
        "memory_text": "User Description: Speaker B is a bartender who enjoys bartending and interacting with different people. They have a busy schedule but still finds time to relax and enjoy activities such as sailing and spending time on their houseboat. Speaker B has a close-knit family, including a little brother whom they spend time with on the houseboat.\n\nRelationship Description: The relationship between Speaker B and the robot (Speaker A) is interactive and friendly. They share personal information about their families, work, and interests, showing a level of intimacy in their conversations.\n\nEvent Description: Speaker B and Speaker A have shared events such as salsa dancing, going out for dinner, watching movies, and enjoying time with family. They also discuss self-care practices like massage, meditation, and essential oils, showing a mutual interest in wellness and relaxation. Speaker B enjoys sailing and spending time on their houseboat, while Speaker A plans to take their clients salsa dancing for fun. Both enjoy meeting new people and engaging in enjoyable activities like dancing under the stars on a boat.",
        "speaker": "Speaker A",
        "raw_prediction": " While watching Black Widow, I had some delicious Brazilian foods like feijoada and coxinha. It was a nice change from my usual bartending routine. Have you ever tried Brazilian food before?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!",
        "memory_text": "User Description: Speaker B is a bartender who enjoys bartending and interacting with different people. They have a busy schedule but still finds time to relax and enjoy activities such as sailing and spending time on their houseboat. Speaker B has a close-knit family, including a little brother whom they spend time with on the houseboat.\n\nRelationship Description: The relationship between Speaker B and the robot (Speaker A) is interactive and friendly. They share personal information about their families, work, and interests, showing a level of intimacy in their conversations.\n\nEvent Description: Speaker B and Speaker A have shared events such as salsa dancing, going out for dinner, watching movies, and enjoying time with family. They also discuss self-care practices like massage, meditation, and essential oils, showing a mutual interest in wellness and relaxation. Speaker B enjoys sailing and spending time on their houseboat, while Speaker A plans to take their clients salsa dancing for fun. Both enjoy meeting new people and engaging in enjoyable activities like dancing under the stars on a boat.",
        "speaker": "Speaker A",
        "raw_prediction": " I find that certain foods can definitely have healing properties. For example, ginger and turmeric are known for their anti-inflammatory effects, which can be great for overall health. I also love using essential oils for relaxation and stress relief. It's amazing how different foods and practices can help us feel good both physically and mentally. Have you tried any specific foods or practices for healing?",
        "previous_summary": "Speaker A is involved in healing work and mentioned hot latina salsa.\nSpeaker A recommended self-massage, essential oils, reiki, meditation, and self-awareness for healing.\nSpeaker A finds being on the water therapeutic and relaxing.\nSpeaker A is a Reiki practitioner who also works with meditation."
    },
    {
        "utter_id": "e28-s5-t4",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get ",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " You know, incorporating some music into your garden could be a fun experiment! Maybe playing some Beethoven for your plants could have a positive impact just like his music does for us. Plus, it could be a great way to combine your love for gardening and music. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " Well, I guess we can apply some of our plant science experiments to your garden project! Maybe we can even play Beethoven's music for your plants to see if it helps with their growth. And don't worry, I'll make sure to keep your puppies company while you work on your teleportation machine. How's that for a plan?",
        "previous_summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker A's parents are teachers.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden."
    },
    {
        "utter_id": "e29-s5-t5",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?",
        "memory_text": "User Description:\nSpeaker A is a 27-year-old individual who spends most of their time working and reading. They are considering quitting their current job to pursue a career at Disney World or in dentistry. Speaker A likes books about ice cream, Disney World, and computers. They have no children and are fearful of dentists but want to help others overcome their fear.\n\nRelationship Description:\nSpeaker A had a supportive conversation with Speaker B about quitting their job and potentially pursuing a career in dentistry or at Disney World. Speaker B's mother, who is a dentist, was involved in the conversation and offered advice and encouragement to Speaker A.\n\nEvent Description:\nSpeaker A had a positive conversation with Speaker B's mother about potential career paths, including dentistry and working at Disney World. Speaker A expressed interest in both paths and received encouragement from Speaker B to pursue what makes them happy. Speaker A also discussed their fear of dentists and their desire to help others overcome that fear. Speaker B's child also expressed admiration for their grandmother being a dentist.",
        "speaker": "Speaker B",
        "raw_prediction": " I've actually been with my company for about 5 years now. It's been a great learning experience and I've grown a lot in my role. I remember you mentioning that you were considering a career in dentistry. Have you taken any steps towards pursuing that path?",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?\nSpeaker B: For about four years. It's an industry in flux which is stressful. I need stability for my family at this point. It has changed my focus, which I'm not used to yet. Are you considering any other options for work?",
        "memory_text": "User Description:\nSpeaker B is currently working for a computer company and is stuck in their current career until their child graduates from kindergarten. They love Disney World and hope to take their child there soon. Speaker B's mother is a dentist, and Speaker B thinks Speaker A would be a great fit for working at Disney World. \n\nRelationship Description:\nSpeaker A and Speaker B have had intimate conversations about Speaker B's mother being a dentist. Speaker A is considering going back to school for dentistry later in life, and Speaker B encourages them to choose a career that truly makes them happy. Speaker B's child admires their grandma's profession but does not seem interested in pursuing dentistry. \n\nEvent Description:\nIn a conversation with Speaker B's mother, Speaker A talked about cooking instead of oral health, which was a pleasant surprise. Speaker A feels torn between becoming a dentist for financial reasons and working at Disney for happiness. Speaker B reassures Speaker A that they can overcome any discomfort in dentistry with gloves and determination. Speaker B suggests that Speaker A talks to their mother again about dentistry for more insights and advice.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear that your job is going well, especially during the busy summer season. I've been at my computer company for about four years now, but I feel the need for stability for my family's sake. It's definitely a stressful industry in flux, and I'm hoping to stay put until my child graduates from kindergarten. Have you ever considered working at Disney World? I know you've mentioned your interest in finding a career that truly makes you happy, and I think you would be a great fit there. Plus, your love for cooking could definitely come in handy in the magical world of Disney!",
        "previous_summary": "Speaker A is 27 years old and hopes to change careers soon.\nSpeaker A's father was in the military.\nSpeaker A works for a small local business with a demanding schedule.\nSpeaker A does not have children and spends time working and reading.\nSpeaker A considers quitting their job to work at Disney World.\nSpeaker A is considering becoming a dentist and wants to talk to Speaker B's mother who is a dentist.\nSpeaker A has been looking at dental programs in colleges.\nSpeaker A has not found a dental program yet but plans to keep looking.\nSpeaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\nSpeaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.\nSpeaker A is considering going back to school for dentistry in the future."
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?",
        "memory_text": "User Description:\nSpeaker B is a well-traveled individual who enjoys exploring new countries and cultures. They have a love for the color turquoise and have parents who support them. Speaker B also has an interest in singing and desires to have a studio room for practicing. They have a strong preference for turquoise, singing, and traveling, and have visited 20 countries.\n\nRelationship Description:\nThe relationship between Speaker B and Speaker A is characterized by a shared interest in art and creativity, particularly in the form of origami. Speaker A is willing to teach Speaker B origami and they plan to try it together in the future. This shared activity shows a level of intimacy and collaboration between the two.\n\nEvent Description:\nSome of the events shared by Speaker B and Speaker A include volunteering at the hospital, trying origami, and discussing travel experiences. Speaker B has tried origami while abroad and made a turquoise lotus origami in Japan. Speaker A has also engaged in origami activities and has plans to make a lotus next. Additionally, they have discussed visiting Italy and Japan, highlighting their shared interest in travel and culture.",
        "speaker": "Speaker A",
        "raw_prediction": " I think the idea of using origami in the hospital for breathing apparatus is fascinating. It's amazing how something so intricate can have practical applications like that. I'd love to learn more about the different types of paper used for origami. It sounds like there's a whole world of possibilities to explore!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. \nSpeaker A: Boating is so fun. You could go wakeboarding more often if you had your own boat. And no more boat rental fees or hassle.\nSpeaker B: I actually saw a drone the at will pull you in the water. It's the craziest thing.  \nSpeaker A: That must be a huge drone!",
        "memory_text": "User Description:\nSpeaker A is a person who enjoys eating jello, with their favorite flavors being cherry and grape. They have a family tradition of making jello with their grandma, who taught them how to make it. Speaker A has a passion for water sports, particularly water skiing, and has been doing it for 15 years. They have three kids who also enjoy water skiing. Speaker A is excited about boating and wishes to own a houseboat. They have a friendly and welcoming personality, as they look forward to meeting new people and sharing experiences with them.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is one of mutual interest and shared experiences. They have engaged in conversations about their favorite activities, such as snowboarding and water skiing, showing a willingness to learn from each other. Speaker B expresses a desire to steal Speaker A's jello recipe, indicating a playful and light-hearted dynamic between them.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about their favorite jello flavors, water skiing experiences, and aspirations for future activities. Speaker A expressed excitement about teaching Speaker B how to water ski and potentially sharing their jello recipe. Speaker B shared their interest in learning water skiing tricks and wakeboarding. Both speakers enjoy engaging in outdoor activities and have a shared passion for exploring new hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " That drone that pulls you in the water sounds amazing! It would be so cool to try out new water sports like that. Maybe we can look into it together and give it a shot next time we're out on the water!",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.",
        "memory_text": "User Description: Speaker B is an individual who enjoys playing video games, particularly horror games like Resident Evil VIII. They also have an interest in hunting and have played Jurassic Park: World. Speaker B is eager to play games late at night and spends most of their free time gaming. They also enjoy golfing and plan to alternate between golfing and hunting with Speaker A.\n\nRelationship Description: Speaker B and the robot have a close relationship, as they plan to play games together, with Speaker B teaching the robot how to hunt and the robot teaching Speaker B how to golf.\n\nEvent Description: Some shared events between Speaker B and the robot include playing Resident Evil VIII late at night, planning to play games and order pizza together, and the robot helping Speaker B get used to the UI of Resident Evil.",
        "speaker": "Speaker A",
        "raw_prediction": " How about we try playing a fighting game together? It's a genre you enjoy, and it might be a fun way for us to spend some time gaming without the pressure of competition. Plus, we can order some pizza and have a relaxing time. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.\nSpeaker A: Maybe we can a play fighting game like Street Fighter or Mortal Kombat. It's a good way to pass the time. I've always wanted to learn martial arts myself. Ha!",
        "memory_text": "User Description: Speaker A enjoys hunting deer in their free time and is concerned about deer overpopulation. They like sneaking up on deer in the wild and play calm video games. Speaker A hunts on both family land and state hunting sites.\n\nRelationship Description: Speaker A and Speaker B plan to play games together, showing a mutual interest in gaming. Speaker A invited Speaker B to play the Jurassic Park game and suggested playing Resident Evil together. Speaker B agreed to play Resident Evil with Speaker A.\n\nEvent Description: Speaker A got back from a hunting trip and checked out the conditions for animals living in the area. Speaker B spent all night playing League of Legends and bought Resident Evil VIII. Speaker B is looking forward to playing Resident Evil VIII and usually waits for a sale before buying games. Speaker B plays Resident Evil VIII by himself and turns the lights out to make it scarier. Speaker A and Speaker B are planning to play games together next week Friday after work. Speaker A mentioned that it may take bravery to play Resident Evil. Speaker B mentioned that Resident Evil is definitely scary and the UI is a little hard to get used to.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you enjoy playing all kinds of games, even though scary ones aren't your thing. I can understand why you might not enjoy Resident Evil. It can be pretty intense and scary. Have you ever tried playing any hunting games? I know you enjoy hunting deer in real life, so maybe a hunting game would be a fun way to pass the time without the scare factor.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t4",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really excited for my vacation to San Diego next week! I can't wait to visit the zoo and see all the lions. I might even pick up a poetry book to read while I relax on the beach. Have you ever been to San Diego before?",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t5",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?",
        "memory_text": "User Description: Speaker A is a hard-working individual who works at a local fast food restaurant. They enjoy reading and gardening, and have a preference for visiting the zoo. Speaker A has a sister who recently got married and they like to see pandas, penguins, and exotic birds at the zoo. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, as seen when Speaker A suggested Speaker B to adopt a kitten and they discussed their preferences regarding pets. They also share a love for animals and enjoy visiting the zoo together.\n\nEvent Description: Speaker A's sister got married, Speaker B's cat had a kitten, Speaker A and Speaker B discussed their preferences for pets, Speaker B's girlfriend got a cockatoo, Speaker B mentioned about giving away kittens, Speaker A compared having children to having pets, and Speaker B's sister's cockatoo named John behaves in a funny way.",
        "speaker": "Speaker B",
        "raw_prediction": " I've actually been to the San Diego Zoo a few times before, and it's amazing! They have a great variety of animals, including pandas, penguins, and exotic birds, just like you and your sister enjoy. I'm sure you'll have a fantastic time there during your vacation next week!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " Haha, that would be quite the sight! I think I'll stick with my cat and her kitten for now. But who knows, maybe I'll consider getting an audiobook on lions for my next trip to the zoo!",
        "previous_summary": "Speaker A works at a local fast-food restaurant to pay bills and enjoys reading and gardening.\nSpeaker A's sister recently got married, which was exciting for them.\nSpeaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\nSpeaker A's sister is a dog person with a yellow lab.\nSpeaker A has a sister who owns a corgi."
    },
    {
        "utter_id": "e35-s5-t7",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " Wow, your tattoos sound really meaningful and personal. I love the idea of getting a portrait of your father's face next to a special slogan. It's a beautiful way to honor his memory. And it's great that you're planning out each tattoo with such thought and care. I'll definitely talk to my wife about getting a tattoo, and maybe I'll take your advice on where to place it. Thanks for sharing your experiences with me!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a good plan. Focusing on your artwork and exploring different places seems like a fulfilling way to spend your time. Maybe you'll find someone who shares your passion for tattoos and art along the way.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. ",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " I appreciate your suggestion, but I think I'll stick to installing the aluminum sheeting for now. I'll keep you updated on how it goes with the raccoons. And speaking of pets, I'm still thinking about that bearded dragon from the pet store. Do you think it would be a good fit with my foster dogs?",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "User Description: Speaker B is a zookeeper who works at a Raccoon Cafe. They have a bearded dragon named Bob and a raccoon named Bandicoot, whom they have had since Bandicoot was a baby. Speaker B is experienced in taking care of Bandicoot and Bob, ensuring they are fed correctly with insects and dog kibble. Speaker B's brother owns a grocery store.\n\nRelationship Description: Speaker A fosters dogs and interacts with Speaker B regarding their pets. Speaker A is interested in learning about raccoons and bearded dragons, showing concern for the well-being of foster dogs in the presence of reptiles. The dialogue between Speaker A and Speaker B reflects a friendly and curious relationship.\n\nEvent Description: Speaker B shared experiences of wild raccoons trying to steal food from working raccoons and discussed the intelligence and behavior of raccoons with Speaker A. Speaker B expressed interest in researching whether raccoons can be trained and shared insights on caring for raccoons as pets. Speaker A asked questions about the behavior and care of raccoons, showing interest in wildlife laws and proper pet care.",
        "speaker": "Speaker A",
        "raw_prediction": " It's interesting to hear about your experiences with Bandicoot and Bob. I never knew raccoons could be so smart and mischievous. Have you ever thought about doing some research on raccoon behavior and intelligence to better understand how to care for them? It could be really helpful in your work at the raccoon cafe.",
        "previous_summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker A fosters dogs and is used to them coming and going."
    },
    {
        "utter_id": "e37-s5-t1",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! What book did you check out this time? I'm always looking for new recommendations.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that Pumpkin and Ginger are doing well! I can imagine how cute they must be together. I may not be a cat person, but I can definitely appreciate the bond between them. By the way, your road trip to San Diego sounds like it was a great adventure with the kids. Did you get to try any Mexican cuisine along the way?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t10",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat\nSpeaker A: That would be cruel to do. You need to rehome them properly or otherwise someone may report you to the authorities for animal abuse. My heart is breaking for your poor cats. \nSpeaker B: Thank you for concerning. I am trying to be nice to them do not worry ",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that the Spice Girls are enjoying the nice weather with you. I can imagine how cute they must be chasing bugs in the grass. And don't worry, I'll make sure to find a good home for the kittens once we decide on names. I may not be a cat person, but I still care about their well-being.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t3",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?",
        "memory_text": "User Description:\nSpeaker A is a student with a keen interest in neuroscience and a passion for scuba diving. They are working towards becoming an eagle scout and volunteer at a research lab. Speaker A has a strong desire to work with humans to help cure neurological diseases in the future.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal experiences, interests, and future aspirations. Speaker A and Speaker B engage in meaningful conversations about their respective passions and experiences.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about scuba diving, neuroscience, volunteer work, and military service. They talk about their interests in scuba diving in Hawaii, Speaker A's pursuit of becoming an eagle scout, and Speaker B's military background. Speaker A expresses interest in learning more about eagle scout projects for veterans and Speaker B shares insights about a project that helps dispose of American flags correctly. Speaker A and Speaker B also discuss their shared passion for neuroscience and their respective experiences related to it.",
        "speaker": "Speaker B",
        "raw_prediction": " I appreciate how having snakes like Hensel and Gretel aligns with my interest in neuroscience. Their behavior and unique biology offer a fascinating perspective on the nervous system. Plus, their low maintenance allows me to focus on my research and volunteer work without worrying about their care. It's a perfect balance for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t5",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? ",
        "memory_text": "User Description:\nSpeaker A is a student with a keen interest in neuroscience and a passion for scuba diving. They are working towards becoming an eagle scout and volunteer at a research lab. Speaker A has a strong desire to work with humans to help cure neurological diseases in the future.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal experiences, interests, and future aspirations. Speaker A and Speaker B engage in meaningful conversations about their respective passions and experiences.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about scuba diving, neuroscience, volunteer work, and military service. They talk about their interests in scuba diving in Hawaii, Speaker A's pursuit of becoming an eagle scout, and Speaker B's military background. Speaker A expresses interest in learning more about eagle scout projects for veterans and Speaker B shares insights about a project that helps dispose of American flags correctly. Speaker A and Speaker B also discuss their shared passion for neuroscience and their respective experiences related to it.",
        "speaker": "Speaker B",
        "raw_prediction": " I don't think I'll be able to take Hensel and Gretel with me to my college dorm. I want to make sure they have enough space and the right environment to thrive. But I'll definitely keep you updated on how they're doing! What about you, any plans for your scuba diving adventures in the future?",
        "previous_summary": "Speaker A is a student planning to go to college next year and wants to study neuroscience.\nSpeaker B has two pet snakes named Hansel and Gretel."
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.",
        "memory_text": "User Description: Speaker B works at a fast food place and loves ice cream. Speaker B hasn't started college yet but hopes to become an Eagle Scout. Speaker B uses scouts to make friends and has been involved with Boy Scouts for 7-8 years. \n\nRelationship Description: Speaker B is interested in volunteering at Speaker A's church and has done a lot of volunteer work in Boy Scouts. Speaker B wants to come to the church retreat and thinks twins are little angels. \n\nEvent Description: Speaker A manages work, school, and scouts. Speaker A wants triplets for the choir and needs more volunteers for the retreat. Speaker A mentions a youth retreat next month and bringing babies to the retreat. Speaker B's work is going well, and the hardest part is managing scouts, work, and school. Speaker B plans to attend the local community college and get his Eagle Scout badge.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't started college yet, but I've been involved with Boy Scouts for about 7-8 years now. It's been a great experience for me, not only for learning survival skills like setting up shelter and starting a fire, but also for developing social skills. Working together and compromising are key aspects of being a Scout. I think your kids would really enjoy it, and it's a great way for them to learn and have fun at the same time.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t5",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?",
        "memory_text": "User Description:\nSpeaker A is a stay-at-home mom who recently gave birth to twins. She used to work at IKEA in Sweden for twelve years before becoming a stay-at-home mom. She plays tennis every week, goes to church regularly, and is interested in having a lot of children in the future. Her husband travels frequently, which makes her feel lonely.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and supportive. Speaker B shows empathy towards Speaker A's loneliness and shares his own experiences with volunteering and scouting. They engage in conversations about work, hobbies, and future plans with a level of intimacy and understanding.\n\nEvent Description:\nSpeaker A and Speaker B discuss volunteering opportunities at the church, with Speaker B showing interest in participating despite his busy schedule with work, school, and scouting. They talk about upcoming church retreats, with Speaker A suggesting that Speaker B join for a calming experience. Speaker A also mentions managing school, work, and her twins, while Speaker B shares his plans to achieve the Eagle Scout badge for college applications. They bond over shared experiences and future aspirations, creating a supportive and engaging dialogue.",
        "speaker": "Speaker B",
        "raw_prediction": " The last place I went camping was in the mountains near a beautiful lake. It was such a peaceful and serene experience, being surrounded by nature and away from the hustle and bustle of everyday life. I highly recommend taking your kids camping there when they're older, they would absolutely love it!",
        "previous_summary": "Speaker A recently gave birth to twins and is a stay-at-home mom.\nSpeaker A wants more children and feels lonely due to their husband's frequent traveling."
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!",
        "memory_text": "User Description: Speaker B works at a fast food place and loves ice cream. Speaker B hasn't started college yet but hopes to become an Eagle Scout. Speaker B uses scouts to make friends and has been involved with Boy Scouts for 7-8 years. \n\nRelationship Description: Speaker B is interested in volunteering at Speaker A's church and has done a lot of volunteer work in Boy Scouts. Speaker B wants to come to the church retreat and thinks twins are little angels. \n\nEvent Description: Speaker A manages work, school, and scouts. Speaker A wants triplets for the choir and needs more volunteers for the retreat. Speaker A mentions a youth retreat next month and bringing babies to the retreat. Speaker B's work is going well, and the hardest part is managing scouts, work, and school. Speaker B plans to attend the local community college and get his Eagle Scout badge.",
        "speaker": "Speaker A",
        "raw_prediction": " The last camping trip I went on was up to an island in the middle of nowhere in Canada. It was such a great experience, surrounded by nature and wildlife. We even saw bears and huge moose roaming around, it was amazing!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t11",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!\nSpeaker A: Wow, that sounds like such an adventure! I love to visit Canada. I have seen moose but never a bear! That must have been scary!\nSpeaker B: Yes, it is quite scary. We could also hear the wolves howling at night, luckily we didn't come across them though. One thing to note about bears, is they just want to come and scrounge for our food, so we learned to safely pack it away and hang it up high in a tree.\nSpeaker A: Yes, I've heard that it's important to be careful in bear country! I would love to see one in person though. Do you take lots of photos on your trips?\nSpeaker B: Yes, I took quite a few. The scenery was stunning. Would you like me to send you some photos? I know they are uninteresting to some people.\nSpeaker A: Oh yes, I would love to see some photos! It will be a while before I can take a vacation myself so it's fun to see other people's adventures!",
        "memory_text": "User Description:\nSpeaker A is a stay-at-home mom who recently gave birth to twins. She used to work at IKEA in Sweden for twelve years before becoming a stay-at-home mom. She plays tennis every week, goes to church regularly, and is interested in having a lot of children in the future. Her husband travels frequently, which makes her feel lonely.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and supportive. Speaker B shows empathy towards Speaker A's loneliness and shares his own experiences with volunteering and scouting. They engage in conversations about work, hobbies, and future plans with a level of intimacy and understanding.\n\nEvent Description:\nSpeaker A and Speaker B discuss volunteering opportunities at the church, with Speaker B showing interest in participating despite his busy schedule with work, school, and scouting. They talk about upcoming church retreats, with Speaker A suggesting that Speaker B join for a calming experience. Speaker A also mentions managing school, work, and her twins, while Speaker B shares his plans to achieve the Eagle Scout badge for college applications. They bond over shared experiences and future aspirations, creating a supportive and engaging dialogue.",
        "speaker": "Speaker B",
        "raw_prediction": " Definitely, I'm always here to listen and support you. It's important to have that connection, especially when you're feeling lonely or overwhelmed. Just know that you're not alone in this journey.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.",
        "memory_text": "User Description:\nSpeaker B is a software tech from England who is very active and loves running marathons. They also teach jiu-jitsu and have a foster home for dogs. Speaker B is planning to take summer courses soon and has considered adopting a dog in the states, but feels it would be disloyal to their dogs in England. They miss their dogs and London very much, and their favorite restaurant in London is Sufi.\n\nRelationship Description:\nSpeaker B and Speaker A have been working on the same project and have discussed planning a trip to England together. Speaker A enrolled in a class on the history of martial arts, which Speaker A thinks Speaker B would enjoy. They have shared information about their favorite restaurants, with Speaker A loving Taco Bell.\n\nEvent Description:\nSpeaker B is busy with software work and has not had much time to do other activities. They are considering planning a trip to England to visit family and friends, as well as their dogs. Speaker B recently signed up for a class teaching the history of martial arts, while Speaker A is studying for an athletic training degree. Speaker A loves teaching and learning, especially about the history of martial arts.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you've been really busy with work! I hope you can find some time to relax and enjoy a break soon. Have you made any progress on planning your trip to England? I'm sure your dogs and favorite restaurant are calling your name.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t11",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.\nSpeaker A: Thanks for letting me know! I'll have to check that out soon!",
        "memory_text": "User Description:\nSpeaker A is a college student who loves teaching and learning. They are regretting eating ice cream due to being lactose intolerant. Speaker A also teaches jiu-jitsu and is planning to take summer courses soon. They are taking a class on the history of martial arts and want to get an athletic training degree.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker A mentioning events and activities that may interest Speaker B. Speaker B, a software tech from England, is busy with work and misses dogs. They both share a love for martial arts and have discussed running a half marathon together.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning a trip to England, considering adopting a dog, discussing favorite restaurants in London, and signing up for online classes. Speaker A mentioned a half marathon coming up and Speaker B is considering running it despite their busy work schedule. Speaker B plans to travel back to England to visit family, friends, and dogs.",
        "speaker": "Speaker B",
        "raw_prediction": " I have no doubt you'll ace that class with flying colors. I'm looking forward to learning from you! And don't worry about the finals too much, you'll do great. Let's focus on getting through them first. And hey, after all that studying, we can celebrate with some delicious Donairs from that restaurant!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t4",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?",
        "memory_text": "User Description:\nSpeaker B is searching for a furniture shop to buy furniture but is struggling with choosing new furniture due to doubts about the colors. They painted the room light green before buying purple sofas and are willing to add vibrant colors suggested by Speaker A to create a hippy feel in the room. Speaker B loves pets and is buying furniture safe for their two dogs. They work near a mall by their house and love to barbecue, especially grilling steak and hotdogs. Speaker B prefers grilling corn straight from the farm and using a charcoal grill over a gas grill. They plan to meet Speaker A in person once they are done renovating their house.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy as they plan to meet in person and help each other with furniture choices and grilling preferences. Speaker A invites Speaker B over to help break in new furniture and enjoy grilling and eating outside together.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A getting new furniture like a couch, recliner, and patio furniture, hoping to enjoy more quiet evenings outside. They plan to grill and eat outside most nights with the new furniture, even on busy nights. Speaker B plans to bring marinated meat and a six pack to Speaker A's place and use bug spray to keep bugs away. Speaker A has things set up to play music, enjoy food, and company without worrying about bugs, using lamps and other devices for bug control. Speaker A suggests grilling corn with mayo and cheese and recommends using a smoker for grilling. Speaker B prefers grilling corn with fresh ingredients and loves the flavor of meat cooked on charcoal. Speaker B is willing to give all purple furniture to Speaker A and plans to get rid of the green and purple scheme.",
        "speaker": "Speaker A",
        "raw_prediction": " I got my patio furniture from a local shop near the mall by my house. They have a great selection and I think you'll find something perfect for your living room there too. I can't wait to see the new color scheme you choose and help you set up the furniture. And don't worry, I'll make sure to bring that bug-repelling lamp for our barbecue, so we can enjoy the evening without any interruptions from mosquitoes.",
        "previous_summary": "Speaker B is looking for furniture shop to buy furniture, has two dogs, and works near a mall.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets.\nSpeaker A and Speaker B are discussing furniture and home decor choices.\nSpeaker B recently purchased purple sofas for their home.\nSpeaker B is considering adding more colorful elements to the room to make the purple sofas work.\nSpeaker A is looking to redecorate their house and likes purple furniture.\nSpeaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\nSpeaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture."
    },
    {
        "utter_id": "e42-s5-t5",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? ",
        "memory_text": "User Description:\nSpeaker A is a big country music fan who is sad that winter is ending, their favorite season. They live on a corn and bean farm with lots of animals and they like driving trucks and tractors. Speaker A loves BBQing and grilling steak and hotdogs.\n\nRelationship Description:\nSpeaker A suggests Speaker B to come down and visit for blasting country music, and Speaker B wishes to live the country lifestyle down there. Speaker B plans to meet Speaker A in person after renovating their house and buying furniture safe for their two dogs.\n\nEvent Description:\nSpeaker A inspired to redecorate the house with purple furniture and neon pink and lavender walls. Speaker B regrets the green and purple scheme but plans to give Speaker A all purple stuff. Speaker A bought new furniture including a new couch, recliner, and patio furniture. Speaker A hopes to enjoy quiet evenings outside this summer and plans to grill and eat outside most nights when the weather permits. Speaker B offers to bring a new marinade and a six pack over for a BBQ gathering. Speaker A uses lamps to keep bugs away while enjoying food and company outside. Speaker A has bug spray as a backup plan, and Speaker B needs to get lamps and candles to keep bugs away.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait for you to come over and enjoy some country music while we grill some steak and hotdogs. I'll make sure to have the bug spray ready for those pesky mosquitos. When you come over, we can sit on the patio furniture I got from Ikea and enjoy the summer evenings. I'm really looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t9",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.\nSpeaker A: Of course! I love Miranda Lambert, any specific song requests? ",
        "memory_text": "User Description:\nSpeaker A is a big country music fan who is sad that winter is ending, their favorite season. They live on a corn and bean farm with lots of animals and they like driving trucks and tractors. Speaker A loves BBQing and grilling steak and hotdogs.\n\nRelationship Description:\nSpeaker A suggests Speaker B to come down and visit for blasting country music, and Speaker B wishes to live the country lifestyle down there. Speaker B plans to meet Speaker A in person after renovating their house and buying furniture safe for their two dogs.\n\nEvent Description:\nSpeaker A inspired to redecorate the house with purple furniture and neon pink and lavender walls. Speaker B regrets the green and purple scheme but plans to give Speaker A all purple stuff. Speaker A bought new furniture including a new couch, recliner, and patio furniture. Speaker A hopes to enjoy quiet evenings outside this summer and plans to grill and eat outside most nights when the weather permits. Speaker B offers to bring a new marinade and a six pack over for a BBQ gathering. Speaker A uses lamps to keep bugs away while enjoying food and company outside. Speaker A has bug spray as a backup plan, and Speaker B needs to get lamps and candles to keep bugs away.",
        "speaker": "Speaker B",
        "raw_prediction": " I'll definitely bring the corn for the barbeque, I can't wait to grill some steaks with you! And I'll make sure to learn some Miranda Lambert songs on the guitar for you, any specific favorites that you want me to play?",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t1",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?",
        "memory_text": "User Description: Speaker A is a reader who loves Greek mythology and traveling. They have a dog named Wylie, a mom who is a pediatrician, and a dad who is a fireman. Speaker A enjoys being outside and is planning a vacation this year. They want kids in the future and have a fascination with strong women, like the goddess Athena.\n\nRelationship Description: Speaker A and Speaker B have a friendly and engaging relationship, sharing excitement about upcoming trips and discussing preferences for historical places and Greek mythology. They exchange travel tips and show interest in each other's plans and experiences.\n\nEvent Description: Speaker A has booked a plane ticket to Rome and is leaving in two weeks, while Speaker B is planning a trip to Greece with their family. Speaker B recommends destinations like the Parthenon and the Acropolis of Athens to Speaker A. They discuss the purpose of their trips and share their excitement for the upcoming travels. Speaker A expresses their love for exploring cities with their dog, Wylie, and Speaker B shares their admiration for the goddess Athena.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so exciting that you booked an excursion to visit the Acropolis in Athens! You're going to love it, especially with your fascination with Greek mythology. The Acropolis is a must-see, with its rich history and connection to strong women like the goddess Athena. I'm sure you'll have a great time exploring the ancient ruins and soaking in all the history. Have a fantastic trip!",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t10",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. ",
        "memory_text": "User Description:\nSpeaker B is a librarian from Amsterdam who commutes to work by boat. They have three kids and are currently reading Star Wars novels. Speaker B is planning a vacation to Greece, excited to visit historical places. They express their love for Athena and reveal that their lucky number is three. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, discussing travel plans, Greek mythology, and strong women. They share their excitement about upcoming trips and recommend sights to each other.\n\nEvent Description:\nSpeaker B is preparing for their trip to Greece, including sorting out flights and deciding on destinations like Athens, Santorini, and Thessaloniki. Speaker A recalls past travels in Europe and shares favorite cities. Speaker A and Speaker B discuss their travel plans, including recommendations for each other's trips. They also talk about their admiration for strong women and Greek mythology. Speaker B's kids are excited about the trip to Greece, and they recommend the Parthenon as a must-see attraction.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you have a lot of exciting travel plans coming up! I can't wait to hear all about your trip to Greece and your visit to the Acropolis. Maybe you can bring back some Greek mythology books for your kids to enjoy.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t1",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? ",
        "memory_text": "User Description: Speaker A is from Venice Beach and has traveled to 20 countries, despite hating traveling but loving running. They picked up a yodel in their travels and come from a musical background, as their parents met in a high school choir. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, with Speaker B providing motivational speeches and encouragement to Speaker A in their running goals. \n\nEvent Description: Speaker A and Speaker B have shared moments of discussing marathon training, dealing with injuries like a sprained ankle, and planning to run together for the Alps marathon. Speaker A has also shared their love for singing and active lifestyle recommendations for Speaker B when feeling down. Speaker B mentioned missing his family while traveling for work and finding solace in nature and motivational speeches.",
        "speaker": "Speaker B",
        "raw_prediction": " Well, the speech went really well! I shared some of our marathon training experiences and how running has brought us closer together. I actually mentioned how your yodeling skills have motivated me to push through tough moments during our runs. As for finding a motivational speaker, I think I might know just the person for the job - someone who can inspire us with their words and help us reach our running goals together. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol",
        "memory_text": "User Description: Speaker B is kind, caring, and hopeful for group equality. They like camping and hiking, with a favorite trail being the Columbia Trail near home. They have a neighbor named John who sells camping gear and also loves hammocks. Speaker B's dog loves the hammock more than Speaker B.\n\nRelationship Description: Speaker B and the robot have a friendly and collaborative relationship. They enjoy planning hikes, picnics, and discussing camping equipment together.\n\nEvent Description: Speaker B and the robot plan to go hiking this weekend, with Speaker B suggesting a picnic at the top of the mountain. They discuss bringing sandwiches, fruit, water, and even swimming in a lake during their hike. Speaker B shares their preference for veggie sandwiches and their experience with swimming in cold water. Speaker A also mentions a hidden primitive camping spot off the main hiking trail. Speaker B finds it cool that Speaker A plans to buy a hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": " That's awesome that you got the shift lead position at the grocery store! It sounds like a great fit for you. As for me, I've been helping John with some side projects to make ends meet. He actually pays pretty well, even better than a regular job. And speaking of John, my dog loves his hammock more than I do, it's hilarious! \n\nI can't wait for our hike this weekend, it's going to be so much fun. I think a picnic at the top of the mountain sounds perfect. I'll make sure to pack some veggie sandwiches for us, along with some fruit and water. Maybe we can even take a dip in the lake if it's not too cold, just like when we went swimming that one time. And hey, maybe we can check out that hidden primitive camping spot you mentioned off the main trail, it sounds like a cool adventure. Oh, and speaking of hammocks, I saw a really nice one online that I might get, John would probably approve!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t5",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? ",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " I've actually been helping my neighbor John with some side projects to make some cash, which is working out pretty well for me. It's nice to have some extra money coming in, especially when you're in between jobs. And you're right, it's a win when it's under the table and you don't have to worry about taxes. As for my career aspirations, I've always been drawn to the idea of working in a field where I can make a difference in people's lives, maybe something related to community outreach or social services. What about you? Have you thought about what you'd like to do career-wise after your cross-country journey?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. ",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " That third shift schedule sounds tough, but at least you'll have some peaceful moments in your hammock after work. And the fact that you can go hiking and relax by the lake sounds amazing. I'm happy for you! Maybe we can plan a hike together soon and bring some sandwiches and fruit for a nice picnic at the top of the mountain.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t11",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.\nSpeaker A: Yeah, you know the area it's in. It's pretty safe, but I'm also a light sleeper. Thank you for your concern though. You are a good friend.",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you feel safe in the area, but please promise me you won't fall asleep in that hammock all alone! Maybe bring a whistle or something just in case. And speaking of hammocks, let's remember to bring ours for our hike together. I can't wait to enjoy the view from the top of the mountain with some veggie sandwiches and a swim in the lake afterwards.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t3",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! It sounds like your new iPhone is perfect for your love of music. Maybe we can even find some blues concerts to attend together in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " If I were to win the lotto, I'd definitely use the money to buy a bigger farm where I can have both a city and country house. It would be the perfect balance for me - some peace and quiet in the country, but still close enough to the city for convenience. I can imagine having a nice little spot where we can listen to blues music and enjoy the fresh air. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t9",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " I can imagine how having a country and city house would be the perfect balance for you. It sounds like a dream come true to have the best of both worlds. I'm sure you'll find a way to make it happen one day. Maybe we can plan a trip to the city together to see a concert and then escape back to the peaceful countryside afterwards.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " Yes, I am definitely looking forward to meeting her! My son has told me so much about her, especially how passionate she is about cooking. I think we will get along just fine, especially since we share a love for food.",
        "previous_summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker A's sons will be coming for winter break from Europe."
    },
    {
        "utter_id": "e47-s5-t6",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " That's great to hear that you live in Portugal! I'll be in Spain for about a week, but maybe we can arrange something for a quick meet up. And I'll definitely have to try some Portuguese cuisine while I'm there, I've heard it's delicious. And speaking of trying new things, I found this amazing Chinese restaurant that I think you would love. Maybe we can check it out together sometime!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t7",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?\nSpeaker A: I'm planning to stay in Spain for three weeks.  Since you live in Portugal, I'd love to stop by for a visit if you're free this coming month.  I've always wanted to visit Lisbon.  It has the world's longest bridge!",
        "memory_text": "User Description: Speaker A is a family man who loves spending time with his sons. He is concerned about their well-being, especially when they are studying abroad. Speaker A enjoys various cuisines such as Chinese, Italian, and Mexican.\n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing personal matters such as their sons and preferences in music and food. They plan to meet up during winter break.\n\nEvent Description: Speaker A found a great new Chinese restaurant, China Dragon, and brought his boys there. His sons, who are studying abroad, are skilled in Italian and Chinese cooking. Speaker A's youngest son is addicted to social media and video games. Speaker B's younger son loves Chinese food, and both speakers plan to have a surprise party for their sons who are turning thirteen. Speaker B also suspects his younger son might be secretly gay. Speaker A and Speaker B enjoy ice skating together.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a wonderful plan! Three weeks in Spain and a visit to Portugal, how exciting! I'm sure you'll have a great time meeting your son's girlfriend and exploring Lisbon. Maybe we can even try out some Chinese, Italian, or Mexican cuisine together while you're in Europe. And don't forget to bring your ice skating gear, maybe we can hit the rink again like old times.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t5",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?",
        "memory_text": "User Description:\nSpeaker A was born in Brazil and likes going to museums. They used to live in Los Angeles and loved the food there. Speaker A enjoys Disney music and could eat lengua tacos all day, everyday. They think sauerkraut is important. Speaker A has no Profile and Preference information available.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, sharing their love for music and different food preferences. They engage in conversations about their favorite bands and songs, showing a level of comfort and familiarity.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with their boyfriend. They look forward to shopping, enjoying the nightlife, and having refreshing beers by the beach. Speaker B recommends visiting the Museum of Art of São Paulo and mentions the variety of beaches in São Paulo. They also discuss shopping options and bargains in the city.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't seen the fireworks at the Disney castle, but I have been to Disney World in Florida. I love fireworks too. I want to get married on the 4th of July. That way we will have a national holiday and fireworks for us every year! It sounds like you've been to Disneyland? And yes, I can't wait to visit the Museum of Art of São Paulo next week. It's going to be amazing!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t10",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?\nSpeaker A: No, I had a cousin that I went with.  We stayed in a hotel in Miami too and I got so sunburned on the beach!  I'm sure the art museum will be good if it isn't too crowded.  Was your concert crowded?\nSpeaker B: It was so crowded, but my older brothers went with me and kept me from getting squished. Make sure you wear sunscreen when you visit the beach this time!",
        "memory_text": "User Description:\nSpeaker B is from Brazil, specifically from the big city of San Paulo. They have 2 older brothers and 1 younger brother. Speaker B enjoys the city life, live music, street hot dogs with specific toppings, and discovering amazing food. They have a love for Rock or metal music and have seen Three Dog Night in concert. Speaker B is eagerly waiting for bands to announce their summer tour schedule for future plans.\n\nRelationship Description:\nSpeaker B and the robot have engaged in a conversation about music preferences, favorite bands, and upcoming events. The dialogue shows a friendly and casual relationship between the two, with shared interests in music and cultural activities.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with her boyfriend. They also plan to do lots of shopping and enjoy the nightlife in the city, including having refreshing beers by the beach. Speaker B mentions the various types of beaches in São Paulo, showing their knowledge and willingness to share information with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": " Yes, I will definitely wear sunscreen this time at the beach! I can't wait to explore the art museum in São Paulo with my boyfriend. I heard they have some amazing exhibitions. By the way, have you checked out any upcoming rock or metal concerts in the city? I know you love live music.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!",
        "memory_text": "User Description:\nSpeaker A is an inventor who is super busy and has suggested starting a band, building a time machine, or becoming a chef. They love trying new food, especially Mexican and seafood dishes like chicken enchiladas, tacos, shrimp shish kabob, baked fish, grilled corn, and stuffed burgers. Speaker A used to foster puppies and is an animal person who loves meeting puppies from history.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and collaborative relationship, with Speaker B showing interest in becoming Speaker A's chef. They discuss cooking different cuisines around the world and share a passion for grilling and trying new food.\n\nEvent Description:\nShared events include Speaker A recommending indoor grilled veggies for fajitas, discussing the drawbacks of working as a chef, and considering a job as a line cook. Speaker B expresses interest in grilling steaks and trying grilled asparagus. They also talk about the impact of their jobs on their social lives and consider switching careers to gain free time.",
        "speaker": "Speaker B",
        "raw_prediction": " Well, I do love puppies because they are just so adorable and always bring a smile to my face! They remind me of all the fun times I had when I used to foster them. But you know what would be even cuter? A puppy-themed food truck serving up puppy-shaped treats for all the dog lovers out there!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t4",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old workaholic who is starting their career. They enjoy grilling and have not yet settled on a specific career path. Speaker B doesn't have a strong opinion on puppies, but they are interested in trying new things and exploring different cuisines.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship. They discuss various topics such as career recommendations, cooking, and volunteering at animal shelters. Speaker A shows interest in Speaker B's career choices and preferences, suggesting ideas like starting a band or working on a time machine together.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B talk about grilling delicious dishes like grilled corn and stuffed burgers. They also discuss cooking different types of cuisines while teleporting around the world. Speaker A shares their love for Mexican food and seafood, while Speaker B expresses interest in becoming a chef and trying out new recipes. Additionally, Speaker A mentions their volunteer work at animal shelters, particularly with dogs and cats, while Speaker B shows interest in volunteering and prefers cats over puppies. Speaker B also mentions their project of building a resume and applying for companies, while Speaker A suggests considering a career switch for more free time.",
        "speaker": "Speaker A",
        "raw_prediction": " Asparagus is a great vegetable to work with! Have you ever tried grilling it? It's a delicious and healthy option to add to your meals. I can share a simple grilled asparagus recipe with you if you'd like! And speaking of trying new things, have you thought about volunteering at an animal shelter? It's a rewarding experience, and I know you love animals.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t6",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old workaholic who is starting their career. They enjoy grilling and have not yet settled on a specific career path. Speaker B doesn't have a strong opinion on puppies, but they are interested in trying new things and exploring different cuisines.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship. They discuss various topics such as career recommendations, cooking, and volunteering at animal shelters. Speaker A shows interest in Speaker B's career choices and preferences, suggesting ideas like starting a band or working on a time machine together.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B talk about grilling delicious dishes like grilled corn and stuffed burgers. They also discuss cooking different types of cuisines while teleporting around the world. Speaker A shares their love for Mexican food and seafood, while Speaker B expresses interest in becoming a chef and trying out new recipes. Additionally, Speaker A mentions their volunteer work at animal shelters, particularly with dogs and cats, while Speaker B shows interest in volunteering and prefers cats over puppies. Speaker B also mentions their project of building a resume and applying for companies, while Speaker A suggests considering a career switch for more free time.",
        "speaker": "Speaker A",
        "raw_prediction": " Grilled asparagus is a great choice for your chef book! I usually pair it with a nice grilled salmon or even shrimp skewers. And when it comes to fajitas, I prefer chicken over beef. How about you?",
        "previous_summary": null
    }
]