[
    {
        "utter_id": "e0-s5-t3",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?",
        "memory_text": "Speaker B is excited about Easter weekend and spring break. This excitement led Speaker B to dye their hair with henna and enjoy experimenting with different hair colors. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one. Both Speaker A and Speaker B have a sense of humor, as seen by their use of \"lol\" in the conversation. Speaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks. Speaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession. Speaker B is going on a trip but has not started packing yet, showing their excitement for the upcoming adventure.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll be in Costa Rica for about a week. I can't wait to explore the rainforests and beaches!",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?",
        "memory_text": "Speaker B is excited about Easter weekend and spring break, which is why Speaker B dyed their hair with henna and enjoys experimenting with different hair colors. Speaker A, a retired librarian, used to have quiet spring breaks, but now recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm doing well, thank you for asking. I recently finished reading \"Where the Crawdads Sing\" by Delia Owens, and I highly recommend it. How about you, any new books on your reading list?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "1. Speaker A mentions having eight grandchildren and already having blue hair. Speaker B has an oldest nephew who is about to turn 14.\n2. Both Speaker A's mother and Speaker A were librarians, but Speaker A is retired. Speaker B asks if the recommended book is fiction or nonfiction.\n3. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one. Speaker A, a retired librarian, recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit.",
        "speaker": "Speaker B",
        "raw_prediction": "He's doing well, thank you for asking. He's getting ready for his birthday, and he's excited to finally be a teenager.",
        "previous_summary": "Speaker A is older and has eight grandchildren.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city."
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?\nSpeaker A: Sorry for the typo. I meant \"pool\". Weather here is very hot and humid. It is miserable if you don't have air conditioning. Pollen count is also very high, so the air quality is poor. ",
        "memory_text": "Speaker A and Speaker B both have a sense of humor, as seen by their use of \"lol\" in the conversation. Speaker A jokes about the inevitability of grey hair, finding getting old no fun. Speaker B's new dress is blue, but more of a turquoise shade, contrasting with Speaker A's quiet spring breaks in the past. Speaker B dyed their hair with henna and enjoys experimenting with different hair colors, excited about Easter weekend and spring break. Speaker A's granddaughter, who is a cosmetologist, helped dye their hair in streaks.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds rough! Hopefully, the weather will improve soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!",
        "memory_text": "Speaker B enjoys watching swimming movies and wants to listen to punk music while swimming and learning programming.\nSpeaker B is looking forward to eating a pizza burger in a pool with punk music playing. \nSpeaker A enjoys cruising in their car while listening to punk music. Speaker A enjoys the food and the adventure of cruises and wants to discuss the potential of getting on a cruise ship together with Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds awesome! I can't wait to listen to it while we hang out by the pool and then get into our programming studies.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "Speaker B enjoys watching swimming movies and wants to listen to punk music while swimming and learning programming. \nSpeaker A has known how to swim since the age of 5 and offers to teach Speaker B how to swim and programming. \nSpeaker B's favorite food is a pizzaburger and is looking forward to eating it in a pool with punk music playing.",
        "speaker": "Speaker B",
        "raw_prediction": "Thank you, I appreciate your willingness to teach me how to swim. I'm excited for our meetup this weekend!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t6",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.",
        "memory_text": "Speaker B, who does not know how to swim but enjoys watching swimming movies, reacted positively when Speaker A offered to teach them how to swim and programming. Speaker A's plan to do snorkeling and other activities at their cruise destination changed as they signed up for several trips. This led to Speaker A planning a snorkeling trip and looking forward to traveling to the Caribbean for their next trip. Additionally, Speaker B expressed their enjoyment of cruising in their car while listening to punk music, which sparked a conversation about the potential of Speaker A and Speaker B getting on a cruise ship together.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll definitely let you know how it goes. It's going to be a fantastic experience for sure.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.",
        "memory_text": "Speaker A enjoys running and listening to music as hobbies. Speaker A offers to take Sparky for a walk to help out and spend time with the dog. Speaker A is considering getting a dog and already walks Speaker B's dog, Sparky. Speaker B has invented a chilli dog casserole that Speaker A wants to try. \nSpeaker B is also a high school student preparing for college, working at a diner at night. Speaker A and Speaker B are involved in different fields of work, cooking and lab research. Speaker A plans to try the famous hamburgers made by Speaker B at the diner. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce.",
        "speaker": "Speaker B",
        "raw_prediction": "I totally get what you mean. It's always good to be informed about what we're eating. Would you be up for trying a plant-based burger together sometime?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t10",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,\nSpeaker B: Yes, ice cream shops are the best! They have stir-ins, and the smells are heavenly! Ben and Jerry's used to have a blueberry cheesecake that was amazing! I have only had that and their strawberry flavors. Both were great!",
        "memory_text": "Speaker B works on weekends at a research lab and has a deaf dog named Sparky, a beagle breed. Speaker A is considering getting a dog and already walks Speaker B's dog, Sparky. Speaker B has invented a chili dog casserole that Speaker A wants to try.\nSpeaker B is also a high school student preparing for college and works at a diner at night. Speaker A plans to try the famous hamburgers made by Speaker B at the diner, and Speaker B had hamburgers for dinner with cheese, mustard, and lettuce. Speaker A had cheesy ham and potato soup for dinner, and Speaker B has invented a chili dog casserole that Speaker A wants to try.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll have to try Ben & Jerry's blueberry cheesecake flavor next time! It sounds delicious.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t3",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.",
        "memory_text": "- Speaker B, who lives in the country and loves nature, is currently re-reading 'Redwall' by Brian Jacques, a favorite book from their childhood. This has been hindered by their new painting project, which has been keeping them busy and away from reading. Speaker B prefers silence while reading and creating artwork to stay focused.",
        "speaker": "Speaker B",
        "raw_prediction": "The river trail sounds lovely. I always enjoy being near the water.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "Speaker B and Speaker A both enjoy reading books and finding inspiration in nature for their hobbies.\nSpeaker A values the importance of proper form in exercise to prevent injuries, especially since they walk to work.\nSpeaker B, being an artist, finds inspiration for their artwork during nature walks, which Speaker A acknowledges and asks about.",
        "speaker": "Speaker A",
        "raw_prediction": "Kyrie sounds like a wonderful companion! It's great that she's well-behaved off-leash. I can imagine how much energy and space a Kelpie needs. Do you have any favorite spots you like to take her for walks?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t2",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!",
        "memory_text": "Speaker B has a lot of kids, all grown up now and with kids of their own, causing Speaker A to have kids and be busy with work, unable to spend as much time with them as they would like. Speaker B wants to spend time with their grandkids at the park, reacting to their grandkids being more interested in phones and tablets than musical instruments. \nSpeaker A, a librarian who loves kids, mentioned having 3 children, which changed to Speaker B mentioning having grandkids, implying they are older and have a family of their own. Speaker B enjoys spending time with their grandkids at the park, reacting to taking them fishing once with mixed reactions. Speaker B's kids do not go to work by boat like Speaker A, but now Speaker B has grandkids and enjoys spending time with them at the park, reacting to their interest in technology over musical instruments.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great, it's important to stay connected in whatever way works best for you!",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "Speaker A is a librarian and loves kids, mentioning having 3 children. This leads to Speaker B mentioning having grandkids, implying they are older and have a family of their own. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like. Speaker B has grandkids and enjoys spending time with them at the park. Speaker A's other children are addicted to tablets and phones, unlike the youngest one who is interested in music. Speaker B has grandkids who are more interested in phones and tablets than musical instruments. Speaker A has children and grandchildren, with at least one child interested in learning the flute.",
        "speaker": "Speaker B",
        "raw_prediction": "I can see how that would be challenging with your schedule. It's important to adapt to stay connected with your loved ones.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t8",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway",
        "memory_text": "Speaker A is a librarian and loves kids, mentioning having 3 children. Speaker B's mother was a librarian, which seems to have influenced their perspective on the job. Speaker A is a retired librarian who enjoys implementing creative activities in their library. \n\nSpeaker B's kids do not go to work by boat like Speaker A. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like. Speaker B has grandkids and enjoys spending time with them at the park. Speaker B took their grandkids fishing once, with mixed reactions from the kids. \n\nSpeaker B has a lot of kids, all grown up now and with kids of their own. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like. Speaker B has grandkids and enjoys spending time with them at the park. Speaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature.",
        "speaker": "Speaker A",
        "raw_prediction": "Thank you, that's very kind of you to offer. I might take you up on that sometime, it would be nice to have the extra help.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t10",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway\nSpeaker A: I will keep that in mind as we do have volunteer hours available. How is your family doing these days?\nSpeaker B: Well I would be happy to help. My family are all great thank you for asking I took the grandkids to the park again we had a great time. How's your family doing? ",
        "memory_text": "Speaker B, having a lot of kids who are now grown up and have kids of their own, causes Speaker A to be busy with work and unable to spend as much time with their own kids as they would like. Speaker B, in contrast, wants to spend time with their grandkids at the park and enjoys it. This causes Speaker B to like the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature. Additionally, Speaker A has children and grandchildren, with at least one child interested in learning the flute.",
        "speaker": "Speaker A",
        "raw_prediction": "My family is doing well, thank you for asking. It's great to hear that you had a wonderful time at the park with your grandkids.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?",
        "memory_text": "Speaker B prefers painting regular people over professionals and discovered their love for portraits through a self-portrait with pets. They also think pit bulls are lovely and have one that is kind and sweet. Additionally, Speaker B likes Persian cats and imagines their pets having interesting interactions. Speaker B's prices for a portrait start at $5000 to pay for college tuition, as they are an artist who did a painting for Elton John and has student debt from art school. Currently, Speaker B is working on other portraits and taking care of a sick dog.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a unique and fun portrait idea! As for the cat, I'm still exploring different shelters and breeders to find the perfect match.",
        "previous_summary": "Speaker B is in college, paints on the side, and has five dogs and three rats.\nSpeaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\nSpeaker B has five dogs and enjoys taking them to the park.\nSpeaker B is working on other portraits and taking care of a sick dog.\nSpeaker B likes Persian cats and imagines their pets having interesting interactions."
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.",
        "memory_text": "Speaker B is unsure about what else there is to do in Alaska besides hiking. Speaker B is going to Alaska for a vacation in two weeks and has some experience with flying on airplanes. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker A and Speaker B are planning a trip to Alaska together.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a great idea! Camping under the stars in Alaska would be an incredible experience.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t11",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?\nSpeaker A: I think it could be a good idea, especially with all the large animals in Alaska and the terrain. I wouldn't rely on your friend and have someone more professional that knows a lot just in case. I'm sure the guide could also give you tons of suggestions of things to do while in the area, and maybe even the best ice cream places lol!",
        "memory_text": "Speaker B is going to Alaska for a vacation in two weeks and has some experience with flying on airplanes. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking. \nSpeaker A and Speaker B share a sense of humor and make each other laugh during the conversation. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker B is unsure about what else there is to do in Alaska besides hiking. \nSpeaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker B is going to Alaska for a vacation in two weeks and has some experience with flying on airplanes. Speaker A and Speaker B are planning a trip to Alaska together.",
        "speaker": "Speaker B",
        "raw_prediction": "Yeah, I think it might be a good idea to hire a hiking guide, just to be safe. I'll ask my friend if he knows of any good ones in the area. I want to make sure I have a great time on this trip!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t5",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?",
        "memory_text": "Speaker B is interested in going rock climbing with Speaker A. Speaker A enjoys the interaction with people at work and the variety of experiences that come with it. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\nSpeaker A works at a restaurant and invited Speaker B to visit. Speaker A owns a restaurant and recently experienced a fire incident but managed to put it out. Speaker A is a restaurant worker who enjoys working there but finds it very busy. Speaker A enjoys working at the restaurant despite the busy schedule.\nSpeaker A works at a restaurant and invited Speaker B to visit, which causes Speaker A to enjoy the interaction with people at work and the variety of experiences that come with it. Speaker A enjoys working at the restaurant despite the busy schedule.",
        "speaker": "Speaker B",
        "raw_prediction": "I would go for the tres leches cake with fresh raspberry jam sauce and lemon drizzle. It sounds like a delicious choice!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t1",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?",
        "memory_text": "Speaker A is studying marketing and enjoys it, while Speaker B practices Karate and holds a green belt, being involved in other activities and considering going back to school for a certificate in IT work. Both Speaker A and Speaker B have interests in learning new languages. Speaker B is considering a career change to the IT sector due to their computer skills and the growing demand for employees in that sector. Speaker B currently works as a lifeguard, which is physically demanding and not suitable for a long-term career.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I've also dabbled in Taekwondo and Judo before focusing on Karate.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t2",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.",
        "memory_text": "Speaker A is working at a pizza shop to pay for college and studying computer science. Speaker B is majoring in linguistics and hopes to turn it into a practical job. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics. Speaker B is studying linguistics but mentions feeling limited in job opportunities. Speaker A is interested in teaching computer science, specifically in the field of robotics.",
        "speaker": "Speaker A",
        "raw_prediction": "It's completely understandable to feel overwhelmed with such a big decision. Teaching can be a rewarding path, especially with your passion for linguistics. Just remember, it's okay to explore different options before committing.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t6",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.",
        "memory_text": "Speaker B wants to turn their linguistics major into a practical job, while Speaker A wants to develop apps for differently abled youth through studying computer science. Speaker A is interested in teaching computer science, specifically in the field of robotics. \nSpeaker A is working at a pizza shop to pay for college and studying computer science, while Speaker B is considering further education to become a college professor in linguistics, feeling limited in job opportunities.",
        "speaker": "Speaker A",
        "raw_prediction": "Teaching English or history could be a great fit for you. It's always good to have options to explore!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t7",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?",
        "memory_text": "Speaker B is majoring in linguistics and hopes to turn it into a practical job. This has led Speaker A to be interested in teaching computer science, specifically in the field of robotics. \nSpeaker B is majoring in linguistics and hopes to turn it into a practical job. This has led Speaker B to consider getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics. This decision has made Speaker B feel limited in job opportunities.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm particularly interested in ancient civilizations and how they shaped the world today. It's fascinating to see the connections between the past and the present.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?",
        "memory_text": "Speaker A enjoys visiting the zoo and grew up in big cities. Speaker B's child wants to visit the zoo, particularly to see the monkeys. Speaker A is offering advice and seems to have experience with children. \n\nSpeaker A compares having a kitten to being a grandparent and mentions starting their own zoo. Speaker B expresses concern about leaving a kitten alone during their family camping adventures. \n\nSpeaker A suggests taking the pets to the zoo and mentions that most major cities have good zoos. Speaker B's child wants to visit the zoo, particularly to see the monkeys. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.",
        "speaker": "Speaker B",
        "raw_prediction": "One of our favorite camping spots is near the beach. The sound of the waves at night is so peaceful. Where do you usually camp?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t6",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?",
        "memory_text": "Speaker B is away from their child and glad that the pets are with them. Speaker B is considering calling in sick to work to go to the zoo with their child.\nSpeaker A enjoys visiting the zoo and grew up in big cities. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys. Speaker B's daughter likes monkeys and is starting to assert her independence.",
        "speaker": "Speaker A",
        "raw_prediction": "I didn't make it to the zoo last weekend, but I'm hoping to go soon. Do you have a favorite animal to see there?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t9",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.\nSpeaker A: No, I acctually haven't. I'm expecting pineapple and ham on everything, but I know they will having some amazing cultural food that is probably going to blow my mind! Is there a specific dish you would recommend",
        "memory_text": "1. Speaker A recently saw the Disney movie 'Luca', which was super cute and made them want to visit Italy, but instead, they booked a Hawaii sunset tour for next month.\n2. Speaker B's kids enjoyed watching 'Luca' and found it good, reflecting Speaker B's enjoyment of Disney movies.",
        "speaker": "Speaker B",
        "raw_prediction": "You should definitely try the traditional Hawaiian dish, poke. It's a must-try when you're there. The fresh fish mixed with various seasonings is absolutely delicious.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.",
        "memory_text": "Speaker A invited Speaker B to visit and mentioned looking into flights, causing Speaker A to plan to take Speaker B on tours and attend folk concerts during the visit.\n\nSpeaker A invited Speaker B to visit and mentioned looking into flights, causing Speaker B to plan to visit Speaker A and be interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n\nSpeaker B is interested in visiting Alaska and mentions getting blackout curtains due to the midnight sun, causing Speaker B to find flights that work for their schedule and price and will be visiting Speaker A in a couple of weeks, which in turn causes Speaker A to be excited about the trip.",
        "speaker": "Speaker A",
        "raw_prediction": "You might not need to rent a car, it's definitely possible to walk and bike around here in the summer. The snow melts pretty quickly once summer hits.",
        "previous_summary": "Speaker A drives a smart car and used to have a long commute in Alaska.\nSpeaker A mentions the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer.\nSpeaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\nSpeaker A plans to take Speaker B on tours and attend folk concerts during the visit."
    },
    {
        "utter_id": "e16-s5-t1",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. ",
        "memory_text": "- Speaker A frequents live band venues and plays music at home. Speaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy. Speaker A and Speaker B discuss the logistics of attending a festival with a small baby. \n- Speaker A does not live in Mexico but likes Mexican food and women. Speaker B is not going out drinking much due to their wife's pregnancy. Speaker B's wife is pregnant, so they are considering attending a local festival for just a day. Speaker B's wife is pregnant and has three more months to go until the due date. \n- Speaker B is a mechanic who enjoys working on cars. Speaker A and Speaker B enjoy bluegrass music.",
        "speaker": "Speaker B",
        "raw_prediction": "Hey, that sounds like a great idea! I'll check with my wife and let you know. Thanks for the offer.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t2",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.",
        "memory_text": "Speaker A enjoys going to bars and loves the ladies. They also like Mexican food and women. \nSpeaker B's wife is pregnant and currently in the second trimester, still working. They are considering attending a local festival for just a day. \nSpeaker A is not sure if they will ever settle down with a partner and have kids. \nSpeaker B, a mechanic, is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy. They discuss the logistics of attending a festival with a small baby.",
        "speaker": "Speaker B",
        "raw_prediction": "Sounds like a plan! I'll talk to my friend about it and let you know the details.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "Speaker A finds cooking helpful for stress relief, while Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker A wakes up early in the morning to catch waves, while Speaker B likes to eat huge steaks after snowboarding.",
        "speaker": "Speaker A",
        "raw_prediction": "I recently tried making some spicy shrimp tacos with homemade salsa. They turned out pretty good!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.",
        "memory_text": "Speaker A enjoys cooking new dishes and following recipes occasionally. This might be a great opportunity for Speaker B to teach them how to make spicy fried rice.",
        "speaker": "Speaker A",
        "raw_prediction": "No, they didn't have al pastor, but that sounds delicious! I'll have to keep an eye out for it.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?",
        "memory_text": "Speaker A used to work part-time at a supermarket while majoring in Humanities in college. Now, Speaker A plays soccer as a striker and has a match next week. Additionally, Speaker A is a member of a soccer team and enjoys playing in tournaments. On top of that, Speaker A has been scoring well in soccer recently.",
        "speaker": "Speaker B",
        "raw_prediction": "I used to play as a defender. What about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t8",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.",
        "memory_text": "Speaker A used to work part-time at a supermarket but now plays soccer as a striker and has a match next week. Speaker B played intramural soccer in college and is a fan of Manchester United. \nSpeaker A enjoys playing soccer and joked about treating Speaker B to lunch, indicating Speaker B is currently low on cash. Speaker B is considering asking for a raise at work and works as a clerk for a law firm, enjoying the work but wishing it paid better.",
        "speaker": "Speaker A",
        "raw_prediction": "Sounds like a plan! I'll let you know when we're organizing a game.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?",
        "memory_text": "Speaker A used to work part-time at a supermarket but now plays soccer as a striker and has a match next week. They are a member of a soccer team and enjoy playing in tournaments. \nSpeaker A is a college student majoring in Humanities, not currently employed but used to work part-time at a supermarket. Lately, Speaker A has been scoring well in soccer.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm pretty flexible, so just let me know when works for you and I'll try to make it work.",
        "previous_summary": "Speaker B is 26 years old, works 12 hours a day, has a background in Humanities but now works as a law clerk.\nSpeaker B is currently working and mentioned the importance of taking breaks from work.\nSpeaker B is considering looking for a new job for higher pay but is comfortable at the current job."
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "Speaker A mentioning their neighbor John, who loves soccer, leads Speaker B to study sports medicine, play soccer, and aim to join their college team. This interest causes Speaker B to seek internships in sports medicine and enjoy surfing instead. Speaker B's professors being supportive in writing letters for an internship application causes Speaker A to offer advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field. Speaker B, as a college student playing soccer with peers, transitions to looking for internships in sports medicine, asking professors for letters of recommendation. This change results in Speaker B struggling to find internships and feeling disadvantaged compared to those with connections.",
        "speaker": "Speaker A",
        "raw_prediction": "I had a few injuries from playing sports when I was younger, and they just caught up with me over the years. It's great that you're focused on internships and making connections in your field. Keep pushing forward, it will pay off in the long run!",
        "previous_summary": "Speaker A is retired and spends most days hiking.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B is interested in sports medicine and enjoys surfing."
    },
    {
        "utter_id": "e19-s5-t9",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? ",
        "memory_text": "Speaker A mentions their neighbor John who loves soccer, which causes Speaker B to be studying sports medicine and playing soccer, looking to join their college team in the future. This leads Speaker B's professors to be supportive in writing letters for an internship application, prompting Speaker A to offer advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\nSpeaker B's mother running a local high school, with Speaker B being her only child, leads to Speaker B being interested in sports medicine and enjoying surfing.",
        "speaker": "Speaker B",
        "raw_prediction": "I haven't decided yet where I want to settle, but I'm definitely keeping my options open. Traveling sounds amazing, especially to all those European countries you've been to.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!",
        "memory_text": "1. Speaker A's pet raccoon enjoys eating pizza because Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid, so Speaker A wants to have a pet raccoon and has a friend who found baby raccoons.\n3. Speaker B enjoys going on cruises for fun as Speaker A has been working at their job for almost 10 years and has only taken 3 vacations.",
        "speaker": "Speaker B",
        "raw_prediction": "That's hilarious! Journey really loves pizza, huh?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t2",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?",
        "memory_text": "Speaker B is interested in helping Speaker A with their penguins at the zoo and working with animals. Speaker A and Speaker B plan to have a house concert with their pets, sharing a love for music.\nSpeaker B inquires if Speaker A has experience with pet raccoons after Speaker A's pet raccoon, Journey, enjoys eating pizza. Speaker A expresses interest in having a pet raccoon after having a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "I've tried to keep the food out of reach, but Journey always finds a way to sneak a bite!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t4",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?",
        "memory_text": "Speaker A loves animals, especially white tigers, and works as a zookeeper. Speaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature. Speaker B asks Speaker A if they have had a pet raccoon before. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker A's pet raccoon enjoys eating pizza. Speaker A has a pet raccoon and has a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "Sid is pretty well-behaved when it comes to food, but he does love to explore and find new places to hide!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t5",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?",
        "memory_text": "Speaker A enjoys working with animals and has penguins at the zoo. Speaker B is excited about the opportunity at the zoo and is looking for a new job. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.",
        "speaker": "Speaker B",
        "raw_prediction": "They're doing okay, just getting older. I'm really looking forward to starting a new job at the zoo, it will be a nice change of pace.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "Speaker A works as a zookeeper and loves animals, especially white tigers. Speaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one. \n\nSpeaker B has two terrier dogs as pets. Speaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature. Speaker B asks Speaker A if they have had a pet raccoon before. \n\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker A has a pet raccoon and has a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "It's all about finding a good balance and making sure their needs are met. I'm sure your terriers are loving the extra time with you now!",
        "previous_summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations."
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?",
        "memory_text": "Speaker A is interested in adopting a rescue kitten and has a parrot named Tasha who speaks Mandarin. Speaker B has two sick kitties and recently received a rescue, and is considering giving them Mandarin names based on their personalities. Speaker A has a pet parrot named Tasha and has red hair that makes them stand out. Speaker B has an older mellow cat and is concerned about training the new energetic kittens.",
        "speaker": "Speaker A",
        "raw_prediction": "Oreo sounds like a cute name! Have you thought of a name for the other kitten yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t7",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.",
        "memory_text": "Speaker A has a pet parrot named Tasha and is interested in adopting a rescue kitten. \nSpeaker A is a country girl who loves animals and is considering adopting a rescue kitten. \nSpeaker B lives in the city they grew up in, loves animals, and has a cat that recently had a kitten.",
        "speaker": "Speaker B",
        "raw_prediction": "I totally get that! Fall hikes are the best, no bugs and cooler temperatures. It's my favorite time of year to hit the trails too.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.\nSpeaker B: That is funny. And impressive that you're learning. The closest I can get to another language is doing a bad New York accent LOL",
        "memory_text": "Speaker B loves animals, lives in the city they grew up in, and has a cat that recently had a kitten. This led Speaker B to have two sick kitties and recently receive a rescue. Speaker A, on the other hand, has a parrot named Tasha and is interested in adopting a rescue kitten. Speaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\n\nSpeaker A, a country girl who loves animals and is a lacto-ovo vegetarian, now has a pet named Tasha who speaks Mandarin. As a result, Speaker A has been learning Mandarin, and Tasha has started saying Chinese phrases instead of English ones. This has led Speaker A to be interested in adopting a rescue kitten, similar to Speaker B.",
        "speaker": "Speaker A",
        "raw_prediction": "Haha, well, at least a New York accent adds some flair! I'm sure Tasha finds your Mandarin quite entertaining.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.",
        "memory_text": "1. Speaker A enjoys going on camping trips and hiking trails in parks, and has planned several camping trips for the summer. She will also be doing a part of the Appalachian Trail for 10 days.\n2. Speaker A has a pet parrot named Tasha and works as a personal trainer leading hikes. This led to Speaker A becoming a personal trainer who loves camping in remote areas. Recently, Speaker B went on a long hike and enjoyed it.",
        "speaker": "Speaker B",
        "raw_prediction": "It's great that you're getting others out on the trails with you, even if they tire out quickly!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t1",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?",
        "memory_text": "Speaker B enjoys painting and taking naps, but is not entirely satisfied with their current job and wishes it was more rewarding. They have a government job that pays the bills but dreams of working in interior design. Speaker B also feels conflicted about their government job, likening it to having tenure as a college professor.\n\nSpeaker A recently moved to a new city and has two older brothers. The change in location has made job searching challenging for Speaker A, who hopes to settle in the new city soon with a steady income. They are currently preparing for an upcoming interview and feeling nervous about it.",
        "speaker": "Speaker B",
        "raw_prediction": "I have considered it, but I worry about the stability and financial security of pursuing a creative career full time.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t2",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.",
        "memory_text": "Speaker A has recently received a call for a job interview and is excited about it. Speaker A wants to pursue a career in producing horror movies and believes everyone loves them. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\nSpeaker B mentioned taking a nap during work and is not entirely satisfied with their job, wishing it was more rewarding. Speaker B has a government job that pays the bills but wishes they could work in interior design.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great to hear that producing horror movies is more enjoyable for you! It's important to pursue what you're passionate about. Have you considered exploring more opportunities within the film industry to further develop your skills and interests?",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t3",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?",
        "memory_text": "- Speaker B's father was involved in producing horror movies, which influenced Speaker B's favorite genre. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\n- Speaker B has two kids and enjoys painting and taking naps. Speaker A has a passion for producing horror movies and believes everyone loves them. Speaker A also likes mid-century design and is a fan of horror movies.",
        "speaker": "Speaker B",
        "raw_prediction": "Oh, absolutely! There have been some spine-chilling moments on set, that's for sure.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t11",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.\nSpeaker A: Yes. Thanks for the reminder.  I have a couple of more companies to research today.  Of course, it is always interesting to figure out what a company's corporate culture is. ",
        "memory_text": "Speaker A used to help their father on a farm in the past, while Speaker B's dad works on smaller projects and has never been involved in a major Hollywood film. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\nSpeaker A recently moved to a new city and has two older brothers. Speaker A has recently received a call for a job interview and is excited about it. Speaker A is preparing for an upcoming interview and is nervous about it. Speaker A is nervous about an upcoming interview and wishes for a government job like Speaker B's.",
        "speaker": "Speaker B",
        "raw_prediction": "Researching a company's culture is key to making a good impression. It shows you're invested in the opportunity. Good luck with your job search!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t6",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?",
        "memory_text": "Speaker A is planning for a spring break trip to Italy and recently bought a dress for Easter. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries. Speaker B has been to Italy in the past and enjoyed the food there. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them. Speaker B suggests California as a destination for Speaker A's trip. Speaker B has tried surfing before but is not very good at it. Speaker B appreciates the idea of superhuman powers and is interested in historical events that involve such figures.",
        "speaker": "Speaker A",
        "raw_prediction": "My hair is back to its natural color now, but I'm considering trying a new color before my trip to Italy. I'll keep you posted on my decision!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t2",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?",
        "memory_text": "Speaker A enjoys cooking and baking, possibly considering turning it into a business. Speaker A primarily cooks Indian food and bakes a lot of rice dishes. Speaker A owns a farm and enjoys cooking and baking. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.\nSpeaker B's husband is an avid cook who enjoys making Asian food with lots of prep work. Speaker B's husband is a great cook and Speaker B is not skilled in cooking. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker. Speaker B also mentions having a farm with animals like chickens, ducks, pigs, goats, and growing crops like corn, strawberries, and pumpkins.",
        "speaker": "Speaker A",
        "raw_prediction": "I would recommend starting with a simple and delicious recipe like a chicken curry or a vegetable stir-fry. It's a great way to get comfortable using the pressure cooker.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t4",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?",
        "memory_text": "Speaker B enjoys spending time with their siblings and going out on their houseboat. Speaker A is looking forward to having dinner with their brother before going dancing. Speaker A's brother is a fan of Brazilian food, especially steak.",
        "speaker": "Speaker A",
        "raw_prediction": "We had Brazilian steak and some delicious sides. It was a great movie night!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!",
        "memory_text": "Speaker B enjoys taking their houseboat out and works as a bartender. Speaker A and their brother enjoy going to a Brazilian steakhouse for dinner. Speaker B has one sibling, a little brother. Speaker A's brother enjoys Brazilian food, specifically steak. Speaker B prefers to keep holidays local with their brother instead of having big family gatherings.\nSpeaker B expressed interest in trying healing methods mentioned by Speaker A. Speaker A is interested in Speaker B's job as a bartender. Speaker B works as a bartender and enjoys meeting different people.",
        "speaker": "Speaker A",
        "raw_prediction": "That's awesome, crab legs and shrimp are delicious! I think certain foods can definitely be healing, like bone broth and turmeric. Have you ever tried incorporating those into your diet?",
        "previous_summary": "Speaker A is involved in healing work and mentioned hot latina salsa.\nSpeaker A recommended self-massage, essential oils, reiki, meditation, and self-awareness for healing.\nSpeaker A finds being on the water therapeutic and relaxing.\nSpeaker A is a Reiki practitioner who also works with meditation."
    },
    {
        "utter_id": "e28-s5-t4",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get ",
        "memory_text": "Speaker B is interested in space exploration and plant science, expressing concerns about the fuels used for space travel. This resonates with Speaker A's interest in nuclear energy and space exploration, mentioning fusion experiments. Speaker A struggles with gardening but finds the idea of space plants intriguing. \nSpeaker B is focused on developing renewable energy sources for their inventions, shifting away from working on a teleportation machine and a time machine. This aligns with Speaker B's plans to combat weight gain from spending time at the computer by working in the garden more. Speaker B is knowledgeable about plants and gardening, with a thriving garden.",
        "speaker": "Speaker A",
        "raw_prediction": "I see what you mean. Creating a full garden experience does sound appealing. I'll definitely consider that approach. Thank you for the advice!",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "Speaker B is knowledgeable about plants and gardening, with a thriving garden. Speaker B is working on a teleportation machine that is currently small and requires substantial energy sources. Speaker B mentions the Chinese advancements in thermal nuclear generators and the need for a Manhattan Project for alternative energy. Speaker B is also interested in space exploration and plant science, expressing concerns about the fuels used for space travel. ",
        "speaker": "Speaker A",
        "raw_prediction": "I'm managing school alright, but now with this garden project, it feels like I'll have a whole new responsibility on my hands!",
        "previous_summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker A's parents are teachers.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden."
    },
    {
        "utter_id": "e29-s5-t5",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?",
        "memory_text": "Speaker B enjoys Disney World more than their child, and Speaker A enjoys reading books about ice cream, Disney World, and computers, which causes Speaker A to be open to meeting for lunch and flexible with food choices. Speaker A works for a small local business with a demanding schedule, which is hindering their ability to meet for lunch, but they are still open to it. Speaker B wants to change careers but is unable to until their child graduates, while Speaker A is considering quitting their job to work at Disney World for happiness and is also interested in a career in dentistry.",
        "speaker": "Speaker B",
        "raw_prediction": "I've been with the company for about five years now. It's been a good experience overall. How about you, how long have you been working at the local business?",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?\nSpeaker B: For about four years. It's an industry in flux which is stressful. I need stability for my family at this point. It has changed my focus, which I'm not used to yet. Are you considering any other options for work?",
        "memory_text": "Speaker B's mother is a dentist, and Speaker A expresses interest in speaking to her about it, causing Speaker A to consider becoming a dentist and wanting to talk to Speaker B's mother.\nSpeaker A, who is 27 years old, has been looking at dental programs in colleges and is considering going back to school for dentistry in the future.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been looking into dental programs at colleges, considering going back to school for dentistry in the future.",
        "previous_summary": "Speaker A is 27 years old and hopes to change careers soon.\nSpeaker A's father was in the military.\nSpeaker A works for a small local business with a demanding schedule.\nSpeaker A does not have children and spends time working and reading.\nSpeaker A considers quitting their job to work at Disney World.\nSpeaker A is considering becoming a dentist and wants to talk to Speaker B's mother who is a dentist.\nSpeaker A has been looking at dental programs in colleges.\nSpeaker A has not found a dental program yet but plans to keep looking.\nSpeaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\nSpeaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.\nSpeaker A is considering going back to school for dentistry in the future."
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?",
        "memory_text": "Speaker A enjoys art and music, specifically painting. Speaker A is working on painting projects in their craft room. Speaker A is interested in trying to make a lotus origami next. Speaker A learned origami by themselves in their craft room.\n\nSpeaker B enjoys running and singing. Speaker B enjoys traveling and visiting gardens. Speaker A is interested in trying to make a lotus origami next. Speaker A enjoys origami and tried making a Lotus flower successfully.\n\nSpeaker A enjoys art and music, specifically painting. Speaker B enjoys traveling and visiting gardens. Speaker B was recommended volunteering by Speaker A and has traveled to Japan and Italy, enjoying the art and food. Speaker A offered to teach Speaker B origami in a few weeks.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, practice definitely helps improve your skills in origami. It's all about getting the folds just right!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. \nSpeaker A: Boating is so fun. You could go wakeboarding more often if you had your own boat. And no more boat rental fees or hassle.\nSpeaker B: I actually saw a drone the at will pull you in the water. It's the craziest thing.  \nSpeaker A: That must be a huge drone!",
        "memory_text": "Speaker B is excited to buy their first new car and wants to try water skiing next. They are looking forward to joining Speaker A's family for a water skiing trip and learning from Speaker A's kids.\nSpeaker B values following their passions for snowboarding and music. Speaker A loves boating and water sports, mentioning that they are better at water skiing than wakeboarding. Speaker B is considering living in a houseboat when they are old and retired.",
        "speaker": "Speaker B",
        "raw_prediction": "I bet using a drone for water sports would be an exhilarating experience!",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.",
        "memory_text": "Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\nSpeaker A and Speaker B both enjoy playing video games in their free time. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\nSpeaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.",
        "speaker": "Speaker A",
        "raw_prediction": "How about we try a co-op puzzle or adventure game? It's a good mix of fun and teamwork without the pressure of competition. Plus, it could be a nice change of pace from our usual games.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.\nSpeaker A: Maybe we can a play fighting game like Street Fighter or Mortal Kombat. It's a good way to pass the time. I've always wanted to learn martial arts myself. Ha!",
        "memory_text": "[Speaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop.] - (SameTopic) - [Speaker A and Speaker B both enjoy playing video games in their free time.] - (Want) - [Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.] \n[Speaker A does not play video games often but may consider trying them.] - (Want) - [Speaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.] - (SameTopic) - [Speaker A and Speaker B plan to meet next week Friday at 6 pm to play games and order pizza.] \n[Speaker A does not play video games often but may consider trying them.] - (Want) - [Speaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.] - (Changed) - [Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.]",
        "speaker": "Speaker B",
        "raw_prediction": "Street Fighter sounds like a plan! I'm up for some friendly matches. It's a nice change from the intense games I usually play. Let's do it!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t4",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!",
        "memory_text": "Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo. Speaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks. Speaker B's girlfriend has a cockatoo that makes a lot of noise. Speaker B is considering adopting a kitten from a friend.\n\nSpeaker B has a cat that recently had a kitten and enjoys visiting the zoo. Speaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks. Speaker B's girlfriend has a cockatoo that makes a lot of noise. Speaker A prefers cockatoos over kittens as pets.\n\nSpeaker B has a cat that recently had a kitten and enjoys visiting the zoo. Speaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks. Speaker A's sister is a dog person with a yellow lab. Speaker B is open to being a cool uncle to his sister's future children but does not want kids of his own.",
        "speaker": "Speaker A",
        "raw_prediction": "San Diego Zoo is amazing! You'll have a great time there.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t5",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?",
        "memory_text": "Speaker A enjoys visiting the zoo and has a preference for seeing pandas and penguins, as well as exotic birds. They have been to the zoo before and go with their sister. On the other hand, Speaker A prefers cockatoos over kittens as pets.\n\nSpeaker A and Speaker B discuss their hobbies and interests, with Speaker A enjoying gardening and reading, while Speaker B enjoys visiting the zoo. Speaker B's girlfriend shares the same enjoyment of pandas and penguins at the zoo, and they visit the zoo every few weeks. Additionally, Speaker A's sister is a dog person with a yellow lab. Speaker B is willing to be a cool uncle to his sister's future children but does not want kids of his own.\n\nSpeaker B has a cat that recently had a kitten and also loves visiting the zoo. Speaker A, on the other hand, enjoys seeing pandas, penguins, and exotic birds at the zoo and usually goes with their sister. Furthermore, Speaker A expresses a preference for cockatoos over kittens as pets.",
        "speaker": "Speaker B",
        "raw_prediction": "I've been to the San Diego Zoo a couple of times before, it's really impressive with a wide variety of animals.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...",
        "memory_text": "Speaker A and Speaker B enjoy visiting the zoo and discussing hobbies and interests. Speaker B's girlfriend loves pandas and penguins at the zoo, and they go there regularly. Speaker A has been to the zoo before and likes seeing exotic birds. Speaker A prefers cockatoos over kittens as pets. \nSpeaker A's sister recently got married, which was exciting for them. Speaker A enjoys pandas and penguins at the zoo and goes with their sister. This caused Speaker A's sister to become a dog person with a yellow lab. Speaker B is willing to be a cool uncle to his sister's future children but does not want kids of his own. \nSpeaker B, who has a cat that recently had a kitten, also enjoys visiting the zoo. Speaker A enjoys pandas and penguins at the zoo and goes with their sister. This causes Speaker A's sister to become a dog person with a yellow lab. Speaker B is open to being a cool uncle to his sister's future children but does not want kids of his own.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a great idea! I'll have to plan a trip with her soon.",
        "previous_summary": "Speaker A works at a local fast-food restaurant to pay bills and enjoys reading and gardening.\nSpeaker A's sister recently got married, which was exciting for them.\nSpeaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\nSpeaker A's sister is a dog person with a yellow lab.\nSpeaker A has a sister who owns a corgi."
    },
    {
        "utter_id": "e35-s5-t7",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!",
        "memory_text": "Speaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father. This is why Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest. \nSpeaker A's favorite tattoo is the one dedicated to their late father, saying \"for you I shall live\". Therefore, Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest.",
        "speaker": "Speaker B",
        "raw_prediction": "I don't want to end up on your couch, that's for sure! I'll make sure to discuss it with my wife before making any decisions.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.",
        "memory_text": "Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest. They enjoy getting tattoos and have 5 so far, with one dedicated to their late father. They work at a coffee shop and are saving up for their next tattoo. Their favorite tattoo is the one dedicated to their late father, saying \"for you I shall live.\"",
        "speaker": "Speaker B",
        "raw_prediction": "That's understandable. Focusing on your artwork sounds like a great way to channel your energy and creativity.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. ",
        "memory_text": "Speaker A fosters dogs till they find a forever home. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B wants to train the raccoon and has been taking care of it for over a month. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.\n\nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker A admires raccoons but has not interacted closely with them. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather.\n\nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B owns a raccoon named Bandicoot and a bearded dragon named Bob.",
        "speaker": "Speaker B",
        "raw_prediction": "I completely understand your concern. It's important to keep a safe distance from wild animals, especially if they could potentially cause harm or carry diseases.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "Speaker A is interested in animals, specifically raccoons and bearded dragons. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather. \nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B has been taking care of the raccoon for over a month and is interested in training it. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.",
        "speaker": "Speaker A",
        "raw_prediction": "I've thought about adopting a dog, but my work keeps me pretty busy. Maybe someday when things calm down a bit.",
        "previous_summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker A fosters dogs and is used to them coming and going."
    },
    {
        "utter_id": "e37-s5-t1",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.",
        "memory_text": "- [Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.] - (SameTopic) - [Speaker A enjoys watching movies with their grandchildren.] \n- [Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.] - (SameTopic) - [Speaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.]",
        "speaker": "Speaker B",
        "raw_prediction": "What book did you pick up this time?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?",
        "memory_text": "1. Speaker B loves dogs which is a reason Speaker A has a kitten from their cat and enjoys taking them on trips. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker A drives a Mini Cooper and recently visited a hair salon, leading to Speaker A having a kitten from their cat and enjoying taking them on trips. Speaker B is excited for the trip and looking forward to trying the best iced tea.\n3. Speaker A has a cat that recently had a kitten, prompting Speaker A to have a kitten from their cat and enjoy taking them on trips instead of leaving their cats with a friend while traveling. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.",
        "speaker": "Speaker A",
        "raw_prediction": "They're doing great! Pumpkin is full of energy and Ginger is adjusting well to being a new mom. It's been quite the adventure having them around.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t10",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat\nSpeaker A: That would be cruel to do. You need to rehome them properly or otherwise someone may report you to the authorities for animal abuse. My heart is breaking for your poor cats. \nSpeaker B: Thank you for concerning. I am trying to be nice to them do not worry ",
        "memory_text": "1. [Speaker A drives a Mini Cooper and recently visited a hair salon.] - (Changed) - [Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.] - (Want) - [Speaker A wants to take the Spice Girls on a road trip in the Subaru.]\n\n2. [Speaker A has a cat that recently had a kitten.] - (React) - [Speaker A has a kitten from their cat and enjoys taking them on trips.] - (Want) - [Speaker A wants to take the Spice Girls on a road trip in the Subaru.]",
        "speaker": "Speaker A",
        "raw_prediction": "I'm glad to hear you're trying to do right by them. It's important to remember that pets are family too.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t3",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?",
        "memory_text": "Speaker B recently divorced their wife and loves to scuba dive in Hawaii when not working. Speaker A does not have any pets and expresses an interest in scuba diving. Speaker B has an interest in diving and is planning to take neuroscience classes using the GI Bill. Speaker B is a veteran who went to the army after high school, interested in neuroscience and seeking advice on studying it.",
        "speaker": "Speaker B",
        "raw_prediction": "I find their unique personalities fascinating. Each snake has its own behavior and characteristics that make them interesting to observe.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t5",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? ",
        "memory_text": "Speaker B recently divorced their wife and loves to scuba dive in Hawaii when not working. Speaker A is scared of sharks but finds the idea of going into a steel cage with them interesting. Speaker A finds it amusing that Speaker B prefers animals to humans. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n\nSpeaker B recently divorced their wife and loves to scuba dive in Hawaii when not working. Speaker B has two pet snakes named Hansel and Gretel. Speaker A finds it amusing that Speaker B prefers animals to humans. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n\nSpeaker A is a student planning to go to college next year and wants to study neuroscience. Speaker A does not have any pets and expresses an interest in scuba diving. Speaker B has an interest in diving and is planning to take neuroscience classes using the GI Bill. Speaker A is interested in scuba diving and neuroscience, with experience in a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": "I wish I could, but I don't think most dorms allow pets. I'll have to find a way to visit Hansel and Gretel during breaks.",
        "previous_summary": "Speaker A is a student planning to go to college next year and wants to study neuroscience.\nSpeaker B has two pet snakes named Hansel and Gretel."
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.",
        "memory_text": "Speaker B is involved with Boy Scouts for 7-8 years, currently a Life Scout. \nSpeaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat. \nSpeaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a great way for kids to learn important life skills while having fun outdoors. I'll look into signing them up for Boy Scouts.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t5",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?",
        "memory_text": "Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\nSpeaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat. Speaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker B",
        "raw_prediction": "The last camping trip I went on was to a national park nearby. It was an amazing experience being so close to nature and disconnecting from the busy world for a while.",
        "previous_summary": "Speaker A recently gave birth to twins and is a stay-at-home mom.\nSpeaker A wants more children and feels lonely due to their husband's frequent traveling."
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!",
        "memory_text": "Speaker A wants more children and feels lonely due to their husband's frequent traveling. Speaker A suggested that Speaker B join one of the church retreats in the future. Speaker B appreciates Speaker A's involvement with the scout troop and invites them to a youth retreat. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n\nSpeaker B is not yet in college but hopes to become an Eagle Scout. Speaker A is involved in church activities and mentioned a church retreat. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n\nSpeaker B is not yet in college but hopes to become an Eagle Scout. Speaker B has not taken any vacations recently but has vacation days saved up. Speaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat. Speaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker A",
        "raw_prediction": "Wow, that sounds like quite the adventure! I'm sure your scouting experiences will make for great stories to share with the kids.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t11",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!\nSpeaker A: Wow, that sounds like such an adventure! I love to visit Canada. I have seen moose but never a bear! That must have been scary!\nSpeaker B: Yes, it is quite scary. We could also hear the wolves howling at night, luckily we didn't come across them though. One thing to note about bears, is they just want to come and scrounge for our food, so we learned to safely pack it away and hang it up high in a tree.\nSpeaker A: Yes, I've heard that it's important to be careful in bear country! I would love to see one in person though. Do you take lots of photos on your trips?\nSpeaker B: Yes, I took quite a few. The scenery was stunning. Would you like me to send you some photos? I know they are uninteresting to some people.\nSpeaker A: Oh yes, I would love to see some photos! It will be a while before I can take a vacation myself so it's fun to see other people's adventures!",
        "memory_text": "Speaker B, who has been involved with Boy Scouts for 7-8 years and is currently a Life Scout, finds fulfillment in being a stay-at-home mom despite feeling lonely. Speaker A, who plays tennis every week and goes to church, suggested that Speaker B join one of the church retreats in the future. Speaker A is involved in a church choir and organizing a retreat, looking for volunteers, and has twins while being involved with their church as a volunteer.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll send you some photos, it's always nice to share the beauty of nature with others. It might inspire you to plan your next adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.",
        "memory_text": "Speaker A is planning to take summer courses soon and is very active, enjoying martial arts. Speaker A is enrolled in a class on the history of martial arts and is majoring in athletic training. Speaker A is taking a history of martial arts class and enjoys it. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.\nSpeaker A is a college student who teaches jiu-jitsu and is lactose intolerant. Speaker A is taking a history of martial arts class and enjoys it. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things.\nSpeaker A is planning to take summer courses soon and is very active, enjoying martial arts. Speaker A has never been out of the United States and thinks it would be nice to visit England. Speaker A and Speaker B have not booked any holidays recently.",
        "speaker": "Speaker A",
        "raw_prediction": "Teaching in a group setting allows for more interaction among students. Upgrading software can be time-consuming, but it's rewarding once everything runs smoothly.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t11",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.\nSpeaker A: Thanks for letting me know! I'll have to check that out soon!",
        "memory_text": "Speaker A, who is a college student teaching jiu-jitsu and is lactose intolerant, is now enrolled in a class on the history of martial arts and is majoring in athletic training. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts. \nSpeaker A, who is planning to take summer courses soon and is very active in martial arts, wants to visit England as they have never been out of the United States. Speaker B, who is from London, England and misses it, enjoys fancy restaurants and mentioned Sufi as their favorite in London.",
        "speaker": "Speaker B",
        "raw_prediction": "Donairs are a must-try, especially if you enjoy Sufi's cuisine. Let me know how you like them when you get the chance!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t4",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?",
        "memory_text": "Speaker B is looking to redecorate their house and is considering adding more colorful elements to the room to make the purple sofas work. Speaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture.\nSpeaker B regrets their green and purple color scheme, recently purchased purple sofas for their home, and is willing to give away their purple furniture.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets and plans to meet up with Speaker A to discuss the furniture exchange. Speaker A has devices to keep bugs away and offers to share the product names with Speaker B.",
        "speaker": "Speaker A",
        "raw_prediction": "I got my patio furniture from a local store that had a great sale. I can share the details with you when we meet up.",
        "previous_summary": "Speaker B is looking for furniture shop to buy furniture, has two dogs, and works near a mall.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets.\nSpeaker A and Speaker B are discussing furniture and home decor choices.\nSpeaker B recently purchased purple sofas for their home.\nSpeaker B is considering adding more colorful elements to the room to make the purple sofas work.\nSpeaker A is looking to redecorate their house and likes purple furniture.\nSpeaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\nSpeaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture."
    },
    {
        "utter_id": "e42-s5-t5",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? ",
        "memory_text": "Speaker B is in the process of renovating their house to meet their living standards with their pets. This includes recently purchasing purple sofas for their home and considering adding more colorful elements to the room to make the purple sofas work. Speaker A is looking to redecorate their house and likes purple furniture, having recently bought new furniture for their house, including a couch, recliner, and patio furniture. They both enjoy barbecuing and have a love for pets, leading to them discussing furniture and home decor choices. This has caused Speaker A and Speaker B to plan to meet up to discuss the furniture exchange, with Speaker A offering devices to keep bugs away and sharing the product names with Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "I was thinking of getting a nice outdoor dining set with some comfortable chairs. Thanks for the tip about Ikea, I'll check out their patio furniture selection.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t9",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.\nSpeaker A: Of course! I love Miranda Lambert, any specific song requests? ",
        "memory_text": "Speaker A and Speaker B both acknowledge their lack of expertise in interior decorating. They plan to meet up to discuss the furniture exchange and enjoy a night with music, food, and company. Speaker A invites Speaker B over for this purpose. \n\nSpeaker A and Speaker B both enjoy barbecuing and have a love for pets. Speaker B plans to grill steaks this weekend using an old charcoal grill. Speaker A is looking forward to spending quiet evenings outside during the summer, possibly grilling most nights.\n\nSpeaker B plans to grill steaks this weekend using an old charcoal grill. They suggest making enough barbeque for leftovers on nights when grilling is not possible, due to time or energy constraints.",
        "speaker": "Speaker B",
        "raw_prediction": "How about \"The House That Built Me\" and \"White Liar\"? I think those would be great choices for the barbecue.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t1",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?",
        "memory_text": "Speaker B enjoys being outside and reading Star Wars novels. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian. Speaker B is planning a trip to Greece in the next three months with a family of five. Speaker B and their kids are excited about their upcoming trip to Greece. Both Speaker A and Speaker B enjoy reading and are librarians.",
        "speaker": "Speaker B",
        "raw_prediction": "That's fantastic! The Acropolis is an iconic historical site in Athens with breathtaking views. You'll love exploring it.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t10",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. ",
        "memory_text": "Speaker A and Speaker B both enjoy reading and are librarians. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian. Speaker B is planning a trip to Greece in the next three months with a family of five. Speaker B and their kids are excited about their upcoming trip to Greece.\n\nSpeaker A's mother is a pediatrician. Speaker A has kids and is familiar with Greek mythology. Speaker A has traveled around Europe before, visiting capital cities of each country. Speaker A booked a plane ticket to Rome on a whim and is leaving in two weeks.\n\nSpeaker A and Speaker B both enjoy reading and are librarians. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian. Speaker B is planning a trip to Greece in the next three months with a family of five. Speaker B asks Speaker A if their trip is more for relaxation or sightseeing.",
        "speaker": "Speaker A",
        "raw_prediction": "The Louvre museum in Paris is a must-visit if you enjoy museums. The artwork there is truly breathtaking.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t1",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? ",
        "memory_text": "- Speaker A, a runner who dislikes traveling but has visited 20 countries, wants to improve their mile time and train for a marathon. This causes Speaker A to seek advice on marathon training and recovery. As a result, Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and scheduling a beach meeting at 0600.\n\n- Speaker B, who travels frequently for work and misses their wife and kids, wants to work on improving their mile time and train for a marathon like Speaker A. This causes Speaker A to seek advice on marathon training and recovery. Speaker B is considering running a marathon and has mentioned fishing and feeling depressed, which is a similar topic to Speaker A's marathon training.\n\n- Speaker A, a runner who dislikes traveling but has visited 20 countries, wants Speaker B to get into motivational speaking. This change occurred after Speaker B ran a marathon and found it tough but rewarding. Speaker B got into motivational speaking as a way to battle depression and anxiety, a topic they joked about while mentioning fishing and feeling depressed.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm glad you enjoyed the speech. I might know someone who could help with that. Let me check and get back to you.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol",
        "memory_text": "Speaker A, a recent high school graduate on a cross-country journey looking for jobs, wants to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip. They also applied to work at a grocery store near a hiking trail. As a result, Speaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail, and now has a portable hammock for the hike, asking Speaker B to bring theirs.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great that you found a good gig with your neighbor! Sometimes those side projects can be more lucrative than traditional jobs.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t5",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? ",
        "memory_text": "Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs. Speaker A plans to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip. Speaker A and Speaker B have gone hiking together before and plan to meet up for another hike. Speaker B is not in the best hiking shape and jokes about needing to recharge their energy.",
        "speaker": "Speaker B",
        "raw_prediction": "I've always been interested in photography, so I've been thinking about pursuing that as a career. How about you, any dream job in mind?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. ",
        "memory_text": "Speaker A is looking for a job and new camping gear, specifically a hammock, and plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail. There is a lake at the hiking trail, and Speaker A suggests swimming in it, warning that the water may be cold. Speaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite, and has gone hiking with Speaker B before and plans to meet up for another hike. Speaker B is not in the best hiking shape and jokes about needing to recharge their energy.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a nice way to unwind after a shift. A hammock by the river does sound tempting, especially after a long night at work.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t11",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.\nSpeaker A: Yeah, you know the area it's in. It's pretty safe, but I'm also a light sleeper. Thank you for your concern though. You are a good friend.",
        "memory_text": "Speaker A is on a cross-country journey looking for jobs and new camping gear, specifically a hammock. This leads Speaker A to apply to work at a grocery store near a hiking trail. Speaker A also plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail. Additionally, there is a lake at the hiking trail, and Speaker A suggests swimming in it, warning that the water may be cold.",
        "speaker": "Speaker B",
        "raw_prediction": "You're welcome. I'm just looking out for you. Have you had a chance to try out your new hammock yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t3",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music",
        "memory_text": "Speaker B expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm. Speaker A enjoys the peace and quiet of country life, the fresh produce, and fresh air.\nSpeaker A mentions that Speaker B's kids could try milking cows on the farm, which Speaker B finds amusing. Speaker A works on a family farm and will be using the new truck for farm work.\nSpeaker B believes that luxurious items distract from the value of their family. Speaker A bought 50 lotto tickets with different numbers to increase their chances of winning.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear. Music is always a good way to relax and unwind.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me",
        "memory_text": "Speaker A, who was born and raised as a preacher's kid in the country and worked on a produce farm, mentions that Speaker B's kids could try milking cows on the farm, which Speaker B finds amusing. They then discuss different strategies for playing the lotto and the potential outcomes if they win.\n\nSpeaker A and Speaker B have a friendly interaction and part ways on a positive note after both buying lotto tickets for a big jackpot.\n\nSpeaker A, who was born and raised as a preacher's kid in the country and worked on a produce farm, expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm. Speaker B is open to moving to the country to be further away from neighbors and buys 20 lotto tickets with the same numbers, aiming to get a bigger share of the jackpot if they win.",
        "speaker": "Speaker B",
        "raw_prediction": "I can understand that. I actually prefer the peace and quiet of the countryside myself.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t9",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though",
        "memory_text": "Speaker A, who was born and raised as a preacher's kid in the country and worked on a produce farm, suggests that Speaker B and their family could stay over at the farm after the concert. They discuss different strategies for playing the lotto and the potential outcomes if they win.\n\nAfter a friendly interaction, Speaker A and Speaker B part ways on a positive note, having both bought lotto tickets for a big jackpot.\n\nSpeaker A, who has never been to college and values the peaceful life of working on the farm, reacts as Speaker B expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm. Both speakers dream of having a city and country house or a summer and winter home.",
        "speaker": "Speaker B",
        "raw_prediction": "It sounds like the best of both worlds, being able to enjoy the city life and the peacefulness of the countryside.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "Speaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend. Speaker A has two sons, one of whom has a girlfriend and the other is secretive and possibly gay. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next. Speaker A's sons will be coming for winter break from Europe. Speaker B's younger son would be jealous of Speaker A's sons' European tour. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I've heard a lot about her. I hope we'll get along well when I finally meet her.",
        "previous_summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker A's sons will be coming for winter break from Europe."
    },
    {
        "utter_id": "e47-s5-t6",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?",
        "memory_text": "1. Speaker A's sons will be coming for winter break from Europe, where they have been studying abroad. Speaker A is a family man who loves spending time with his sons, despite worrying about them traveling far away.\n2. Speaker A has two sons, one of whom has a girlfriend and the other is secretive and possibly gay. Speaker A enjoys spending time with their sons and is trying to encourage one of them to get into programming or writing, but the son is more interested in gaming with friends. Speaker A's sons play video games and listen to music in their rooms.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll be in Spain for about a week, but I can definitely make a trip to Portugal to visit you. It would be great to catch up and see your place!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t7",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?\nSpeaker A: I'm planning to stay in Spain for three weeks.  Since you live in Portugal, I'd love to stop by for a visit if you're free this coming month.  I've always wanted to visit Lisbon.  It has the world's longest bridge!",
        "memory_text": "Speaker A's sons have been studying abroad in Spain and are going to Italy next. Speaker A's sons will be coming for winter break from Europe.\nSpeaker A enjoys spending time with their sons despite worrying about them traveling far away. Speaker B is trying to encourage one of their sons to get into programming or writing, but the son is more interested in gaming with friends. Speaker A's sons play video games and listen to music in their rooms.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds wonderful! I'd be happy to show you around Lisbon when you visit. Just let me know when you're free, and we can plan something.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t5",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?",
        "memory_text": "- Speaker A enjoys going to museums and trying different foods. This leads to Speaker A planning to do lots of shopping during their trip.\n- Speaker B has 2 older and 1 younger brother, and their father used to be a farmer. Speaker B was born in Brazil, specifically in San Paulo. Speaker A is interested in music concerts and planning a trip to Sao Paulo. Speaker A plans to do lots of shopping during their trip.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I've been to Disneyland too. It's a magical place, especially with the fireworks show. Have you ever been on a hot air balloon ride?",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t10",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?\nSpeaker A: No, I had a cousin that I went with.  We stayed in a hotel in Miami too and I got so sunburned on the beach!  I'm sure the art museum will be good if it isn't too crowded.  Was your concert crowded?\nSpeaker B: It was so crowded, but my older brothers went with me and kept me from getting squished. Make sure you wear sunscreen when you visit the beach this time!",
        "memory_text": "Speaker A enjoys going to museums and trying different foods. They plan to do lots of shopping during their trip.\nSpeaker B is waiting for bands to announce their summer tour schedule to plan which shows to attend.",
        "speaker": "Speaker A",
        "raw_prediction": "Thanks for the reminder! I'll definitely remember the sunscreen this time. I hope the concert was worth the crowd.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!",
        "memory_text": "Speaker A loves animals, especially puppies, and visits shelters in every city they go to. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.",
        "speaker": "Speaker B",
        "raw_prediction": "I guess that's true, puppies do have that adorable and energetic charm about them.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t4",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.",
        "memory_text": "- Speaker A used to foster puppies but no longer does because they are busy with work, and now mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n- Speaker A's interest in science over music contrasts with Speaker B's love for Black Sabbath and grilling meat, but they both share a passion for animals, especially puppies, and visiting shelters in every city they go to.",
        "speaker": "Speaker A",
        "raw_prediction": "I love asparagus! One of my favorite ways to prepare it is by roasting it with some olive oil, garlic, and parmesan cheese. It's simple and delicious!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t6",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?",
        "memory_text": "Speaker A loves animals, especially puppies, and visits shelters in every city they go to. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters. Speaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it. Speaker A suggests that working as a line cook or chef involves a big time commitment and building a working family. \nSpeaker B is a 26-year-old workaholic who is excited about the idea of traveling the world and trying different cuisines. Speaker B enjoys listening to Black Sabbath and grilling meat. Speaker B is interested in trying different careers and is considering becoming a chef for Speaker A who loves Mexican food and seafood.",
        "speaker": "Speaker A",
        "raw_prediction": "I usually pair the grilled asparagus with seafood fajitas, it adds a nice contrast of flavors. How about you, do you prefer chicken or beef fajitas?",
        "previous_summary": null
    }
]