[
    {
        "utter_id": "e0-s5-t3",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?",
        "memory_text": "1. Speaker B is going on a trip but has not started packing yet\n2. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one.\n3. Speaker B is excited about Easter weekend and spring break.\n4. Speaker B received a new car from their mom and plans to drive during spring break.\n5. Speaker A is worried about gas mileage and asks about the fuel efficiency of Speaker B's car.\n6. Both Speaker A's mother and Speaker A were librarians, but Speaker A is retired.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm planning to stay for a week - plenty of time to explore and relax. I can't wait to experience the beaches and the rainforest. Plus, I'm excited to try all the local cuisine!",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?",
        "memory_text": "1. Speaker B is going on a trip but has not started packing yet\n2. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one.\n3. Speaker B is excited about Easter weekend and spring break.\n4. Speaker B received a new car from their mom and plans to drive during spring break.\n5. Speaker A, a retired librarian, recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit.\n6. Speaker A is worried about gas mileage and asks about the fuel efficiency of Speaker B's car.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm doing well, thank you! I recently finished \"Beautiful Ruins\" by Jess Walter. It's a perfect beach read with a captivating storyline. Have you heard of it?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "1. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one.\n2. Speaker B asks if the recommended book is fiction or nonfiction.\n3. Speaker B is going on a trip but has not started packing yet\n4. Both Speaker A's mother and Speaker A were librarians, but Speaker A is retired.\n5. Speaker B is excited about Easter weekend and spring break.\n6. Speaker B has an oldest nephew who is about to turn 14.",
        "speaker": "Speaker B",
        "raw_prediction": "He's doing well, thanks for asking! He's getting ready for his 14th birthday, and he's so excited. I still need to figure out what to get him as a gift. Do you have any suggestions for a teenage boy?",
        "previous_summary": "Speaker A is older and has eight grandchildren.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city."
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? \nSpeaker B: He's doing well! He just finished theatre camp and he's fighting with my sister because he wants to dye his hair green hahaha.\nSpeaker A: Young people today really have different values than our generation had. Acting sounds like it would be personally rewarding. I also like the arts. I play guitar and piano. You mentioned that you have a poll. That sounds refreshing in the hot weather.\nSpeaker B: Yes it's great, but it hasn't stopped raining here! How's the weather where you are?\nSpeaker A: Sorry for the typo. I meant \"pool\". Weather here is very hot and humid. It is miserable if you don't have air conditioning. Pollen count is also very high, so the air quality is poor. ",
        "memory_text": "1. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one.\n2. Speaker B is excited about Easter weekend and spring break.\n3. Speaker A and Speaker B both have a sense of humor, as seen by their use of \"lol\" in the conversation.\n4. Speaker A is worried about gas mileage and asks about the fuel efficiency of Speaker B's car.\n5. Speaker B is going on a trip but has not started packing yet\n6. Speaker B plans to touch up their hair for the summer due to sun and pool damage.",
        "speaker": "Speaker B",
        "raw_prediction": "I can imagine how uncomfortable that must be with the humidity and poor air quality. Make sure to stay hydrated and indoors as much as possible. Hopefully, the weather clears up for you soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!",
        "memory_text": "1. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n2. Speaker B is looking forward to eating a pizza burger in a pool with punk music playing.\n3. Speaker B enjoys cruising in their car while listening to punk music.\n4. Speaker A finds swimming relaxing and uses it to destress from their job.\n5. Speaker A offers to teach Speaker B how to swim and programming.\n6. Speaker A enjoys cruising and has a favorite club in school.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds awesome! I can't wait to listen to punk music while swimming and then switch to some steady tunes for our programming session. Thanks for putting the playlist together!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "1. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n2. Speaker A offers to teach Speaker B how to swim and programming.\n3. Speaker B is looking forward to eating a pizza burger in a pool with punk music playing.\n4. Speaker A knows how to swim since the age of 5.\n5. Speaker A finds swimming relaxing and uses it to destress from their job.\n6. Speaker B is interested in learning programming and is already practicing.",
        "speaker": "Speaker B",
        "raw_prediction": "That's awesome! I can't wait to learn from you. And after our swimming lesson, we can enjoy that pizza burger in the pool with some punk music blasting in the background. It's going to be a perfect day.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t6",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.",
        "memory_text": "1. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n2. Speaker A offers to teach Speaker B how to swim and programming.\n3. Speaker A and Speaker B discuss the potential of getting on a cruise ship together.\n4. Speaker A is planning a snorkeling trip and has signed up for several trips.\n5. Speaker A plans to travel to the Caribbean for their next trip.\n6. Speaker B is afraid of cruises because they can't swim.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll definitely keep you updated on how the Caribbean trip goes! Maybe after I teach you how to swim, you'll feel more comfortable joining me on a cruise in the future. It's all about taking it one step at a time.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.",
        "memory_text": "1. Speaker A plans to try the famous hamburgers made by Speaker B at the diner.\n2. Speaker B has invented a chilli dog casserole that Speaker A wants to try.\n3. Speaker A and Speaker B are involved in different fields of work, cooking and lab research.\n4. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce.\n5. Speaker B is planning to major in molecular biology.\n6. Speaker B works on weekends at a research lab, showing an interest in neuroscience.",
        "speaker": "Speaker B",
        "raw_prediction": "That's totally understandable. It's always good to be cautious and informed about what we're consuming. Plant-based options are a great alternative, and it's always fun to try new things. Maybe one day you can try my chili dog casserole too, it's a unique dish that might surprise you!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t10",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,\nSpeaker B: Yes, ice cream shops are the best! They have stir-ins, and the smells are heavenly! Ben and Jerry's used to have a blueberry cheesecake that was amazing! I have only had that and their strawberry flavors. Both were great!",
        "memory_text": "1. Speaker A plans to try the famous hamburgers made by Speaker B at the diner.\n2. Speaker B has invented a chilli dog casserole that Speaker A wants to try.\n3. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce.\n4. Speaker A and Speaker B are involved in different fields of work, cooking and lab research.\n5. Speaker A had cheesy ham and potato soup for dinner.\n6. Speaker B works on weekends at a research lab, showing an interest in neuroscience.",
        "speaker": "Speaker A",
        "raw_prediction": "I agree, there's something special about the atmosphere of an ice cream shop. Blueberry cheesecake sounds delicious! I'll have to try it sometime. Have you ever considered creating a unique ice cream flavor based on your lab work? It could be a fun experiment!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t3",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.",
        "memory_text": "1. Speaker A is a city dweller who walks to work instead of driving.\n2. Speaker B lives in the country, loves nature, and works with animals.\n3. Speaker B enjoys reading the Odd Thomas and Dark Tower series and finds inspiration for their artwork during nature walks.\n4. Speaker A asks about Speaker B's new artwork and acknowledges their need for inspiration.\n5. Speaker A is a fan of the Game of Thrones series and enjoys audiobooks.\n6. Speaker A recommends the new album by Highly Suspect to Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds lovely! I always enjoy walks by rivers. Did you come across any interesting wildlife or plant life along the trail?",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "1. Speaker B lives in the country, loves nature, and works with animals.\n2. Speaker A is a city dweller who walks to work instead of driving.\n3. Speaker B gets along somewhat with their sister.\n4. Speaker A also enjoyed reading 'Redwall' growing up and keeps an eye out for similar books.\n5. Speaker B enjoys reading the Odd Thomas and Dark Tower series and finds inspiration for their artwork during nature walks.\n6. Speaker A is a fan of the Game of Thrones series and enjoys audiobooks.",
        "speaker": "Speaker A",
        "raw_prediction": "Kyrie sounds like such a spirited companion! It must be wonderful having her by your side during your nature walks. It's true, a dog might be a bit challenging to keep in my apartment, but I do admire the energy and loyalty they bring. Do you find that spending time with Kyrie helps inspire your artwork in any way?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t2",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!",
        "memory_text": "1. Speaker B has grandkids who are more interested in phones and tablets than musical instruments.\n2. Speaker B has grandkids and enjoys spending time with them at the park.\n3. Speaker B mentions having grandkids, implying they are older and have a family of their own.\n4. Speaker A's other children are addicted to tablets and phones, unlike the youngest one who is interested in music.\n5. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like.\n6. Speaker B took their grandkids fishing once, with mixed reactions from the kids.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a nice way to keep things personal. Speaking of which, have you tried introducing your grandkids to any traditional hobbies or activities like fishing?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "1. Speaker B has grandkids who are more interested in phones and tablets than musical instruments.\n2. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like.\n3. Speaker B has grandkids and enjoys spending time with them at the park.\n4. Speaker A's other children are addicted to tablets and phones, unlike the youngest one who is interested in music.\n5. Speaker B mentions having grandkids, implying they are older and have a family of their own.\n6. Speaker B has a lot of kids, all grown up now and with kids of their own.",
        "speaker": "Speaker B",
        "raw_prediction": "It can be tough finding the right balance, especially with work taking up so much time. At least you're making the effort to stay connected with your family, even if it's through technology.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t8",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway",
        "memory_text": "1. Speaker A is a retired librarian who enjoys implementing creative activities in their library.\n2. Speaker B has grandkids and enjoys spending time with them at the park.\n3. Speaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature.\n4. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like.\n5. Speaker A and Speaker B agree on the importance of reading and the value of libraries, despite the rise of the internet.\n6. Speaker A sees parents bringing in their little kids to the library as encouraging.",
        "speaker": "Speaker A",
        "raw_prediction": "Thank you so much for the offer, that means a lot. Having your help at the library would truly make a difference, especially during these busy times. I will definitely keep that in mind and reach out when needed.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t10",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway\nSpeaker A: I will keep that in mind as we do have volunteer hours available. How is your family doing these days?\nSpeaker B: Well I would be happy to help. My family are all great thank you for asking I took the grandkids to the park again we had a great time. How's your family doing? ",
        "memory_text": "1. Speaker B has grandkids and enjoys spending time with them at the park.\n2. Speaker B took their grandkids fishing once, with mixed reactions from the kids.\n3. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like.\n4. Speaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature.\n5. Speaker A sees parents bringing in their little kids to the library as encouraging.\n6. Speaker B mentions having grandkids, implying they are older and have a family of their own.",
        "speaker": "Speaker A",
        "raw_prediction": "It's great to hear that your family is doing well! My family is hanging in there, thank you for asking. I wish I could spend more time with them like you do with your grandkids at the park.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?",
        "memory_text": "1. Speaker B likes Persian cats and imagines their pets having interesting interactions.\n2. Speaker B is a painter and is working on a portrait for Speaker A.\n3. Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\n4. Speaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\n5. Speaker A has a brother and might commission a family portrait from Speaker B.\n6. Both Speaker A and Speaker B enjoy the company of their pets and think they are smart and playful.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a fun and unexpected pairing for a portrait! As for the new cat, I'm thinking of adopting from a local shelter. I want to give a loving home to a cat in need.",
        "previous_summary": "Speaker B is in college, paints on the side, and has five dogs and three rats.\nSpeaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\nSpeaker B has five dogs and enjoys taking them to the park.\nSpeaker B is working on other portraits and taking care of a sick dog.\nSpeaker B likes Persian cats and imagines their pets having interesting interactions."
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.",
        "memory_text": "1. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\n2. Speaker B is unsure about what else there is to do in Alaska besides hiking.\n3. Speaker A and Speaker B are planning a trip to Alaska together.\n4. Speaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.\n5. Speaker B is planning an Alaskan vacation but has not planned much yet.\n6. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds amazing! Camping under the Alaskan night sky must be a breathtaking experience. We could even try to catch the northern lights if we're lucky. I'll have to look into the best spots for stargazing in Alaska.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t11",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?\nSpeaker A: I think it could be a good idea, especially with all the large animals in Alaska and the terrain. I wouldn't rely on your friend and have someone more professional that knows a lot just in case. I'm sure the guide could also give you tons of suggestions of things to do while in the area, and maybe even the best ice cream places lol!",
        "memory_text": "1. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\n2. Speaker B is unsure about what else there is to do in Alaska besides hiking.\n3. Speaker A and Speaker B are planning a trip to Alaska together.\n4. Speaker B is planning an Alaskan vacation but has not planned much yet.\n5. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.\n6. Speaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.",
        "speaker": "Speaker B",
        "raw_prediction": "That's a good point. I'll look into hiring a professional guide to ensure a safe and enjoyable trip. It would be great to have someone knowledgeable about the area and activities. I'll make sure to ask them about the best ice cream spots too!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t5",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?",
        "memory_text": "1. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\n2. Speaker A works at a restaurant and invited Speaker B to visit.\n3. Speaker A is a restaurant worker who enjoys working there but finds it very busy.\n4. Speaker B loves the beach and Mediterranean food.\n5. Speaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners.\n6. Speaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.",
        "speaker": "Speaker B",
        "raw_prediction": "Both options sound delicious, but I think I would go for the tres leches cake with fresh raspberry jam sauce and lemon drizzle. It sounds like the perfect combination of sweet and tangy flavors. Enjoy your meal!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t1",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?",
        "memory_text": "1. Speaker B practices Karate and holds a green belt, being involved in other activities and considering going back to school for a certificate in IT work.\n2. Speaker B signed up for classes at the local college and has a background in football and karate.\n3. Speaker B attends football games at their old high school and finds that their football background helps in karate footwork.\n4. Speaker A and Speaker B both have interests in learning new languages.\n5. Speaker B enjoys water-related activities and movies like \"Jaws\".\n6. Speaker A is taking a French class and plans to learn French to dig for clams in Quebec.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I've also dabbled in Taekwondo and Jiu-Jitsu before focusing on Karate. It's been a great journey exploring different disciplines.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t2",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.",
        "memory_text": "1. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\n2. Speaker B is studying linguistics but mentions feeling limited in job opportunities.\n3. Speaker A is interested in teaching computer science, specifically in the field of robotics.\n4. Speaker A and B both value education and continuous learning.\n5. Speaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\n6. Speaker B lives with their mom and is currently in college.",
        "speaker": "Speaker A",
        "raw_prediction": "That's understandable, deciding on a career path can be overwhelming. Teaching could be a rewarding choice, especially in a field you're passionate about like linguistics. Have you considered looking into teaching opportunities at universities or colleges?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t6",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.",
        "memory_text": "1. Speaker A is interested in teaching computer science, specifically in the field of robotics.\n2. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\n3. Speaker B is studying linguistics but mentions feeling limited in job opportunities.\n4. Speaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\n5. Speaker A and B both value education and continuous learning.\n6. Speaker B lives with their mom and is currently in college.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great to hear! English and history are fascinating subjects to teach. It's wonderful to see your interests expanding. Have you considered combining linguistics with history in your teaching career? It could offer a unique perspective and open up more opportunities for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t7",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?",
        "memory_text": "1. Speaker A is interested in teaching computer science, specifically in the field of robotics.\n2. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\n3. Speaker B is studying linguistics but mentions feeling limited in job opportunities.\n4. Speaker A and B both value education and continuous learning.\n5. Speaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\n6. Speaker B suggests trying the game Elder Scrolls, knowing Speaker A plays World of Warcraft.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm really drawn to ancient civilizations and how they shaped the world we live in today. It's fascinating to see the connections between the past and the present. Maybe I could combine my love for linguistics with historical research in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?",
        "memory_text": "1. Speaker B expresses concern about leaving a kitten alone during their family camping adventures.\n2. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.\n3. Speaker A enjoys visiting the zoo and grew up in big cities.\n4. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\n5. Speaker B's child wants to visit the zoo, particularly to see the monkeys.\n6. Speaker A is offering advice and seems to have experience with children.",
        "speaker": "Speaker B",
        "raw_prediction": "One of our favorite places to camp is by the lake up in the mountains. It's so peaceful and beautiful there. But sometimes I worry about leaving our kitten alone at home while we're away.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t6",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?",
        "memory_text": "1. Speaker A enjoys visiting the zoo and grew up in big cities.\n2. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\n3. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.\n4. Speaker B expresses concern about leaving a kitten alone during their family camping adventures.\n5. Speaker B is interested in finding family discounts for the zoo.\n6. Speaker B's child wants to visit the zoo, particularly to see the monkeys.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I did! I went to see the tigers and monkeys. It's always a great experience.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t9",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.\nSpeaker A: No, I acctually haven't. I'm expecting pineapple and ham on everything, but I know they will having some amazing cultural food that is probably going to blow my mind! Is there a specific dish you would recommend",
        "memory_text": "1. Speaker A has seen the Disney movie 'Luca' recently.\n2. Speaker A has booked a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.\n3. Speaker B's kids enjoyed watching 'Luca' and said it was good.\n4. Speaker A works two jobs and struggles to make time for themselves, but still manages to plan a trip to Hawaii.\n5. Speaker B's kids enjoy watching Disney movies, which Speaker B also finds good.\n6. Speaker B enjoys watching movies with her kids.",
        "speaker": "Speaker B",
        "raw_prediction": "You're in for a treat! I highly recommend trying poi, kalua pig, and of course, some delicious shave ice for dessert. The flavors are so unique and vibrant, I'm sure you'll love it!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.",
        "memory_text": "1. Speaker A plans to take Speaker B on tours and attend folk concerts during the visit.\n2. Speaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n3. Speaker A invited Speaker B to visit and mentioned looking into flights.\n4. Speaker A has invited Speaker B to visit them and is excited about the trip.\n5. Speaker A mentioned the warm weather at their location.\n6. Speaker A has visited Alaska and describes it as beautiful, suggesting cheap flights to Anchorage.",
        "speaker": "Speaker A",
        "raw_prediction": "You'll be happy to hear that in the summer, walking and biking are great options here! The snow melts, and the city is very pedestrian-friendly. Renting a car isn't necessary, but it could be convenient if we decide to go on a glacier tour or pet some wolves.",
        "previous_summary": "Speaker A drives a smart car and used to have a long commute in Alaska.\nSpeaker A mentions the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer.\nSpeaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\nSpeaker A plans to take Speaker B on tours and attend folk concerts during the visit."
    },
    {
        "utter_id": "e16-s5-t1",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. ",
        "memory_text": "1. Speaker B's wife is pregnant, so they are considering attending a local festival for just a day.\n2. Speaker A and Speaker B enjoy bluegrass music.\n3. Speaker A and Speaker B discuss the logistics of attending a festival with a small baby.\n4. Speaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy.\n5. Speaker A frequents live band venues and plays music at home.\n6. Speaker B is not going out drinking much due to their wife's pregnancy.",
        "speaker": "Speaker B",
        "raw_prediction": "That's really thoughtful of you to offer the cabin! I'll talk to my wife and see if that could work for us. It would definitely make things more comfortable for her during the festival. Thank you for the suggestion.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t2",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.",
        "memory_text": "1. Speaker A and Speaker B enjoy bluegrass music.\n2. Speaker B's wife is pregnant, so they are considering attending a local festival for just a day.\n3. Speaker A and Speaker B discuss the logistics of attending a festival with a small baby.\n4. Speaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy.\n5. Speaker A frequents live band venues and plays music at home.\n6. Speaker B's wife is pregnant and has three more months to go until the due date.",
        "speaker": "Speaker B",
        "raw_prediction": "That's incredibly kind of you and your friend! We'd definitely appreciate the offer to stay in the cabin. We'll make sure to discuss the details and let you know. It would be great for my wife to have some extra comfort during the festival.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "1. Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\n2. Speaker A likes cooking new dishes and following recipes occasionally.\n3. Speaker A enjoys cooking and finds it helpful for stress relief.\n4. Speaker A plays the drums and loves making food for others.\n5. Speaker A cooked steak, fried potatoes, and shrimp for dinner with their father.\n6. Speaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking.",
        "speaker": "Speaker A",
        "raw_prediction": "I haven't tried anything new recently, but I'm always up for experimenting with different flavors. I'll definitely take you up on the offer to learn how to make your spicy fried rice. Cooking together sounds like a great way to spend time.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.",
        "memory_text": "1. Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\n2. Speaker A likes cooking new dishes and following recipes occasionally.\n3. Speaker A plays the drums and loves making food for others.\n4. Speaker A enjoys cooking and finds it helpful for stress relief.\n5. Speaker A cooked steak, fried potatoes, and shrimp for dinner with their father.\n6. Speaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, they did have al pastor! The marinated pork was so flavorful and juicy, it was definitely one of the highlights. I'll have to bring you some next time I visit, along with some of my latest cooking experiments. What's your favorite Mexican dish to cook at home?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?",
        "memory_text": "1. Speaker B played intramural soccer in college and is a fan of Manchester United.\n2. Speaker A is a member of a soccer team and enjoys playing in tournaments.\n3. Speaker A plays soccer as a striker and has a match next week.\n4. Speaker A has been scoring well in soccer recently.\n5. Speaker A is a college student studying Humanities and wants to finish college before looking for a job.\n6. Speaker A is a fan of Arsenal and enjoys watching international teams play.",
        "speaker": "Speaker B",
        "raw_prediction": "I mainly played as a midfielder, but I also filled in as a defender when needed. How about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t8",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.",
        "memory_text": "1. Speaker A is a member of a soccer team and enjoys playing in tournaments.\n2. Speaker A plays soccer as a striker and has a match next week.\n3. Speaker A has been scoring well in soccer recently.\n4. Speaker B played intramural soccer in college and is a fan of Manchester United.\n5. Speaker A is a fan of Arsenal and enjoys watching international teams play.\n6. Speaker A is seeking career advice from a guidance counselor and is open to suggestions.",
        "speaker": "Speaker A",
        "raw_prediction": "Casual games are always a great way to ease back into playing. It will be fun to have you join us on the field for a friendly match. I'll let you know when we organize the next one!",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?",
        "memory_text": "1. Speaker A is a member of a soccer team and enjoys playing in tournaments.\n2. Speaker A plays soccer as a striker and has a match next week.\n3. Speaker A has been scoring well in soccer recently.\n4. Speaker B played intramural soccer in college and is a fan of Manchester United.\n5. Speaker A is a fan of Arsenal and enjoys watching international teams play.\n6. Speaker A is a college student studying Humanities and wants to finish college before looking for a job.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm pretty flexible with my schedule, so just let me know what works for you and I'll try to make it work. I'm excited to get back out on the field again!",
        "previous_summary": "Speaker B is 26 years old, works 12 hours a day, has a background in Humanities but now works as a law clerk.\nSpeaker B is currently working and mentioned the importance of taking breaks from work.\nSpeaker B is considering looking for a new job for higher pay but is comfortable at the current job."
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "1. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n2. Speaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\n3. Speaker B is interested in sports medicine and enjoys surfing.\n4. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n5. Speaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\n6. Speaker B is studying sports medicine and plays soccer, looking to join their college team in the future.",
        "speaker": "Speaker A",
        "raw_prediction": "It's great that you're already planning ahead for internships. As for my knees, it's just wear and tear from years of hiking and being active. Surfing could be a good way for you to relax and network. Have you tried reaching out to any sports medicine clinics or local teams for internship opportunities?",
        "previous_summary": "Speaker A is retired and spends most days hiking.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B is interested in sports medicine and enjoys surfing."
    },
    {
        "utter_id": "e19-s5-t9",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? ",
        "memory_text": "1. Speaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\n2. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n3. Speaker B is interested in sports medicine and enjoys surfing.\n4. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n5. Speaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\n6. Speaker B is studying sports medicine and plays soccer, looking to join their college team in the future.",
        "speaker": "Speaker B",
        "raw_prediction": "I haven't decided yet, but I do dream of having a career that allows me to travel and work in different places. Maybe I'll find a job that combines my passion for sports medicine and exploring new countries. It sounds like you've had some incredible adventures with your travels.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!",
        "memory_text": "1. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A and Speaker B share a love for music and plan to have a house concert with their pets.\n3. Speaker B is interested in taking a Disney cruise and has been watching videos on YouTube about them.\n4. Speaker A has a pet raccoon and has a friend who found baby raccoons.\n5. Speaker A's friend found two baby raccoons in her yard, one of which was given to Speaker A to keep as a pet.\n6. Speaker A is not interested in going on a cruise and would prefer camping as a vacation.",
        "speaker": "Speaker B",
        "raw_prediction": "Oh, Journey must really love pizza! Sid would probably try to steal a piece too if he could. Maybe we can have a mini house concert soon to distract them from the pizza temptation. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t2",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?",
        "memory_text": "1. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A's friend found two baby raccoons in her yard, one of which was given to Speaker A to keep as a pet.\n3. Speaker A is not interested in going on a cruise and would prefer camping as a vacation.\n4. Speaker A does not play music for the animals at the zoo to keep them calm.\n5. Speaker A and Speaker B share a love for music and plan to have a house concert with their pets.\n6. Speaker B asks Speaker A if they have had a pet raccoon before.",
        "speaker": "Speaker A",
        "raw_prediction": "I have to be really careful and keep an eye on her whenever there's food around. I usually try to distract her with some of her favorite treats to keep her from going after my food!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t4",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?",
        "memory_text": "1. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature.\n3. Speaker B has two terrier dogs as pets.\n4. Speaker A and Speaker B share a love for music and plan to have a house concert with their pets.\n5. Speaker B asks Speaker A if they have had a pet raccoon before.\n6. Speaker A has a pet raccoon and has a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "Sid surprisingly doesn't have much of an interest in human food, which is a relief. I guess I lucked out there! But he does love to bask in the sunlight near the window, it's adorable.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t5",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?",
        "memory_text": "1. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature.\n3. Speaker B has two terrier dogs as pets.\n4. Speaker A and Speaker B share a love for music and plan to have a house concert with their pets.\n5. Speaker B asks Speaker A if they have had a pet raccoon before.\n6. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.",
        "speaker": "Speaker B",
        "raw_prediction": "They're doing alright, thank you for asking. My elderly terriers are enjoying some relaxation time before I start my new job. It's nice to have this break to spend more time with them. I bet your pets are keeping you on your toes with their antics!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "1. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature.\n3. Speaker B has two terrier dogs as pets.\n4. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.\n5. Speaker A and Speaker B share a love for music and plan to have a house concert with their pets.\n6. Speaker B asks Speaker A if they have had a pet raccoon before.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm glad to hear you're able to spend more time with your dogs now! It can be tough balancing work and pet care, but I try to make sure they have plenty of toys and activities to keep them busy while I'm away. Plus, coming home to their happy faces makes it all worth it.",
        "previous_summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations."
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?",
        "memory_text": "1. Speaker A suggested the name Zhao for one of the kittens.\n2. Speaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\n3. Speaker B has an older mellow cat and is concerned about training the new energetic kittens.\n4. Speaker A has a parrot as a pet and is considering adopting a rescue kitten.\n5. Speaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\n6. Speaker B lives in the city they grew up in, loves animals, and has a cat that recently had a kitten.",
        "speaker": "Speaker A",
        "raw_prediction": "I think Oreo is a cute name! It suits her coloring perfectly. Have you thought of names for the other kittens yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t7",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.",
        "memory_text": "1. Speaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\n2. Speaker A has a parrot as a pet and is considering adopting a rescue kitten.\n3. Speaker A is interested in training tips for the kittens and is open to adopting one despite having a parrot.\n4. Speaker A's parrot Tasha has seen cats before and ignores them.\n5. Speaker B lives in the city they grew up in, loves animals, and has a cat that recently had a kitten.\n6. Speaker B has an older mellow cat and is concerned about training the new energetic kittens.",
        "speaker": "Speaker B",
        "raw_prediction": "I totally get that! Fall is the perfect time for hiking - cool weather and no bugs to bother you. I can't wait for the season to change so I can hit the trails without feeling like a snack for mosquitoes.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.\nSpeaker B: That is funny. And impressive that you're learning. The closest I can get to another language is doing a bad New York accent LOL",
        "memory_text": "1. Speaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\n2. Speaker A has been learning Mandarin and Tasha has started saying Chinese phrases instead of English ones.\n3. Speaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\n4. Speaker B finds it amusing that Tasha speaks Mandarin and mutters things under her breath.\n5. Speaker A's parrot Tasha has seen cats before and ignores them.\n6. Speaker A has a parrot as a pet and is considering adopting a rescue kitten.",
        "speaker": "Speaker A",
        "raw_prediction": "Haha, well, a bad New York accent can be quite entertaining too! Maybe you can teach one of the kittens to meow with a New York accent, that would be a riot.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.",
        "memory_text": "1. Speaker B recently went on a long hike and enjoyed it\n2. Speaker A leads hikes for the group they camp with, which are usually an hour or two long.\n3. Speaker A has planned several camping trips for the summer and will be doing a part of the Appalachian Trail.\n4. Speaker A is nervous about the Appalachian Trail hike, as they don't usually do full day hikes.\n5. Speaker B shared tips on repelling mosquitos using sprays with 20% DEET and other active ingredients.\n6. Speaker A enjoys hiking, birdwatching, and spotting rare animals.",
        "speaker": "Speaker B",
        "raw_prediction": "It's great that you're getting out there and leading hikes for your friends, even if they tire out quickly. Maybe you can gradually build up their stamina and get them excited about longer hikes!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t1",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?",
        "memory_text": "1. Speaker B has a government job that pays the bills but wishes they could work in interior design.\n2. Speaker A finds job searching challenging and hopes to settle in the new city soon with a steady income.\n3. Speaker A is applying for a project coordinator role at a charity but aspires to become a project manager in the future.\n4. Speaker B has two kids and enjoys painting and taking naps.\n5. Speaker A has recently received a call for a job interview and is excited about it.\n6. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.",
        "speaker": "Speaker B",
        "raw_prediction": "I've definitely thought about it. Interior design is a passion of mine, but the stability of my government job is hard to walk away from with two kids to support. Maybe one day I'll take the leap and pursue something more creative full-time.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t2",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.",
        "memory_text": "1. Speaker B has a government job that pays the bills but wishes they could work in interior design.\n2. Speaker A has a passion for producing horror movies and believes everyone loves them.\n3. Speaker A also likes mid-century design and is a fan of horror movies.\n4. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\n5. Speaker B has two kids and enjoys painting and taking naps.\n6. Speaker A finds job searching challenging and hopes to settle in the new city soon with a steady income.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great to hear that you're enjoying producing horror movies! It's wonderful to have a creative passion that brings you fulfillment. Maybe you can find a way to incorporate your love for painting into your movie sets or props. It could add a unique touch to your films and combine your talents in a new and exciting way.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t3",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?",
        "memory_text": "1. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\n2. Speaker A has a passion for producing horror movies and believes everyone loves them.\n3. Speaker A also likes mid-century design and is a fan of horror movies.\n4. Speaker B has a government job that pays the bills but wishes they could work in interior design.\n5. Speaker A prefers classic horror movies like Halloween or Friday the 13th over modern ones.\n6. Speaker A has recently received a call for a job interview and is excited about it.",
        "speaker": "Speaker B",
        "raw_prediction": "Oh, the stories from the set are endless! One time, my dad and I were brainstorming for a new movie idea, and we ended up scaring ourselves so much that we had to keep the lights on all night. It was both thrilling and hilarious at the same time.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t11",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.\nSpeaker A: Yes. Thanks for the reminder.  I have a couple of more companies to research today.  Of course, it is always interesting to figure out what a company's corporate culture is. ",
        "memory_text": "1. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\n2. Speaker A is preparing for an upcoming interview and is nervous about it.\n3. Speaker A has a passion for producing horror movies and believes everyone loves them.\n4. Speaker A has recently received a call for a job interview and is excited about it.\n5. Speaker A also likes mid-century design and is a fan of horror movies.\n6. Speaker A is nervous about an upcoming interview and wishes for a government job like Speaker B's.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear! Understanding a company's culture can really give you an edge in the interview. It shows you're not just interested in the job but also in being a good fit for their team. Good luck with your research and interviews!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t6",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?",
        "memory_text": "1. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology.\n2. Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\n3. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.\n4. Speaker B has been to Italy in the past and enjoyed the food there.\n5. Speaker B enjoys Greek mythology and did a case study on Poseidon, the God of the Sea, Earthquakes, and Horses.\n6. Speaker A is going to a hair appointment for their birthday.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm glad to hear your daughter is getting into Greek mythology! It's great to share those interests with the next generation. Also, my blue hair has grown out now. I'm actually heading to a hair appointment for my birthday to decide on a new color.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t2",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?",
        "memory_text": "1. Speaker B's husband is an avid cook who enjoys making Asian food with lots of prep work.\n2. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker.\n3. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.\n4. Speaker A recommends the pressure cooker for its efficiency and ease of use, suggesting it to Speaker B.\n5. Speaker A has given a pressure cooker as a gift and uses it for recipes like lamb shanks.\n6. Speaker B's husband is a great cook and Speaker B is not skilled in cooking.",
        "speaker": "Speaker A",
        "raw_prediction": "I would recommend starting with a simple recipe like a chicken curry or a vegetable stir-fry. Both are delicious and easy to make in a pressure cooker. Plus, they will give you a good feel for using the appliance before moving on to more complex dishes. Enjoy your cooking adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t4",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?",
        "memory_text": "1. Speaker A and their brother enjoy going to a Brazilian steakhouse for dinner.\n2. Speaker A's brother enjoys Brazilian food, specifically steak.\n3. Speaker A enjoys salsa dancing and is planning to go out dancing.\n4. Speaker B works as a bartender and enjoys meeting different people.\n5. Speaker B expressed interest in trying healing methods mentioned by Speaker A.\n6. Speaker A is planning to take their clients salsa dancing for fun.",
        "speaker": "Speaker A",
        "raw_prediction": "We had delicious Brazilian steak and some traditional side dishes like feijoada and pão de queijo. It was a perfect dinner before hitting the dance floor for some salsa!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!",
        "memory_text": "1. Speaker B expressed interest in trying healing methods mentioned by Speaker A.\n2. Speaker A and their brother enjoy going to a Brazilian steakhouse for dinner.\n3. Speaker A's brother enjoys Brazilian food, specifically steak.\n4. Speaker B works as a bartender and enjoys meeting different people.\n5. Speaker A finds being on the water therapeutic and relaxing.\n6. Speaker A enjoys salsa dancing and is planning to go out dancing.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm glad you find healing methods fascinating! Actually, some people believe in the healing properties of certain foods. For example, bone broth is said to be good for gut health and overall well-being. Have you ever tried bone broth before?",
        "previous_summary": "Speaker A is involved in healing work and mentioned hot latina salsa.\nSpeaker A recommended self-massage, essential oils, reiki, meditation, and self-awareness for healing.\nSpeaker A finds being on the water therapeutic and relaxing.\nSpeaker A is a Reiki practitioner who also works with meditation."
    },
    {
        "utter_id": "e28-s5-t4",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get ",
        "memory_text": "1. Speaker A struggles with gardening but finds the idea of space plants intriguing.\n2. Speaker B is knowledgeable about plants and gardening, with a thriving garden.\n3. Speaker B mentions weight gain from spending time at the computer and plans to work in the garden more.\n4. Speaker A jokes about space weeds and expresses a desire to see space.\n5. Speaker A plays the clarinet in a band concert and has a solar investment for their office building.\n6. Speaker A's parents are teachers.",
        "speaker": "Speaker A",
        "raw_prediction": "I see what you mean. Maybe I can start with some smaller plants and work my way up to trees. I definitely want that authentic garden experience, just on a slightly smaller scale!",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "1. Speaker A struggles with gardening but finds the idea of space plants intriguing.\n2. Speaker B is knowledgeable about plants and gardening, with a thriving garden.\n3. Speaker B mentions weight gain from spending time at the computer and plans to work in the garden more.\n4. Speaker A's parents are teachers.\n5. Speaker A jokes about space weeds and expresses a desire to see space.\n6. Speaker B is also interested in space exploration and plant science, expressing concerns about the fuels used for space travel.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm doing well at school, thanks for asking! Learning about gardening is a whole different world for me, but I'm excited to give it a try. It's like a whole new subject to explore, just like space plants!",
        "previous_summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker A's parents are teachers.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden."
    },
    {
        "utter_id": "e29-s5-t5",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?",
        "memory_text": "1. Speaker B works for a computer company and is unable to change careers until their child graduates.\n2. Speaker A works for a small local business with a demanding schedule.\n3. Speaker A enjoys reading books about ice cream, Disney World, and computers.\n4. Speaker B's mother is a dentist and loves her job.\n5. Speaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\n6. Speaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.",
        "speaker": "Speaker B",
        "raw_prediction": "I've been with the company for about five years now. It's been a good experience overall. How are you feeling about your job? Are you considering any changes in the future?",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?\nSpeaker B: For about four years. It's an industry in flux which is stressful. I need stability for my family at this point. It has changed my focus, which I'm not used to yet. Are you considering any other options for work?",
        "memory_text": "1. Speaker B works for a computer company and is unable to change careers until their child graduates.\n2. Speaker A works for a small local business with a demanding schedule.\n3. Speaker A is 27 years old and hopes to change careers soon.\n4. Speaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.\n5. Speaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\n6. Speaker A does not have children and spends time working and reading.",
        "speaker": "Speaker A",
        "raw_prediction": "I can imagine how stressful that must be with the industry constantly changing. As for me, I've been thinking about changing careers lately. I'm torn between pursuing dentistry for financial stability or working at Disney for personal happiness. It's a tough decision to make.",
        "previous_summary": "Speaker A is 27 years old and hopes to change careers soon.\nSpeaker A's father was in the military.\nSpeaker A works for a small local business with a demanding schedule.\nSpeaker A does not have children and spends time working and reading.\nSpeaker A considers quitting their job to work at Disney World.\nSpeaker A is considering becoming a dentist and wants to talk to Speaker B's mother who is a dentist.\nSpeaker A has been looking at dental programs in colleges.\nSpeaker A has not found a dental program yet but plans to keep looking.\nSpeaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\nSpeaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.\nSpeaker A is considering going back to school for dentistry in the future."
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?",
        "memory_text": "1. Speaker A enjoys origami and tried making a Lotus flower successfully.\n2. Speaker A learned origami by themselves in their craft room.\n3. Speaker A offered to teach Speaker B origami in a few weeks.\n4. Speaker A is interested in trying to make a lotus origami next.\n5. Speaker A volunteers at a hospital and enjoys making origami crafts, specifically a 3D modular swan with glue.\n6. Speaker B is interested in making origami animals and finds the idea cute.",
        "speaker": "Speaker A",
        "raw_prediction": "Absolutely! Like with any skill, practice definitely helps improve your origami abilities. Starting with simple designs and gradually moving on to more complex ones is a great way to enhance your folding techniques. Plus, the satisfaction of completing a beautiful origami creation is truly rewarding!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. \nSpeaker A: Boating is so fun. You could go wakeboarding more often if you had your own boat. And no more boat rental fees or hassle.\nSpeaker B: I actually saw a drone the at will pull you in the water. It's the craziest thing.  \nSpeaker A: That must be a huge drone!",
        "memory_text": "1. Speaker B is excited to join Speaker A's family for a water skiing trip and wants to learn from Speaker A's kids.\n2. Speaker A loves boating and water sports, mentioning that they are better at water skiing than wakeboarding.\n3. Speaker B expresses interest in trying water skiing next.\n4. Speaker A has been water skiing for 15 years and has 3 kids who also water ski.\n5. Speaker B enjoys snowboarding but will focus on wakeboarding as summer approaches.\n6. Speaker A takes their boat out every day and wishes they had a houseboat.",
        "speaker": "Speaker B",
        "raw_prediction": "Yeah, those drones for water sports are pretty cool. They can make wakeboarding or water skiing more accessible without needing a boat. Maybe that could be a fun alternative for you to try out!",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.",
        "memory_text": "1. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\n2. Speaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\n3. Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\n4. Speaker A and Speaker B both enjoy playing video games in their free time.\n5. Speaker B mentions that Resident Evil can be scary and provides some tips for playing it.\n6. Speaker A prefers tamer video games and is not a fan of horror movies.",
        "speaker": "Speaker A",
        "raw_prediction": "How about we try playing a casual online co-op game like Overcooked or Stardew Valley? They're fun and don't require intense competition or rankings. Plus, we can just relax and enjoy playing together without any pressure. What do you think about that?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?\nSpeaker B: Unfortunately I mainly play games similar to RE. I don't know why I like them so much. I remember when I was little my brother play Doom and it gave me nightmares for a week. What genre of games you like?\nSpeaker A: I like all kinds of games. I like party, fighting, RPGs, shooters, action, adventure, and puzzle games. I enjoy playing Jurassic Park: World but I'd like to find another game to play. The storm means I'll be inside for a bit, so I think I'll curl up with some pizza and just zone out. Do you like to do anything else besides game when it's rainy?\nSpeaker B: Well, I might help around the house with cleaning or laundry, but not that much. Mostly gaming. If I feel I sat too long, I'll switch to Nintendo Switch's Ring Fit Adventure to get my body moving a bit. Do yo know that game?\nSpeaker A: I've heard of it. I think I need to get some exercise, so that might be a good idea. I'd like to stay in shape as much as I can. I guess games are the best way to do that! That's a good suggestion. How about you? Do you only like games like RE? What other genres do you like?\nSpeaker B: I like fighting too, but not RPG types. I tried racing games before, but clearly not good at it so I'm not enjoying them that much. \nSpeaker A: Maybe when you get the chance, we should play an online game together. I'm not a competitive person. I mainly play games for fun and I don't care if I win or lose. What do you think?\nSpeaker B: Sure! Do you have any suggestion for the game? I also not that competitive, which probably is the reason why I don't enjoy RPG types that much with all their groups and clans and ranks. I always thought RPG players are all these serious gamers.\nSpeaker A: Maybe we can a play fighting game like Street Fighter or Mortal Kombat. It's a good way to pass the time. I've always wanted to learn martial arts myself. Ha!",
        "memory_text": "1. Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\n2. Speaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\n3. Speaker A and Speaker B both enjoy playing video games in their free time.\n4. Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\n5. Speaker B mentions that Resident Evil can be scary and provides some tips for playing it.\n6. Speaker B likes to play golf when not playing video games.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a great idea! I haven't played Street Fighter in a while, so it would be fun to jump back into it with you. I'm up for some friendly matches anytime. Let's see who can master those special moves first!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t4",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!",
        "memory_text": "1. Speaker B has a cat that recently had a kitten and enjoys visiting the zoo.\n2. Speaker B is considering adopting a kitten from a friend.\n3. Speaker A has been to the zoo before and enjoys seeing exotic birds.\n4. Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\n5. Speaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\n6. Speaker A prefers cockatoos over kittens as pets.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a fantastic trip! San Diego Zoo is amazing. You'll have a great time exploring all the different exhibits and animals there. Make sure to visit the pandas and penguins while you're there, they're always a delight to see!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t5",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?",
        "memory_text": "1. Speaker B has a cat that recently had a kitten and enjoys visiting the zoo.\n2. Speaker A has been to the zoo before and enjoys seeing exotic birds.\n3. Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\n4. Speaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\n5. Speaker B is considering adopting a kitten from a friend.\n6. Speaker A prefers cockatoos over kittens as pets.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I've been to San Diego Zoo a couple of times, and it's amazing! They have a fantastic variety of animals, especially the pandas and penguins. It's definitely worth a visit if you enjoy zoos.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...",
        "memory_text": "1. Speaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\n2. Speaker B has a cat that recently had a kitten and enjoys visiting the zoo.\n3. Speaker A has been to the zoo before and enjoys seeing exotic birds.\n4. Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\n5. Speaker B is considering adopting a kitten from a friend.\n6. Speaker A has a sister who owns a corgi.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a great idea! My sister's corgi would love to join us, and I bet she'd enjoy seeing all the exotic birds there too. I'll definitely plan a trip to the zoo soon. Thanks for the suggestion!",
        "previous_summary": "Speaker A works at a local fast-food restaurant to pay bills and enjoys reading and gardening.\nSpeaker A's sister recently got married, which was exciting for them.\nSpeaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\nSpeaker A's sister is a dog person with a yellow lab.\nSpeaker A has a sister who owns a corgi."
    },
    {
        "utter_id": "e35-s5-t7",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!",
        "memory_text": "1. Speaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father.\n2. Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest.\n3. Speaker A works at a coffee shop and is saving up for their next tattoo.\n4. Speaker B enjoys fishing and wishes their wife and sons could have joined them on the trip.\n5. Speaker A and Speaker B have a conversation about their personal interests and trips they have taken for work.\n6. Speaker A works at a coffee shop that their mom owned.",
        "speaker": "Speaker B",
        "raw_prediction": "I can't imagine the fallout from not discussing it first! I'll definitely have a chat with my wife before making any decisions. It's all about communication, right?",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.",
        "memory_text": "1. Speaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father.\n2. Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest.\n3. Speaker A works at a coffee shop and is saving up for their next tattoo.\n4. Speaker A and Speaker B have a conversation about their personal interests and trips they have taken for work.\n5. Speaker B enjoys fishing and wishes their wife and sons could have joined them on the trip.\n6. Speaker A works at a coffee shop that their mom owned.",
        "speaker": "Speaker B",
        "raw_prediction": "It's important to prioritize what makes you happy. Relationships aren't for everyone, and focusing on your artwork sounds like a great plan. Your tattoos must hold a lot of personal meaning for you, especially the one dedicated to your father.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. ",
        "memory_text": "1. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.\n2. Speaker B believes raccoons can make good pets if cared for properly.\n3. Speaker B has been taking care of the raccoon for over a month and is interested in training it.\n4. Speaker A hears raccoons and cats fighting in their neighborhood.\n5. Speaker A is worried about the raccoon potentially eating the bearded dragon.\n6. Speaker A is interested in animals, specifically raccoons and bearded dragons.",
        "speaker": "Speaker B",
        "raw_prediction": "I understand your concern. It's important to keep your home and pets safe. Hopefully, with the aluminum sheeting in place, you won't have to worry about unwanted visitors. Just keep an eye out for any signs of raccoons trying to get in.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "1. Speaker B has been taking care of the raccoon for over a month and is interested in training it.\n2. Speaker B believes raccoons can make good pets if cared for properly.\n3. Bandicoot was a rescue and has been at the Raccoon Cafe since he was a baby.\n4. Speaker B has a dog named Bandicoot and is willing to bring him over for extra company.\n5. Speaker A is worried about the raccoon potentially eating the bearded dragon.\n6. Speaker A is interested in animals, specifically raccoons and bearded dragons.",
        "speaker": "Speaker A",
        "raw_prediction": "I've definitely considered it, but with my current schedule and living situation, it's not the right time for me to commit to adopting a dog permanently. Maybe in the future when things are more settled, I'll look into it.",
        "previous_summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker A fosters dogs and is used to them coming and going."
    },
    {
        "utter_id": "e37-s5-t1",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.",
        "memory_text": "1. Speaker A has grandchildren and mentions watching them.\n2. Speaker A is tired after spending time with their energetic grandchildren.\n3. Speaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.\n4. Speaker A suggests taking naps during quiet times and mentions watching her grandkids.\n5. Speaker A is older and babysits their grandchildren about four days a week and most weekends.\n6. Speaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a relaxing way to spend your day off from babysitting. What book did you pick up?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?",
        "memory_text": "1. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker A has a cat that recently had a kitten.\n3. Speaker B is not a cat person but ends up taking care of stray cats brought home by kids.\n4. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.\n5. Speaker A usually leaves their cats with a friend while traveling.\n6. Speaker B loves dogs.",
        "speaker": "Speaker A",
        "raw_prediction": "They are getting along surprisingly well! Ginger seems to have taken on the role of a protective big sister, and Pumpkin is just a bundle of energy and mischief. It's quite entertaining to watch them interact, even for a non-cat person like you!",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t10",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat\nSpeaker A: That would be cruel to do. You need to rehome them properly or otherwise someone may report you to the authorities for animal abuse. My heart is breaking for your poor cats. \nSpeaker B: Thank you for concerning. I am trying to be nice to them do not worry ",
        "memory_text": "1. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker B is not a cat person but ends up taking care of stray cats brought home by kids.\n3. Speaker A has a cat that recently had a kitten.\n4. Speaker A usually leaves their cats with a friend while traveling.\n5. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.\n6. Speaker B loves dogs.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm glad to hear that you're trying to be nice to them, even if cats aren't your favorite. It's important to give them a good home and take care of them properly. Maybe one day you'll become a cat person after all!",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t3",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?",
        "memory_text": "1. Speaker B has two pet snakes named Hansel and Gretel.\n2. Speaker A finds it amusing that Speaker B prefers animals to humans.\n3. Speaker B prefers animals to humans but acknowledges the importance of curing diseases.\n4. Speaker A is scared of sharks but finds the idea of going into a steel cage with them interesting.\n5. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n6. Speaker B has experience scuba diving in Hawaii and found it to be amazing and beautiful.",
        "speaker": "Speaker B",
        "raw_prediction": "I love how fascinating they are to observe. Their movements and behavior are so different from traditional pets like cats and dogs. It's like having a window into a completely different world right in my living room.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t5",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? ",
        "memory_text": "1. Speaker B has two pet snakes named Hansel and Gretel.\n2. Speaker A finds it amusing that Speaker B prefers animals to humans.\n3. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n4. Speaker A's interest in neuroscience was further fueled by their experience in a research lab and being in the Eagle Scouts.\n5. Speaker A is interested in scuba diving and neuroscience, with experience in a research lab.\n6. Speaker B goes to Hawaii for scuba diving and is considering studying marine life or a different type of animal.",
        "speaker": "Speaker B",
        "raw_prediction": "I wish I could, but unfortunately, most dorms don't allow pets. I'll have to make do with visiting them during breaks.",
        "previous_summary": "Speaker A is a student planning to go to college next year and wants to study neuroscience.\nSpeaker B has two pet snakes named Hansel and Gretel."
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.",
        "memory_text": "1. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n2. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\n3. Speaker B is a member of the boy scouts and works at a fast food place\n4. Speaker B plans to earn the Eagle Scout badge for college applications.\n5. Speaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat.\n6. Speaker A is involved in church activities and mentioned a church retreat",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds really valuable for kids to learn. Maybe I should look into getting them involved in Boy Scouts. Hey, speaking of retreats, are you still up for joining the youth retreat next month?",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t5",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?",
        "memory_text": "1. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\n2. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n3. Speaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat.\n4. Speaker A is involved in church activities and mentioned a church retreat\n5. Speaker B is a member of the boy scouts and works at a fast food place\n6. Speaker B plans to earn the Eagle Scout badge for college applications.",
        "speaker": "Speaker B",
        "raw_prediction": "The last camping trip I went on was to a national park a few hours away. We hiked through the trails, cooked our meals over the campfire, and even saw some wildlife up close. It was such a memorable experience, and I can't wait for the next adventure.",
        "previous_summary": "Speaker A recently gave birth to twins and is a stay-at-home mom.\nSpeaker A wants more children and feels lonely due to their husband's frequent traveling."
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!",
        "memory_text": "1. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\n2. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n3. Speaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat.\n4. Speaker A is involved in church activities and mentioned a church retreat\n5. Speaker B is a member of the boy scouts and works at a fast food place\n6. Speaker B plans to earn the Eagle Scout badge for college applications.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like quite the adventure! I bet the scouts had a blast exploring the wilderness and encountering wildlife. It must have been an unforgettable experience for you all.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t11",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!\nSpeaker A: Wow, that sounds like such an adventure! I love to visit Canada. I have seen moose but never a bear! That must have been scary!\nSpeaker B: Yes, it is quite scary. We could also hear the wolves howling at night, luckily we didn't come across them though. One thing to note about bears, is they just want to come and scrounge for our food, so we learned to safely pack it away and hang it up high in a tree.\nSpeaker A: Yes, I've heard that it's important to be careful in bear country! I would love to see one in person though. Do you take lots of photos on your trips?\nSpeaker B: Yes, I took quite a few. The scenery was stunning. Would you like me to send you some photos? I know they are uninteresting to some people.\nSpeaker A: Oh yes, I would love to see some photos! It will be a while before I can take a vacation myself so it's fun to see other people's adventures!",
        "memory_text": "1. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\n2. Speaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat.\n3. Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\n4. Speaker B has not taken any vacations recently but has vacation days saved up\n5. Speaker A is involved in church activities and mentioned a church retreat\n6. Speaker A wants more children and feels lonely due to their husband's frequent traveling.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll make sure to send you some photos soon. It's always nice to share the beauty of nature with others, especially when they can't get out there themselves. It's like bringing a piece of the wilderness to you.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.",
        "memory_text": "1. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.\n2. Speaker A is taking a history of martial arts class and enjoys it.\n3. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things.\n4. Speaker A is a martial arts teacher and student and is pursuing an athletic training degree in college.\n5. Speaker B is busy debugging software and is a runner.\n6. Speaker A is a college student who teaches jiu-jitsu and is lactose intolerant.",
        "speaker": "Speaker A",
        "raw_prediction": "Teaching in a group setting can be really rewarding. It sounds like you have your hands full with debugging the software. Hopefully, you can squash those bugs quickly and get everything back on track for the company.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t11",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.\nSpeaker A: Thanks for letting me know! I'll have to check that out soon!",
        "memory_text": "1. Speaker A is taking a history of martial arts class and enjoys it.\n2. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.\n3. Speaker A is a martial arts teacher and student and is pursuing an athletic training degree in college.\n4. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things.\n5. Speaker A is a college student who teaches jiu-jitsu and is lactose intolerant.\n6. Speaker B enjoys fancy restaurants and mentioned Sufi as their favorite in London.",
        "speaker": "Speaker B",
        "raw_prediction": "No problem! Donairs sound delicious, let me know how you like them when you try them out. And good luck with your finals, I'm sure you'll do great!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t4",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?",
        "memory_text": "1. Speaker A is looking to redecorate their house and likes purple furniture.\n2. Speaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\n3. Speaker A and Speaker B are discussing furniture and home decor choices.\n4. Speaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.\n5. Speaker A has devices to keep bugs away and offers to share the product names with Speaker B.\n6. Speaker A is looking forward to spending quiet evenings outside during the summer, possibly grilling most nights.",
        "speaker": "Speaker A",
        "raw_prediction": "I got my patio furniture from a local store that specializes in outdoor furniture. They had a great selection, so I'm sure you'll find something you like. And don't worry about the green and purple color scheme, we can work together to find something that suits your taste better.",
        "previous_summary": "Speaker B is looking for furniture shop to buy furniture, has two dogs, and works near a mall.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets.\nSpeaker A and Speaker B are discussing furniture and home decor choices.\nSpeaker B recently purchased purple sofas for their home.\nSpeaker B is considering adding more colorful elements to the room to make the purple sofas work.\nSpeaker A is looking to redecorate their house and likes purple furniture.\nSpeaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\nSpeaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture."
    },
    {
        "utter_id": "e42-s5-t5",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? ",
        "memory_text": "1. Speaker A is looking to redecorate their house and likes purple furniture.\n2. Speaker A and Speaker B are discussing furniture and home decor choices.\n3. Speaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\n4. Speaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture.\n5. Speaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.\n6. Speaker A is looking forward to spending quiet evenings outside during the summer, possibly grilling most nights.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm considering a cozy outdoor seating area with a small table and some chairs. Maybe some string lights and a few plants to create a relaxing ambiance. Ikea sounds perfect for finding something that fits my new color scheme. Thanks for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t9",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.\nSpeaker A: Of course! I love Miranda Lambert, any specific song requests? ",
        "memory_text": "1. Speaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.\n2. Speaker A is looking forward to spending quiet evenings outside during the summer, possibly grilling most nights.\n3. Speaker A and Speaker B both enjoy barbecuing and have a love for pets.\n4. Speaker B plans to bring a new marinade and a six pack of beer for the gathering.\n5. Speaker B plans to grill steaks this weekend and prefers using an old charcoal grill over a gas one.\n6. Speaker B suggests making enough barbeque for leftovers on nights when grilling is not possible, due to time or energy constraints.",
        "speaker": "Speaker B",
        "raw_prediction": "How about \"The House That Built Me\" or \"Vice\"? I think those songs would be perfect for the evening. And thanks for agreeing to bring the corn, it's always a hit at barbecues.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t1",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?",
        "memory_text": "1. Speaker B recommends visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece.\n2. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian.\n3. Speaker B and their kids are excited about their upcoming trip to Greece.\n4. Speaker B is planning a trip to Greece in the next three months with a family of five.\n5. Speaker B asks Speaker A if their trip is more for relaxation or sightseeing.\n6. Speaker A hasn't planned their trip out yet but is open to suggestions.",
        "speaker": "Speaker B",
        "raw_prediction": "Oh, that's wonderful! The Acropolis in Athens is truly a sight to behold. Make sure to take your time exploring the Parthenon, it's absolutely stunning. The history and architecture there are fascinating. You and your family will have an amazing time exploring all the ancient ruins.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t10",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. ",
        "memory_text": "1. Speaker A has traveled around Europe before, visiting capital cities of each country.\n2. Speaker B and their kids are excited about their upcoming trip to Greece.\n3. Speaker B is planning a trip to Greece in the next three months with a family of five.\n4. Speaker B recommends visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece.\n5. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian.\n6. Speaker B asks Speaker A if their trip is more for relaxation or sightseeing.",
        "speaker": "Speaker A",
        "raw_prediction": "The museums in Paris are incredible, you'll love exploring them. The Louvre is a must-visit, and the Musee d'Orsay is fantastic for art lovers. Paris is truly a city filled with history and culture. I hope you get to experience it soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t1",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? ",
        "memory_text": "1. Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600.\n2. Speaker A is training for marathons and seeking advice on how to recover.\n3. Speaker B is a motivational speaker who travels to schools and conferences to give pep talks.\n4. Speaker B got into motivational speaking because they needed it themselves to battle depression and anxiety.\n5. Speaker B's job involves motivating people to be successful and follow their dreams.\n6. Speaker B is considering running a marathon and mentioned fishing and feeling depressed.",
        "speaker": "Speaker B",
        "raw_prediction": "The speech went well, thank you! I'm glad to hear you're looking for motivation. I actually know a few great motivational speakers who could help. I can connect you with someone who specializes in fitness motivation. Just remember, the first step is always the hardest, but once you get started, you'll build momentum and achieve your goals.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker B's friend worked at the same store and enjoyed the people there.\n3. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n4. Speaker B's neighbor, John, is getting divorced and selling top-of-the-line camping gear.\n5. Speaker A will use the money earned from the store to buy the hammock online.\n6. Speaker A plans to bring sandwiches and fruit for the hike, specifically asking about veggie sandwiches for Speaker B.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great! It's always nice to have some extra cash coming in. Maybe John can hook you up with some top-of-the-line camping gear for your hiking trip.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t5",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? ",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker B's friend worked at the same store and enjoyed the people there.\n3. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n4. Speaker A will use the money earned from the store to buy the hammock online.\n5. Speaker B's neighbor, John, is getting divorced and selling top-of-the-line camping gear.\n6. Speaker A plans to bring sandwiches and fruit for the hike, specifically asking about veggie sandwiches for Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm still figuring that out. I've been exploring different options and trying to see what really interests me. John's divorce has given me a glimpse into how unpredictable life can be, so I want to make sure whatever I choose brings me joy and stability. It's all about finding that balance, right? How about you, any long-term career goals or just taking it day by day?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. ",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\n3. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n4. Speaker B's friend worked at the same store and enjoyed the people there.\n5. Speaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality.\n6. Speaker A will use the money earned from the store to buy the hammock online.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a nice way to unwind after a shift. I can imagine how peaceful it must be to relax in a hammock after a night of work. Plus, it's great that the job is in a location you enjoy. It's important to find those little moments of peace and happiness wherever we can.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t11",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.\nSpeaker A: Yeah, you know the area it's in. It's pretty safe, but I'm also a light sleeper. Thank you for your concern though. You are a good friend.",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\n3. Speaker B's friend worked at the same store and enjoyed the people there.\n4. Speaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality.\n5. Speaker A has a portable hammock for the hike and asks if Speaker B will bring theirs.\n6. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm glad to hear you feel safe and that you enjoy your alone time in nature. It's important to prioritize your well-being, especially when you're out on your own. Your new job sounds like it will provide the perfect balance between work and relaxation in your hammock. If you ever need someone to hike with or just hang out, I'm here for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t3",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music",
        "memory_text": "1. Speaker A and Speaker B have a friendly interaction and part ways on a positive note.\n2. Speaker A enjoys the peace and quiet of country life, the fresh produce, and fresh air.\n3. Speaker B appreciates the convenience of city living but also values what the country has to offer.\n4. Speaker A and Speaker B both bought lotto tickets for a big jackpot.\n5. Speaker A used to live in a suburb of DC and misses the convenience of city life.\n6. Speaker A bought 50 lotto tickets with different numbers to increase their chances of winning.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear! It sounds like the new iPhone is serving its purpose for you. Have you tried using any music production apps on it yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me",
        "memory_text": "1. Speaker A and Speaker B discuss different strategies for playing the lotto and the potential outcomes if they win.\n2. Speaker A and Speaker B both bought lotto tickets for a big jackpot.\n3. Speaker B bought 20 lotto tickets with the same numbers, aiming to get a bigger share of the jackpot if they win.\n4. Speaker A bought 50 lotto tickets with different numbers to increase their chances of winning.\n5. Speaker B's children have been sick, and Speaker B also had a fever, possibly influencing their decision to buy 20 lotto tickets.\n6. Both speakers dream of having a city and country house or a summer and winter home.",
        "speaker": "Speaker B",
        "raw_prediction": "I think I'd prefer a country house, actually. Somewhere peaceful and away from the hustle and bustle. A place to relax and unwind.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t9",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though",
        "memory_text": "1. Both speakers dream of having a city and country house or a summer and winter home.\n2. Speaker A and Speaker B discuss different strategies for playing the lotto and the potential outcomes if they win.\n3. Speaker A and Speaker B both bought lotto tickets for a big jackpot.\n4. Speaker B appreciates the convenience of city living but also values what the country has to offer.\n5. Both speakers acknowledge the pros and cons of city and country living.\n6. Speaker A used to live in a suburb of DC and misses the convenience of city life.",
        "speaker": "Speaker B",
        "raw_prediction": "That's true, having the best of both worlds would be amazing. You could enjoy the hustle and bustle of the city life when you want, and then retreat to the peace and quiet of the country. It's definitely a dream worth aiming for!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "1. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next.\n2. Speaker A's sons will be coming for winter break from Europe.\n3. Speaker B's younger son would be jealous of Speaker A's sons' European tour.\n4. Speaker A enjoys spending time with their sons despite worrying about them traveling far away.\n5. Speaker B has two sons, one of whom has had a girlfriend for several years and the other is secretive.\n6. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "He has mentioned her quite a bit. I'm excited to finally meet her in person and see the dynamic between them. I hope they get along well with my other son and his friend when they all meet during winter break.",
        "previous_summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker A's sons will be coming for winter break from Europe."
    },
    {
        "utter_id": "e47-s5-t6",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?",
        "memory_text": "1. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next.\n2. Speaker A enjoys spending time with their sons despite worrying about them traveling far away.\n3. Speaker A's sons will be coming for winter break from Europe.\n4. Speaker B's younger son would be jealous of Speaker A's sons' European tour.\n5. Speaker A is a family man who loves spending time with his sons.\n6. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll be in Spain for about two weeks, so I'll have some time to travel around and explore. Portugal sounds wonderful, and it would be lovely to catch up with you while I'm in the area. I'll definitely let you know once I confirm my travel plans.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t7",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?\nSpeaker A: I'm planning to stay in Spain for three weeks.  Since you live in Portugal, I'd love to stop by for a visit if you're free this coming month.  I've always wanted to visit Lisbon.  It has the world's longest bridge!",
        "memory_text": "1. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next.\n2. Speaker A's sons will be coming for winter break from Europe.\n3. Speaker A enjoys spending time with their sons despite worrying about them traveling far away.\n4. Speaker B's younger son would be jealous of Speaker A's sons' European tour.\n5. Speaker A's boys are leaving again in a few months for another trip after studying abroad.\n6. Speaker A is a family man who loves spending time with his sons.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds fantastic! I'd be delighted to show you around Lisbon and maybe even take a road trip to see that impressive bridge. Let's plan something when you're in the area. It would be great to catch up and spend some time together.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t5",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?",
        "memory_text": "1. Speaker A loves Disney music.\n2. Speaker A enjoys going to museums and trying different foods.\n3. Speaker A is interested in music concerts and planning a trip to Sao Paulo.\n4. Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend.\n5. Speaker B enjoys living in the city for the accessibility to food and live music.\n6. Speaker B has seen Three Dog Night in concert and enjoys their live shows.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I've been to Disneyland in California a few times. The fireworks show there is truly magical, especially with the castle as the backdrop. Getting married on the 4th of July sounds incredible! It's like having your own annual celebration with fireworks to mark the occasion.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t10",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?\nSpeaker A: No, I had a cousin that I went with.  We stayed in a hotel in Miami too and I got so sunburned on the beach!  I'm sure the art museum will be good if it isn't too crowded.  Was your concert crowded?\nSpeaker B: It was so crowded, but my older brothers went with me and kept me from getting squished. Make sure you wear sunscreen when you visit the beach this time!",
        "memory_text": "1. Speaker A loves Disney music.\n2. Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend.\n3. Speaker A enjoys going to museums and trying different foods.\n4. Speaker A and their boyfriend also look forward to having some refreshing beers by the beach.\n5. Speaker B is waiting for bands to announce their summer tour schedule to plan which shows to attend.\n6. Speaker A is interested in music concerts and planning a trip to Sao Paulo.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll definitely remember to bring sunscreen this time! Hopefully, the beach won't be as crowded as the concert was. I can't wait to relax with some refreshing beers by the beach after visiting the museum in São Paulo. It sounds like a perfect day ahead.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!",
        "memory_text": "1. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n2. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.\n3. Speaker A dreams of meeting all the puppies from history when they can move through space and time.\n4. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n5. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.\n6. Speaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat.",
        "speaker": "Speaker B",
        "raw_prediction": "I see what you mean, puppies do have a special charm with their playful and loyal nature. But I must admit, there's something about the soft purring of a kitten that melts my heart. Each has its unique way of capturing our affections, don't you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t4",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.",
        "memory_text": "1. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n2. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.\n3. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n4. Speaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it.\n5. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.\n6. Speaker A dreams of meeting all the puppies from history when they can move through space and time.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I actually love grilling asparagus! One of my favorite ways to prepare it is by grilling it indoors and then squeezing some fresh lemon juice on top. It gives it a nice citrusy kick that really enhances the flavor. Would you like me to share the recipe with you?",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t6",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?",
        "memory_text": "1. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n2. Speaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it.\n3. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.\n4. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n5. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.\n6. Speaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat.",
        "speaker": "Speaker A",
        "raw_prediction": "I usually pair the grilled asparagus with a squeeze of fresh lemon juice on top for a zesty flavor. As for fajitas, I'm more of a chicken fajitas person myself. The combination of tender chicken with sautéed peppers and onions always hits the spot for me. How about you, do you lean towards chicken or beef fajitas?",
        "previous_summary": null
    }
]