[
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.",
        "memory_text": "1. [The Parent's experience in juvenile detention led to a newfound appreciation for small moments, such as watching the sunrise after leaving detention.] - (SameTopic) - [The child reminisces about a special morning watching the sunrise with the parent.]\n   \n2. [The child's supportive and caring attitude towards the parent inspired the Parent to find hope and value small moments even in tough situations.] - (Causes) - [The parent reflects on past mistakes and efforts to make positive changes in life.]\n   \n3. [The child's comforting reassurance towards the parent resulted in the Parent getting to see the sunrise after leaving detention.] - (Changed) - [The parent faced challenges during arrest and had to seek help from a lawyer and the justice system.]",
        "speaker": "Parent",
        "raw_prediction": "That morning was truly special. It's moments like those that remind me of the beauty in life.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.\nParent: It was. I love being able to appreciate the beauty of nature. And you know, having my own place to live in the suburbs makes it even easier to do things like that.",
        "memory_text": "1. The Parent and Child enjoy watching the sunrise together, finding it special and memorable.\n2. The Parent's past mistakes lead to finding hope and appreciating small moments, aiming to turn their life around.\n3. The Child is inspired by the Parent's story and suggests continuing the sunrise-watching tradition in the future.",
        "speaker": "Child",
        "raw_prediction": "I'm glad we can enjoy those moments together. Nature really has a way of making things feel peaceful.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t11",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.\nParent: It was. I love being able to appreciate the beauty of nature. And you know, having my own place to live in the suburbs makes it even easier to do things like that.\nChild: Yeah, your house is really nice. You've always been good at taking care of yourself.\nParent: Well, I've always valued my independence. Even as a kid, I wanted to do things on my own. That's why I decided to live on my own a few years ago.\nChild: I can see why you would want to do that. You're just really good at being self-sufficient.\nParent: Thanks for saying that. But I still think one of the most important things I can do for others is listen. Whether it's to give advice, or just to let someone feel heard.",
        "memory_text": "The parent values independence and self-sufficiency, which is why they decided to live on their own a few years ago. This decision was influenced by their desire to provide a safe and stable environment for the child. \nThe parent's past experience of being in juvenile detention and going through a tough time when they got arrested led them to appreciate small moments and find hope even in difficult situations. This ultimately shaped their decision to live in a little house in the suburbs that they love.",
        "speaker": "Child",
        "raw_prediction": "I appreciate how you're always there to listen to me. It means a lot to feel understood by you.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.",
        "memory_text": "1. The Mentor has been guiding and supporting the Mentee in their work for years, which causes the Mentee to be offered a job and decide to take the job in the city.\n2. The Mentee hopes to inspire others to join the cause of gender equality and fighting discrimination, so the Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process, even though the Mentee is feeling overwhelmed with the college application process.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way, Mentee. Building new friendships takes time, but I believe you'll find your place soon. Just keep being yourself and open to new experiences.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t17",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.\nNeighbors B: I feel the same way. We should plan something fun to do together.\nNeighbors A: Absolutely. Hey, do you remember when I ripped off the tag from my shirt?\nNeighbors B: Yeah, your mom was pretty upset about that.\nNeighbors A: I didn't think it was a big deal, but she sure did. Do you ever have disagreements like that with your parents?",
        "memory_text": "Neighbors A and B have agreed to hang out once a week, possibly watching a movie, getting coffee, or just talking. They are looking forward to it, as they are on friendly terms and enjoy spending time together. Both Neighbors A and B have known each other for years and have become good friends. They reminisce about past events during their time together.",
        "speaker": "Neighbors B",
        "raw_prediction": "Sometimes, but it's all part of the parent-child dynamic, right? They just want what's best for us.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t6",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.\nCo-workers B: That's not the same thing, Co-workers A. Stealing someone and keeping them against their will is illegal and immoral. You need to let go of this obsession and move on.",
        "memory_text": "- Co-worker A felt guilty about borrowing a pencil from Co-worker B without asking, similar to how they intervened to separate two women in a fight.\n- Co-worker B reassured Co-worker A that intervening in the fight was not a big deal and suggested making it up by buying coffee next time, showing their supportive nature.\n- Co-worker A's bravery and willingness to help were commended by Co-worker B, who admires their resilience and positivity, even in challenging situations like the accident where they lost their hands and feet.",
        "speaker": "Co-workers A",
        "raw_prediction": "I know you're right, Co-worker B. I'll try to let go of this obsession and respect her choices. Thanks for being honest with me.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t6",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.",
        "memory_text": "Co-worker B supports and encourages Co-worker A to prioritize their health. This leads to Co-worker B feeling glad that Co-worker A is okay. Additionally, Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership. \nCo-worker B offers help and support to Co-worker A, resulting in Co-worker A being grateful for the assistance. Subsequently, Co-worker B is pleased with the outcome of their trade and acknowledges that their skills complement each other well.",
        "speaker": "Co-workers A",
        "raw_prediction": "We make a great team, always looking out for each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t11",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.\nCo-workers A: Me too! I think we would make a great business partnership.\nCo-workers B: Definitely. It's great to have someone I can trust and rely on in both work and personal matters.\nCo-workers A: I agree. We have a good working dynamic and I'm happy to help out whenever I can.",
        "memory_text": "Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership and encourages Co-worker A to prioritize their health.\n\nCo-worker A feels motivated about the future and is excited to work with Co-worker B, which causes Co-worker B to be glad to have been able to help Co-worker A and feel the trade worked out well for both of them.\n\nCo-worker B offers help and support to Co-worker A, leading to Co-worker A offering Person Z to Co-worker B in exchange for one of their horses and expressing gratitude for the joy and happiness the horse brings.",
        "speaker": "Co-workers B",
        "raw_prediction": "I'm grateful for your support, and I know we can achieve great things together.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t1",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.",
        "memory_text": "1. Both Classmates A and B enjoy talking to each other and consider themselves great study partners. Classmates A expresses admiration for Classmates B's intelligence and sense of humor. They are excited about seeing Lady Gaga in concert and are looking forward to singing and dancing along to her hits.\n\n2. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B. Both Classmates A and B enjoy talking to each other and consider themselves great study partners. Classmate B admires Classmate A's dedication and believes they have a knack for science. They discuss Classmate A's favorite Lady Gaga song, \"Born This Way.\"\n\n3. Both Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor. They are interested in biology and studying cells. Classmate A is passionate about science and interested in becoming a doctor or researcher to help people and make a difference.",
        "speaker": "Classmates A",
        "raw_prediction": "Sure, what's on your mind?",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.",
        "memory_text": "1. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor. This admiration has led to both Classmates A and B enjoying talking to each other and considering themselves great study partners. As a result, they are excited about seeing Lady Gaga in concert and are looking forward to singing and dancing along to her hits.\n\n2. Classmates A has developed a crush on Classmates B, which Classmates B finds flattering. In response, Classmates B is considering taking biology classes in college to learn more about how the body works. Meanwhile, Classmate A is balancing high school and college classes to be successful and help their family.",
        "speaker": "Classmates A",
        "raw_prediction": "I must have misunderstood the situation, I apologize for jumping to conclusions.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t9",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.\nClassmates A: I can't stand that you're a better singer than I am. I'm envious of your talent and success.",
        "memory_text": "Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B. This leads to both Classmates A and B enjoying talking to each other and considering themselves great study partners. As a result, they are excited about seeing Lady Gaga in concert and are looking forward to singing and dancing along to her hits.\n\nClassmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor. This positive interaction leads to both Classmates enjoying talking to each other and considering themselves great study partners. Additionally, Classmate B admires Classmate A's dedication and believes they have a knack for science. They bond over their shared favorite Lady Gaga song, \"Born This Way.\"\n\nClassmates A has developed a crush on Classmates B, which Classmates B finds flattering. This genuine interest leads to Classmates A finding it refreshing to talk to someone genuinely interested in science and learning. As a result, Classmate B admires Classmate A's dedication and believes they have a knack for science. They also bond over their shared favorite Lady Gaga song, \"Born This Way.\"",
        "speaker": "Classmates B",
        "raw_prediction": "I had no idea you felt that way. I'm sorry you see it like that.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t9",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.",
        "memory_text": "Neighbors A and B are discussing the idea of having telekinetic abilities, and Neighbors B is excited and supportive of Neighbors A's new ability. Neighbors B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n\nNeighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people, and Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor A feels there is no room for growth or new projects at their current job.\n\nNeighbors A compares mastering telekinesis to cooking, requiring patience and trial-and-error, and is considering incorporating their telekinesis into their cooking in the future.",
        "speaker": "Neighbors B",
        "raw_prediction": "You're welcome. Just remember, communication is key in any relationship, including with your mom.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t15",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbor A enjoys trying new things, like new recipes. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n\nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors A has been practicing moving small objects with their telekinesis.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's a good idea. It's always important to keep growing and challenging yourself. Have you thought about what kind of opportunities you might be interested in exploring?",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t16",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.\nNeighbors B: That's a good plan. It's important to pursue what makes you happy and fulfilled.",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning. \n\nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career. \n\nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A mentions the practical uses of telekinesis, like grabbing things from a distance. Neighbors A has gained the ability to move objects with their mind.",
        "speaker": "Neighbors A",
        "raw_prediction": "I appreciate your support and encouragement. It means a lot to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t2",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?",
        "memory_text": "- Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends. This causes Classmates B to appreciate Classmates A's gesture of buying coffee. As a reaction, Classmates A agreed to try the suggestion and thanked Classmates B for it, wanting Classmates B to encourage them to work through their feelings and take steps towards a better future.\n\n- Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings. They both plan to relax at home later in the day, having had trouble sleeping and trying natural remedies like chamomile tea and lavender oil.\n\n- Classmate A and Classmate B both enjoy socializing and going out to parties together. This shared interest leads Classmates A to be social and enjoy meeting new people, while also considering talking to a therapist or counselor to address past issues.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm thinking about starting a new hobby, maybe painting or cooking classes. I feel like it could be a great way to relax and unwind after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t13",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.",
        "memory_text": "1. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends, which causes Classmates B to appreciate Classmates A's gesture of buying coffee. This leads to Classmates A agreeing to try the suggestion and thanking Classmates B for it, showing that Classmates B wants Classmates A to work through their feelings and take steps towards a better future.\n\n2. Classmates A and B both enjoy socializing and going out to parties together, and they are open to meeting for coffee again in the future. This mutual interest in socializing also extends to both planning to relax at home later in the day. Additionally, Classmates B suggests meditation or breathing exercises to help Classmates A relax before bed, which causes Classmates A to consider talking to a therapist or counselor to address past issues.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! It's amazing how simple practices like yoga and meditation can make a big difference in our daily lives.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t15",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.\nClassmates B: That's great to hear. And what about your past struggles with school and friendships? Do you feel like you've moved on from that?\nClassmates A: Definitely. It's been a journey, but I've worked hard to overcome those obstacles. And now I feel like I'm finally on the right path.",
        "memory_text": "Classmates A encourages Classmates B to initiate conversations and be friendly to make new friends, causing Classmates B to appreciate Classmates A's gesture of buying coffee. In reaction, Classmates A agreed to try the suggestion and thanked Classmates B for it, wanting Classmates B to encourage them to work through their feelings and take steps towards a better future.\n\nClassmate A suggests planning a picnic in the park or a hike for the next outing with friends, and both Classmates A and B plan to relax at home later in the day. They both want to meet up again after getting better sleep, with Classmates B suggesting going back to school or taking courses to improve.",
        "speaker": "Classmates B",
        "raw_prediction": "I'm really proud of you for all the progress you've made. It's inspiring to see how far you've come.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t1",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?",
        "memory_text": "Neighbors A and B appreciate the resourcefulness of using fallen trees for firewood or other purposes. Neighbor A values their friendship with Neighbor B and wants to ensure it remains strong. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too. Neighbors A did not bring any notes or textbooks to school, causing them to leave their backpack at home once and had to borrow notes from a classmate. Neighbor A feels like they should have been more prepared for the test, which leads to them valuing double-checking before leaving the house.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yeah, I've definitely noticed! You must have been putting in a lot of hard work.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t4",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.",
        "memory_text": "Neighbors A and B appreciate the resourcefulness of using fallen trees for firewood or other purposes. This reminds Neighbors A of the time they apologized to Neighbors B for the way they treated them, expressing a desire to make amends and learn from their mistakes.\n\nNeighbors A and B emphasize the importance of taking care of trees and the environment for future generations. This is similar to when Neighbor A apologized to Neighbor B for their behavior and showed a willingness to take responsibility for their actions.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm glad you remember that. It was important to me to make things right between us.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t5",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.",
        "memory_text": "1. Neighbors A and B emphasize the importance of taking care of trees and the environment for future generations. This reminds Neighbors A of the time when they apologized to Neighbor B for their behavior and expressed a desire to make amends. In response, Neighbors B reminds Neighbors A about taking responsibility for their mistakes in the past and learning from them.\n\n2. Neighbors A and B appreciate the resourcefulness of using fallen trees for firewood or other purposes. This also reminds Neighbors A of the time when they apologized to Neighbor B for their behavior and expressed a desire to make amends. In response, Neighbors B reminds Neighbors A about taking responsibility for their mistakes in the past and learning from them.\n\n3. Neighbors A and B emphasize the importance of taking care of trees and the environment for future generations. This leads to Neighbors A staying up all night studying for a test and feeling terrible about forgetting the backpack, as they had once left their backpack at home and had to borrow notes from a classmate.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's impressive to see how much you've grown, not just physically but also in your character. Keep up the good work!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t7",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.\nNeighbors B: It's always important to own up to our mistakes. It's like when you forgot your backpack in high school and had to deal with the consequences.\nNeighbors A: Definitely. It taught me to always be prepared and double-check everything. It's like how I make sure to tighten screws and wires when working on my computer.",
        "memory_text": "Neighbors A and B discussed the importance of taking care of trees and the environment for future generations. This led to Neighbor B accepting Neighbor A's apology and mentioning how hurtful it was to be treated poorly. In response, Neighbors A apologized to Neighbors B, admitted their mistake, and expressed a desire to make amends.\n\nThe conversation about the environment continued with Neighbor A apologizing to Neighbor B and showing a willingness to make things right. This triggered Neighbors B to remind Neighbor A about the importance of taking responsibility for past mistakes and learning from them. As a result, Neighbor A apologized again and acknowledged their wrongdoing.\n\nBuilding on the theme of environmental care, Neighbor A apologized to Neighbor B and expressed a desire to make amends. This prompted Neighbors B to suggest talking to the teacher so Neighbor A could potentially take a test on another day.",
        "speaker": "Neighbors B",
        "raw_prediction": "You've learned some valuable lessons from those experiences. It's great to see how you've grown and become more responsible.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.",
        "memory_text": "Classmate A grew up around carpentry as their dad was a carpenter, and started helping him out at a young age, eventually developing a passion for it. \nClassmate A is attending a seminar on starting a business and is excited about applying that knowledge to future plans, leading them to research local open mic nights and talent showcases to start building a following. \nClassmate B hopes the President will consider their concerns and make improvements for the country's betterment, while Classmate A appreciates the support and encouragement from Classmate B and wants to get to know them better to potentially become friends.",
        "speaker": "Classmates B",
        "raw_prediction": "It's wonderful that you found your passion at such a young age. Your dad must be proud to see you following in his footsteps.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t3",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.",
        "memory_text": "1. Co-worker A's dedication to helping others and taking pride in their work is appreciated by Co-worker B.\n2. Co-worker A's belief in leading by example translates into their strive for excellence in work, and they used to enjoy playing with dolls and stuffed animals as a child.\n3. Co-worker A's good work ethic and positive impact on the workplace is acknowledged by Co-worker B, who was made happy when Co-worker A returned a watch.",
        "speaker": "Co-workers B",
        "raw_prediction": "We appreciate your attention to detail and dedication to making sure everything runs smoothly.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t9",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.",
        "memory_text": "[Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.] - (React) - [Co-worker A and Co-worker B excel at working well with others and resolving issues.] - (React) - [Co-worker B appreciates Co-worker A's effort in giving them a massage to help them relax.] \n[Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.] - (SameTopic) - [Both Co-worker A and Co-worker B value communication and understanding in relationships.] - (SameTopic) - [Both Co-worker A and Co-worker B enjoy connecting with each other to make work more enjoyable.] \n[Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.] - (React) - [Co-worker A and Co-worker B excel at working well with others and resolving issues.] - (React) - [Co-worker A's massage to Co-worker B helps them feel relaxed and at peace.]",
        "speaker": "Co-workers B",
        "raw_prediction": "Absolutely, open communication and collaboration are key to our success as a team. Thank you for being willing to consider different perspectives.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t3",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.",
        "memory_text": "Neighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This camaraderie causes Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. The strong bond is evident as Neighbors A values the relationship with Neighbors B and considers them like family. This mutual appreciation leads Neighbors A to be excited to explore the neighborhood and make new friends. \n\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This friendship causes Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. The strong bond is evident as Neighbors A values the relationship with Neighbors B and considers them like family. Neighbor B acknowledges Neighbors A's friendly and outgoing nature.\n\nNeighbor B has moved around a lot over the years but is considering settling down in the current neighborhood. This decision resonates with Neighbors A, who enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. The strong bond is evident as Neighbors A values the relationship with Neighbors B and considers them like family. This mutual appreciation leads Neighbors A to be excited to explore the neighborhood and make new friends.",
        "speaker": "Neighbors B",
        "raw_prediction": "Chicago is such a vibrant city, glad you had a wonderful experience there!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t5",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.",
        "memory_text": "Neighbor B has moved around a lot over the years but is considering settling down in the current neighborhood. This is similar to Neighbors A enjoying living in the neighborhood, feeling comfortable and safe, and having made good friends, including Neighbor B. It's also like Neighbors A valuing the relationship with Neighbor B and considering them like family. Additionally, Neighbors A is excited to explore the neighborhood and make new friends.\n\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This relates to Neighbors A enjoying living in the neighborhood, feeling comfortable and safe, and having made good friends, including Neighbor B. They also both live in the same place and find comfort in it. Moreover, Neighbors A found a park and a coffee shop nearby that they want to visit.\n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. This aligns with Neighbors A enjoying living in the neighborhood, feeling comfortable and safe, and having made good friends, including Neighbor B. It's also similar to Neighbors A used to have power over Neighbor B, but no longer has it.",
        "speaker": "Neighbors B",
        "raw_prediction": "I know what you mean. It's funny how things change over time. But I'm glad to hear that you've come to appreciate our neighborhood more.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t13",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.\nNeighbors A: Oh, gosh. That was so long ago. I can't even believe I had that kind of power over you.\nNeighbors B: I'm just glad we've both grown since then, and we can have a friendship that's based on mutual respect.\nNeighbors A: Absolutely. And now, I'm excited to explore my new neighborhood and get to know the people here. It feels like a fresh start.",
        "memory_text": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there, feeling comfortable and safe, and has made good friends, including Neighbors B. This has led to Neighbors A being excited to explore the neighborhood, make new friends, and have a fresh start. \nNeighbors B used to obey Neighbors A's commands, but they have both grown since then and now have a friendship based on mutual respect.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's always exciting to have a fresh start and meet new people. I'm sure you'll make just as many great memories in your new neighborhood as you did here.",
        "previous_summary": "Neighbors A just moved to a new neighborhood and is getting to know the area.\nNeighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\nNeighbors A is excited to explore the neighborhood and make new friends.\nNeighbors A found a park and a coffee shop nearby that they want to visit.\nNeighbors B acknowledges Neighbors A's friendly and outgoing nature.\nNeighbors A appreciates having friendly faces around and hopes to make new friends soon."
    },
    {
        "utter_id": "e12-s5-t3",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.",
        "memory_text": "Classmates A is also working on an essay about the Industrial Revolution. This dedication to studying hard and taking extra classes to get into a good college caused Classmates A to show up to school in pajamas due to oversleeping after studying late. This incident reminded Classmates B of a funny moment from high school involving Classmates A wearing pajamas to school.\n\nClassmates A is also working on an essay about the Industrial Revolution, which made Classmates B notice Classmates A's improvement and acknowledge their hard work. In response, Classmates B advised Classmates A to consider how others perceive them, especially in situations like applying to college.\n\nClassmates B working on finishing a history project was hindered by Classmates A's past frustration, but Classmates A has learned to channel that energy into studies. This change led Classmates A to be willing to work hard to achieve their dreams and not be afraid to be themselves, embracing their quirks, which their girlfriend appreciates.",
        "speaker": "Classmates B",
        "raw_prediction": "That's fascinating! The history of the pyramids is always so intriguing. Did they mention anything about the theories surrounding how they were built?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t12",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.\nClassmates B: Aww, that's fantastic. How has everything been going with her?",
        "memory_text": "1. [Classmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.] - (React) - [Classmates A is willing to work hard to achieve their dreams.]\n2. [Classmates A is also working on an essay about the Industrial Revolution.] - (React) - [Classmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.] - (SameTopic) - [Classmates A feels like everything is falling into place and is excited to see where the new relationship goes.]\n3. [Classmate B is working on finishing a history project.] - (Causes) - [Classmates A's grades are looking good according to their teacher.] - (SameTopic) - [Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.]",
        "speaker": "Classmates A",
        "raw_prediction": "Things have been going really well with her. I feel like everything is falling into place, and I'm excited to see where this new relationship goes.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t6",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?",
        "memory_text": "1. The Child suggests creating a schedule for chores to ensure everyone contributes equally. The Parent expresses a desire to be a better role model for the Child and their siblings. The Child is caring and offers help to the Parent.\n\n2. The Parent agrees to make an effort to start pulling their weight around the house and to follow the chore schedule. The Parent expresses a desire to be a better role model for the Child and their siblings. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n\n3. The Child feels it is unfair that they have to do certain chores because the Parent is too tired. This causes the Parent to acknowledge being lazy about washing dishes and promises to contribute more to keeping the home clean. They have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores. The Parent has seen a doctor and is taking medicine for their illness.",
        "speaker": "Parent",
        "raw_prediction": "I'm not sure yet, but I'm hopeful that it will attract some interest.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.\nClassmates B: I'm proud of you. It's always great to see someone following their dreams.\nClassmates A: Thanks, it's been a journey, but I'm really happy with where I am now. It's crazy to think that years ago, I was so hesitant to even share this part of myself.\nClassmates B: It just goes to show that it's never too late to start pursuing what you love. Remember when we talked about you living your life on your own terms? You're doing just that.",
        "memory_text": "Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth. This aligns with their shared value of trying new things and taking risks for personal development. As a result, Classmates A values living life on their own terms and being content with their choices. This attitude towards independence and happiness has led Classmates A to pursue their passions and find joy in life.",
        "speaker": "Classmates A",
        "raw_prediction": "I appreciate your support and encouragement. It really means a lot to me.",
        "previous_summary": "Classmates A and B are in the same class and have had previous conversations about study tips.\nClassmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth.\nClassmates A ended up taking Classmates B's advice and found success with it.\nClassmates A values living life on their own terms and being content with their choices.\nClassmates A and B went to the same high school.\nThey reconnected on Facebook after many years.\nClassmates A has been pursuing their passions and enjoying life.\nClassmates A values their happiness and living life on their own terms."
    },
    {
        "utter_id": "e16-s5-t6",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?",
        "memory_text": "Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader.\nCo-worker A acknowledges the importance of communication and resolving conflicts.\nCo-worker A advises Co-worker A to take small steps and have one conversation at a time.\nCo-worker A has fantasies of being a great leader.\nCo-worker A is focused on getting along and working smoothly with Co-worker B.\nCo-worker B acknowledges and supports Co-worker A's growth and progress.\nCo-worker B advises Co-worker A to take small steps and have one conversation at a time.\nCo-worker A considers taking on more responsibility at work as a start towards being a leader.\nCo-worker B acknowledges the importance of communication and resolving conflicts.\nCo-worker A is willing to calm down and have a conversation with Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "I do remember that. It's funny how things have a way of falling into place sometimes.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t9",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?",
        "memory_text": "1. [Co-worker A used to fantasize about being a great leader and being respected and admired.] - (SameTopic) - [Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.]\n2. [Co-worker A has fantasies of being a great leader.] - (SameTopic) - [Co-worker A felt stressed about their relationship with Co-worker B in the past.] - (Causes) - [Co-worker B advises Co-worker A to control their emotions and discuss the issue with Co-worker B.]",
        "speaker": "Co-workers B",
        "raw_prediction": "I do remember that time. It's important to address any issues that come up in the workplace. I'm glad we were able to work through it and continue to support each other.",
        "previous_summary": "Co-worker A is feeling stressed about their relationship with Co-worker B.\nCo-worker B reassures Co-worker A that there are no issues from their side.\nCo-worker A felt stressed about their relationship with Co-worker B in the past.\nCo-worker A feels embarrassed for losing control of their emotions.\nCo-worker B advises Co-worker A to control their emotions and discuss the issue with Co-worker B.\nCo-worker A assumes that Co-worker B wouldn't listen or care about their concerns.\nCo-worker A is willing to calm down and have a conversation with Co-worker B."
    },
    {
        "utter_id": "e16-s5-t15",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.\nCo-workers A: Oh yeah, I still try to keep up with it whenever I can. It's important to stay physically and mentally fit, especially with this new job.\nCo-workers B: Just don't let your anger get the better of you again. Remember when you exploded and started throwing things?\nCo-workers A: Ugh, let's not even go there. My parents gave me a good scolding for that.",
        "memory_text": "Co-worker A fantasizing about being a great leader led to them emphasizing the importance of communication and aspiring to be respected and admired.\n\nCo-worker B encouraging Co-worker A to pursue a leadership position resulted in them stressing the significance of communication, conflict resolution, and taking small steps in conversations.\n\nCo-worker A's fantasies of being a great leader influenced them to prioritize getting along and working smoothly with Co-worker B, despite feeling stressed about their past relationship. This stress caused Co-worker B to advise Co-worker A on managing emotions and addressing the issue openly.",
        "speaker": "Co-workers B",
        "raw_prediction": "Well, it sounds like you've learned a lot from that experience. Remember to keep your cool and handle any challenges that come your way with grace and composure in your new role as a product manager.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t8",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.",
        "memory_text": "Neighbors A ordered a large cheese pizza with extra sauce for Neighbors B. This gesture of appreciation led to Neighbors A being willing to take things slow in their relationship with Neighbors B. In response, Neighbor B reassured Neighbor A about past embarrassing incidents and emphasized their current friendship.\n\nNeighbors A surprised Neighbors B with a pizza, leading to Neighbor B valuing their friendship with Neighbors A. This made Neighbor A want to address an embarrassing past incident where they pushed Neighbor B's shoulder to gain acceptance.\n\nNeighbors A did this as a gesture of appreciation for Neighbors B's actions in the neighborhood. This led to Neighbors A being willing to take things slow in their relationship with Neighbors B. Additionally, Neighbor B, who has a son starting high school, understands the challenges and excitement that come with it.",
        "speaker": "Neighbors A",
        "raw_prediction": "I just want to apologize for that moment, it was definitely not the right way to go about gaining acceptance.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!",
        "memory_text": "- Neighbors B is supportive and believes Neighbors A's story, suggesting looking up UFO sightings in the area. This leads to Neighbors A feeling tired from work and needing to catch up on sleep. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries, which caused Neighbors A to make a big career change recently and be much happier now.\n\n- Neighbors A plans to do some research and possibly report the sighting of the UFO, then suggests planning something else to do together over the weekend. This makes Neighbors A want to start looking for new opportunities soon, updating their resume and starting networking, after they took the leap to make a change and are glad they did.\n\n- Neighbors B is supportive and believes Neighbors A's story, suggesting looking up UFO sightings in the area, and this is in the same topic where Neighbors B is supportive of Neighbors A's decision and admires the courage it took.",
        "speaker": "Neighbors A",
        "raw_prediction": "I know, it's unbelievable! I still can't wrap my head around it.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t6",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?",
        "memory_text": "1. The husband finds joy in the little things, like catching the bus on time, which the wife recalls him mentioning a couple of years ago.\n2. Both the husband and wife agree that life's meaning comes from appreciating the small things, such as playing the guitar, a hobby the wife supports.\n3. The husband values his wife's support in his hobbies and is grateful for having a friend he can trust, while the wife is happy to see him happy.\n4. The husband cherishes the supportive community at church and is thankful for his wife's presence, as they both find purpose and happiness together.",
        "speaker": "Husband",
        "raw_prediction": "Yes, I remember that! It's those small victories that can really brighten up the day.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t6",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?",
        "memory_text": "1. [Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.] - (React) - [Co-worker A had a positive experience with a commander who helped them feel safe.]\n2. [Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.] - (Want) - [Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director.]\n3. [Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.] - (Want) - [Co-worker A values making money and is interested in opportunities to do so.]",
        "speaker": "Co-workers A",
        "raw_prediction": "I've thought about it, but right now I'm really focused on making a difference in my current role.",
        "previous_summary": "Co-worker A prioritizes making money and believes it is the most efficient use of time.\nCo-worker A values making money and is interested in opportunities to do so.\nCo-worker A had an argument with the director about a play but didn't compromise.\nCo-worker A is self-aware about being stubborn and needing to learn to compromise."
    },
    {
        "utter_id": "e22-s5-t8",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?\nCo-workers A: I'm always open to new opportunities, but I don't want to do it just for the sake of having more power. If I could make a bigger difference in that role, then I would consider it.\nCo-workers B: I have no doubt that you would do an amazing job. Your skills as a leader and guide are top-notch.",
        "memory_text": "Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\nCo-worker B offers encouragement and believes things will work out in the end. Co-worker A had a positive experience with a commander who helped them feel safe.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you for the vote of confidence. I believe in using leadership positions to create positive change and support others.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t4",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?",
        "memory_text": "The student emphasized the importance of being aware of surroundings and acting quickly in emergencies, feeling rewarded by the experience. The teacher and student have a positive and understanding relationship. \nThe teacher encouraged the student to prioritize safety and continue helping others in need, causing the student to mention feeling stressed lately, which may have led to the outburst. The student has already made plans with their daughter and son-in-law to visit more often and take the grandkids on trips. \nThe teacher expressed understanding and encouraged the student to seek help when needed, which made the student already make plans with their daughter and son-in-law to visit more often and take the grandkids on trips.",
        "speaker": "Student",
        "raw_prediction": "Yes, I've heard that before. I guess I'll have to start small and work my way up to handle the heat better.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t6",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?",
        "memory_text": "The teacher praised the student for their bravery and quick action in the emergency situation, which led to the teacher offering support and reassurance that they are there to talk to. This positive and understanding relationship between the teacher and student is evident.\n\nThe student had a heroic experience at the beach where they saved a young kid from drowning, sparking a desire to spend time with their grandchildren in retirement. Additionally, the student is studying French at college and aims to learn Spanish and German as well.\n\nThe teacher praised the student for their bravery and quick action in the emergency situation, which made the student feel stressed lately, possibly leading to an outburst. As a result, the student wants to visit more often and take the grandkids on trips with their daughter and son-in-law.",
        "speaker": "Student",
        "raw_prediction": "I've been practicing French regularly, and I'm starting to pick up some Spanish too. German is next on my list!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t11",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?\nStudent: It's going well. I'm really looking forward to spending more time with them and taking them on fun trips.",
        "memory_text": "The student's heroic beach rescue experience is a topic that they are looking forward to sharing with their grandchildren during retirement. Their desire to spend time with family is also motivating their retirement plans. The teacher's praise for the student's bravery during the rescue may have contributed to the student feeling stressed lately. Additionally, the teacher's support and encouragement have shifted towards validating the student's retirement aspirations.",
        "speaker": "Teacher",
        "raw_prediction": "That sounds like a wonderful plan. Quality time with family is truly precious.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t3",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.",
        "memory_text": "Neighbor A and Neighbor B both enjoy reading and sharing books, emphasizing the importance of taking care of each other as neighbors.\nNeighbor B feels inspired by Neighbor A's reading and offers to be more supportive, checking in on Neighbor A more often.\nNeighbor A and Neighbor B reminisce about a past concert they attended together and express a desire to strengthen their relationship. \nAfter being promoted to manager, Neighbor A has a new workout routine, waking up at 5 a.m to relieve stress, but struggles to maintain consistency.",
        "speaker": "Neighbors B",
        "raw_prediction": "I appreciate you being proactive about it. It's always good to have clear boundaries.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t5",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.",
        "memory_text": "Neighbor A enjoys reading and sharing books with Neighbor B. This shared interest causes Neighbor A to believe in setting goals, developing a positive attitude, and taking action for personal development and career advancement. As a result, Neighbor A offers to help Neighbor B with getting into a workout routine. In response, Neighbor B offers to be more supportive and check in on Neighbor A more often. \nNeighbor A's favorite book is \"The Great Gatsby,\" which causes Neighbor B to admire Neighbor A's career advancement and express interest in borrowing the personal development book. Neighbor B's admiration leads Neighbor A to offer help with getting into a workout routine. Both neighbors then emphasize the importance of taking care of each other as neighbors.",
        "speaker": "Neighbors B",
        "raw_prediction": "I think we've covered everything for now. I appreciate your proactive approach to avoid misunderstandings. Let's continue to communicate openly if anything comes up in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t10",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.",
        "memory_text": "Neighbor A enjoys reading and sharing books with Neighbor B. This leads to Neighbor A believing in setting goals, developing a positive attitude, and taking action for personal development and career advancement. As a result, Neighbor A offers to help Neighbors B with getting into a workout routine, and Neighbor B suggests working out together to make it more enjoyable for both of them.",
        "speaker": "Neighbors A",
        "raw_prediction": "Setting boundaries is crucial in both personal and professional relationships. It helps maintain clarity and respect.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t7",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.\nClassmates B:  You're right. Our class definitely has a unique energy about it. What do you think sets us apart from other classes?\nClassmates A:  I think it's our sense of community. We all support each other and work together to achieve our goals.\nClassmates B:  That's definitely a big factor. And I also think our class has a lot of diversity, which brings new perspectives and ideas to the table.\nClassmates A:  Yes, absolutely. I love hearing everyone's different viewpoints and experiences. It really helps us all grow and learn.\nClassmates B:  And it's not just in the classroom, but also in extracurricular activities and events. We always have a strong turnout and participation.\nClassmates A:  I couldn't agree more. And I feel like being part of our class has made me a better person overall. I've learned so much and grown so much as a result.",
        "memory_text": "1. [Classmates B enjoys people watching at the mall.] - (React) - [Classmate B is disappointed when Classmate A does not feel the same way.] - (React) - [Classmates B complimented Classmates A on their suit and brought up a past conversation about feelings.]\n   \n2. [Classmates A and B are both interested in going to the mall near their school.] - (SameTopic) - [Classmate B feels relieved that they can still be friends with Classmate A.] - (React) - [Classmates B appreciates Classmates A's honesty about their feelings, but doesn't feel the same way.] - (Causes) - [Classmates A confessed their love for Classmates B, who does not feel the same way.]",
        "speaker": "Classmates B",
        "raw_prediction": "I completely agree. Our class has definitely had a positive impact on all of us. It's great to see how much we've all grown and learned together.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t1",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?",
        "memory_text": "1. Co-worker A has been trying to improve their punctuality and cut back on drinking, and as a result, they have been successful in not being late to work for weeks.\n   \n2. Co-worker A has been getting written up for being late to work, which made them react by being successful in not being late to work for weeks.\n   \n3. Co-worker B is concerned about Co-worker A's punctuality and drinking habits, and in reaction, Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable. This led to Co-worker B being supportive and encouraging Co-worker A to give people a chance.",
        "speaker": "Co-workers B",
        "raw_prediction": "No, you didn't! What did you have to do there?",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t6",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?",
        "memory_text": "- Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable, as both co-workers show a supportive and caring attitude towards each other.\n- Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions, causing Co-worker B to be supportive of Co-worker A's efforts to improve their life by being more responsible and reliable.\n- Co-worker B is concerned about Co-worker A's punctuality and drinking habits, reacting to Co-worker A's struggles with late nights out and expensive Uber rides, while still wanting Co-worker A to be more responsible and avoid such situations.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, that was a rough night. I've been working on being more responsible with my outings since then.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t7",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.",
        "memory_text": "Co-worker B is concerned about Co-worker A's punctuality and drinking habits, but Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable. In return, Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides. Both co-workers show a supportive and caring attitude towards each other, which helps in their personal growth and mutual understanding.",
        "speaker": "Co-workers B",
        "raw_prediction": "Well, at least you're making progress in being more responsible. It's all about taking small steps towards improvement.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t11",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.\nCo-workers A: Wow, that was a long time ago. But I appreciate the compliment. It's nice to be reminded of my successes.",
        "memory_text": "Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable. This reminds Co-worker B of the time when Co-worker A was a leader in their country, making it prosperous and safe.",
        "speaker": "Co-workers B",
        "raw_prediction": "You've come a long way since then, and it's inspiring to see you taking charge of your responsibilities now.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t2",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?",
        "memory_text": "Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience. Neighbor A looks forward to playing with Neighbor B again when feeling better. Neighbor A found some of their dog's toys while packing, indicating they have a golden retriever. Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm doing okay, thanks for asking. How's your week been so far?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t4",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?",
        "memory_text": "Neighbors A has been dealing with back pain for a few months but sought help from a chiropractor, avoiding surgery. As a result, Neighbors A looks forward to playing with Neighbors B again when feeling better and wants to do so. They also appreciated the support and friendship of Neighbors B.\n\nNeighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go, showing their willingness to help. Additionally, Neighbors A and Neighbors B enjoy playing together with toys and appreciate each other's support and friendship.\n\nNeighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience, which causes Neighbors A to look forward to playing with Neighbors B again when feeling better. Neighbors A recently moved to London from their current location, which brings up the reaction of Neighbors A having moved to London in the past and having to learn how to manage stress.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yeah, it was a lot of fun. We used to play at local gigs and it was a great way to unwind.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t9",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?\nNeighbors A: Not really, it was just a fun hobby back then. Plus, I don't think I have the same energy as I did when I was younger.",
        "memory_text": "- [Neighbor A has been dealing with back pain for a few months but sought help from a chiropractor, avoiding surgery.] - (React) - [Neighbors A looks forward to playing with Neighbors B again when feeling better.] - [Neighbors A appreciated the support and friendship of Neighbors B.]\n- [Neighbor A has been dealing with back pain for a few months but sought help from a chiropractor, avoiding surgery.] - (React) - [Neighbors A looks forward to playing with Neighbors B again when feeling better.] - [Neighbors A found some of their dog's toys while packing, indicating they have a golden retriever.]\n- [Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.] - (SameTopic) - [Neighbors A and Neighbors B enjoy playing together with toys.] - (React) - [Neighbors B is familiar with Neighbors A's dog and looking forward to playing with it again.]",
        "speaker": "Neighbors B",
        "raw_prediction": "Maybe you can start a new hobby that doesn't require as much energy. Have you thought about picking up a musical instrument again?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t4",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.",
        "memory_text": "1. Co-worker A believes the project will be approved with flying colors because Co-worker A made changes to modernize processes and invest in new technology for the business.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture, similar to how Co-worker A took over the family business and made changes to adapt to modern times.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture, which is a result of Co-worker A taking over their family's business a few years ago and improving it since then.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I really want this project to succeed. I believe the changes I've made will help us move forward successfully.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t5",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.",
        "memory_text": "Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A, which led to Co-worker A taking over their family's business a few years ago, resulting in improvements since then. This experience taught Co-worker A the importance of being efficient and proactive.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's great that you were able to apply those lessons to your current role. I'm sure your boss will appreciate the effort you put into the report.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t1",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.",
        "memory_text": "1. The Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches, which leads to the Athlete deciding to tough it out and stay focused on the game.\n2. The Coach is giving advice to the Athlete regarding their performance and focus, causing the coach to encourage the athlete to continue their good work with nutrition and training, which results in the Coach encouraging the Athlete to keep up the good work and acknowledges their achievements, leading to the Athlete taking on more responsibilities and gaining respect from other players.\n3. The Athlete decides to tough it out and stay focused on the game, which changes to the Athlete being focused on improving their performance and energy levels, causing the Athlete to take on more responsibilities and gain respect from other players.",
        "speaker": "Coach",
        "raw_prediction": "Looks like you've got a solid plan in place. Just remember to stay focused and keep up the good work with your training and nutrition. You're doing great out there.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t7",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?\nAthlete: Yes, Coach. I've been incorporating more nutrient-dense foods like bean sprouts into my diet. And I've noticed a significant improvement in my overall energy levels and performance on the field.",
        "memory_text": "The Coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated. Both the Athlete and Coach emphasize the importance of small changes in diet impacting performance.\nThe Coach encourages the athlete to continue their good work with nutrition and training, which causes the Athlete to take on more responsibilities and gain respect from other players.",
        "speaker": "Coach",
        "raw_prediction": "That's great to hear, Ted. It's amazing how small changes in diet can make such a big difference in performance. Keep up the good work!",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t2",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.",
        "memory_text": "1. Co-worker A's confidence in collecting evidence for a case leads to Co-worker B commending them for standing up for their beliefs. This encourages Co-worker A to be more mindful of their interactions with others in the future. Furthermore, Co-worker A's experience with challenging clients highlights the significance of communication and clear expectations.\n\n2. Co-worker A's belief in the strength of their evidence is praised by Co-worker B for their bravery in defending their position. This prompts Co-worker A to be more considerate of how they present themselves to others. In addition, Co-worker A's background in handling difficult clients underscores the importance of effective communication and managing expectations.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you, that means a lot coming from you. I believe effective communication is key in any interaction.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t2",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support. This has made Classmates B feel valued and appreciated. Classmates A saved up for the car despite it being pricey.\n2. Classmates A appreciates Classmates B's efforts and support. They both value their friendship and feel comfortable talking to each other about anything. Classmates A and B appreciate the support and friendship they have. \n3. Classmates A appreciates Classmates B's efforts and support. As a result, both Classmates A and B are looking forward to hanging out outside of school. They got a new Ford Mustang car and took it for a test drive on the highway.",
        "speaker": "Classmates A",
        "raw_prediction": "I helped them fix their leaky faucet and mow their lawn. It felt good to lend a hand.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t3",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A. As a result, Classmates A wants to value each other's opinions, even though Classmates B was initially worried about Classmates A going out with friends.\n   \n2. Classmates A is struggling to make friends and adjust to a new school, which makes Classmates A appreciate Classmates B's efforts and support.\n\n3. Classmates B advised Classmates A to drive safely to avoid accidents, showing responsibility and reliability. This changed the dynamic, leading to Classmates B being supportive and helpful to Classmates A.",
        "speaker": "Classmates B",
        "raw_prediction": "That's so thoughtful of you to help out your neighbor like that. I'm sure she really appreciated your assistance.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t6",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A, which Classmates A appreciates. Classmates B then advised Classmates A to drive safely to avoid accidents.\n2. Classmates A appreciates the support and friendship of Classmates B, as they value their friendship and feel comfortable talking to each other about anything.\n3. Classmates A and B started as acquaintances and have developed a strong friendship, which Classmates A appreciates. Initially worried about Classmates A going out with friends, Classmates B now values their opinions.",
        "speaker": "Classmates A",
        "raw_prediction": "Definitely, helping others in need is something we should all strive to do. It's all about making the world a better place one small act of kindness at a time.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t3",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.",
        "memory_text": "The wife supports the husband's goals but wanted to be involved in them. Both the husband and wife are supportive of each other's dreams and aspirations. The husband has long-awaited plans and is finally taking action on them, causing the wife to be disappointed that he didn't wait for her and wanted to be included in his plans. This led to the wife bringing up past disappointment when the husband left without her, breaking a promise to wait for her.",
        "speaker": "Wife",
        "raw_prediction": "That sounds like a wonderful idea, husband! I can't wait to spend some quality time together in the peaceful woods.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t14",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.\nWife: Thanks, husband. And speaking of good times, I had so much fun at the dance a few weeks ago. Dancing with you always puts me in a good mood.",
        "memory_text": "The husband is inspired by his wife to take action on his dreams and goals. This drives him to achieve his dreams and put effort into making them a reality.\nThe wife reassures the husband of her continuous support and belief in him. This leads to the husband acknowledging his mistake, apologizing, and promising to make it up to his wife. He emphasizes the importance of keeping promises and taking action.",
        "speaker": "Husband",
        "raw_prediction": "Yes, that dance was a blast. I can't wait to have more moments like that during our weekend getaway.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t8",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.",
        "memory_text": "1. Classmates A praised Classmates B for their resilience and quick thinking during a scary experience in space, showing mutual admiration for each other's strengths.\n2. Both classmates value supporting and uplifting each other in their learning and growth, with Classmates A helping Classmates B out of friendship and belief in mutual support.\n3. Classmate B praises Classmate A's attention to detail and work ethic as truly impressive, while Classmate A emphasizes the importance of hard work and dedication in skill improvement.",
        "speaker": "Classmates A",
        "raw_prediction": "It happens to the best of us, don't worry too much about it. Just a funny mishap.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t6",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.",
        "memory_text": "Neighbors A is working on improving themselves and Neighbors B is supportive of their efforts. Neighbors A is also advised by Neighbors B to change their behavior at work. Both neighbors have a friendly and supportive relationship, enjoying coffee together.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I'm hopeful that all the hard work will pay off in the end.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.\nNeighbors B: Speaking of hard work, have you made any progress at your current job? I remember you were having some trouble with your boss.",
        "memory_text": "1. Neighbors A is taking responsibility for their actions and working on self-improvement, advised by Neighbors B to be more responsible at work.\n2. Neighbors B points out that Neighbors A's work attitude and behavior might be causing issues with their boss, leading Neighbors A to change and strive to be a better colleague.\n3. Neighbors B wishes for Neighbors A's success and stresses the significance of respect and effort at work, showcasing their supportive and friendly relationship.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, things have been going much better at work lately. I've been putting in more effort and my boss has noticed the positive changes. I'm hoping to continue improving and show that I'm a valuable member of the team.",
        "previous_summary": "Neighbors A is at risk of losing their job due to conflicts with colleagues.\nNeighbors B suggests that Neighbors A's attitude and behavior at work may be the reason for their boss wanting to fire them.\nNeighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.\nNeighbors B points out that it might be too late to change their boss's decision and emphasizes the importance of learning from mistakes.\nNeighbors A agrees to take responsibility for their actions and work on improving themselves.\nNeighbors A is having issues at work, such as not pulling their weight and being rude to colleagues.\nNeighbors B advised Neighbors A to change their behavior at work and be a responsible adult.\nNeighbors A is trying to improve their behavior at work and be a better colleague."
    },
    {
        "utter_id": "e35-s5-t4",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?",
        "memory_text": "1. [Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.] - (React) - [Co-worker A and Co-worker B have a strong bond and mutual respect for each other's talents.]\n2. [Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.] - (Changed) - [Co-worker A and Co-worker B are optimistic about their creative futures and are considering entrepreneurship.]\n3. [Co-worker A and Co-worker B met on a movie set and are now good friends.] - (React) - [Co-worker A values the friendship and growth they've experienced with Co-worker B.]",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, that was a challenging time, but your encouragement and support helped me get through it. I appreciate that so much.",
        "previous_summary": "Co-worker A and Co-worker B met on a movie set and are now good friends.\nCo-worker A was initially intimidated by Co-worker B due to their talent as a director.\nCo-worker B was nervous about working with Co-worker A because of their talent as an actor.\nBoth Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\nThey both believe that their teamwork made the movie a success.\nCo-worker A had a tough week on set, feeling overwhelmed and chaotic.\nCo-worker B expressed disapproval of Co-worker A's actions and suggested talking to the director to address the stressful situation.\nCo-worker A felt remorse for what they did and appreciated Co-worker B's understanding."
    },
    {
        "utter_id": "e36-s5-t1",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?",
        "memory_text": "1. Mentee has found a shelter for people who have been in abusive cults and is planning to escape there. Mentor suggests Mentee volunteer at a local church or religious organization to gain experience. Mentor became a mentor to help others going through similar situations.\n   \n2. Mentee expresses feeling suffocated and eager to leave the cult. Mentee has been thinking about helping others who may be in abusive cults.\n\n3. Both Mentee and Mentor agree to pack their things and get ready to leave without letting anyone know.",
        "speaker": "Mentor",
        "raw_prediction": "Yes, I believe it's important to try to understand different perspectives. It helps us empathize with others and see the world in a more compassionate way.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t8",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.",
        "memory_text": "1. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives. This approach helps Mentee to be more compassionate towards others, as discussed with Mentor.\n   \n2. Mentor encourages Mentee to approach teaching religion with an open mind and heart. This resonates with Mentor's belief that teaching religion or spiritual beliefs can help people feel connected and live by values, which is why Mentor became a mentor to help others going through similar situations.",
        "speaker": "Mentee",
        "raw_prediction": "It's amazing how much we can learn and grow when we take the time to truly listen and understand each other's perspectives.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.\nNeighbors B: Yes, and I appreciate it so much. It's always nice to have someone you can count on.\nNeighbors A: That's true. And speaking of which, I'm helping another friend move next weekend. It'll be a big job, but I know they'd do the same for me.\nNeighbors B: That's great. And if you need any help, just let me know.\nNeighbors A: Thanks, I will. I always feel like I can ask for help when I need it, and that's a really good feeling.",
        "memory_text": "Neighbors A thanked Neighbors B for the suggestion to visit their shop, where Neighbors A found a new necklace and loved it. This led to a discussion on the importance of strength in apologizing, with both neighbors agreeing on the sentiment.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that you have a strong support system. It's important to have friends you can rely on.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t2",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?",
        "memory_text": "1. Classmates A offered to provide support and stress-relieving massages to Classmates B, which was appreciated. This led to Classmates A offering help and support to Classmates B, showing their compassionate nature.\n2. Classmates A had doubts about trusting Classmates B due to rumors about their reliability, but they discovered a secret that Classmates B has been keeping, leading to a moment where Classmate A admired Classmate B's courage and strength in sharing the secret.\n3. Classmates B assures Classmates A that they will do their part in the group project, which was appreciated by Classmates A, who tends to overthink things and struggles with feeling satisfied with their work.",
        "speaker": "Classmates A",
        "raw_prediction": "I've been feeling a bit overwhelmed with the upcoming group project. Do you think we could meet up to discuss our roles and plan things out together?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.",
        "memory_text": "1. Classmates A and B, while working on a group project together, have developed a strong bond as supportive friends who always have each other's backs during stressful times. This has led to a close relationship with a high level of trust between them. Additionally, Classmate A values maintaining high standards and is reluctant to compromise on them.\n\n2. While collaborating on a group project, Classmates A and B's relationship took a turn when Classmate A uncovered a secret that Classmate B had been keeping. Reflecting on this discovery, Classmate A remembers a moment when they admired Classmate B's bravery and resilience in sharing this secret, showcasing their supportive and empathetic nature.\n\n3. After Classmate B reassured Classmate A about their commitment to the group project, Classmate A, known for overthinking, appreciated the support and guidance provided by Classmate B. Furthermore, Classmate B emphasizes the importance of self-compassion and finding a balance between striving for excellence and being kind to oneself.",
        "speaker": "Classmates A",
        "raw_prediction": "I understand if this is new territory for you. I just wanted to be honest about how I've been feeling.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t3",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.",
        "memory_text": "1. Classmates A is struggling with feeling competitive and the need to be the best at everything. As a result, Classmates A has not experienced similar pains in the past and is feeling worried about the situation.\n2. Classmates A is always looking to challenge themselves and improve their skills. In response, Classmates B offers support and suggests taking a step back to find a balance. Despite that, Classmates A had a muscle strain in their arm but did not go to the hospital.\n3. Classmates A is experiencing sudden pain in their left arm and is considering going to the hospital after Classmates B offers support and suggests taking a step back to find a balance. However, Classmate B reminds Classmate A to trust their instincts and know when to seek medical attention.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a great approach! It's important to challenge yourself and develop those critical thinking skills. Just remember to take breaks and find a balance to avoid burnout.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t8",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.",
        "memory_text": "Classmates A's competitiveness was fueled by facing tough competition from a fast girl in middle school. This motivated them to improve, which Classmates B acknowledged and emphasized the importance of enjoying the journey and effort put in, not just focusing on winning. Both classmates value taking moments to relax and appreciate small things.\n\nClassmates A's drive to challenge themselves and improve their skills is always present. In response, Classmates B offers support and suggests finding a balance. Despite Classmates B offering to take Classmates A to the hospital for a muscle strain in their arm, Classmates A declines, saying they will manage.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, it's amazing how dedication and effort can really make a difference. I just need to keep pushing myself to reach my goals.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t11",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.\nClassmates B: It's important to listen to your body and take care of yourself.\nClassmates A: Exactly. And sometimes, it's nice to just take a break and enjoy a quiet moment to yourself.",
        "memory_text": "Classmates A faced tough competition in middle school from a fast girl, motivating them to improve. This reminds Classmates B of the importance of enjoying the journey and effort put in, not just focusing on winning. Both classmates value taking moments to relax and appreciate small things.\n\nClassmates B acknowledges Classmates A's determination and competitiveness. This resonates with Classmates A who is struggling with feeling competitive and the need to be the best at everything. Classmates A has not experienced similar pains in the past and is feeling worried about the situation.\n\nClassmates A is always looking to challenge themselves and improve their skills. This prompts Classmates B to offer support and suggests taking a step back to find a balance. They also emphasize the importance of having someone to talk to about personal matters. Additionally, Classmate A emphasizes the importance of self-care and relaxation.",
        "speaker": "Classmates B",
        "raw_prediction": "Taking breaks and appreciating quiet moments can really help recharge your mind and body. It's important to find that balance between hard work and relaxation.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t1",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.",
        "memory_text": "1. Classmates A has matured since acknowledging the mistake and plans to learn from it, showing growth from past mistakes.\n2. Classmates A used to dance a lot in middle school, which makes Classmate A appreciate having friends who are there for them during difficult times. This friendship extends to helping each other with schoolwork.\n3. Acknowledging the mistake, Classmates A is considering taking a dance class for fun.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! It's always rewarding to gain new skills and knowledge. What do you plan to do next with your computer skills?",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t9",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?\nClassmates A: Yeah, I also learned some basic coding languages like HTML and CSS. It was challenging but really interesting.\nClassmates B: Wow, that sounds cool. Do you think you'll pursue coding further?\nClassmates A: Maybe, I'm not sure yet. But I definitely want to keep learning about computers and technology. It's such a relevant and useful skill to have nowadays.",
        "memory_text": "1. [Classmates A and B both appreciate having friends who are there for them during difficult times.]\n2. [Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility.]\n3. [Classmates A is considering taking a dance class for fun.]",
        "speaker": "Classmates B",
        "raw_prediction": "That's a great mindset to have! Keeping up with technology is definitely important in today's world.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t2",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?",
        "memory_text": "1. Co-worker B appreciates Co-worker A's support and encouragement after moving on from their past arrest, showing a positive change in their relationship. \n2. Co-worker A's efforts to be more conscious of their actions are acknowledged by Co-worker B, who highlights their responsibility at work and potential for success, boosting Co-worker A's confidence. \n3. Co-worker B reassures Co-worker A that making mistakes is part of the learning process, encouraging them to have more confidence and continue growing.",
        "speaker": "Co-workers A",
        "raw_prediction": "How about around 12:30 pm?",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t6",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?",
        "memory_text": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions. This leads to Co-worker B moving on from their arrest and appreciating Co-worker A's concern and change in behavior, reminding Co-worker A of their progress and potential for success. \nCo-worker A feels remorseful about the situation that led to Co-worker B's arrest, and as a result, Co-worker B has moved on and appreciates Co-worker A's concern and change in behavior, being supportive and encouraging towards Co-worker A. \nCo-worker B has been arrested in the past partly because of Co-worker A's actions, which is in the same topic as Co-workers A and B working together on a big story in the past, causing Co-worker A to be a journalist and a finalist in a singing competition.",
        "speaker": "Co-workers A",
        "raw_prediction": "I just wanted to say that I've been really working on being more responsible since then.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t8",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.\nCo-workers B: That's awesome, congratulations! I'm proud of you and all the hard work you've put in. You've definitely grown and matured in the workplace.",
        "memory_text": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions. This has caused Co-worker B to move on from their arrest and appreciate Co-worker A's concern and change in behavior. They both discuss Co-worker A's progress and potential for success.\n\nCo-worker A has made mistakes in the past but is trying to be more aware of their actions. As a result, Co-worker A is adjusting to the night shift schedule and excited for a promotion.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I really appreciate your support and encouragement. It means a lot coming from you.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t4",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?\nClassmates B: I'm sorry,, but I can't disclose that information. It's not my place to tell.\nClassmates A: But how did you find out? I haven't told anyone.\nClassmates B: Let's just say I have my ways of finding out things. But don't worry,, it's nothing bad or embarrassing.",
        "memory_text": "1. Classmates B warns Classmates A about the potential danger of dark alleys because Classmates A doesn't have their own car yet and takes the bus.\n2. Classmates B appreciates the genuine friendship and positive attitude of Classmates A, which causes Classmates A to be curious and open to exploring new things and taking risks.",
        "speaker": "Classmates A",
        "raw_prediction": "I guess I'll just have to trust that you have your reasons for keeping it to yourself.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t1",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.",
        "memory_text": "Neighbor A is grieving the recent loss of their grandmother. This has caused Neighbor A to be tired of living in a run-down apartment complex and want to improve their quality of life. As a result, Neighbor A recently moved to a new neighborhood and feels safer and happier there. This change has led Neighbor A to find solace in nature and believe that it helps in coping with their emotions.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm so sorry to hear that. It must be really tough for you right now.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t7",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.",
        "memory_text": "Neighbor A has a bit of a drive to get to the park where they are meeting with Neighbor B. This is because Neighbors A and Neighbors B enjoy going for walks together, especially to the park. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\n\nNeighbor A recently moved into the neighborhood and wanted to live in a nicer area. As a result, Neighbor B enjoys taking walks in the park after work to clear their mind. After their activities, Neighbors A and Neighbors B like to grab a bite to eat together. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n\nTired of living in a run-down apartment complex and wanting to improve their quality of life is the reason why Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood. Additionally, Neighbor A is grieving the recent loss of their grandmother.",
        "speaker": "Neighbors B",
        "raw_prediction": "How about we take a walk in the park together? It might help clear your mind and give us a chance to talk.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t1",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed. This support boosts Classmate A's confidence and motivates them to continue working hard towards their goals.\n   \n2. Classmate A appreciates the support and understanding from Classmate B. In return, Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.\n\n3. Classmate A has tried practicing in front of others but still feels nervous. Despite the nerves, Classmates A continues to practice basketball daily, both individually and with their team, incorporating weight training to improve strength. They believe in the importance of hard work and dedication to achieve success in both basketball and their job. Both classmates maintain a positive attitude towards each other and their goals.",
        "speaker": "Classmates A",
        "raw_prediction": "I know, it's a tough situation to be in. Have you considered seeking advice from a tax professional to help resolve this?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.",
        "memory_text": "1. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed. Classmates A believes in hard work and dedication to achieve goals both in basketball and their job. Both classmates have a positive attitude towards each other and their respective goals.\n2. Classmate B reassures Classmate A that they are all in it together and offers help if needed. Classmates A practices basketball every day, both individually and with their team, and also does weight training to build strength. Classmates A started working at the grocery store last week and is enjoying the experience, learning about running a store. Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\n3. Classmate A appreciates the support and understanding from Classmate B. Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.",
        "speaker": "Classmates B",
        "raw_prediction": "You should never cheat, especially on something as serious as taxes. It's important to find legitimate ways to handle financial struggles. How can I support you through this?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t6",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?\nClassmates B: Yeah, I remember. So, what does that have to do with cheating on your taxes?",
        "memory_text": "1. Classmates A practices basketball every day, both individually and with their team, and also does weight training to build strength. This is to help them pursue their dream of becoming a professional basketball player while working at a grocery store to save up money for training.\n   \n2. Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal. They believe in hard work and dedication to achieve goals both in basketball and their job, maintaining a positive attitude towards their aspirations.\n   \n3. Classmates B reassures Classmate A that they are all in it together and offers help if needed. Additionally, Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help when necessary, fostering a supportive environment for each other's goals.",
        "speaker": "Classmates A",
        "raw_prediction": "I just wanted to share that I'm feeling overwhelmed with everything lately.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?\nClassmates B: Yeah, I remember. So, what does that have to do with cheating on your taxes?\nClassmates A: It's just that I feel like I keep hitting roadblocks in my life. Every time I try to move forward, something happens to set me back. It's really discouraging.\nClassmates B: I understand that it can be tough, but cheating isn't the answer. You have to keep working hard and doing the right thing, even when it's hard.\nClassmates A: On a completely different note, do you remember when I got a job at the local grocery store?",
        "memory_text": "Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal. Classmates A believes in hard work and dedication to achieve goals both in basketball and their job. Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\nClassmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed. Both classmates have a positive attitude towards each other and their respective goals.\nClassmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed. Classmates A balances their job with basketball practice by scheduling shifts around practice time and requesting time off for games or tournaments.",
        "speaker": "Classmates B",
        "raw_prediction": "Yes, I remember when you started working at the grocery store. How's that going for you?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t10",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?\nClassmates B: Yeah, I remember. So, what does that have to do with cheating on your taxes?\nClassmates A: It's just that I feel like I keep hitting roadblocks in my life. Every time I try to move forward, something happens to set me back. It's really discouraging.\nClassmates B: I understand that it can be tough, but cheating isn't the answer. You have to keep working hard and doing the right thing, even when it's hard.\nClassmates A: On a completely different note, do you remember when I got a job at the local grocery store?\nClassmates B: Yeah, you seemed really happy with that job.",
        "memory_text": "Classmate B reassures Classmate A that they are all in it together and offers help if needed. - (SameTopic) - Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed. - (React) - Classmates A believes in hard work and dedication to achieve goals both in basketball and their job.\nClassmate A has tried practicing in front of others but still feels nervous. - (React) - Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal. - (React) - Both classmates have a positive attitude towards each other and their respective goals.\nClassmate B advises Classmate A to take deep breaths, stay confident, and focus on delivery. - (SameTopic) - Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed. - (React) - Classmates A believes in hard work and dedication to achieve goals both in basketball and their job.",
        "speaker": "Classmates A",
        "raw_prediction": "I've been putting in extra hours there to make ends meet, but it's been a struggle.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t2",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!",
        "memory_text": "1. Classmates B finds Classmates A's involvement in the community admirable and important. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference. As a result, Classmate A realizes that their current allergic reaction could be related to the previous discussion on allergies.\n\n2. Classmate A and Classmate B are classmates who attended a party together. In reaction to this, Classmate B suggests that Classmate A should go see the nurse immediately and take antihistamines if available.\n\n3. Classmates B finds Classmates A's involvement in the community admirable and important. This leads to Classmate A expressing a desire to find alternative ways to have fun and make a positive impact in the community. Subsequently, Classmate A, who is proactive and curious, takes the initiative to research topics of interest, resulting in the realization that their current allergic reaction could be related to the previous discussion on allergies.",
        "speaker": "Classmates A",
        "raw_prediction": "I know, right? I can't wait to spend the night here and just relax.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t5",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.",
        "memory_text": "1. Classmates A expresses a desire to find alternative ways to have fun and make a positive impact in the community, which leads to Classmates A being proactive and curious, taking the initiative to research topics of interest, and ultimately realizing that their current allergic reaction could be related to the previous discussion on allergies.\n\n2. Classmates A expresses a desire to find alternative ways to have fun and make a positive impact in the community, which leads to Classmates A agreeing to take better care of themselves in the future.\n\n3. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference, which leads to Classmate A realizing that their current allergic reaction could be related to the previous discussion on allergies.",
        "speaker": "Classmates B",
        "raw_prediction": "Being adventurous definitely pays off sometimes. I'm glad you found this perfect spot for us to camp out.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t8",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.\nClassmates B: That's true. You always seem to find the best spots. Like that time we went camping near the lake and had the whole place to ourselves.\nClassmates A: Oh yeah, that was a great spot too. It's always fun to explore and go on new adventures.\nClassmates B: Definitely. And it's also important to be prepared and bring all the necessary camping gear, like extra food and water, first-aid items, and warm clothes.",
        "memory_text": "Classmates A is actively involved in an action committee focused on improving the community and creating positive change. This involvement inspires Classmate A to seek alternative ways to have fun and make a positive impact in the community. As a result, Classmate A takes the initiative to research topics of interest. Subsequently, Classmate A connects their current allergic reaction to a previous discussion on allergies. \n\nClassmates A is actively involved in an action committee focused on improving the community and creating positive change. This motivates Classmate A to explore new ways to have fun and contribute positively to the community. In response, Classmate A commits to better self-care practices going forward. \n\nClassmates B admires and values Classmates A's community involvement. This admiration prompts Classmate A to explore different avenues for enjoyment and community impact. Acting on this desire, Classmate A proactively engages in researching various topics. This exploration leads Classmate A to link their current allergic reaction to a past conversation about allergies.",
        "speaker": "Classmates A",
        "raw_prediction": "Absolutely, being prepared is key for a successful camping trip. It's all about finding that balance between adventure and readiness.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.",
        "memory_text": "- Classmates A and B enjoy playing music together, plan to collaborate in the future, and have a supportive relationship.\n- Classmates A and B are both dedicated to their math class homework and share a passion for music.\n- Classmates A and B are excited about their new red sports cars and plan to celebrate with a drink.",
        "speaker": "Classmates A",
        "raw_prediction": "I get that. Just know that I'm here for you if you ever need help or support.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t9",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.",
        "memory_text": "1. Classmates A and B enjoy playing music together, as they have a friendly and supportive relationship.\n2. Classmates A and B find it awesome to pursue their passions after a conversation about following dreams.\n3. Classmates A and B both enjoy reminiscing about childhood memories, including playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a good idea. I'll start with making that list. Thanks for being so supportive.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t11",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?",
        "memory_text": "- Classmates A and B are both keeping up with the homework in their math class, and Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n- Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "I've been practicing regularly, and it's been really fulfilling. It's great to have a creative outlet like music.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t12",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.",
        "memory_text": "1. Classmates A and B enjoy playing music together and plan to collaborate on music in the future.\n2. Classmates A finds it awesome that Classmates B is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A is working on a new original song on the guitar.",
        "speaker": "Classmates A",
        "raw_prediction": "That's great to hear! Consistent practice really pays off. Keep it up!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t13",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?",
        "memory_text": "- Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n- Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams. Classmates A bought a sleek and red Mustang GT car, which Classmates B recently bought a red sports car and finds driving it to be fun and freeing.\n- Classmates A plays the guitar, takes lessons, and plays in a band, and has been dreaming of owning a Mustang GT since childhood.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't thought about it yet, but it's something I'd love to explore in the future. Thanks for the suggestion!",
        "previous_summary": "Classmates A plays the guitar, takes lessons, and plays in a band.\nClassmates B is interested in learning to play an instrument.\nClassmates A started playing the guitar because of a love for music and is working on their first album.\nClassmates A's band mostly plays at local bars and coffee shops.\nClassmates A's band is trying to build up their fan base and play at bigger venues.\nClassmates A and B enjoy jamming together and plan to collaborate on music in the future."
    },
    {
        "utter_id": "e47-s5-t15",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.",
        "memory_text": "1. Classmates A and B enjoy playing music together, plan to collaborate on music in the future, and have a supportive relationship.\n2. Classmates A pursuing their passion for music makes Classmates B feel awesome, and Classmates A recently bought a sleek and red Mustang GT car.\n3. Classmates A enjoys reminiscing about childhood memories, including playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "That sounds like a great idea! I appreciate your support and encouragement, Classmates A.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t16",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.\nClassmates B: That sounds like a challenge, but also kind of exciting. I'm in!",
        "memory_text": "- Classmates A and B are both keeping up with the homework in their math class, and they enjoy jamming together and plan to collaborate on music in the future.\n- Classmates A plays the guitar, takes lessons, and plays in a band, while Classmates B is working on a new original song on the guitar.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad you're open to the idea! It could be a great way to build your confidence and showcase your talent.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t21",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.\nClassmates B: That sounds like a challenge, but also kind of exciting. I'm in!\nClassmates A: Great, I'm looking forward to seeing you rock out on stage. Hey, remember when we talked about your new car a few hours ago? How's that going?\nClassmates B: I'm loving it! It's so much fun to drive. Thanks for asking, Classmates A.\nClassmates A: No problem, glad to hear it. Hey, I remember a few months ago when you talked about being reminded of your childhood and feeling emotional. How are you feeling about that now?\nClassmates B: I'm still feeling a bit emotional about it, but I've also been trying to focus on making new positive memories to replace the old ones.\nClassmates A: That's a great idea. It's important to acknowledge our emotions, but also not let them hold us back.",
        "memory_text": "[Classmates A and B discussing their respective experiences shows they have a friendly and supportive relationship, as evidenced by their conversation about keeping up with homework in their math class.]\n[After talking about pursuing dreams, Classmates A and B plan to collaborate on music in the future, enjoying jamming together.]\n[Classmates A reminisces about childhood memories, including playing on swings and making music with friends, showing a connection to the topic of keeping up with homework in their math class.]\n[Classmates A's pursuit of their passion for music, following dreams, is admired by Classmates B, who also dreams of owning a Mustang GT since childhood.]",
        "speaker": "Classmates B",
        "raw_prediction": "Thanks for understanding, Classmates A. It means a lot to have your support.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t8",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.",
        "memory_text": "Neighbor B's reminder of Neighbor A's potential to do good things referencing a house that Neighbor A built for them makes Neighbor A consider using their skills for good instead of evil.\nNeighbor A's enjoyment in building houses and finishing them quickly caused them to find building the new house challenging but rewarding with the help of friends.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks for the reminder. I'll head to the library and get back on track with this project.",
        "previous_summary": null
    }
]