[
    {
        "utter_id": "e1-s5-t2",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. ",
        "memory_text": "1. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n2. Speaker B is looking forward to eating a pizza burger in a pool with punk music playing.\n3. Speaker A offers to teach Speaker B how to swim and programming.\n4. Speaker A finds swimming relaxing and uses it to destress from their job.\n5. Speaker A knows how to swim since the age of 5.\n6. Speaker B enjoys cruising in their car while listening to punk music.",
        "speaker": "Speaker A",
        "raw_prediction": "Don't worry, I'll make sure to start with the basics and help you feel comfortable in the water. Plus, with some punk music playing in the background, you'll be cruising through the pool in no time!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t4",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.",
        "memory_text": "1. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n2. Speaker A offers to teach Speaker B how to swim and programming.\n3. Speaker A and Speaker B discuss the potential of getting on a cruise ship together.\n4. Speaker A is planning a snorkeling trip and has signed up for several trips.\n5. Speaker B is afraid of cruises because they can't swim.\n6. Speaker B is looking forward to eating a pizza burger in a pool with punk music playing.",
        "speaker": "Speaker A",
        "raw_prediction": "That would be awesome! Imagine swimming in the pool, enjoying a pizza burger, with punk music playing in the background. I'll make sure you have a great time, even if it's your first cruise.",
        "previous_summary": "Speaker A enjoys cruising and has a favorite club in school.\nSpeaker A knows how to swim since the age of 5.\nSpeaker A has planned a cruise to the Caribbeans.\nSpeaker B is afraid of cruises because they can't swim.\nSpeaker A is not nervous about going on a cruise.\nSpeaker A recommends hiking and exploring the local area for those who can't swim.\nSpeaker A and Speaker B discuss the potential of getting on a cruise ship together.\nSpeaker A plans to travel to the Caribbean for their next trip.\nSpeaker A offers to teach Speaker B how to swim and programming."
    },
    {
        "utter_id": "e1-s5-t5",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?",
        "memory_text": "1. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n2. Speaker A offers to teach Speaker B how to swim and programming.\n3. Speaker A and Speaker B discuss the potential of getting on a cruise ship together.\n4. Speaker A is planning a snorkeling trip and has signed up for several trips.\n5. Speaker A plans to travel to the Caribbean for their next trip.\n6. Speaker B is afraid of cruises because they can't swim.",
        "speaker": "Speaker B",
        "raw_prediction": "No, I haven't been to the Caribbean. It sounds amazing, but I'm still a bit hesitant about cruises because I can't swim.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t10",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.",
        "memory_text": "1. Speaker A offers to teach Speaker B how to swim and programming.\n2. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n3. Speaker A and Speaker B discuss the potential of getting on a cruise ship together.\n4. Speaker B is interested in learning programming and is already practicing.\n5. Speaker A is planning a snorkeling trip and has signed up for several trips.\n6. Speaker A enjoys the food and the adventure of cruises.",
        "speaker": "Speaker A",
        "raw_prediction": "Sure, I'd be happy to show you some different programming languages. We can start with something beginner-friendly like Python or JavaScript. Once you get the hang of it, we can explore more advanced languages together. It's going to be a fun learning journey!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t11",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.\nSpeaker A: Sure. I usually like to start with html and css so we can start there. We'll order some pizzaburgers to help us out. ",
        "memory_text": "1. Speaker A offers to teach Speaker B how to swim and programming.\n2. Speaker B enjoys punk music and wants to listen to it while swimming and learning programming.\n3. Speaker A and Speaker B discuss the potential of getting on a cruise ship together.\n4. Speaker B is interested in learning programming and is already practicing.\n5. Speaker B is looking forward to eating a pizza burger in a pool with punk music playing.\n6. Speaker A enjoys the food and the adventure of cruises.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a tasty way to kick off our programming lessons! Looking forward to diving into HTML and CSS with some delicious pizzaburgers by the pool.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.",
        "memory_text": "1. Speaker A plans to try the famous hamburgers made by Speaker B at the diner.\n2. Speaker B has invented a chilli dog casserole that Speaker A wants to try.\n3. Speaker A and Speaker B are involved in different fields of work, cooking and lab research.\n4. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce.\n5. Speaker B is planning to major in molecular biology.\n6. Speaker B works on weekends at a research lab, showing an interest in neuroscience.",
        "speaker": "Speaker B",
        "raw_prediction": "That's totally understandable. It's always good to be cautious and informed about what we're consuming. Plant-based options are a great alternative, and it's always fun to try new things. Maybe one day you can try my chili dog casserole too, it's a unique dish that might surprise you!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t9",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,",
        "memory_text": "1. Speaker B has invented a chilli dog casserole that Speaker A wants to try.\n2. Speaker A plans to try the famous hamburgers made by Speaker B at the diner.\n3. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce.\n4. Speaker A and Speaker B are involved in different fields of work, cooking and lab research.\n5. Speaker B works on weekends at a research lab, showing an interest in neuroscience.\n6. Speaker A had cheesy ham and potato soup for dinner.",
        "speaker": "Speaker B",
        "raw_prediction": "I totally get that! The atmosphere in an ice cream shop really adds to the experience. Cheesecake flavored ice cream sounds amazing, and Ben & Jerry's always has some unique and delicious flavors. Have you ever tried making your own ice cream at home?",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t1",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.",
        "memory_text": "1. Speaker A and Speaker B plan to travel to Sweden together.\n2. Speaker A is considering visiting their cousin in Sweden and needs to save money for the trip.\n3. Speaker B misses Sweden and has fond memories of the country.\n4. Speaker B has not visited Sweden for a long time due to the high expenses.\n5. Speaker A has a cousin in Sweden but has not visited the country.\n6. Speaker B's parents still live in Sweden, and they find it expensive to travel there.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear! Have you started saving up for the trip?",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t1",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?",
        "memory_text": "1. Speaker B is a therapist and a football fan, supporting the Chiefs.\n2. Speaker B has been working in their own practice for about six years.\n3. Speaker B is considering the psychological aspects of owning a horse, relating it to Freudian theories.\n4. Speaker B is a professional in a practice, where it is illegal for them to have relationships with clients.\n5. Speaker A mainly knows about horses and doesn't know much about psychology.\n6. Speaker A is married and has been for four years.",
        "speaker": "Speaker B",
        "raw_prediction": "I've always been fascinated by the human mind and behavior. I wanted to help people navigate through their struggles and find a way to lead happier, more fulfilling lives. It's a rewarding profession that allows me to make a positive impact on others.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t4",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  ",
        "memory_text": "1. Speaker B is a therapist and a football fan, supporting the Chiefs.\n2. Speaker B is considering the psychological aspects of owning a horse, relating it to Freudian theories.\n3. Speaker B has been working in their own practice for about six years.\n4. Speaker A mainly knows about horses and doesn't know much about psychology.\n5. Speaker B is a professional in a practice, where it is illegal for them to have relationships with clients.\n6. Speaker A is married and has been for four years.",
        "speaker": "Speaker A",
        "raw_prediction": "No, I've never been to therapy, but I can imagine how beneficial it could be. I usually find solace in spending time with my horses. They're great listeners, even if they can't talk back!",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t5",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.",
        "memory_text": "1. Speaker B is considering the psychological aspects of owning a horse, relating it to Freudian theories.\n2. Speaker A mainly knows about horses and doesn't know much about psychology.\n3. Speaker B is a therapist and a football fan, supporting the Chiefs.\n4. Speaker A suggests that Speaker B could pay a fee to a ranch to take care of a horse.\n5. Speaker B lives in the city and is interested in having a horse in the future.\n6. Speaker B is concerned about the cost of owning horses, including medical fees and expenses like horse shoes.",
        "speaker": "Speaker B",
        "raw_prediction": "It's interesting that you find therapy in riding horses. Horses can be incredibly therapeutic animals. Maybe exploring your love for horses and how it ties into your past could be a valuable avenue to explore in therapy.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "1. Speaker B lives in the country, loves nature, and works with animals.\n2. Speaker A is a city dweller who walks to work instead of driving.\n3. Speaker B gets along somewhat with their sister.\n4. Speaker A also enjoyed reading 'Redwall' growing up and keeps an eye out for similar books.\n5. Speaker B enjoys reading the Odd Thomas and Dark Tower series and finds inspiration for their artwork during nature walks.\n6. Speaker A is a fan of the Game of Thrones series and enjoys audiobooks.",
        "speaker": "Speaker A",
        "raw_prediction": "Kyrie sounds like such a spirited companion! It must be wonderful having her by your side during your nature walks. It's true, a dog might be a bit challenging to keep in my apartment, but I do admire the energy and loyalty they bring. Do you find that spending time with Kyrie helps inspire your artwork in any way?",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t3",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?",
        "memory_text": "1. Speaker A is in a band and plays music, possibly a musician.\n2. Speaker A is in a band where they play the drums and write music, with 4 members including the singer who is their best friend.\n3. Speaker A is part of a band that tours different countries for their music.\n4. Speaker A wants to see Sublime live one day but doesn't go to many concerts other than the ones their band plays in.\n5. Speaker A is planning a concert in Denver and offers to get tickets for Speaker B.\n6. Speaker A enjoys eating fish, particularly salmon or tuna.",
        "speaker": "Speaker B",
        "raw_prediction": "I don't have a favorite rock band, but I do enjoy listening to a variety of rock music genres. Have you ever considered incorporating different rock influences into your band's music?",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t10",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.",
        "memory_text": "1. Speaker B wishes they had time to go surfing and is considering getting lessons at a surf shop.\n2. Speaker B finds fishing easier than surfing, but is interested in trying surfing.\n3. Speaker A grew up on the beach and is good at surfing, nicknamed \"lil fishie\".\n4. Speaker B is willing to teach Speaker A how to fish and cook.\n5. Speaker B listens to Sublime a lot while relaxing on the beach.\n6. Speaker A is preoccupied with not dying when surfing.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a shame your friends aren't into surfing, but it's great that you're keen to give it a try! Surfing can be such a fun and thrilling experience, especially when you catch that perfect wave. Maybe you can convince them to join you for a lesson at the surf shop, who knows, they might end up loving it too!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t1",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?",
        "memory_text": "1. Speaker B is a painter and is working on a portrait for Speaker A.\n2. Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\n3. Speaker B likes Persian cats and imagines their pets having interesting interactions.\n4. Speaker A has a brother and might commission a family portrait from Speaker B.\n5. Speaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\n6. Both Speaker A and Speaker B enjoy the company of their pets and think they are smart and playful.",
        "speaker": "Speaker B",
        "raw_prediction": "The portrait is almost ready, I'm glad you're enjoying the progress! My furry friends are doing great, thank you for asking. They've been keeping me company while I work on your portrait.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t3",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.",
        "memory_text": "1. Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\n2. Speaker B is a painter and is working on a portrait for Speaker A.\n3. Speaker B likes Persian cats and imagines their pets having interesting interactions.\n4. Speaker A prefers adopting pets from shelters rather than from breeders.\n5. Speaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\n6. Speaker A has a brother and might commission a family portrait from Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "That's wonderful! Adopting from a shelter is such a kind choice. I can already imagine your new cat having some playful interactions with your dogs in the family portrait I'll paint for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t5",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  ",
        "memory_text": "1. Speaker B likes Persian cats and imagines their pets having interesting interactions.\n2. Speaker A prefers adopting pets from shelters rather than from breeders.\n3. Speaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\n4. Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\n5. Both Speaker A and Speaker B enjoy the company of their pets and think they are smart and playful.\n6. Speaker B thinks pit bulls are lovely and has one that is kind and sweet.",
        "speaker": "Speaker B",
        "raw_prediction": "Naming a new pet is always so exciting! I bet your new cat will have a special name that suits their personality perfectly. Have you considered any Persian-inspired names, just for fun?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t8",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?",
        "memory_text": "1. Speaker B likes Persian cats and imagines their pets having interesting interactions.\n2. Both Speaker A and Speaker B enjoy the company of their pets and think they are smart and playful.\n3. Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\n4. Speaker A reads a novel a week, lives in the city, and goes to pilates class.\n5. Speaker A is interested in getting a dog and likes Akitas.\n6. Speaker B thinks pit bulls are lovely and has one that is kind and sweet.",
        "speaker": "Speaker A",
        "raw_prediction": "Starting with Youtube videos at home is a great idea to get a feel for Pilates! It's a good way to see if you enjoy the exercises before committing to a class. Plus, you might even be able to involve your pets in the workout somehow, knowing how creative you are with them!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t11",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?\nSpeaker A: You can probably start with Youtube just to see if you like it.  Much better to go to a class I think though.  Of course, I'm biased. I'm in love with my instructor! haha\nSpeaker B: Lol, okay I will definitely try it at home first. If I can get the hang of it, I will sign up for a class. Hopefully I can get an instructor as good as yours lol! \nSpeaker A: Well, getting some individual responses to questions and individual attention at times, I think makes a difference. But there is nothing wrong with going to youtube first!  I did!",
        "memory_text": "1. Speaker B likes Persian cats and imagines their pets having interesting interactions.\n2. Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\n3. Speaker A reads a novel a week, lives in the city, and goes to pilates class.\n4. Both Speaker A and Speaker B enjoy the company of their pets and think they are smart and playful.\n5. Speaker A is interested in getting a dog and likes Akitas.\n6. Speaker B thinks pit bulls are lovely and has one that is kind and sweet.",
        "speaker": "Speaker B",
        "raw_prediction": "That's a good point. I'll start with Youtube and see how it goes. Maybe my pets will even join in on the Pilates fun!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t1",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?",
        "memory_text": "1. Speaker B is planning an Alaskan vacation but has not planned much yet.\n2. Speaker B is unsure about what else there is to do in Alaska besides hiking.\n3. Speaker A and Speaker B are planning a trip to Alaska together.\n4. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\n5. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.\n6. Speaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.",
        "speaker": "Speaker B",
        "raw_prediction": "I've been looking into some wildlife tours to see bears and whales in their natural habitats. I think that would be a unique experience in Alaska.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t6",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.",
        "memory_text": "1. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\n2. Speaker B is unsure about what else there is to do in Alaska besides hiking.\n3. Speaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.\n4. Speaker A and Speaker B are planning a trip to Alaska together.\n5. Speaker B is planning an Alaskan vacation but has not planned much yet.\n6. Speaker A mentions that Alaska has mountains and glaciers, unsure if skiing is possible there.",
        "speaker": "Speaker A",
        "raw_prediction": "I think it's a good idea to check with your friend about the season so you can pack appropriately. Bears can be a concern in certain areas of Alaska, but as long as you take the necessary precautions and stay informed about where you are, you should be fine. Just be bear-aware and keep your distance if you happen to encounter any. Remember, safety first!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t8",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? ",
        "memory_text": "1. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\n2. Speaker B is unsure about what else there is to do in Alaska besides hiking.\n3. Speaker A and Speaker B are planning a trip to Alaska together.\n4. Speaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.\n5. Speaker B is planning an Alaskan vacation but has not planned much yet.\n6. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.",
        "speaker": "Speaker A",
        "raw_prediction": "I don't think Rocky and Bullwinkle were specifically from Alaska, but they were definitely inspired by the northern wilderness. Maybe you'll find some fun souvenirs related to them on your trip! Just remember to stick with your friend's advice to stay safe and enjoy all the unique experiences Alaska has to offer.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t11",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?\nSpeaker A: I think it could be a good idea, especially with all the large animals in Alaska and the terrain. I wouldn't rely on your friend and have someone more professional that knows a lot just in case. I'm sure the guide could also give you tons of suggestions of things to do while in the area, and maybe even the best ice cream places lol!",
        "memory_text": "1. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\n2. Speaker B is unsure about what else there is to do in Alaska besides hiking.\n3. Speaker A and Speaker B are planning a trip to Alaska together.\n4. Speaker B is planning an Alaskan vacation but has not planned much yet.\n5. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.\n6. Speaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.",
        "speaker": "Speaker B",
        "raw_prediction": "That's a good point. I'll look into hiring a professional guide to ensure a safe and enjoyable trip. It would be great to have someone knowledgeable about the area and activities. I'll make sure to ask them about the best ice cream spots too!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t2",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?",
        "memory_text": "1. Speaker A works at a restaurant and invited Speaker B to visit.\n2. Speaker A is a restaurant worker who enjoys working there but finds it very busy.\n3. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\n4. Speaker B loves the beach and Mediterranean food.\n5. Speaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.\n6. Speaker A enjoys the interaction with people at work and the variety of experiences that come with it.",
        "speaker": "Speaker A",
        "raw_prediction": "It's called Mediterranean Grilled Sea Bass. I heard the chef talking about how they marinate it in olive oil, garlic, and herbs for hours before grilling it to perfection. I'll make sure to send you a picture once it's ready!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t3",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!",
        "memory_text": "1. Speaker A works at a restaurant and invited Speaker B to visit.\n2. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\n3. Speaker A is a restaurant worker who enjoys working there but finds it very busy.\n4. Speaker B loves the beach and Mediterranean food.\n5. Speaker A is an omnivore.\n6. Speaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds delicious! I can't wait to see the picture and hear how it tastes. Your workplace seems to have some amazing dishes on the menu.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t6",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.",
        "memory_text": "1. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\n2. Speaker A works at a restaurant and invited Speaker B to visit.\n3. Speaker A is a restaurant worker who enjoys working there but finds it very busy.\n4. Speaker B loves the beach and Mediterranean food.\n5. Speaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners.\n6. Speaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a great choice! The tres leches cake with fresh raspberry jam sauce and lemon drizzle is definitely a fan favorite here. I'll make sure to save you a piece for when you visit next time.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t11",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.\nSpeaker A: Okay, I will try that! I've heard the can be made with different fruits. Did you have fruit with yours?\nSpeaker B: I like it best with fresh strawberries. And then it is even better with some fresh whipped cream and chocolate drizzle. Just thinking about it is making me want to have some right now!\nSpeaker A: Ooh, that sounds delicious! It's a rich and moist cake, so I don't think it should have too much chocolate. I've seen brown sugar and caramel versions too!\nSpeaker B: Oh I've never seen that version. That sounds scrumptuous. Tonight I'm going to bake some oatmeal raisin cookies.\nSpeaker A: That sounds great! I love a good oatmeal raisin cookie with the right amount of cinnamon! My brothers don't like them though, haha. They call them the \"vegetable of cookies\" :)",
        "memory_text": "1. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\n2. Speaker A works at a restaurant and invited Speaker B to visit.\n3. Speaker B loves the beach and Mediterranean food.\n4. Speaker A is a restaurant worker who enjoys working there but finds it very busy.\n5. Speaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners.\n6. Speaker A is an omnivore.",
        "speaker": "Speaker B",
        "raw_prediction": "Haha, that's a funny way to describe oatmeal raisin cookies! Well, more for you then. Do you ever bring home any of those delicious baked goods for your brothers to try, or do you keep them all to yourself?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t3",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.",
        "memory_text": "1. Speaker A is interested in teaching computer science, specifically in the field of robotics.\n2. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\n3. Speaker B is studying linguistics but mentions feeling limited in job opportunities.\n4. Speaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\n5. Speaker A and B both value education and continuous learning.\n6. Speaker A is involved with a football league and is looking forward to playing games.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear! Teaching robotics would be such a fascinating and fulfilling career. Your passion for the subject will definitely inspire your students. I'm sure you'll excel in that field.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t8",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.",
        "memory_text": "1. Speaker A is interested in teaching computer science, specifically in the field of robotics.\n2. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\n3. Speaker B is studying linguistics but mentions feeling limited in job opportunities.\n4. Speaker A and B both value education and continuous learning.\n5. Speaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\n6. Speaker B suggests trying the game Elder Scrolls, knowing Speaker A plays World of Warcraft.",
        "speaker": "Speaker A",
        "raw_prediction": "That's fascinating! World War II is such a complex and impactful period in history. It's great to see your interest in delving deeper into it. Have you considered incorporating your passion for history into your future teaching career?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.\nSpeaker A: For sure! So much happened and it really affected how the world is today. I like learning about the history of places where I have lived, it's really interesting.\nSpeaker B: That sounds really cool! What have you learned about where you currently live?\nSpeaker A: Oh, I found out that the big sports field used to be a farm where they grew wheat and raised cows! It's really cool to see places in old photos and see how they have changed.",
        "memory_text": "1. Speaker A is interested in teaching computer science, specifically in the field of robotics.\n2. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\n3. Speaker B is studying linguistics but mentions feeling limited in job opportunities.\n4. Speaker A and B both value education and continuous learning.\n5. Speaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\n6. Speaker B is part of a local amateur soccer team and used to play World of Warcraft a lot in high school and college.",
        "speaker": "Speaker B",
        "raw_prediction": "That's fascinating! It's amazing how much history is hidden in the places we see every day. Have you thought about incorporating local history into your teaching when you become a robotics professor?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t2",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?",
        "memory_text": "1. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.\n2. Speaker B expresses concern about leaving a kitten alone during their family camping adventures.\n3. Speaker A enjoys visiting the zoo and grew up in big cities.\n4. Speaker B is away from their child and glad that the pets are with them.\n5. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\n6. Speaker B's child wants to visit the zoo, particularly to see the monkeys.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm glad to hear she had a good time! I haven't done much camping, but I did go to the zoo last weekend. Have you been able to find someone to look after the kitten during your camping trips?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t8",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?",
        "memory_text": "1. Speaker A enjoys visiting the zoo and grew up in big cities.\n2. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\n3. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.\n4. Speaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua.\n5. Speaker B's child wants to visit the zoo, particularly to see the monkeys.\n6. Speaker A suggests taking the pets to the zoo and mentions that most major cities have good zoos.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I did! Joshua was looking majestic as always. Have you ever taken your daughter to see the tigers at the zoo?",
        "previous_summary": "Speaker B just moved to America and is unfamiliar with the places.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\nSpeaker B's child wants to visit the zoo, particularly to see the monkeys.\nSpeaker B is interested in finding family discounts for the zoo.\nSpeaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua."
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?\nSpeaker A: I think the Bronx Zoo is one of the best in the country.   Yes, I did see Joshua.  Did you use a season pass for the zoo or just a one time ticket?",
        "memory_text": "1. Speaker A enjoys visiting the zoo and grew up in big cities.\n2. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\n3. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.\n4. Speaker B is interested in finding family discounts for the zoo.\n5. Speaker B's child wants to visit the zoo, particularly to see the monkeys.\n6. Speaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua.",
        "speaker": "Speaker B",
        "raw_prediction": "We used a family pass. It's a great deal if you plan on visiting multiple times throughout the year. Joshua is such a magnificent tiger, isn't he?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t3",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?",
        "memory_text": "1. Speaker A has seen the Disney movie 'Luca' recently.\n2. Speaker B's kids enjoyed watching 'Luca' and said it was good.\n3. Speaker B's kids enjoy watching Disney movies, which Speaker B also finds good.\n4. Speaker B's husband enjoys Disney sports movies, such as 'Miracle'.\n5. Speaker B recommends Speaker A to watch 'Miracle'.\n6. Speaker B enjoys watching movies with her kids.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds amazing! Italy and Hawaii both sound like dream destinations. I'm sure you'll have a fantastic time on the sunset tour. As for us, we've been rewatching some of our favorite Disney classics at home with the kids. It's always a fun movie night for the whole family.",
        "previous_summary": "Speaker A is a plumber.\nSpeaker A has booked a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.\nSpeaker A has seen the Disney movie 'Luca' recently.\nSpeaker B's kids enjoyed watching 'Luca' and said it was good."
    },
    {
        "utter_id": "e14-s5-t8",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.",
        "memory_text": "1. Speaker A has seen the Disney movie 'Luca' recently.\n2. Speaker A has booked a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.\n3. Speaker B's kids enjoyed watching 'Luca' and said it was good.\n4. Speaker A works two jobs and struggles to make time for themselves, but still manages to plan a trip to Hawaii.\n5. Speaker B's kids enjoy watching Disney movies, which Speaker B also finds good.\n6. Speaker B enjoys watching movies with her kids.",
        "speaker": "Speaker A",
        "raw_prediction": "I've actually never had Hawaiian food before, so I'm looking forward to trying some authentic dishes while I'm there. It's always fun to experience new cultures through their cuisine. I'll definitely make sure to indulge in some local Hawaiian food during my trip.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.",
        "memory_text": "1. Speaker A plans to take Speaker B on tours and attend folk concerts during the visit.\n2. Speaker A invited Speaker B to visit and mentioned looking into flights.\n3. Speaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n4. Speaker A has invited Speaker B to visit them and is excited about the trip.\n5. Speaker A has visited Alaska and describes it as beautiful, suggesting cheap flights to Anchorage.\n6. Speaker A mentioned the warm weather at their location.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds fantastic! I love folk music. Count me in for the concert and a night out on the town. I'll keep an eye on the flights and let you know as soon as I find a good deal.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t7",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.",
        "memory_text": "1. Speaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n2. Speaker A suggests going on hikes in Alaska to see wildlife and mentions glaciers as a potential attraction.\n3. Speaker A plans to take Speaker B on tours and attend folk concerts during the visit.\n4. Speaker A has invited Speaker B to visit them and is excited about the trip.\n5. Speaker A has visited Alaska and describes it as beautiful, suggesting cheap flights to Anchorage.\n6. Speaker A mentioned the wildlife, including elk and wolves.",
        "speaker": "Speaker B",
        "raw_prediction": "That makes sense. I'll look into renting a car then. I wouldn't want to run into any wolves or elk unexpectedly. It sounds like having a car will give us more flexibility to explore safely.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?",
        "memory_text": "1. Speaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n2. Speaker A mentioned the wildlife, including elk and wolves.\n3. Speaker A suggests going on hikes in Alaska to see wildlife and mentions glaciers as a potential attraction.\n4. Speaker B is interested in going whale watching and asks about a wolf petting zoo.\n5. Speaker A plans to take Speaker B on tours and attend folk concerts during the visit.\n6. Speaker A has invited Speaker B to visit them and is excited about the trip.",
        "speaker": "Speaker A",
        "raw_prediction": "I've had a few close encounters, but my dogs are pretty good at sensing danger and keeping wildlife at bay. It's always an adventure living so close to nature!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t7",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.\nSpeaker A: Oh, I definitely will. Thanks for the motivation. Is this going to me your first festival?",
        "memory_text": "1. Speaker B's wife is pregnant, so they are considering attending a local festival for just a day.\n2. Speaker A and Speaker B discuss the logistics of attending a festival with a small baby.\n3. Speaker A and Speaker B enjoy bluegrass music.\n4. Speaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy.\n5. Speaker A is a guitar player and values jam time over social time.\n6. Speaker A mentions Drunky, who is likely a pet.",
        "speaker": "Speaker B",
        "raw_prediction": "No, I've been to a few festivals before, but this will be the first one with a little one on the way. It's going to be a different experience, but I'm looking forward to it.",
        "previous_summary": "Speaker B is a mechanic who enjoys working on cars.\nSpeaker B dislikes public transportation and enjoys going to festivals, but misses doing so.\nSpeaker B's wife is pregnant, so they are considering attending a local festival for just a day.\nSpeaker B's wife is pregnant and has three more months to go until the due date.\nSpeaker B is currently working on building cribs and will take two months off when the baby is born."
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "1. Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\n2. Speaker A likes cooking new dishes and following recipes occasionally.\n3. Speaker A enjoys cooking and finds it helpful for stress relief.\n4. Speaker A plays the drums and loves making food for others.\n5. Speaker A cooked steak, fried potatoes, and shrimp for dinner with their father.\n6. Speaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking.",
        "speaker": "Speaker A",
        "raw_prediction": "I haven't tried anything new recently, but I'm always up for experimenting with different flavors. I'll definitely take you up on the offer to learn how to make your spicy fried rice. Cooking together sounds like a great way to spend time.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t7",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.\nSpeaker A: unfortunately no, but I can ask them if they plan to get it in the future. I had one of each and they were all good in their own way. Have you ever had Birra tacos? I'd love to try those next.",
        "memory_text": "1. Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\n2. Speaker A likes cooking new dishes and following recipes occasionally.\n3. Speaker A plays the drums and loves making food for others.\n4. Speaker A enjoys cooking and finds it helpful for stress relief.\n5. Speaker A cooked steak, fried potatoes, and shrimp for dinner with their father.\n6. Speaker A enjoys surfing and offers to give Speaker B lessons.",
        "speaker": "Speaker B",
        "raw_prediction": "Birria tacos are amazing! The flavorful meat and melted cheese make them so delicious. If you're up for it, we can try making them together sometime. It's a fun dish to cook and perfect for a cozy night in.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t8",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.\nSpeaker A: unfortunately no, but I can ask them if they plan to get it in the future. I had one of each and they were all good in their own way. Have you ever had Birra tacos? I'd love to try those next.\nSpeaker B: I've never had birra tacos, what are those? They sound intriguing.",
        "memory_text": "1. Speaker A likes cooking new dishes and following recipes occasionally.\n2. Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\n3. Speaker A plays the drums and loves making food for others.\n4. Speaker A enjoys cooking and finds it helpful for stress relief.\n5. Speaker A cooked steak, fried potatoes, and shrimp for dinner with their father.\n6. Speaker A enjoys surfing and offers to give Speaker B lessons.",
        "speaker": "Speaker A",
        "raw_prediction": "Birria tacos are delicious! They're a traditional Mexican dish made with tender, flavorful stewed meat typically served in a crispy taco shell with melted cheese. It's definitely worth trying if you enjoy Mexican cuisine. I can show you how to make them sometime if you'd like!",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.",
        "memory_text": "1. Speaker A is a member of a soccer team and enjoys playing in tournaments.\n2. Speaker A plays soccer as a striker and has a match next week.\n3. Speaker B played intramural soccer in college and is a fan of Manchester United.\n4. Speaker A has been scoring well in soccer recently.\n5. Speaker A is a fan of Arsenal and enjoys watching international teams play.\n6. Speaker A is seeking career advice from a guidance counselor and is open to suggestions.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a great idea! It'll be a fun way to stay active and bond over our love for soccer. Let me know when you organize it, I'll definitely be up for some friendly matches.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t8",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.",
        "memory_text": "1. Speaker A is a member of a soccer team and enjoys playing in tournaments.\n2. Speaker A plays soccer as a striker and has a match next week.\n3. Speaker A has been scoring well in soccer recently.\n4. Speaker B played intramural soccer in college and is a fan of Manchester United.\n5. Speaker A is a fan of Arsenal and enjoys watching international teams play.\n6. Speaker A is seeking career advice from a guidance counselor and is open to suggestions.",
        "speaker": "Speaker A",
        "raw_prediction": "Casual games are always a great way to ease back into playing. It will be fun to have you join us on the field for a friendly match. I'll let you know when we organize the next one!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t3",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?",
        "memory_text": "1. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n2. Speaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\n3. Speaker B is interested in sports medicine and enjoys surfing.\n4. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n5. Speaker B is studying sports medicine and plays soccer, looking to join their college team in the future.\n6. Speaker B's professors have been supportive in writing letters for an internship application.",
        "speaker": "Speaker B",
        "raw_prediction": "I have a couple more years left before I graduate. It's great to hear that the beach helps your knees. I'll definitely take your advice and try to network through surfing more often. It could be a unique way to make connections in sports medicine.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "1. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n2. Speaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\n3. Speaker B is interested in sports medicine and enjoys surfing.\n4. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n5. Speaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\n6. Speaker B is studying sports medicine and plays soccer, looking to join their college team in the future.",
        "speaker": "Speaker A",
        "raw_prediction": "It's great that you're already planning ahead for internships. As for my knees, it's just wear and tear from years of hiking and being active. Surfing could be a good way for you to relax and network. Have you tried reaching out to any sports medicine clinics or local teams for internship opportunities?",
        "previous_summary": "Speaker A is retired and spends most days hiking.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B is interested in sports medicine and enjoys surfing."
    },
    {
        "utter_id": "e19-s5-t7",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?",
        "memory_text": "1. Speaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\n2. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n3. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n4. Speaker B is interested in sports medicine and enjoys surfing.\n5. Speaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\n6. Speaker B jokes about pretending to get hurt surfing to meet a doctor, showing a sense of humor and creativity.",
        "speaker": "Speaker B",
        "raw_prediction": "I haven't been to Europe yet, but it's definitely on my bucket list! I'd love to explore different countries and experience their cultures. Maybe one day I'll be able to add some European shells to my collection!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t9",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? ",
        "memory_text": "1. Speaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\n2. Speaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\n3. Speaker B is interested in sports medicine and enjoys surfing.\n4. Speaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\n5. Speaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\n6. Speaker B is studying sports medicine and plays soccer, looking to join their college team in the future.",
        "speaker": "Speaker B",
        "raw_prediction": "I haven't decided yet, but I do dream of having a career that allows me to travel and work in different places. Maybe I'll find a job that combines my passion for sports medicine and exploring new countries. It sounds like you've had some incredible adventures with your travels.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t4",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?",
        "memory_text": "1. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n2. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature.\n3. Speaker B has two terrier dogs as pets.\n4. Speaker A and Speaker B share a love for music and plan to have a house concert with their pets.\n5. Speaker B asks Speaker A if they have had a pet raccoon before.\n6. Speaker A has a pet raccoon and has a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "Sid surprisingly doesn't have much of an interest in human food, which is a relief. I guess I lucked out there! But he does love to bask in the sunlight near the window, it's adorable.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.",
        "memory_text": "1. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature.\n2. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.\n3. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid.\n4. Speaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\n5. Speaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\n6. Speaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, it was the warehouse job. I just felt like I needed a change of pace before starting something new. And yes, caring for elderly pets definitely requires more time and attention. How did you end up working at the zoo in the first place?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t8",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?",
        "memory_text": "1. Speaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\n2. Speaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\n3. Speaker A has a parrot as a pet and is considering adopting a rescue kitten.\n4. Speaker A's parrot Tasha has seen cats before and ignores them.\n5. Speaker A is interested in training tips for the kittens and is open to adopting one despite having a parrot.\n6. Speaker A suggested the name Zhao for one of the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": "I haven't been actively learning more Mandarin, but I try to incorporate a few new phrases now and then. Tasha's quite the polyglot! I think I'll stick to the basics for now though.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t9",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.",
        "memory_text": "1. Speaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\n2. Speaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\n3. Speaker A's parrot Tasha has seen cats before and ignores them.\n4. Speaker A has been learning Mandarin and Tasha has started saying Chinese phrases instead of English ones.\n5. Speaker B finds it amusing that Tasha speaks Mandarin and mutters things under her breath.\n6. Speaker A has a parrot as a pet and is considering adopting a rescue kitten.",
        "speaker": "Speaker B",
        "raw_prediction": "That's adorable! Maybe Tasha thinks you're teaching her new phrases. It's fascinating how pets pick up on our habits. Who knows, maybe she'll start responding in Mandarin too!",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t7",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.\nSpeaker B: I will someday. just not in the summer when all the bugs are out! Where do you go hiking the most?\nSpeaker A: I like to go hiking in the local trails here. I am familiar with them and there's so many routes that I can take. Sadly, the bugs are as bad here as they are anywhere else.....",
        "memory_text": "1. Speaker B recently went on a long hike and enjoyed it\n2. Speaker B dislikes bugs and is not a fan of camping, hiking, or the outdoors.\n3. Speaker A is nervous about the Appalachian Trail hike, as they don't usually do full day hikes.\n4. Speaker A has planned several camping trips for the summer and will be doing a part of the Appalachian Trail.\n5. Speaker A and Speaker B both enjoy being outdoors, but Speaker B prefers the fresh air over being in the mud and rain.\n6. Speaker A leads hikes for the group they camp with, which are usually an hour or two long.",
        "speaker": "Speaker B",
        "raw_prediction": "Maybe I'll consider joining you on one of your shorter hikes one day. It sounds like you make it a fun experience with all those snacks and drinks.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t2",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.",
        "memory_text": "1. Speaker B has a government job that pays the bills but wishes they could work in interior design.\n2. Speaker A has a passion for producing horror movies and believes everyone loves them.\n3. Speaker A also likes mid-century design and is a fan of horror movies.\n4. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\n5. Speaker B has two kids and enjoys painting and taking naps.\n6. Speaker A finds job searching challenging and hopes to settle in the new city soon with a steady income.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great to hear that you're enjoying producing horror movies! It's wonderful to have a creative passion that brings you fulfillment. Maybe you can find a way to incorporate your love for painting into your movie sets or props. It could add a unique touch to your films and combine your talents in a new and exciting way.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t10",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?\nSpeaker A: My last final is on English. I think I will do well, I just have to do a little more studying. Would you be willing to help me study?\nSpeaker B: Ah, English should be easier than History. Sure, I can help you. What do you need to do exactly? Write an essay?\nSpeaker A: Yeah, we have to write an essay and we have a spelling component towards the end of the exam, I sure could use a little help!\nSpeaker B: No problem! I like correcting and editing essays. Although, it seems like your English is pretty good. I doubt you even need much help.",
        "memory_text": "1. Speaker A struggles to maintain good grades and finds gym to be the only subject they excel in.\n2. Speaker B has sports medicine training and is taking an exam in that subject.\n3. Speaker B studies sports medicine and feels pressured to maintain straight A's to avoid embarrassing their mother who runs the school.\n4. Both speakers value good grades and believe it can lead to better job opportunities.\n5. Speaker B feels overwhelmed by their mother's strictness and is eager to finish school to escape it.\n6. Speaker A advises Speaker B to take breaks and prioritize their own happiness and well-being.",
        "speaker": "Speaker A",
        "raw_prediction": "Thank you for the offer! I appreciate your confidence in my English skills, but a second pair of eyes is always helpful. Plus, your expertise in sports medicine might bring a fresh perspective to my writing.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t7",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.",
        "memory_text": "1. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology.\n2. Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\n3. Speaker B enjoys Greek mythology and did a case study on Poseidon, the God of the Sea, Earthquakes, and Horses.\n4. Speaker B has been to Italy in the past and enjoyed the food there.\n5. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.\n6. Speaker B appreciates the idea of superhuman powers and is interested in historical events that involve such figures.",
        "speaker": "Speaker B",
        "raw_prediction": "I'd be more than happy to share my knowledge of Greek mythology with you! It's truly fascinating once you dive into it. And hey, brown hair can be just as fun! Maybe we can plan a trip to Greece together and explore all the historical sites and mythology together.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t8",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.",
        "memory_text": "1. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology.\n2. Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\n3. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.\n4. Speaker B has been to Italy in the past and enjoyed the food there.\n5. Speaker B enjoys Greek mythology and did a case study on Poseidon, the God of the Sea, Earthquakes, and Horses.\n6. Speaker A is going to a hair appointment for their birthday.",
        "speaker": "Speaker A",
        "raw_prediction": "Haha, I'll definitely have to switch up my hairstyles again soon! Thanks for the tips on Greece - I'll make sure to pack accordingly. I can't wait to explore all the history and mythology with you as my guide. It's going to be an amazing trip!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t3",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?",
        "memory_text": "1. Speaker B's husband is an avid cook who enjoys making Asian food with lots of prep work.\n2. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker.\n3. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.\n4. Speaker A recommends the pressure cooker for its efficiency and ease of use, suggesting it to Speaker B.\n5. Speaker A has given a pressure cooker as a gift and uses it for recipes like lamb shanks.\n6. Speaker B's husband is a great cook and Speaker B is not skilled in cooking.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a great idea! I'll give it a try. I'm excited to learn some new recipes using the pressure cooker.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t9",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.",
        "memory_text": "1. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker.\n2. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.\n3. Speaker B's husband is an avid cook who enjoys making Asian food with lots of prep work.\n4. Speaker A recommends the pressure cooker for its efficiency and ease of use, suggesting it to Speaker B.\n5. Speaker B lives in a rural area with a farm and can relate to cooking.\n6. Speaker A is interested in running a business with their cooking skills.",
        "speaker": "Speaker B",
        "raw_prediction": "That would be fantastic! I'll let you know when I have a free spot for a passenger. It would be great to have some company on the road, especially if we can chat about cooking and recipes along the way.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t5",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? ",
        "memory_text": "1. Speaker A and their brother enjoy going to a Brazilian steakhouse for dinner.\n2. Speaker A's brother enjoys Brazilian food, specifically steak.\n3. Speaker A enjoys salsa dancing and is planning to go out dancing.\n4. Speaker B works as a bartender and enjoys meeting different people.\n5. Speaker B expressed interest in trying healing methods mentioned by Speaker A.\n6. Speaker A is planning to take their clients salsa dancing for fun.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm glad you enjoyed the movie and the Brazilian food! My favorite food is sushi, I could eat it every day. It's great that you had an amazing steak, Brazilian steakhouses are known for their delicious meats.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t2",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them",
        "memory_text": "1. Speaker B is knowledgeable about plants and gardening, with a thriving garden.\n2. Speaker A struggles with gardening but finds the idea of space plants intriguing.\n3. Speaker B mentions weight gain from spending time at the computer and plans to work in the garden more.\n4. Speaker A jokes about space weeds and expresses a desire to see space.\n5. Speaker A plays the clarinet in a band concert and has a solar investment for their office building.\n6. Speaker A's parents are teachers.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds lovely! I'll definitely consider plum and pear trees for my garden. Do you have any tips on how to care for them during the different seasons?",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t3",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.",
        "memory_text": "1. Speaker B works for a computer company and is unable to change careers until their child graduates.\n2. Speaker A enjoys reading books about ice cream, Disney World, and computers.\n3. Speaker A works for a small local business with a demanding schedule.\n4. Speaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\n5. Speaker B's mother is a dentist and loves her job.\n6. Speaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.",
        "speaker": "Speaker B",
        "raw_prediction": "Yeah, I feel fortunate to enjoy what I do. It's important to find fulfillment in your work, don't you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!",
        "memory_text": "1. Speaker A enjoys origami and tried making a Lotus flower successfully.\n2. Speaker A learned origami by themselves in their craft room.\n3. Speaker A offered to teach Speaker B origami in a few weeks.\n4. Speaker A is interested in trying to make a lotus origami next.\n5. Speaker A volunteers at a hospital and enjoys making origami crafts, specifically a 3D modular swan with glue.\n6. Speaker B is interested in making origami animals and finds the idea cute.",
        "speaker": "Speaker B",
        "raw_prediction": "That's fascinating! I never realized origami could have such practical applications in healthcare. It's amazing how versatile this art form can be. I'm really looking forward to learning more about it from you.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t8",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?\nSpeaker B: Not up close, but I noticed a lot in shop windows in certain areas. I love Japan -- they're so welcoming. One of our acquaintances GAVE me a kimono. She said it's customary to try to share their culture. Kind of different from America in my opinion.  ",
        "memory_text": "1. Speaker A wishes to visit the country where origami was originally created, possibly Japan.\n2. Speaker A learned origami by themselves in their craft room.\n3. Speaker A enjoys origami and tried making a Lotus flower successfully.\n4. Speaker A offered to teach Speaker B origami in a few weeks.\n5. Speaker A is interested in trying to make a lotus origami next.\n6. Speaker B is interested in making origami animals and finds the idea cute.",
        "speaker": "Speaker A",
        "raw_prediction": "That's so thoughtful of your acquaintance to gift you a kimono! Japan really does have a beautiful and unique culture. Maybe one day you can wear the kimono while making origami animals together, it would be a fun way to embrace their traditions through art!",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t10",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?\nSpeaker B: Not up close, but I noticed a lot in shop windows in certain areas. I love Japan -- they're so welcoming. One of our acquaintances GAVE me a kimono. She said it's customary to try to share their culture. Kind of different from America in my opinion.  \nSpeaker A: Oh, that sounds wonderful. It's impressive how much things that came from there and how giving a culture they are. America is definetly a lot different from them, have you visted different states in America?\nSpeaker B: Oh yes. I live in North Carolina, but I've been to almost every state. Alaska was by far my favorite, but I'm kind of a loner and it feels like a lot of people there are, so maybe I just relate. But the scenery and landscapes are unbelievably beautiful. What's your favorite place you've been to?",
        "memory_text": "1. Speaker A wishes to visit the country where origami was originally created, possibly Japan.\n2. Speaker B has visited Japan and found it to be an amazing country.\n3. Speaker B was recommended volunteering by Speaker A and has traveled to Japan and Italy, enjoying the art and food.\n4. Speaker A enjoys origami and tried making a Lotus flower successfully.\n5. Speaker A learned origami by themselves in their craft room.\n6. Speaker A offered to teach Speaker B origami in a few weeks.",
        "speaker": "Speaker A",
        "raw_prediction": "That's fascinating that you've traveled to so many states! My favorite place I've been to is definitely Japan. The culture, the scenery, and the overall atmosphere just left a lasting impression on me. I hope you get a chance to visit Japan one day too, I think you'd really enjoy it based on your love for origami and appreciation of different cultures.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t4",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"",
        "memory_text": "1. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman.\n2. Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\n3. Speaker B enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy.\n4. Speaker A enjoyed the movie \"Coming to America\" and expressed interest in watching its sequel.\n5. Speaker A relies on Speaker B for movie suggestions, mentioning a preference for comedies.\n6. Speaker B recommended \"Coming 2 America\" and \"I-SPY\" starring Eddie Murphy.",
        "speaker": "Speaker A",
        "raw_prediction": "Oh, that sounds intriguing! I hope you enjoy watching \"Girl Next.\" Let me know how it turns out. As for me, I'm looking forward to watching \"Coming 2 America\" next. Thanks again for the recommendation!",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t5",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  ",
        "memory_text": "1. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman.\n2. Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\n3. Speaker B enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy.\n4. Speaker A relies on Speaker B for movie suggestions, mentioning a preference for comedies.\n5. Speaker A enjoyed the movie \"Coming to America\" and expressed interest in watching its sequel.\n6. Speaker B used to teach Film Studies and carefully chooses what movies to watch.",
        "speaker": "Speaker B",
        "raw_prediction": "My job definitely helps in discovering new movies to watch, but my love for films goes beyond that. I always keep an eye out for new releases and hidden gems. It's exciting to explore different genres and find captivating stories to enjoy.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t11",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.\nSpeaker A: Yes exactly. I think all kids should learn that. I know my grandkids love to watch all genre’s of movies and I think kids should learn what they like to watch. ",
        "memory_text": "1. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman.\n2. Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\n3. Speaker B has kids and enjoys watching movies with them.\n4. Speaker B used to teach Film Studies and carefully chooses what movies to watch.\n5. Speaker B enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy.\n6. Speaker A relies on Speaker B for movie suggestions, mentioning a preference for comedies.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear that your grandkids enjoy watching movies across different genres. It's important for kids to explore different types of films and find what they enjoy. It sounds like they have a fun movie-watching experience ahead of them with your guidance.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t4",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.",
        "memory_text": "1. Speaker A has a grandmother who teaches them various jello recipes.\n2. Speaker A suggests that Speaker B can consider their grandmother as a surrogate grandma for learning jello recipes.\n3. Speaker A has a strong connection to jello, particularly cherry flavor, due to their grandma making it at family dinners.\n4. Speaker A is eating their favorite jello.\n5. Speaker B does not do a lot of cooking or baking but is interested in learning.\n6. Speaker B also enjoys jello, with cherry being their favorite flavor as well.",
        "speaker": "Speaker A",
        "raw_prediction": "I totally get that! It's surprising how much sugar goes into desserts. Maybe you can try experimenting with low-sugar or sugar-free recipes to satisfy your sweet tooth without the guilt. You could even try making a healthier version of jello using natural sweeteners or fruit juices.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t3",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?",
        "memory_text": "1. Speaker B is considering adopting a kitten from a friend.\n2. Speaker B has a cat that recently had a kitten and enjoys visiting the zoo.\n3. Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\n4. Speaker A prefers cockatoos over kittens as pets.\n5. Speaker A has been to the zoo before and enjoys seeing exotic birds.\n6. Speaker A is focused on saving money and not planning to have children in the near future.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm still deciding between a beach destination or a mountain retreat. I love exploring new places and getting a change of scenery.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t6",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.",
        "memory_text": "1. Speaker B has a cat that recently had a kitten and enjoys visiting the zoo.\n2. Speaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\n3. Speaker A has been to the zoo before and enjoys seeing exotic birds.\n4. Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\n5. Speaker B is considering adopting a kitten from a friend.\n6. Speaker B likes poetry and fantasy books, and has a pet cat.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a great trip! Pandas are always a highlight at any zoo. I hope you have a fantastic time in San Diego and enjoy all the different animals they have there.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t9",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.",
        "memory_text": "1. Speaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\n2. Speaker B has a cat that recently had a kitten and enjoys visiting the zoo.\n3. Speaker A has been to the zoo before and enjoys seeing exotic birds.\n4. Speaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\n5. Speaker B is considering adopting a kitten from a friend.\n6. Speaker A has a sister who owns a corgi.",
        "speaker": "Speaker B",
        "raw_prediction": "Maybe your sister's corgi just needs a little time to adjust. It could be an entertaining day out for all of you, even if there's a bit of barking involved!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t5",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?",
        "memory_text": "1. Speaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father.\n2. Speaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest.\n3. Speaker A works at a coffee shop and is saving up for their next tattoo.\n4. Speaker A works at a coffee shop that their mom owned.\n5. Speaker A and Speaker B have a conversation about their personal interests and trips they have taken for work.\n6. Speaker B enjoys fishing and wishes their wife and sons could have joined them on the trip.",
        "speaker": "Speaker B",
        "raw_prediction": "I was thinking of getting it on my forearm. I've heard that area isn't too painful for tattoos. Maybe I'll gather my courage and finally get one to honor my family.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t6",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.",
        "memory_text": "1. Speaker B has been taking care of the raccoon for over a month and is interested in training it.\n2. Speaker B believes raccoons can make good pets if cared for properly.\n3. Bandicoot was a rescue and has been at the Raccoon Cafe since he was a baby.\n4. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.\n5. Speaker B owns a raccoon named Bandicoot and a bearded dragon named Bob.\n6. Speaker A is worried about the raccoon potentially eating the bearded dragon.",
        "speaker": "Speaker A",
        "raw_prediction": "Wow, Bandicoot sounds like quite the troublemaker! I can't imagine the stress of having to constantly outsmart a raccoon. It must keep you on your toes. I hope you find a way to keep him entertained without causing too much chaos in your home.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t1",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.",
        "memory_text": "1. Speaker A has grandchildren and mentions watching them.\n2. Speaker A is tired after spending time with their energetic grandchildren.\n3. Speaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.\n4. Speaker A suggests taking naps during quiet times and mentions watching her grandkids.\n5. Speaker A is older and babysits their grandchildren about four days a week and most weekends.\n6. Speaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a relaxing way to spend your day off from babysitting. What book did you pick up?",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t2",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? ",
        "memory_text": "1. Speaker A is tired after spending time with their energetic grandchildren.\n2. Speaker A has grandchildren and mentions watching them.\n3. Speaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.\n4. Speaker A suggests taking naps during quiet times and mentions watching her grandkids.\n5. Speaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.\n6. Speaker B is a parent to a young son who keeps them busy throughout the day.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, it was a nice change of pace. Sometimes a quiet afternoon with a good book is just what I need after keeping up with my energetic grandkids.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t4",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. ",
        "memory_text": "1. Speaker A is tired after spending time with their energetic grandchildren.\n2. Speaker A has grandchildren and mentions watching them.\n3. Speaker A watches Netflix shows rated over 3.5 stars after running out of things to watch.\n4. Speaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.\n5. Speaker B is fascinated by animals and can relate to Speaker A's comparison of their grandchildren to animals.\n6. Speaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.",
        "speaker": "Speaker A",
        "raw_prediction": "I guess I just love the thrill of a good mystery! Keeps me on the edge of my seat, especially after all that non-stop energy from the grandkids.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?",
        "memory_text": "1. Speaker B is fascinated by animals and can relate to Speaker A's comparison of their grandchildren to animals.\n2. Speaker A is tired after spending time with their energetic grandchildren.\n3. Speaker A watches Netflix shows rated over 3.5 stars after running out of things to watch.\n4. Speaker A has grandchildren and mentions watching them.\n5. Speaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.\n6. Speaker A was influenced by Alex Trebek and Ken Jennings to develop a love for books and reading.",
        "speaker": "Speaker A",
        "raw_prediction": "No, not yet. But I heard they might be adapting it into a mini-series soon. I'll keep you posted if I hear any updates!",
        "previous_summary": "Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.\nSpeaker B has a son and enjoys reading books, particularly about animals.\nSpeaker A watches Netflix shows rated over 3.5 stars after running out of things to watch."
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.",
        "memory_text": "1. Speaker A watches Netflix shows rated over 3.5 stars after running out of things to watch.\n2. Speaker B is fascinated by animals and can relate to Speaker A's comparison of their grandchildren to animals.\n3. Speaker A has grandchildren and mentions watching them.\n4. Speaker A is tired after spending time with their energetic grandchildren.\n5. Speaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.\n6. Speaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.",
        "speaker": "Speaker B",
        "raw_prediction": "That's exciting! Maybe it'll be one of those Netflix shows you end up binging because it's rated over 3.5 stars. Who knows, it might even rival your Jeopardy nights with the grandkids!",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t1",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!",
        "memory_text": "1. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker A has a cat that recently had a kitten.\n3. Speaker B is not a cat person but ends up taking care of stray cats brought home by kids.\n4. Speaker A usually leaves their cats with a friend while traveling.\n5. Speaker B loves dogs.\n6. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.",
        "speaker": "Speaker B",
        "raw_prediction": "Pumpkin is perfect for the season! It's a cute and festive choice for the new kitten. I bet Ginger will have her paws full with the little one running around.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t3",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! ",
        "memory_text": "1. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker A has a cat that recently had a kitten.\n3. Speaker B is not a cat person but ends up taking care of stray cats brought home by kids.\n4. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.\n5. Speaker A enjoys drinking tea and water.\n6. Speaker B is excited for the trip and looking forward to trying the best iced tea.",
        "speaker": "Speaker B",
        "raw_prediction": "Haha, the Spice Girls of the feline world! That's adorable. Pumpkin is a perfect fit for your little fur family.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t8",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat",
        "memory_text": "1. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker A has a cat that recently had a kitten.\n3. Speaker B is not a cat person but ends up taking care of stray cats brought home by kids.\n4. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.\n5. Speaker A usually leaves their cats with a friend while traveling.\n6. Speaker A is from a city known for great iced teas and prefers unsweetened iced tea.",
        "speaker": "Speaker A",
        "raw_prediction": "Maybe your kids will come up with some creative names for the cats! Who knows, they might end up naming them after famous iced teas from my city!",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t11",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat\nSpeaker A: That would be cruel to do. You need to rehome them properly or otherwise someone may report you to the authorities for animal abuse. My heart is breaking for your poor cats. \nSpeaker B: Thank you for concerning. I am trying to be nice to them do not worry \nSpeaker A: They all have their own unique personalities and maybe you will enjoy them more once you get to know them better. I think of Pumpkin and Ginger as my children and I am sure you would never consider abandoning your children. Ginger is going for surgery to make sure she has no more babies. Im worried that she may be in pain afterwards.",
        "memory_text": "1. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker B is not a cat person but ends up taking care of stray cats brought home by kids.\n3. Speaker A has a cat that recently had a kitten.\n4. Speaker A usually leaves their cats with a friend while traveling.\n5. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.\n6. Speaker B loves dogs.",
        "speaker": "Speaker B",
        "raw_prediction": "You're right, each cat has its own charm and quirks that make them special. I'm sure your care and attention will help them feel safe and loved. Ginger will be in good hands after the surgery, and I hope she recovers quickly without much discomfort.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t6",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? \nSpeaker B: I'll be living off campus, so absolutely. How about you? Are you staying in the dorms?",
        "memory_text": "1. Speaker B has two pet snakes named Hansel and Gretel.\n2. Speaker A finds it amusing that Speaker B prefers animals to humans.\n3. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n4. Speaker B goes to Hawaii for scuba diving and is considering studying marine life or a different type of animal.\n5. Speaker B has an interest in diving and is planning to take neuroscience classes using the GI Bill.\n6. Speaker A is interested in scuba diving and neuroscience, with experience in a research lab.",
        "speaker": "Speaker A",
        "raw_prediction": "I agree, snakes are truly fascinating creatures! And that's great that you'll be able to bring them with you. I'll actually be staying off campus as well, so no dorm life for me either. It's nice to have a bit more freedom and space.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t7",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? \nSpeaker B: I'll be living off campus, so absolutely. How about you? Are you staying in the dorms?\nSpeaker A: I'm glad your taking them with you. My mum wants me to stay in dorms. But I think I just want my own place, less drama and more freedom that way.",
        "memory_text": "1. Speaker B has two pet snakes named Hansel and Gretel.\n2. Speaker A finds it amusing that Speaker B prefers animals to humans.\n3. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n4. Speaker B goes to Hawaii for scuba diving and is considering studying marine life or a different type of animal.\n5. Speaker B has an interest in diving and is planning to take neuroscience classes using the GI Bill.\n6. Speaker B is a veteran who went to the army after high school, interested in neuroscience and seeking advice on studying it.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a good plan. Having your own place definitely has its perks. Plus, you'll have the freedom to focus on your studies without any distractions. And it's great that you can bring your pets along for the adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t3",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?",
        "memory_text": "1. Speaker A is taking a history of martial arts class and enjoys it.\n2. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.\n3. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things.\n4. Speaker A is a martial arts teacher and student and is pursuing an athletic training degree in college.\n5. Speaker B is busy debugging software and is a runner.\n6. Speaker A is a college student who teaches jiu-jitsu and is lactose intolerant.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm currently debugging a new software feature. It's been quite challenging, but I'm making progress. How was the class? Any new techniques you learned?",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t6",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.",
        "memory_text": "1. Speaker A and Speaker B are discussing furniture and home decor choices.\n2. Speaker A is looking to redecorate their house and likes purple furniture.\n3. Speaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture.\n4. Speaker A is looking forward to spending quiet evenings outside during the summer, possibly grilling most nights.\n5. Speaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.\n6. Speaker B regrets their green and purple color scheme and is willing to give away their purple furniture.",
        "speaker": "Speaker A",
        "raw_prediction": "A screened-in gazebo with a fire pit in the middle sounds like a cozy and inviting setup for your patio! It would be a great addition to your green and purple color scheme dilemma. Ikea has some great options for outdoor furniture that could complement that look. Plus, it'll be perfect for our summer evenings with music, food, and good company.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t10",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. ",
        "memory_text": "1. Speaker A has traveled around Europe before, visiting capital cities of each country.\n2. Speaker B and their kids are excited about their upcoming trip to Greece.\n3. Speaker B is planning a trip to Greece in the next three months with a family of five.\n4. Speaker B recommends visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece.\n5. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian.\n6. Speaker B asks Speaker A if their trip is more for relaxation or sightseeing.",
        "speaker": "Speaker A",
        "raw_prediction": "The museums in Paris are incredible, you'll love exploring them. The Louvre is a must-visit, and the Musee d'Orsay is fantastic for art lovers. Paris is truly a city filled with history and culture. I hope you get to experience it soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.",
        "memory_text": "1. Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600.\n2. Speaker B is a motivational speaker who travels to schools and conferences to give pep talks.\n3. Speaker A is training for marathons and seeking advice on how to recover.\n4. Speaker B's job involves motivating people to be successful and follow their dreams.\n5. Speaker B got into motivational speaking because they needed it themselves to battle depression and anxiety.\n6. Speaker B is considering running a marathon and mentioned fishing and feeling depressed.",
        "speaker": "Speaker A",
        "raw_prediction": "Haha, I guess I'll have to brace myself for those early morning motivational quotes! But hey, if it helps me push through and cross that finish line in the Alps marathon, I'm all for it. Let's do this!",
        "previous_summary": "Speaker B is a motivational speaker who travels to schools and conferences to give pep talks.\nSpeaker B's job involves motivating people to be successful and follow their dreams.\nSpeaker B got into motivational speaking because they needed it themselves to battle depression and anxiety.\nSpeaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600."
    },
    {
        "utter_id": "e45-s5-t1",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker B's friend worked at the same store and enjoyed the people there.\n3. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n4. Speaker A will use the money earned from the store to buy the hammock online.\n5. Speaker A plans to bring sandwiches and fruit for the hike, specifically asking about veggie sandwiches for Speaker B.\n6. Speaker B's neighbor, John, is getting divorced and selling top-of-the-line camping gear.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great news! I'm so happy for you. When do you start?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker B's friend worked at the same store and enjoyed the people there.\n3. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n4. Speaker A plans to bring sandwiches and fruit for the hike, specifically asking about veggie sandwiches for Speaker B.\n5. Speaker A will use the money earned from the store to buy the hammock online.\n6. Speaker B is excited about the idea of swimming in the lake, mentioning they have swum in cold water before.",
        "speaker": "Speaker B",
        "raw_prediction": "I've been working part-time at a local coffee shop. It's been pretty fun, and I get to meet a lot of interesting people. But your job sounds great, especially with the hiking trail nearby. You'll have to let me know how it goes once you start!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. ",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\n3. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n4. Speaker B's friend worked at the same store and enjoyed the people there.\n5. Speaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality.\n6. Speaker A will use the money earned from the store to buy the hammock online.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a nice way to unwind after a shift. I can imagine how peaceful it must be to relax in a hammock after a night of work. Plus, it's great that the job is in a location you enjoy. It's important to find those little moments of peace and happiness wherever we can.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t10",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.",
        "memory_text": "1. Speaker A applied to work at a grocery store near a hiking trail.\n2. Speaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\n3. Speaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality.\n4. Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\n5. Speaker A has a portable hammock for the hike and asks if Speaker B will bring theirs.\n6. Speaker B's friend worked at the same store and enjoyed the people there.",
        "speaker": "Speaker A",
        "raw_prediction": "I understand your concern, but I've been camping and hiking for years now, so I feel pretty comfortable being out in nature by myself. Plus, I always make sure to set up my hammock in a safe and secure spot. It's like my own little cozy sanctuary amidst the trees.",
        "previous_summary": "Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\nSpeaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\nSpeaker A is looking for a job and new camping gear, specifically a hammock.\nSpeaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail.\nSpeaker A has a portable hammock for the hike and asks if Speaker B will bring theirs.\nSpeaker A decides not to bring the hammock due to extra weight in their bag."
    },
    {
        "utter_id": "e46-s5-t5",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?",
        "memory_text": "1. Speaker A and Speaker B both bought lotto tickets for a big jackpot.\n2. Speaker A and Speaker B discuss different strategies for playing the lotto and the potential outcomes if they win.\n3. Speaker A bought 50 lotto tickets with different numbers to increase their chances of winning.\n4. Speaker B bought 20 lotto tickets with the same numbers, aiming to get a bigger share of the jackpot if they win.\n5. Speaker B's children have been sick, and Speaker B also had a fever, possibly influencing their decision to buy 20 lotto tickets.\n6. Speaker A and Speaker B have a friendly interaction and part ways on a positive note.",
        "speaker": "Speaker B",
        "raw_prediction": "Not yet, but I'm hopeful. With the way things have been going, a little luck wouldn't hurt. Plus, with my 20 tickets, who knows, maybe one of them will be the lucky one!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t2",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?",
        "memory_text": "1. Speaker A's sons will be coming for winter break from Europe.\n2. Speaker B's younger son would be jealous of Speaker A's sons' European tour.\n3. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next.\n4. Speaker A enjoys spending time with their sons despite worrying about them traveling far away.\n5. Speaker B is good at ice skating and suggests going to an ice skating rink during winter break.\n6. Speaker B has two sons, one who loves Chinese food like Speaker A, and the other who prefers Italian food.",
        "speaker": "Speaker A",
        "raw_prediction": "I wish I could visit them soon, but unfortunately, with work and other responsibilities, it's a bit challenging for me to travel all the way to Europe. I'll just have to enjoy their stories and photos from their adventures abroad for now.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t6",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?",
        "memory_text": "1. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next.\n2. Speaker A enjoys spending time with their sons despite worrying about them traveling far away.\n3. Speaker A's sons will be coming for winter break from Europe.\n4. Speaker B's younger son would be jealous of Speaker A's sons' European tour.\n5. Speaker A is a family man who loves spending time with his sons.\n6. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll be in Spain for about two weeks, so I'll have some time to travel around and explore. Portugal sounds wonderful, and it would be lovely to catch up with you while I'm in the area. I'll definitely let you know once I confirm my travel plans.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t1",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!",
        "memory_text": "1. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n2. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.\n3. Speaker A dreams of meeting all the puppies from history when they can move through space and time.\n4. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n5. Speaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat.\n6. Speaker A has experience working night shifts and sees it as a drawback.",
        "speaker": "Speaker B",
        "raw_prediction": "I can't wait to come by and meet the new cat! I adore kittens, but I have to agree, puppies are just so irresistible with their playful energy.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t5",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?",
        "memory_text": "1. Speaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it.\n2. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n3. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n4. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.\n5. Speaker B is interested in becoming a chef but hasn't had the time to apply for jobs.\n6. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.",
        "speaker": "Speaker B",
        "raw_prediction": "I would love to add a grilled asparagus recipe to my chef book! It sounds like a delicious and healthy option. Maybe we can try it out together sometime.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t6",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?",
        "memory_text": "1. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n2. Speaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it.\n3. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.\n4. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n5. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.\n6. Speaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat.",
        "speaker": "Speaker A",
        "raw_prediction": "I usually pair the grilled asparagus with a squeeze of fresh lemon juice on top for a zesty flavor. As for fajitas, I'm more of a chicken fajitas person myself. The combination of tender chicken with sautéed peppers and onions always hits the spot for me. How about you, do you lean towards chicken or beef fajitas?",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t9",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?\nSpeaker A: I prefer chicken to beef. I pair it with beef fajitas andI think it's great to have with a glass of merlot. Do you like wine?\nSpeaker B: You're making me hungry!  Yes, I do love wine.  As a matter of fact, I used to live in the Bordeaux region in France, so my favorite wine is Bordeaux wine.  But I also love champagne and cognac.\nSpeaker A: Haha, I know right? I lived in the Champagne region for a bit! Always wanted to go to Bordeaux. How was it there?",
        "memory_text": "1. Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\n2. Speaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it.\n3. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.\n4. Speaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat.\n5. Speaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in.\n6. Speaker B is interested in becoming a chef but hasn't had the time to apply for jobs.",
        "speaker": "Speaker B",
        "raw_prediction": "Bordeaux was incredible! The vineyards, the wine, the food - everything was just so rich in flavor. You'd absolutely love it there with your passion for cooking and wine. Maybe we can plan a trip there together one day and explore the culinary delights of the region.",
        "previous_summary": null
    }
]