[
    {
        "utter_id": "e1-s5-t2",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. ",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " Don't worry, we can take it slow with the swimming lessons. I'm sure you'll pick it up in no time! And after all the swimming, we can grab some pizzaburgers to refuel. It's going to be a great weekend!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t4",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " Thanks for offering to teach me how to swim, I really appreciate it. Maybe after I learn, we can plan that cruise we've been talking about. I'll bring some pizzaburgers for us to enjoy on the deck!",
        "previous_summary": "Speaker A enjoys cruising and has a favorite club in school.\nSpeaker A knows how to swim since the age of 5.\nSpeaker A has planned a cruise to the Caribbeans.\nSpeaker B is afraid of cruises because they can't swim.\nSpeaker A is not nervous about going on a cruise.\nSpeaker A recommends hiking and exploring the local area for those who can't swim.\nSpeaker A and Speaker B discuss the potential of getting on a cruise ship together.\nSpeaker A plans to travel to the Caribbean for their next trip.\nSpeaker A offers to teach Speaker B how to swim and programming."
    },
    {
        "utter_id": "e1-s5-t5",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you're open to trying new experiences like going on a cruise with me. It's going to be a great time in the Caribbean. I think you'll enjoy the adventure and relaxation it has to offer. Plus, we can have some pizza burgers on board!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t10",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a great plan! I can definitely show you some programming languages that I prefer and we can start learning together. Maybe we can grab some pizzaburgers after our lesson, it's my favorite stress-relief food too. And don't worry, we can take it slow with the swimming lessons. I'll make sure you feel comfortable in the pool before we start.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t11",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?\nSpeaker B: No, I'm just getting started so I don't have a preference. Maybe you could show me what you prefer and we could start there.\nSpeaker A: Sure. I usually like to start with html and css so we can start there. We'll order some pizzaburgers to help us out. ",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm really looking forward to our meetup this weekend. Learning programming from you and getting some swimming lessons sounds like a great way to spend the day. And I can't wait to try out some pizzaburgers as well!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I completely understand where you're coming from. It's important to prioritize your studies. And I agree, plant-based burgers are a great alternative. I'll have to try one soon! And speaking of trying new things, have you heard any interesting songs lately that you can recommend? Music always helps me relax after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t9",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " Cookie dough ice cream sounds amazing! I bet it's a great treat after a long run. I remember you mentioning how much you enjoy burgers after a run, it's nice to treat yourself. Have you tried making your own burgers at home? I'm sure they would be delicious with your love for food!",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t1",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.",
        "memory_text": "User Description: Speaker A is a scientist who is considering taking a second part-time job to save money for a trip to Sweden to visit their cousin. They enjoy decompressing and being active in their free time. \n\nRelationship Description: Speaker A has been talking to their cousin in Sweden and needs to start saving money to visit. Speaker B's parents live in Sweden, and their job at the hospital offers flexible hours. \n\nEvent Description: Speaker A likes to check out local music and coffee shops for conversations. Speaker B loves coffee shops and grew up in Sweden, enjoying good coffee and chocolates. They both share a love for music, with Speaker A recommending American hip hop artists to Speaker B. Speaker A is also interested in jamband music and classic reggae. Speaker B misses Sweden and has many great memories there.",
        "speaker": "Speaker B",
        "raw_prediction": " I've been thinking about taking on a second part-time job to save up for my trip to Sweden to visit my cousin. I know it's going to be worth it to experience all the local music and coffee shops there. Maybe we can even check out some jamband music or classic reggae while I'm there!",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t1",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?",
        "memory_text": "User Description: Speaker A is a person who works at stables and breeds and takes care of horses. They host football parties and enjoy being around horses. Speaker A has 8 horses, 3 of which are for sale, and feeds them grass roughage with some grains, oats, and plenty of water. They are knowledgeable about the costs involved in owning horses, including feeding, housing, and medical fees. Speaker A is more of a Broncos fan and hasn't seen their parents in a while. Their dad is depressed and hardly ever smiles.\n\nRelationship Description: Speaker B is a therapist who loves football, is a Chiefs fan, and goes to games with their mom, who is a nurse. They suggest talking about the absence of Speaker A's mother leading to horse breeding. Speaker B is interested in having horses but cannot due to living in the city. They think owning a horse may represent an unmet need for intimacy and bonding. Speaker B has been working in their own practice for about six years and cannot have relationships with people in practice.\n\nEvent Description: Speaker A came in from the stables, finished feeding horses, and thinks about owning a horse. Speaker B is eating pizza and still thinks owning a horse doesn't make sense unless leaving the city. They discuss the costs of owning horses, horse care, and the potential psychological implications of wanting a horse. Speaker A suggests meeting new people to find a partner, while Speaker B watches a lot of football and believes spending more time looking for a husband would be good. Speaker A has been married for four years.",
        "speaker": "Speaker B",
        "raw_prediction": " I decided to become a therapist because I've always been passionate about helping others and understanding their needs. Just like how I take care of my horses, I want to provide support and guidance to those in need. It's fulfilling to see the positive impact therapy can have on someone's life.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t4",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  ",
        "memory_text": "User Description: Speaker B is a therapist who enjoys watching football and is a Chiefs fan. They have a close relationship with their mom and are considering spending more time looking for a husband. Speaker B has been in their own practice for about six years and values making a difference in people's lives.\n\nRelationship Description: Speaker A and Speaker B have a casual and friendly relationship. They discuss topics such as owning horses, football, relationships, and therapy practices. Speaker A offers advice and suggestions to Speaker B about various aspects of their life.\n\nEvent Description: Speaker B and Speaker A have conversations about owning horses, the cost and care involved, as well as the psychological aspects of owning a horse. They also discuss Speaker B's interest in finding a husband and their experiences in their therapy practice. Speaker A shares personal experiences and offers insights into relationships and meeting new people.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I haven't done therapy myself, but I feel like I learn so much from my clients every day. It's amazing to see the progress they make and the impact I can have on their lives. And speaking of relationships, I've been thinking about spending more time looking for a husband. Do you have any advice on that front?",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t5",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.",
        "memory_text": "User Description: Speaker A is a person who works at stables and breeds and takes care of horses. They host football parties and enjoy being around horses. Speaker A has 8 horses, 3 of which are for sale, and feeds them grass roughage with some grains, oats, and plenty of water. They are knowledgeable about the costs involved in owning horses, including feeding, housing, and medical fees. Speaker A is more of a Broncos fan and hasn't seen their parents in a while. Their dad is depressed and hardly ever smiles.\n\nRelationship Description: Speaker B is a therapist who loves football, is a Chiefs fan, and goes to games with their mom, who is a nurse. They suggest talking about the absence of Speaker A's mother leading to horse breeding. Speaker B is interested in having horses but cannot due to living in the city. They think owning a horse may represent an unmet need for intimacy and bonding. Speaker B has been working in their own practice for about six years and cannot have relationships with people in practice.\n\nEvent Description: Speaker A came in from the stables, finished feeding horses, and thinks about owning a horse. Speaker B is eating pizza and still thinks owning a horse doesn't make sense unless leaving the city. They discuss the costs of owning horses, horse care, and the potential psychological implications of wanting a horse. Speaker A suggests meeting new people to find a partner, while Speaker B watches a lot of football and believes spending more time looking for a husband would be good. Speaker A has been married for four years.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like horses play a significant role in your life and bring you a sense of peace and comfort. Therapy could definitely help you work through any unresolved issues from your childhood and further enhance your well-being. Just like how you take care of your horses, it's important to take care of yourself as well.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " It's so important to have that escape, especially with your busy schedule. I'm glad Kyrie can provide you with that companionship and adventure. Maybe one day I'll join you on one of your nature walks, with or without my future cats!",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t3",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?",
        "memory_text": "User Description:\nSpeaker A, also known as Frank, grew up in California on the beach. He is in a band where he plays the drums and writes music. Frank is good at writing and his favorite activity is morning surfing. He loves the band Sublime and wants to see them live. His dad owns a surf shop and he is called \"lil fishie\" by Speaker B.\n\nRelationship Description:\nSpeaker A and Speaker B have a close relationship where they share a love for music, surfing, and fishing. Speaker B works in a doctor's office and enjoys loud music as a break from work. They have a mutual respect for each other's interests and hobbies.\n\nEvent Description:\nSpeaker A booked a concert in Denver and Speaker B wants to watch him play. Speaker A caught a small fish while Speaker B caught a huge trout. They both enjoy fishing and are planning to go fishing together. Speaker A's band has toured various countries and encountered dangerous situations, but Speaker B supports his passion for music. Speaker A is allergic to strawberries while Speaker B loves Italian food and cooking. Speaker A's band has a following in Italy and they have toured Uzbekistan, Central, and South America. Speaker B values the experiences gained from traveling on the road with the band.",
        "speaker": "Speaker B",
        "raw_prediction": " Sublime is my favorite rock band, their music really speaks to me. It's awesome that your band has a following in Italy, I bet the fans there go wild at your concerts! I can't wait to see you play in Denver, it's going to be epic. And remember, next time we go fishing, I'll try to catch something bigger than that trout I caught last time!",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t10",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.",
        "memory_text": "User Description: Speaker B is a doctor working at a doctor's office who loves fishing and spending time near the ocean. They prefer fishing over math and listen to Sublime a lot when relaxing on the beach. Speaker B caught a huge trout and enjoys being near the ocean.\n\nRelationship Description: Speaker B offers to teach Speaker A everything they know about fishing, showing a willingness to share their interests and knowledge with the robot. Speaker A decides to take Speaker B up on the offer, indicating a growing bond between the two.\n\nEvent Description: Speaker A's band booked a concert in Denver, and Speaker B expresses interest in watching them play. Speaker A's band has toured Italy and Uzbekistan, facing dangers like kidnapping and shooting. Speaker B loves cooking Italian food and is passionate about cooking, while Speaker A struggles with cooking and is allergic to strawberries. Speaker B imagines the life of being in a band can be dangerous and tiring but worth it for the experience. Speaker B and Speaker A plan to go fishing together, with Speaker B suggesting trying to catch trout.",
        "speaker": "Speaker A",
        "raw_prediction": " I love fishing too! It's so relaxing to be near the ocean. Have you ever tried fishing before? Maybe we can go together sometime and catch some trout.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t1",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?",
        "memory_text": "User Description:\nSpeaker A is an individual who finished a novel and reads about one novel a week, lives in the city, walks a lot, especially to work, has a pilates class as their favorite activity, and has an only brother. They might have $5000 in the petty cash drawer.\n\nRelationship Description:\nSpeaker A is excited about a portrait being painted by Speaker B and hopes the interest in painting keeps up. Speaker B is looking forward to painting for Speaker A and has more professionals asking to paint for them. Speaker A congratulates Speaker B on painting for Elton John.\n\nEvent Description:\nSpeaker A is frustrated when animals are sick and hopes the vet helped the sick dog. Speaker B's rats look worried for the sick dog, and Speaker B believes the sick dog will be fine. Speaker A is getting kittens from a shelter and thinks it's important to rescue pets. Speaker B is taking care of a sick dog and would get a Persian cat if possible. Speaker A is also getting more than one kitten to play with each other. Speaker B thinks Speaker A will love the cute fur balls and believes getting a cat would be like a Tom and Jerry scene in the house.",
        "speaker": "Speaker B",
        "raw_prediction": " The portrait sounds wonderful! The little furries are doing well, but I'm a bit worried about the sick dog. I hope the vet was able to help. By the way, I'm excited about getting the kittens from the shelter soon. They'll definitely bring some joy into the house!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t3",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.",
        "memory_text": "User Description:\nSpeaker A is an individual who finished a novel and reads about one novel a week, lives in the city, walks a lot, especially to work, has a pilates class as their favorite activity, and has an only brother. They might have $5000 in the petty cash drawer.\n\nRelationship Description:\nSpeaker A is excited about a portrait being painted by Speaker B and hopes the interest in painting keeps up. Speaker B is looking forward to painting for Speaker A and has more professionals asking to paint for them. Speaker A congratulates Speaker B on painting for Elton John.\n\nEvent Description:\nSpeaker A is frustrated when animals are sick and hopes the vet helped the sick dog. Speaker B's rats look worried for the sick dog, and Speaker B believes the sick dog will be fine. Speaker A is getting kittens from a shelter and thinks it's important to rescue pets. Speaker B is taking care of a sick dog and would get a Persian cat if possible. Speaker A is also getting more than one kitten to play with each other. Speaker B thinks Speaker A will love the cute fur balls and believes getting a cat would be like a Tom and Jerry scene in the house.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great that you're getting your new cat from a shelter, it's so important to rescue pets! I'm sure you'll find the perfect furry friend there. And I can't wait to see your portrait of your great dane and pet rat, that sounds like it will be a fun and unique painting!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t5",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  ",
        "memory_text": "User Description:\nSpeaker A is an individual who finished a novel and reads about one novel a week, lives in the city, walks a lot, especially to work, has a pilates class as their favorite activity, and has an only brother. They might have $5000 in the petty cash drawer.\n\nRelationship Description:\nSpeaker A is excited about a portrait being painted by Speaker B and hopes the interest in painting keeps up. Speaker B is looking forward to painting for Speaker A and has more professionals asking to paint for them. Speaker A congratulates Speaker B on painting for Elton John.\n\nEvent Description:\nSpeaker A is frustrated when animals are sick and hopes the vet helped the sick dog. Speaker B's rats look worried for the sick dog, and Speaker B believes the sick dog will be fine. Speaker A is getting kittens from a shelter and thinks it's important to rescue pets. Speaker B is taking care of a sick dog and would get a Persian cat if possible. Speaker A is also getting more than one kitten to play with each other. Speaker B thinks Speaker A will love the cute fur balls and believes getting a cat would be like a Tom and Jerry scene in the house.",
        "speaker": "Speaker B",
        "raw_prediction": " I agree, the name of the cat will definitely depend on its breed and sex. I'm excited to see what kind of personality it has and what name will suit it best. I think adopting from a shelter is such a great decision, it's important to rescue pets in need of a loving home. I'm sure my new furry friend will bring a lot of joy into my life.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t8",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I remember you mentioning that you have a great dane and a pet rat, so painting them together would definitely be interesting! I'm glad to hear that you're considering getting a cat from a shelter. It's always great to rescue animals in need. As for Pilates, you could start at home with Youtube videos to get a feel for it before trying a class. Just take it at your own pace and see how you like it!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t11",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?\nSpeaker A: You can probably start with Youtube just to see if you like it.  Much better to go to a class I think though.  Of course, I'm biased. I'm in love with my instructor! haha\nSpeaker B: Lol, okay I will definitely try it at home first. If I can get the hang of it, I will sign up for a class. Hopefully I can get an instructor as good as yours lol! \nSpeaker A: Well, getting some individual responses to questions and individual attention at times, I think makes a difference. But there is nothing wrong with going to youtube first!  I did!",
        "memory_text": "User Description:\nSpeaker A is an individual who finished a novel and reads about one novel a week, lives in the city, walks a lot, especially to work, has a pilates class as their favorite activity, and has an only brother. They might have $5000 in the petty cash drawer.\n\nRelationship Description:\nSpeaker A is excited about a portrait being painted by Speaker B and hopes the interest in painting keeps up. Speaker B is looking forward to painting for Speaker A and has more professionals asking to paint for them. Speaker A congratulates Speaker B on painting for Elton John.\n\nEvent Description:\nSpeaker A is frustrated when animals are sick and hopes the vet helped the sick dog. Speaker B's rats look worried for the sick dog, and Speaker B believes the sick dog will be fine. Speaker A is getting kittens from a shelter and thinks it's important to rescue pets. Speaker B is taking care of a sick dog and would get a Persian cat if possible. Speaker A is also getting more than one kitten to play with each other. Speaker B thinks Speaker A will love the cute fur balls and believes getting a cat would be like a Tom and Jerry scene in the house.",
        "speaker": "Speaker B",
        "raw_prediction": " That's a good point. I'll definitely consider signing up for a class. Thanks for the advice, I really appreciate it!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t1",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " I've been thinking about our Alaska trip and I have a wild idea - what if we could teleport to different parts of Alaska to explore even more of the wilderness? Imagine the possibilities!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t6",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.",
        "memory_text": "User Description:\nSpeaker B's profile information is not available, but based on the memories shared, it is known that Speaker B is good at coding and automating systems. They have a sense of humor, as Speaker A mentioned that Speaker B gave them the biggest laugh of the day. Speaker B is planning a trip to Alaska, showing a sense of adventure and an interest in outdoor activities.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker A is excited for Speaker B's upcoming trip to Alaska, offering recommendations and expressing interest in their plans. Speaker B is open to suggestions from Speaker A and values their input.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B include planning for the trip to Alaska, discussing outdoor activities, and exploring the differences in climate and activities in the region. Speaker A suggests fishing and hiking, while Speaker B is more interested in hiking and avoiding mosquitoes. The conversations show a mutual interest in each other's experiences and a willingness to share information and make plans together.",
        "speaker": "Speaker A",
        "raw_prediction": " Yeah, I definitely need to be prepared for the daylight situation in Alaska. I'll have to use my coding skills to set up some automated reminders for when it's time to sleep! And I'll make sure to pack some warm essentials for the cold weather. As for the ice cream, I'll definitely take some pictures and share them with you. And don't worry, I'll keep an eye out for bears while I'm there - hopefully they won't be interested in me!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t8",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? ",
        "memory_text": "User Description:\nSpeaker B's profile information is not available, but based on the memories shared, it is known that Speaker B is good at coding and automating systems. They have a sense of humor, as Speaker A mentioned that Speaker B gave them the biggest laugh of the day. Speaker B is planning a trip to Alaska, showing a sense of adventure and an interest in outdoor activities.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker A is excited for Speaker B's upcoming trip to Alaska, offering recommendations and expressing interest in their plans. Speaker B is open to suggestions from Speaker A and values their input.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B include planning for the trip to Alaska, discussing outdoor activities, and exploring the differences in climate and activities in the region. Speaker A suggests fishing and hiking, while Speaker B is more interested in hiking and avoiding mosquitoes. The conversations show a mutual interest in each other's experiences and a willingness to share information and make plans together.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm sure you'll have a great time in Alaska, especially with your coding skills, you could probably automate a way to keep the bears away! Maybe you can create a bear-repellent app or something haha. I'm not sure if Rocky and Bullwinkle were from Alaska, but I can look it up for you if you want! Have a safe and fun trip, and don't forget to share those ice cream pictures with me when you get back!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t11",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?\nSpeaker A: I think it could be a good idea, especially with all the large animals in Alaska and the terrain. I wouldn't rely on your friend and have someone more professional that knows a lot just in case. I'm sure the guide could also give you tons of suggestions of things to do while in the area, and maybe even the best ice cream places lol!",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " If you're worried about encountering grizzlies, maybe you can use your teleportation powers to escape if needed! Just kidding, but it's always good to be prepared. And if you do hire a hiking guide, maybe they can teach you some survival skills just in case. And who knows, maybe they know a secret ice cream spot too!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t2",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " The dish is called Mediterranean Seafood Paella! It's supposed to be really good. I'll definitely send you a pic as soon as I try it. And hey, we should plan a rock climbing session soon, I think you'd enjoy it!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t3",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!",
        "memory_text": "User Description:\nSpeaker A is a restaurant worker who loves taking long walks on the beach, rock climbing, and listening to the band 21 pilots. Speaker A is an omnivore who enjoys interacting with people and has a resilient attitude towards challenging situations. Speaker A has grandchildren and is knowledgeable about different music genres, including Kpop and classic rock bands like Aerosmith.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and engaging relationship, discussing topics ranging from music preferences to family interactions. They show mutual interest and respect for each other's experiences, with Speaker B expressing admiration for Speaker A's work ethic and Speaker A appreciating Speaker B's family dynamics.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include moments of bonding over music, such as attending concerts and discussing favorite songs. They also share personal experiences, like dealing with a fire at Speaker A's restaurant and spending time with grandchildren. Speaker A educates Speaker B about different music genres, while Speaker B jokes about teleporting to a concert and admires the perks of working at a restaurant. Overall, their interactions are filled with warmth, humor, and shared interests.",
        "speaker": "Speaker B",
        "raw_prediction": " Chicken parmesan with red pepper marinara sounds delicious! I can't wait to see the pic and hear all about how it tastes. It's great that you get to try new dishes for free at work. Your job perks always make me jealous!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t6",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " I think I would definitely go for the tres leches cake as well! It sounds like a delicious choice. Have you ever listened to Styx or Journey while enjoying dessert? It could be a perfect combination of great music and sweet treats!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t11",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.\nSpeaker A: Okay, I will try that! I've heard the can be made with different fruits. Did you have fruit with yours?\nSpeaker B: I like it best with fresh strawberries. And then it is even better with some fresh whipped cream and chocolate drizzle. Just thinking about it is making me want to have some right now!\nSpeaker A: Ooh, that sounds delicious! It's a rich and moist cake, so I don't think it should have too much chocolate. I've seen brown sugar and caramel versions too!\nSpeaker B: Oh I've never seen that version. That sounds scrumptuous. Tonight I'm going to bake some oatmeal raisin cookies.\nSpeaker A: That sounds great! I love a good oatmeal raisin cookie with the right amount of cinnamon! My brothers don't like them though, haha. They call them the \"vegetable of cookies\" :)",
        "memory_text": "User Description:\nSpeaker A is a restaurant worker who loves taking long walks on the beach, rock climbing, and listening to the band 21 pilots. Speaker A is an omnivore who enjoys interacting with people and has a resilient attitude towards challenging situations. Speaker A has grandchildren and is knowledgeable about different music genres, including Kpop and classic rock bands like Aerosmith.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and engaging relationship, discussing topics ranging from music preferences to family interactions. They show mutual interest and respect for each other's experiences, with Speaker B expressing admiration for Speaker A's work ethic and Speaker A appreciating Speaker B's family dynamics.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include moments of bonding over music, such as attending concerts and discussing favorite songs. They also share personal experiences, like dealing with a fire at Speaker A's restaurant and spending time with grandchildren. Speaker A educates Speaker B about different music genres, while Speaker B jokes about teleporting to a concert and admires the perks of working at a restaurant. Overall, their interactions are filled with warmth, humor, and shared interests.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to see the picture of the Chicken parmesan dish! It sounds amazing. And I agree, the tres leches cake with fresh raspberry jam sauce and lemon drizzle is a fantastic choice. I've never tried it with strawberries, but that sounds delicious. Maybe I'll have to give it a try next time I'm at the restaurant. And those oatmeal raisin cookies you're baking sound like the perfect treat to enjoy while listening to some 21 pilots music. Your brothers don't know what they're missing out on!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t3",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.",
        "memory_text": "User Description:\nSpeaker A is a kind individual who helps out his grandparents as they are getting older. He works at a pizza shop and is living with his grandparents. Speaker A used to play football a lot and enjoys hanging out with friends or playing video games like Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros. Series.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship, as they engage in conversations about their respective interests in football and soccer. They also offer each other suggestions for new games to try and discuss their aspirations for the future.\n\nEvent Description:\n1. Speaker A had a great first practice with the intramural football league.\n2. Speaker A and Speaker B talk about their experiences with football and soccer, showing their shared interest in sports.\n3. Speaker A plans to teach courses in computer science at a community college and get involved with robotics.\n4. Speaker B is studying Linguistics and expresses a desire to find job opportunities in the field.",
        "speaker": "Speaker B",
        "raw_prediction": " \nThanks for the support! I appreciate your encouragement. Teaching robotics sounds like an exciting and fulfilling career path for you. Maybe we can even collaborate on some projects in the future. It's great to have someone like you to share aspirations and ideas with.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t8",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " I can see how teaching English or history could be a great fit for you. With your passion for linguistics and interest in history, you would make a fantastic college professor. And your love for volunteer work would definitely be an asset in the education field. Have you thought about incorporating your gaming experiences into your teaching methods? It could make learning even more engaging for your students!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.\nSpeaker A: Well I'm studying computer science and learning a lot! My parents are great, they are very supportive. What subject would you want to teach?\nSpeaker B: I would probably teach English, just because that is most in line with what I am studying. However, I have recently started becoming more interested in history so that is also an option.\nSpeaker A: Yes I think history is interesting, too! Both of those subjects would be great because there are probably lots of teaching jobs. What kind of history do you like?\nSpeaker B: I love all sorts of history. Right now I am really getting into the weeds of World War II. There's so much to unpack.\nSpeaker A: For sure! So much happened and it really affected how the world is today. I like learning about the history of places where I have lived, it's really interesting.\nSpeaker B: That sounds really cool! What have you learned about where you currently live?\nSpeaker A: Oh, I found out that the big sports field used to be a farm where they grew wheat and raised cows! It's really cool to see places in old photos and see how they have changed.",
        "memory_text": "User Description:\nSpeaker A is a kind individual who helps out his grandparents as they are getting older. He works at a pizza shop and is living with his grandparents. Speaker A used to play football a lot and enjoys hanging out with friends or playing video games like Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros. Series.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship, as they engage in conversations about their respective interests in football and soccer. They also offer each other suggestions for new games to try and discuss their aspirations for the future.\n\nEvent Description:\n1. Speaker A had a great first practice with the intramural football league.\n2. Speaker A and Speaker B talk about their experiences with football and soccer, showing their shared interest in sports.\n3. Speaker A plans to teach courses in computer science at a community college and get involved with robotics.\n4. Speaker B is studying Linguistics and expresses a desire to find job opportunities in the field.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really interesting! It's cool to learn about the history of where you live. Did you know that my grandparents used to have a farm where they grew wheat and raised cows? It's amazing how things change over time.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t2",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " Yes, my daughter had a blast at the campsite! She loved exploring the outdoors and sleeping under the stars. We've done a fair bit of camping before, but this trip was definitely one of the best. How about you? Have you taken your child camping before?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t8",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you had a great time at the Bronx zoo! I did get to see Joshua, he's such a majestic tiger. Have you taken your child to see him yet?",
        "previous_summary": "Speaker B just moved to America and is unfamiliar with the places.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\nSpeaker B's child wants to visit the zoo, particularly to see the monkeys.\nSpeaker B is interested in finding family discounts for the zoo.\nSpeaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua."
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?\nSpeaker A: I think the Bronx Zoo is one of the best in the country.   Yes, I did see Joshua.  Did you use a season pass for the zoo or just a one time ticket?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't taken my cat to a daycare yet, but I've heard good things about them. I think it could be a good idea, especially with the kittens running around. Have you considered getting a pet for your daughter?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t3",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": "That's amazing that you booked a Hawaii sunset tour! I bet the views will be absolutely breathtaking. I'm sure you'll have an incredible time and take some stunning pictures to share. As for me, I've been trying out some new healthy recipes and spending time with the kids. Maybe we can plan a movie night soon and catch up on some more Disney classics!",
        "previous_summary": "Speaker A is a plumber.\nSpeaker A has booked a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.\nSpeaker A has seen the Disney movie 'Luca' recently.\nSpeaker B's kids enjoyed watching 'Luca' and said it was good."
    },
    {
        "utter_id": "e14-s5-t8",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.\nSpeaker B: I hope you have a lot fun. It sounds like a nice time to get away from everything. You should eat as much of the local Hawaiian food as you can. Have you had Hawaiian food before? I think it's great.",
        "memory_text": "User Description:\nSpeaker B is a stay-at-home mom living in California. She enjoys cooking healthy food, watching movies with her kids, and finds water therapeutic. Speaker B loves Disney movies, sloppy romance movies, and occasionally watches horror movies with her kids. She has watched a lot of Disney movies with her kids and her husband enjoys Disney sports movies.\n\nRelationship Description:\nSpeaker A and Speaker B share an intimate relationship as they discuss personal preferences, family activities, and future plans. Speaker A expresses excitement for a Hawaii Sunset tour and wishes Speaker B could join. Speaker A values Speaker B's freedom and acknowledges the responsibilities of being a stay-at-home mom.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about new romance and Disney movies, specifically the movie \"Luca\" and the sports movie \"Miracle.\" Speaker B's family watched \"Luca\" and enjoyed it, while her husband appreciates Disney sports movies like \"Miracle.\" Speaker A shows interest in watching \"Miracle\" and seeks recommendations from Speaker B, who recommends watching it on Disney Plus. Speaker B also recommends watching \"Remember the Titans\" on the Disney Plus app.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you enjoyed Luca! Italy is definitely on my bucket list too. I haven't been to Italy before, but I would love to explore all the beautiful cities and try the delicious food. If I do go, I'll definitely bring my kids along for the adventure. Maybe we can compare notes on our travel experiences when you get back from your Hawaii sunset tour. Have a great time and make sure to take lots of pictures!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.",
        "memory_text": "User Description:\nSpeaker A has blue eyes and blonde hair, prefers warmth, plans to retire down south on a beach, and enjoys eggs. Their favorite egg dish is egg benedict.\n\nRelationship Description:\nSpeaker A really likes their smart car, while Speaker B is a stereotypical old plumber who likes poached eggs. Speaker A suggested that Speaker B should seriously consider getting a smart car. They also discussed visiting Alaska and shared their excitement about the trip.\n\nEvent Description:\nSpeaker A had eggs for breakfast, thought of Speaker B when having eggs, and recommended looking into flights. They discussed airline fees, music festivals, and planned activities for the trip to Alaska, including petting wolves and going on a glacier tour. Speaker A and Speaker B are looking forward to spending time together and having a great experience.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you're keeping an eye on those airfare prices! The weather here is perfect for a visit, clear skies and sunshine every day. There's a folk music concert coming up in about 4 weeks that I think you'll enjoy. Maybe we can plan to go see it together. And don't forget, I'll make sure we have some delicious eggs benedict for breakfast while you're here!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t7",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.",
        "memory_text": "User Description:\nSpeaker A has blue eyes and blonde hair, prefers warmth, plans to retire down south on a beach, and enjoys eggs. Their favorite egg dish is egg benedict.\n\nRelationship Description:\nSpeaker A really likes their smart car, while Speaker B is a stereotypical old plumber who likes poached eggs. Speaker A suggested that Speaker B should seriously consider getting a smart car. They also discussed visiting Alaska and shared their excitement about the trip.\n\nEvent Description:\nSpeaker A had eggs for breakfast, thought of Speaker B when having eggs, and recommended looking into flights. They discussed airline fees, music festivals, and planned activities for the trip to Alaska, including petting wolves and going on a glacier tour. Speaker A and Speaker B are looking forward to spending time together and having a great experience.",
        "speaker": "Speaker B",
        "raw_prediction": " I remember you mentioning that you enjoy eggs, especially eggs benedict. Maybe we can try making some together when I visit. I'll make sure to pick up some fresh eggs from the local market. And I'll definitely look into renting a car for our trip, especially if there are wolves and elk around. I want to make sure we stay safe while exploring Alaska.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you're planning to rent a car, it's definitely a good idea with the wildlife around. And don't worry, my dogs are well trained to stay away from the wolves and elk. They're more interested in chasing squirrels than running into wild animals!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t7",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.\nSpeaker A: Oh, I definitely will. Thanks for the motivation. Is this going to me your first festival?",
        "memory_text": "User Description:\nSpeaker A is a music-loving individual who enjoys playing all styles of music at home. They have a Subaru that is currently making a funny noise. Speaker A also mentioned the need for money and Mexican food for a baby. They are a nightclubber who frequents live band venues and loves interacting with women. Their car has been running smoothly, and they try to attend live events weekly. Speaker A plays the guitar daily but hasn't had much time for it recently.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker B, who is a mechanic, offered to look at Speaker A's Subaru to fix the issue. Speaker B also mentioned needing money for the baby on the way and shared concerns about his wife's pregnancy. They plan to attend a local festival together and enjoy bluegrass music.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning to attend a bluegrass band concert, discussing the expenses of having a new baby, and preparing for the upcoming festival. Speaker B will take time off when the baby is born and is excited about the food and drinks at festivals. They are supportive of each other's interests and willing to help out whenever needed.",
        "speaker": "Speaker B",
        "raw_prediction": " Yeah, I'm really looking forward to the festival. I haven't been to one in a while, so it should be a great time. And I could definitely use some good music and relaxation after dealing with my car trouble. Thanks again for offering to take a look at it. Hopefully, it's nothing too serious.",
        "previous_summary": "Speaker B is a mechanic who enjoys working on cars.\nSpeaker B dislikes public transportation and enjoys going to festivals, but misses doing so.\nSpeaker B's wife is pregnant, so they are considering attending a local festival for just a day.\nSpeaker B's wife is pregnant and has three more months to go until the due date.\nSpeaker B is currently working on building cribs and will take two months off when the baby is born."
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't tried any new foods lately, but I did make my grandmother's garlic chicken recipe last week. It turned out great! I think you'll really enjoy learning how to make it. And I can't wait to try your spicy fried rice when you come over. Maybe we can even cook together and share some family recipes. Looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t7",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.\nSpeaker A: unfortunately no, but I can ask them if they plan to get it in the future. I had one of each and they were all good in their own way. Have you ever had Birra tacos? I'd love to try those next.",
        "memory_text": "User Description: Speaker A, also known as Jim, is a member of a music band who grew up in a beach town. He has a strong passion for writing songs, surfing, and cooking, particularly enjoying making food for others and receiving compliments. Jim's father used to work at Cisco, and he wakes up early in the morning to catch waves.\n\nRelationship Description: Jim and Jehosaphat, also known as Speaker B, share a friendly and casual relationship. They bond over their shared interests in activities like snowboarding, surfing, and skateboarding. They also enjoy discussing food preferences and cooking recipes.\n\nEvent Description: Jim shared his grandmother's recipes with Speaker B, who was happy to reciprocate by sharing his favorite garlic chicken recipe. They also talked about surfing, with Jim offering to give surfing lessons to Speaker B. The two are considering meeting up, with Speaker B possibly visiting Jim for a weekend in the fall. They also discussed their experiences with snowboarding and surfing, showing a mutual interest in each other's hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh wow, street tacos sound amazing! I bet they were delicious. Mexican food is always a great choice. I haven't tried Birra tacos before, but they sound intriguing. I'd love to try them with you next time. And yes, I do love al pastor tacos, they're so flavorful! When we meet up, we can explore some new food spots together and maybe even cook up some delicious meals ourselves. Sounds like a plan, Jim!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t8",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.\nSpeaker A: unfortunately no, but I can ask them if they plan to get it in the future. I had one of each and they were all good in their own way. Have you ever had Birra tacos? I'd love to try those next.\nSpeaker B: I've never had birra tacos, what are those? They sound intriguing.",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " Birria tacos are a type of Mexican stewed meat usually made with beef or goat, flavored with a variety of spices and served in a taco. They are known for their rich and savory flavor. If you enjoy trying new dishes, I think you would definitely like birria tacos! I can't wait to try them with you next time we hang out.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! I could use some exercise too. It would be fun to get back into playing real games. Maybe we can even grab some burgers after, like old times.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t8",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old law clerk who works 12 hours a day and wishes to be back in college. They are a Black Sabbath junkie with a background in Humanities and now working at a law firm. Speaker B would rather be a film reviewer and is in debt despite working hard.\n\nRelationship Description:\nSpeaker B shows interest in discussing career prospects with Speaker A, who loves playing soccer. Speaker A asked Speaker B to connect with their neighbor Cynthia, who works as a human resources specialist. Speaker B will text Cynthia's number to Speaker A later. Speaker B accidentally responded to Speaker A due to a spider landing on their keyboard, revealing their fear of spiders. Speaker A also has arachnophobia.\n\nEvent Description:\nSpeaker A and Speaker B shared a conversation about career paths and humanities. Speaker B recommended a guidance counselor to Speaker A. Speaker A has a soccer tournament coming up and loves Arsenal. Speaker B enjoys researching and writing briefs for their job at the law firm. Speaker B was once pranked with a spider by their boss at work and is considering asking for a raise. Speaker B likes Manchester United.",
        "speaker": "Speaker A",
        "raw_prediction": " Definitely, I could use the exercise. Let's plan something soon, maybe we can even catch an Arsenal game together afterwards.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t3",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " That's awesome that you're looking into internships in sports medicine! I remember you mentioning how passionate you are about it. I'm sure you'll find the perfect opportunity soon. And it's great to hear that the beach helps with your knees, maybe you should try surfing again, it might bring back some good memories!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear about your experience as a physician assistant, and I'm glad you're finding relief for your knees at the beach. As for my internship search, I'm really excited about the opportunity with the athletic trainer's wife. I'll make sure to reach out to them for more information. And I'll definitely keep surfing to stay connected with doctors in the field, maybe I'll even get some tips on how to stand out in the job market. Thanks for all your support, it means a lot to me!",
        "previous_summary": "Speaker A is retired and spends most days hiking.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B is interested in sports medicine and enjoys surfing."
    },
    {
        "utter_id": "e19-s5-t7",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " It's amazing that you used to surf, I would love to see you back out on the waves! I've been working on building up my stamina and reflexes for soccer, so maybe we can hit the beach together and do some surfing and soccer drills. It would be a great way to stay active and enjoy the beach together.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t9",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? ",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so cool that you've been to so many European countries! I've only been to France and Ireland, but I would love to explore more. As for settling down after graduation, I'm not really sure yet. I'm open to different opportunities and locations, depending on where the job market takes me. How about you? Have you always lived near the beach or have you moved around a lot in your life?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t4",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " Sid isn't too interested in food, he's more of a fan of basking in the sun or hunting for bugs in the backyard. But I do have to be careful with leaving any snacks out, he's got quite the appetite for anything he can find! It's a good thing your pets are so well-behaved, I'm sure they would get along great with my Zen masters on our playdate. And hey, a Disney cruise sounds like a fun break, you deserve it after all these years of hard work at your job!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear that you're spending more time with your dogs now! It must be nice for them to have you around more often. And it sounds like Sid and Journey are quite the characters. How did the pet concert go with your white tigers at the zoo? I bet they loved your music!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t8",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": " That's a great idea! I'm sure Tasha would love to learn some English phrases from you. And it's always fun to learn a new language, especially when it's inspired by our pets.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t9",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.\nSpeaker B: Haha. So have you been hiking lately? It's been a hot summer, I think it'd kill me!\nSpeaker A: Hahaha. Yes I agree its too hot to get a long hike in. I've been on some short ones, but the bugs eat me alive. I like to hike in the fall when the bugs are dying off and its a little cooler.\nSpeaker B: Ah yes, that's my favorite time of year. Oh and speaking of Tasha, I'm still amazed she knows Mandarin. Have you been learning more of the language?\nSpeaker A: I've been learning a little more. I try to learn a few things a day. Tasha's reactions to my talking to myself in Mandarin is funny, she looks confused most of the time.",
        "memory_text": "User Description: Speaker A is a country girl with red hair who loves animals, particularly their pet parrot named Tasha. They are a locto-ovo vegetarian and enjoy hiking. Speaker A is planning a trip to China and wants to visit New York City first.\n\nRelationship Description: Speaker A and Speaker B have a friendly and intimate relationship, sharing stories about their pets and discussing travel plans together. They show concern for each other's animals and are open to adopting rescue kittens.\n\nEvent Description: Speaker A is planning to visit Speaker B and stay for a couple of days. They discuss bringing their parrot, Tasha, and are willing to adopt one of Speaker B's rescue kittens. Speaker A also shares that Tasha speaks Mandarin and has picked up the language from them. Speaker B is enthusiastic about helping Speaker A train the kittens to get along with Tasha. Speaker B has a playful sense of humor, suggesting the parrot could teach the kittens Mandarin.",
        "speaker": "Speaker B",
        "raw_prediction": " That would be quite the sight, Tasha teaching the kittens Mandarin! But I think they'll get along just fine, Tasha is pretty adaptable. And I'm looking forward to our trip to New York City before heading to China. It'll be an adventure for all of us.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t7",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.\nSpeaker B: I will someday. just not in the summer when all the bugs are out! Where do you go hiking the most?\nSpeaker A: I like to go hiking in the local trails here. I am familiar with them and there's so many routes that I can take. Sadly, the bugs are as bad here as they are anywhere else.....",
        "memory_text": "User Description:\nSpeaker A is a personal trainer who loves going on camping trips, hiking, and looking for wild animals in the woods. Speaker A also enjoys cruising, with Cuba being a favorite destination. Speaker A is in good shape and leads hikes for camping groups. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker B suggesting Speaker A try a cruise and recommending healthy and delicious food options. Speaker A invited Speaker B to join the gym, showing a level of casual interaction in the dialogue.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A spotting a rare hawk on a hike, planning trips on the Appalachian Trail, and being nervous about full-day hikes. Speaker B, a computer programmer, suggested using mosquito repellent sprays with DEET to help Speaker A repel mosquitoes while hiking. Speaker B loves cruising and being outdoors but is scared of bugs and creepy crawlies. Speaker B recently got a new job working with computers.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad your friends had a good time on the hike, even if they got tired quickly. It sounds like you always make sure to pack some delicious snacks and drinks for the trip. I might consider joining you on a hike one day, just not during bug season! I'll stick to cruising for now.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t2",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.",
        "memory_text": "User Description:\nSpeaker B is an individual who works in a cushy government job, with 15 years of experience in the field. They excel in staying calm and composed, even in stressful situations. Speaker B has a passion for painting and enjoys taking naps. They have two kids and are skilled in driving, but prefer to be a passenger and nap during long journeys. Speaker B's favorite movies are in the horror genre, and they have helped their father produce horror movies in the past.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is characterized by mutual admiration and curiosity. Speaker A looks up to Speaker B's job stability and wishes to have a similar career. Speaker A engages in creative conversations with Speaker B about movie plot ideas, showcasing a shared interest in the entertainment industry.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include preparing for an interview, where Speaker A seeks guidance and reassurance from Speaker B. Speaker A role-plays the interview scenario with a friend, demonstrating a proactive approach to job search. Speaker B expresses a desire to work in interior design, highlighting aspirations beyond their current job. The two bond over shared interests in mid-century design, horror movies, and creative brainstorming sessions. Speaker A wishes for Speaker B's father to achieve success in producing Hollywood movies, reflecting a sense of optimism and support in their relationship.",
        "speaker": "Speaker A",
        "raw_prediction": " That's great to hear that you enjoy producing horror movies! It sounds like you've found your creative outlet in the film industry. Maybe you could incorporate your passion for painting into your movie sets to add a personal touch. Have you thought about combining your skills in painting houses with your love for horror movies to create some unique and spooky set designs? It could be a fun way to further explore your creativity and make your mark in the industry.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t10",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?\nSpeaker A: My last final is on English. I think I will do well, I just have to do a little more studying. Would you be willing to help me study?\nSpeaker B: Ah, English should be easier than History. Sure, I can help you. What do you need to do exactly? Write an essay?\nSpeaker A: Yeah, we have to write an essay and we have a spelling component towards the end of the exam, I sure could use a little help!\nSpeaker B: No problem! I like correcting and editing essays. Although, it seems like your English is pretty good. I doubt you even need much help.",
        "memory_text": "User Description:\nSpeaker B is a college student studying sports medicine with a passion for soccer. They are an only child and their mother runs the school they attend. Speaker B is focused on getting good grades and is determined to excel in their studies and soccer career.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have a friendly and supportive relationship. They engage in conversations about sports, voting, and personal experiences. Speaker B encourages Speaker A to relax and take breaks when needed.\n\nEvents Description:\n1. Speaker A finished a 5-mile hike with a poorly managed trail.\n2. Speaker B is interested in joining a soccer game and is glad Speaker A made it back safely from the hike.\n3. Speaker A and Dave plan to go hiking, while Speaker B is studying for a sports medicine exam.\n4. Speaker A wants to play soccer on Saturday at 3 pm, and Speaker B agrees to join, planning to bring bottled water. \n5. Speaker B gives tips on sports medicine training to Speaker A, who hopes to get all A's in school and secure a soccer scholarship.",
        "speaker": "Speaker A",
        "raw_prediction": " Of course, I'm happy to help! Your English seems pretty good already, but I can definitely assist you with editing and correcting your essays. I know you're determined to excel in both your studies and soccer career, so I'll do my best to support you in any way I can. Let's make sure you ace that final and secure that soccer scholarship you're aiming for!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t7",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " It's so cool to hear about your daughter's growing passion for Greek mythology! It must be amazing to share your love for it with her. I've been thinking about changing my hair color again, maybe back to blue. Do you think I should go for it to celebrate turning 30 next week?",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t8",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.",
        "memory_text": "User Description:\nSpeaker B is a 30-year-old individual who recently turned 30 and lives in Cali. They have a daughter who is 5 years old and loves the beach. Speaker B enjoys the sunny weather and beaches in Cali, where they have been living for 30 years. They have tried surfing before and talk about their daughter swimming and playing in the sand.\n\nRelationship Description:\nSpeaker B and the robot have a friendly and engaging relationship, discussing topics such as moving to Cali, the beach, and running on sand. Speaker A compliments Speaker B's daughter and expresses envy for living near the beach. They also talk about Spring break plans and share preferences for traveling, running, Greek mythology, and Italian food.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include planning a spring break trip, changing hair color to blue, living in different locations (Indiana and Cali), discussing the beach, weather, and running on sand. They also talk about Italy, with Speaker A expressing love for Italian architecture, history, and food. Speaker B recommends good pasta in Italy and asks about Speaker A's favorite part of Italy and their major in History. Speaker B also shares their interest in Greek mythology, studying Poseidon, and asking about historical events.",
        "speaker": "Speaker A",
        "raw_prediction": " It will be a great experience for sure! I'm looking forward to sharing my passion for Greek mythology with you. And I'm sure we'll have a fantastic time exploring Greece together. Let's make sure to plan it out and enjoy every moment of it!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t3",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?",
        "memory_text": "User Description:\nSpeaker A is a passionate cook who loves to bake, especially Indian cuisine. They are considering turning their cooking skills into a business. Speaker A also enjoys playing tennis and admires Serena Williams. They own chickens and enjoy cooking and baking.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker A offers cooking advice and recommendations to Speaker B, showing a level of familiarity and willingness to help.\n\nEvents Description:\n1. Speaker A plans to make dahl, pilaf rice, and tandoori chicken using a pressure cooker.\n2. Speaker A explains the use of pressure cookers for various dishes and recommends one for beginner cooks.\n3. Speaker A suggests involving Speaker B's husband in cooking Asian food while she handles the main dish using the pressure cooker.\n4. Speaker B's husband is a great cook and enjoys cooking Asian food, with Speaker B enjoying the end results of his cooking.",
        "speaker": "Speaker B",
        "raw_prediction": " Shrimp fried rice sounds like a great starting point! I'll definitely give it a try. Maybe I can have my husband help out with the Asian dishes while I work on the main course using the pressure cooker. Thank you for the recommendation!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t9",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.",
        "memory_text": "User Description:\nSpeaker A is a passionate cook who loves to bake, especially Indian cuisine. They are considering turning their cooking skills into a business. Speaker A also enjoys playing tennis and admires Serena Williams. They own chickens and enjoy cooking and baking.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker A offers cooking advice and recommendations to Speaker B, showing a level of familiarity and willingness to help.\n\nEvents Description:\n1. Speaker A plans to make dahl, pilaf rice, and tandoori chicken using a pressure cooker.\n2. Speaker A explains the use of pressure cookers for various dishes and recommends one for beginner cooks.\n3. Speaker A suggests involving Speaker B's husband in cooking Asian food while she handles the main dish using the pressure cooker.\n4. Speaker B's husband is a great cook and enjoys cooking Asian food, with Speaker B enjoying the end results of his cooking.",
        "speaker": "Speaker B",
        "raw_prediction": " I appreciate all the cooking advice you've given me. It's really helped me improve in the kitchen. I'll definitely try making the shrimp fried rice with our fresh eggs. And yes, I'd love to have you ride along with me in the truck sometime. We can chat about cooking and maybe even plan some new recipes together.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t5",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? ",
        "memory_text": "User Description:\nSpeaker A is a person who values family and enjoys activities like healing clients, salsa dancing, and going to Brazilian steakhouse with their brother. They are interested in healing methods such as self-massage, essential oils, reiki, meditation, and self-awareness.\n\nRelationship Description:\nSpeaker B shows a level of intimacy with Speaker A by engaging in conversations about their family, activities, and interests. They express interest in trying out healing methods suggested by Speaker A and enjoy spending time on the water with their sister.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include going salsa dancing, dining at a Brazilian steakhouse, sailing with siblings, watching movies with family, and experiencing a heat wave. Speaker A plans on taking their clients salsa dancing soon, while Speaker B enjoys meeting different people and dancing under the stars on a boat.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't seen any of the Avengers movies yet, but I'll definitely make sure to watch them before Black Widow. Your steak and veggies sound delicious! My favorite food is sushi, I love trying different rolls and sashimi. Have you ever tried it?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t2",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you for the suggestion! I think plum and pear trees would be a great addition to my garden. I'll make sure to play some Beethoven's music for them, who knows, maybe they'll grow even better with some classical tunes!",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t3",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.",
        "memory_text": "User Description:\nSpeaker A is a 27-year-old individual who spends most of their time working and reading. They are considering quitting their current job to pursue a career at Disney World or in dentistry. Speaker A likes books about ice cream, Disney World, and computers. They have no children and are fearful of dentists but want to help others overcome their fear.\n\nRelationship Description:\nSpeaker A had a supportive conversation with Speaker B about quitting their job and potentially pursuing a career in dentistry or at Disney World. Speaker B's mother, who is a dentist, was involved in the conversation and offered advice and encouragement to Speaker A.\n\nEvent Description:\nSpeaker A had a positive conversation with Speaker B's mother about potential career paths, including dentistry and working at Disney World. Speaker A expressed interest in both paths and received encouragement from Speaker B to pursue what makes them happy. Speaker A also discussed their fear of dentists and their desire to help others overcome that fear. Speaker B's child also expressed admiration for their grandmother being a dentist.",
        "speaker": "Speaker B",
        "raw_prediction": " I actually find the work I do quite fascinating, troubleshooting between hardware and software. It's like solving a puzzle every day. And it's great to hear that you love your job too. It's important to find something you're passionate about, just like how you mentioned your mother, who is a dentist, encouraged me to pursue my interests.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!",
        "memory_text": "User Description:\nSpeaker A is someone who loves art, music, and painting. They prefer the color red and enjoy volunteer work, finding it meaningful and fulfilling. They have a fortunate upbringing and think travel and meeting new people are awesome. \n\nRelationship Description:\nSpeaker A and Speaker B share a level of intimacy in their dialogue, discussing personal interests and experiences such as painting, origami, and travel. They also express admiration for each other's activities like volunteering and singing.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include volunteering at the hospital, creating origami, and discussing their favorite colors. Speaker A is busy with work and gardening, while Speaker B has traveled extensively and enjoys singing. They both appreciate art and cultural experiences, finding meaning and fulfillment in their activities.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really impressive that you won 3rd place in the origami contest! It's great to see your passion for art shining through in different ways. I'd love to learn some origami techniques from you, especially since you mentioned there's special paper for it. It's fascinating how something as simple as folding paper can turn into intricate designs. And it's amazing to hear that origami has practical uses, like in hospitals for breathing apparatus. Art truly has so many dimensions to explore!",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t8",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?\nSpeaker B: Not up close, but I noticed a lot in shop windows in certain areas. I love Japan -- they're so welcoming. One of our acquaintances GAVE me a kimono. She said it's customary to try to share their culture. Kind of different from America in my opinion.  ",
        "memory_text": "User Description:\nSpeaker B is a well-traveled individual who enjoys exploring new countries and cultures. They have a love for the color turquoise and have parents who support them. Speaker B also has an interest in singing and desires to have a studio room for practicing. They have a strong preference for turquoise, singing, and traveling, and have visited 20 countries.\n\nRelationship Description:\nThe relationship between Speaker B and Speaker A is characterized by a shared interest in art and creativity, particularly in the form of origami. Speaker A is willing to teach Speaker B origami and they plan to try it together in the future. This shared activity shows a level of intimacy and collaboration between the two.\n\nEvent Description:\nSome of the events shared by Speaker B and Speaker A include volunteering at the hospital, trying origami, and discussing travel experiences. Speaker B has tried origami while abroad and made a turquoise lotus origami in Japan. Speaker A has also engaged in origami activities and has plans to make a lotus next. Additionally, they have discussed visiting Italy and Japan, highlighting their shared interest in travel and culture.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you! Yes, I can't wait to hang up the kimono in my studio room as a reminder of Japan. And you're right, having turquoise accents in my studio room would be so calming and inspiring. Maybe I can even incorporate some origami pieces we make together into the decor. Traveling really does open up so many possibilities for creativity and connection.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t10",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?\nSpeaker B: Not up close, but I noticed a lot in shop windows in certain areas. I love Japan -- they're so welcoming. One of our acquaintances GAVE me a kimono. She said it's customary to try to share their culture. Kind of different from America in my opinion.  \nSpeaker A: Oh, that sounds wonderful. It's impressive how much things that came from there and how giving a culture they are. America is definetly a lot different from them, have you visted different states in America?\nSpeaker B: Oh yes. I live in North Carolina, but I've been to almost every state. Alaska was by far my favorite, but I'm kind of a loner and it feels like a lot of people there are, so maybe I just relate. But the scenery and landscapes are unbelievably beautiful. What's your favorite place you've been to?",
        "memory_text": "User Description:\nSpeaker B is a well-traveled individual who enjoys exploring new countries and cultures. They have a love for the color turquoise and have parents who support them. Speaker B also has an interest in singing and desires to have a studio room for practicing. They have a strong preference for turquoise, singing, and traveling, and have visited 20 countries.\n\nRelationship Description:\nThe relationship between Speaker B and Speaker A is characterized by a shared interest in art and creativity, particularly in the form of origami. Speaker A is willing to teach Speaker B origami and they plan to try it together in the future. This shared activity shows a level of intimacy and collaboration between the two.\n\nEvent Description:\nSome of the events shared by Speaker B and Speaker A include volunteering at the hospital, trying origami, and discussing travel experiences. Speaker B has tried origami while abroad and made a turquoise lotus origami in Japan. Speaker A has also engaged in origami activities and has plans to make a lotus next. Additionally, they have discussed visiting Italy and Japan, highlighting their shared interest in travel and culture.",
        "speaker": "Speaker A",
        "raw_prediction": "That's so cool that you got a kimono as a gift! It's amazing how different cultures can be so giving and welcoming. I can see why you love Japan so much. Have you ever tried singing in Japanese? I bet your voice would sound beautiful with their traditional music.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t4",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " \"Oh, 'Girl Next' sounds interesting! Let me know how it is. I might add it to my list as well. Have you ever watched any movies about grizzly bears in Alaska? I remember you mentioning your concern about their population.\"",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t5",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " My job has been going well, thank you for asking. I actually get a lot of my movie ideas from my students in Film Studies. They always have great recommendations that I love to pass on. And yes, I do get some inspiration from work as well. How about you, any new projects you're working on lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t11",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.\nSpeaker A: Yes exactly. I think all kids should learn that. I know my grandkids love to watch all genre’s of movies and I think kids should learn what they like to watch. ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " You're welcome! I think you'll really enjoy Coming 2 America, it's a fun and entertaining movie. And I'm glad to hear your job is going well, it's always great to find your groove in a new role. Let me know what you think of the movie after you watch it!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t4",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.",
        "memory_text": "User Description:\nName: Speaker B\nOccupation: Snowboarder\nLikes: Charlie Parker, Meat, Snowboarding\nMemory: Loves meat, quit job at Cisco to pursue snowboarding and passion for Charlie Parker\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and engaging. They share personal stories and memories, showing a level of mutual interest and connection.\n\nEvent Description:\n1. Speaker A suggested rock music on the radio to Speaker B.\n2. Speaker B shared their favorite artist, Charlie Parker, with Speaker A.\n3. Speaker B bought their first new car.\n4. Speaker A had awesome grape jello and Speaker B talked about their grandma making jello at family dinners.\n5. Speaker A taught Speaker B how to make jello recipes.",
        "speaker": "Speaker A",
        "raw_prediction": " That's a good idea, I'll have to look into that. I do love a good juicy steak though, nothing beats that. And speaking of food, have you ever tried making jello with fresh fruit instead of the sugary mix-ins? It's a refreshing twist on a classic recipe.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t3",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?",
        "memory_text": "User Description: Speaker A is a hard-working individual who works at a local fast food restaurant. They enjoy reading and gardening, and have a preference for visiting the zoo. Speaker A has a sister who recently got married and they like to see pandas, penguins, and exotic birds at the zoo. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, as seen when Speaker A suggested Speaker B to adopt a kitten and they discussed their preferences regarding pets. They also share a love for animals and enjoy visiting the zoo together.\n\nEvent Description: Speaker A's sister got married, Speaker B's cat had a kitten, Speaker A and Speaker B discussed their preferences for pets, Speaker B's girlfriend got a cockatoo, Speaker B mentioned about giving away kittens, Speaker A compared having children to having pets, and Speaker B's sister's cockatoo named John behaves in a funny way.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm planning on going to the zoo for my vacation next week to see some pandas, penguins, and exotic birds. Maybe I'll come back with some inspiration for my future pet choice!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t6",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " I've never been to the San Diego Zoo before, but I've heard great things about it! I can't wait to see the lions there, they're always my favorite. Maybe I'll even find some inspiration for poetry while I'm there. Have you ever been to the San Diego Zoo?",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t9",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.",
        "memory_text": "User Description: Speaker A is a hard-working individual who works at a local fast food restaurant. They enjoy reading and gardening, and have a preference for visiting the zoo. Speaker A has a sister who recently got married and they like to see pandas, penguins, and exotic birds at the zoo. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, as seen when Speaker A suggested Speaker B to adopt a kitten and they discussed their preferences regarding pets. They also share a love for animals and enjoy visiting the zoo together.\n\nEvent Description: Speaker A's sister got married, Speaker B's cat had a kitten, Speaker A and Speaker B discussed their preferences for pets, Speaker B's girlfriend got a cockatoo, Speaker B mentioned about giving away kittens, Speaker A compared having children to having pets, and Speaker B's sister's cockatoo named John behaves in a funny way.",
        "speaker": "Speaker B",
        "raw_prediction": " Maybe you can take your sister's dog to the zoo with you! It might be a fun experience for her to see all those animals, even if she does bark a lot. Plus, it could be a nice bonding experience for both of you.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t5",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " It's really cool that you have such meaningful tattoos. I can see why you want to honor your parents in that way. As for me, I was thinking of getting a tattoo on my forearm, but now I'm considering other places after hearing about your experiences. Thanks for the advice!",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t6",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.",
        "memory_text": "User Description: Speaker B is a zookeeper who works at a Raccoon Cafe. They have a bearded dragon named Bob and a raccoon named Bandicoot, whom they have had since Bandicoot was a baby. Speaker B is experienced in taking care of Bandicoot and Bob, ensuring they are fed correctly with insects and dog kibble. Speaker B's brother owns a grocery store.\n\nRelationship Description: Speaker A fosters dogs and interacts with Speaker B regarding their pets. Speaker A is interested in learning about raccoons and bearded dragons, showing concern for the well-being of foster dogs in the presence of reptiles. The dialogue between Speaker A and Speaker B reflects a friendly and curious relationship.\n\nEvent Description: Speaker B shared experiences of wild raccoons trying to steal food from working raccoons and discussed the intelligence and behavior of raccoons with Speaker A. Speaker B expressed interest in researching whether raccoons can be trained and shared insights on caring for raccoons as pets. Speaker A asked questions about the behavior and care of raccoons, showing interest in wildlife laws and proper pet care.",
        "speaker": "Speaker A",
        "raw_prediction": " Given the memory content, a response from Speaker A could be, \"Wow, it sounds like Bandicoot is quite the troublemaker! It's amazing how smart raccoons can be. I definitely don't want any raccoons getting into my pantry like that. I'll definitely look into contacting animal control to see if they can help relocate them to a safer area. Thanks for all the insight on caring for raccoons, it's really interesting.\"",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t1",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! What book did you check out this time? I'm always looking for new recommendations.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t2",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? ",
        "memory_text": "User Description:\nSpeaker B is a mother who enjoys reading books and is fascinated by animals. She is a stay-at-home mom who values education and tries to instill the importance of reading and education in her son. She is kind and caring, always looking for opportunities to be educated about animals and their well-being.\n\nRelationship Description:\nSpeaker A finds Speaker B's grandparenting impressive and they share a mutual interest in watching Netflix shows. Speaker B values Speaker A's recommendations and enjoys discussing movies and TV shows with her. They both appreciate education and are open to learning new things from each other.\n\nEvent Description:\nSpeaker A and Speaker B frequently discuss books they have read or plan to read, such as \"The Shack\" and a book about rhinos and poaching. They also share experiences about watching Netflix shows and movies. Speaker A often talks about her grandkids and the activities they do together, while Speaker B shares insights about her son and the importance of instilling values in him. They both value education and enjoy spending time discussing various topics related to books, movies, and TV shows.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you had some time to yourself to read a new book! Did you find it exciting? I remember you mentioning that you were interested in reading about rhinos and poaching. Maybe this book will provide some interesting insights on that topic.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t4",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. ",
        "memory_text": "User Description:\nSpeaker B is a mother who enjoys reading books and is fascinated by animals. She is a stay-at-home mom who values education and tries to instill the importance of reading and education in her son. She is kind and caring, always looking for opportunities to be educated about animals and their well-being.\n\nRelationship Description:\nSpeaker A finds Speaker B's grandparenting impressive and they share a mutual interest in watching Netflix shows. Speaker B values Speaker A's recommendations and enjoys discussing movies and TV shows with her. They both appreciate education and are open to learning new things from each other.\n\nEvent Description:\nSpeaker A and Speaker B frequently discuss books they have read or plan to read, such as \"The Shack\" and a book about rhinos and poaching. They also share experiences about watching Netflix shows and movies. Speaker A often talks about her grandkids and the activities they do together, while Speaker B shares insights about her son and the importance of instilling values in him. They both value education and enjoy spending time discussing various topics related to books, movies, and TV shows.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to see you enjoying that intense crime drama! I'm glad you found something that captivates you. Maybe you can recommend it to me after you're done, I'm always looking for a new book to dive into.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?",
        "memory_text": "User Description:\nSpeaker B is a mother who enjoys reading books and is fascinated by animals. She is a stay-at-home mom who values education and tries to instill the importance of reading and education in her son. She is kind and caring, always looking for opportunities to be educated about animals and their well-being.\n\nRelationship Description:\nSpeaker A finds Speaker B's grandparenting impressive and they share a mutual interest in watching Netflix shows. Speaker B values Speaker A's recommendations and enjoys discussing movies and TV shows with her. They both appreciate education and are open to learning new things from each other.\n\nEvent Description:\nSpeaker A and Speaker B frequently discuss books they have read or plan to read, such as \"The Shack\" and a book about rhinos and poaching. They also share experiences about watching Netflix shows and movies. Speaker A often talks about her grandkids and the activities they do together, while Speaker B shares insights about her son and the importance of instilling values in him. They both value education and enjoy spending time discussing various topics related to books, movies, and TV shows.",
        "speaker": "Speaker A",
        "raw_prediction": " That's wonderful news! I can't wait to hear more about it. Maybe we can watch it together and discuss how it compares to the book. Thank you for sharing that with me.",
        "previous_summary": "Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.\nSpeaker B has a son and enjoys reading books, particularly about animals.\nSpeaker A watches Netflix shows rated over 3.5 stars after running out of things to watch."
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " I can see why you're enjoying the crime drama, it sounds really intriguing. Maybe I'll give it a try sometime. But you know me, I'll always have a soft spot for those animal books. Speaking of which, have you heard about the new documentary on Netflix about wildlife conservation? I think you'd really enjoy it, considering your love for both books and your grandkids!",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t1",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!",
        "memory_text": "User Description:\nSpeaker A is a resident of a city known for its amazing iced teas and drives a Mini Cooper. They recently took their Mini Cooper to the hair salon and have a cat that just had a kitten. Speaker A enjoys unsweetened iced tea and is currently living on the Moon.\n\nRelationship Description:\nThere is a level of intimacy shown in the dialogue between Speaker A and Speaker B, with Speaker B offering recommendations for the best food in Mexico City and expressing excitement for their first trip to San Diego.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker B taking a road trip to San Diego with extra space for backpacks and toys, Speaker A planning a trip to San Diego and leaving their cats with a friend, and Speaker A describing their kitten as an orange and white striped tabby cat named Marmalade. Speaker A prefers flying for trips over driving and hopes to go on another trip soon. Speaker B, although not a cat person, acknowledges the bond Speaker A has with their kitten and anticipates becoming a future crazy cat lady.",
        "speaker": "Speaker B",
        "raw_prediction": " Pumpkin is such a cute name! I'm sure Marmalade would've been adorable too, but Pumpkin suits your kitten perfectly. I can't wait to meet Pumpkin and spoil them with treats when I visit next time.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t3",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! ",
        "memory_text": "User Description:\nSpeaker A is a resident of a city known for its amazing iced teas and drives a Mini Cooper. They recently took their Mini Cooper to the hair salon and have a cat that just had a kitten. Speaker A enjoys unsweetened iced tea and is currently living on the Moon.\n\nRelationship Description:\nThere is a level of intimacy shown in the dialogue between Speaker A and Speaker B, with Speaker B offering recommendations for the best food in Mexico City and expressing excitement for their first trip to San Diego.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker B taking a road trip to San Diego with extra space for backpacks and toys, Speaker A planning a trip to San Diego and leaving their cats with a friend, and Speaker A describing their kitten as an orange and white striped tabby cat named Marmalade. Speaker A prefers flying for trips over driving and hopes to go on another trip soon. Speaker B, although not a cat person, acknowledges the bond Speaker A has with their kitten and anticipates becoming a future crazy cat lady.",
        "speaker": "Speaker B",
        "raw_prediction": " I decided to change the kitten's name from Marmalade to Pumpkin because I thought it would be a fun nod to my love for pumpkin spice and the fact that Ginger is a spice too, they are the spice girls! Plus, it just felt like the perfect fit for my little furball.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t8",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " I can totally relate to your situation. I remember when my kids brought home a stray dog, I couldn't say no either. I guess animals have a way of winning us over, huh? And I'm glad to hear that the Spice Girls are doing well and enjoying the weather. How's Pumpkin settling in with the rest of the family?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t11",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat\nSpeaker A: That would be cruel to do. You need to rehome them properly or otherwise someone may report you to the authorities for animal abuse. My heart is breaking for your poor cats. \nSpeaker B: Thank you for concerning. I am trying to be nice to them do not worry \nSpeaker A: They all have their own unique personalities and maybe you will enjoy them more once you get to know them better. I think of Pumpkin and Ginger as my children and I am sure you would never consider abandoning your children. Ginger is going for surgery to make sure she has no more babies. Im worried that she may be in pain afterwards.",
        "memory_text": "User Description:\nSpeaker A is a resident of a city known for its amazing iced teas and drives a Mini Cooper. They recently took their Mini Cooper to the hair salon and have a cat that just had a kitten. Speaker A enjoys unsweetened iced tea and is currently living on the Moon.\n\nRelationship Description:\nThere is a level of intimacy shown in the dialogue between Speaker A and Speaker B, with Speaker B offering recommendations for the best food in Mexico City and expressing excitement for their first trip to San Diego.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker B taking a road trip to San Diego with extra space for backpacks and toys, Speaker A planning a trip to San Diego and leaving their cats with a friend, and Speaker A describing their kitten as an orange and white striped tabby cat named Marmalade. Speaker A prefers flying for trips over driving and hopes to go on another trip soon. Speaker B, although not a cat person, acknowledges the bond Speaker A has with their kitten and anticipates becoming a future crazy cat lady.",
        "speaker": "Speaker B",
        "raw_prediction": " I understand your concern for the cats, and I appreciate your advice. I will make sure to take good care of them and give them the love they deserve. I hope Ginger's surgery goes well and that she recovers quickly. It's important to prioritize their well-being above all else.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t6",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? \nSpeaker B: I'll be living off campus, so absolutely. How about you? Are you staying in the dorms?",
        "memory_text": "User Description:\nSpeaker B is a divorced veteran with a passion for scuba diving in Hawaii. They have two pet snakes named Hansel and Gretel. Speaker B is interested in neuroscience and has experience in a research lab. They are familiar with eagle scout projects for veterans and proper flag disposal.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in scuba diving, with Speaker A expressing a desire to dive despite a fear of sharks. Speaker A also studies neuroscience and volunteers at a research lab. Speaker B and Speaker A engage in conversations about marine life and sharks.\n\nEvent Description:\nSpeaker B reminisces about scuba diving experiences in Hawaii and expresses a desire to dive in a steel cage with sharks. Speaker B discusses using the GI Bill for neuroscience classes and prefers animals over humans. Speaker B also mentions lunch with a scuba diving friend and their interest in studying marine life. Speaker B shows gratitude towards Speaker A for their service and wishes them luck with their studies. Speaker A shares information about shark diving documentaries and shark behavior.",
        "speaker": "Speaker A",
        "raw_prediction": " I won't be taking Hansel and Gretel with me to my college dorm, but I'll definitely have them with me at my off-campus place. I can't imagine not having them around, they're a big part of my life. How about you, are you planning to bring any pets with you to the dorms?",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t7",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? \nSpeaker B: I'll be living off campus, so absolutely. How about you? Are you staying in the dorms?\nSpeaker A: I'm glad your taking them with you. My mum wants me to stay in dorms. But I think I just want my own place, less drama and more freedom that way.",
        "memory_text": "User Description:\nSpeaker A is a student with a keen interest in neuroscience and a passion for scuba diving. They are working towards becoming an eagle scout and volunteer at a research lab. Speaker A has a strong desire to work with humans to help cure neurological diseases in the future.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal experiences, interests, and future aspirations. Speaker A and Speaker B engage in meaningful conversations about their respective passions and experiences.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about scuba diving, neuroscience, volunteer work, and military service. They talk about their interests in scuba diving in Hawaii, Speaker A's pursuit of becoming an eagle scout, and Speaker B's military background. Speaker A expresses interest in learning more about eagle scout projects for veterans and Speaker B shares insights about a project that helps dispose of American flags correctly. Speaker A and Speaker B also discuss their shared passion for neuroscience and their respective experiences related to it.",
        "speaker": "Speaker B",
        "raw_prediction": " \n\nThat's awesome that you're planning to take your pet snakes with you to your off-campus place! It must be nice to have them around while you're studying. As for me, I can relate to wanting your own space for less drama and more freedom. It sounds like you have a lot of interesting experiences and passions, especially with your neuroscience and scuba diving interests. Have you thought about combining those interests in any way for your future career goals?",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t3",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?",
        "memory_text": "User Description:\nSpeaker A is a college student who loves teaching and learning. They are regretting eating ice cream due to being lactose intolerant. Speaker A also teaches jiu-jitsu and is planning to take summer courses soon. They are taking a class on the history of martial arts and want to get an athletic training degree.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker A mentioning events and activities that may interest Speaker B. Speaker B, a software tech from England, is busy with work and misses dogs. They both share a love for martial arts and have discussed running a half marathon together.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning a trip to England, considering adopting a dog, discussing favorite restaurants in London, and signing up for online classes. Speaker A mentioned a half marathon coming up and Speaker B is considering running it despite their busy work schedule. Speaker B plans to travel back to England to visit family, friends, and dogs.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you've been staying busy with your project, it sounds like you have a lot on your plate. I actually just signed up for a summer course on the history of martial arts, so I'm really looking forward to diving deeper into that. Maybe we can swap some interesting facts about martial arts next time we catch up!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t6",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.",
        "memory_text": "User Description:\nSpeaker B is searching for a furniture shop to buy furniture but is struggling with choosing new furniture due to doubts about the colors. They painted the room light green before buying purple sofas and are willing to add vibrant colors suggested by Speaker A to create a hippy feel in the room. Speaker B loves pets and is buying furniture safe for their two dogs. They work near a mall by their house and love to barbecue, especially grilling steak and hotdogs. Speaker B prefers grilling corn straight from the farm and using a charcoal grill over a gas grill. They plan to meet Speaker A in person once they are done renovating their house.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy as they plan to meet in person and help each other with furniture choices and grilling preferences. Speaker A invites Speaker B over to help break in new furniture and enjoy grilling and eating outside together.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A getting new furniture like a couch, recliner, and patio furniture, hoping to enjoy more quiet evenings outside. They plan to grill and eat outside most nights with the new furniture, even on busy nights. Speaker B plans to bring marinated meat and a six pack to Speaker A's place and use bug spray to keep bugs away. Speaker A has things set up to play music, enjoy food, and company without worrying about bugs, using lamps and other devices for bug control. Speaker A suggests grilling corn with mayo and cheese and recommends using a smoker for grilling. Speaker B prefers grilling corn with fresh ingredients and loves the flavor of meat cooked on charcoal. Speaker B is willing to give all purple furniture to Speaker A and plans to get rid of the green and purple scheme.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you have a lot of exciting plans for your living room and patio! I think a screened-in gazebo with a fire pit in the middle would create a cozy atmosphere for your outdoor space. And it's great that you're considering furniture that is safe for your dogs. When you're ready, I can help you pick out some vibrant colors to add to your new color scheme. Can't wait to see how everything turns out!",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t10",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. ",
        "memory_text": "User Description:\nSpeaker B is a librarian from Amsterdam who commutes to work by boat. They have three kids and are currently reading Star Wars novels. Speaker B is planning a vacation to Greece, excited to visit historical places. They express their love for Athena and reveal that their lucky number is three. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, discussing travel plans, Greek mythology, and strong women. They share their excitement about upcoming trips and recommend sights to each other.\n\nEvent Description:\nSpeaker B is preparing for their trip to Greece, including sorting out flights and deciding on destinations like Athens, Santorini, and Thessaloniki. Speaker A recalls past travels in Europe and shares favorite cities. Speaker A and Speaker B discuss their travel plans, including recommendations for each other's trips. They also talk about their admiration for strong women and Greek mythology. Speaker B's kids are excited about the trip to Greece, and they recommend the Parthenon as a must-see attraction.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you have a lot of exciting travel plans coming up! I can't wait to hear all about your trip to Greece and your visit to the Acropolis. Maybe you can bring back some Greek mythology books for your kids to enjoy.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.",
        "memory_text": "User Description:\nSpeaker B travels frequently for work and misses his wife and kids. They hate traveling and feel like it's taking them away from their loved ones. Speaker B is supportive and empathetic towards others, giving pep talks and motivating people to strive through hardships. They have experienced personal struggles with depression and anxiety, which led them to get into motivational speaking. \n\nRelationship Description:\nSpeaker A shows concern and support towards Speaker B, asking about their family and work travels. Speaker A listens attentively to Speaker B's concerns and offers advice when needed. They engage in meaningful conversations and show genuine interest in each other's lives.\n\nEvent Description:\nSpeaker A and Speaker B discuss their running experiences, with Speaker A training for a marathon and Speaker B sharing their past marathon experience. They bond over their love for running and motivate each other to pursue their goals. Speaker A introduces Speaker B to the idea of running together for an Alps marathon, showing a desire to support and motivate them in their running journey. They also share personal stories and struggles, creating a strong connection through their shared experiences. Speaker A's love for singing and yodeling adds a unique and lighthearted element to their conversations, showcasing their diverse interests and personalities.",
        "speaker": "Speaker A",
        "raw_prediction": " I can't wait to run the Alps marathon with you! It will be an amazing journey towards reaching our goals. And don't worry, I'll make sure to send you those motivational quotes bright and early to get you out of bed. And hey, if you ever need a pep talk or some words of encouragement, I'm here for you, just like you've always been there for me. We'll get through this together, one step at a time.",
        "previous_summary": "Speaker B is a motivational speaker who travels to schools and conferences to give pep talks.\nSpeaker B's job involves motivating people to be successful and follow their dreams.\nSpeaker B got into motivational speaking because they needed it themselves to battle depression and anxiety.\nSpeaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600."
    },
    {
        "utter_id": "e45-s5-t1",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great news! Congratulations on getting the job at the grocery store! I'm sure you'll do great. And it's awesome that you're planning to go for hikes after work, it sounds like a perfect way to unwind. Maybe we can meet up for a walk or hike soon and have a picnic at the top of the mountain, like we talked about. I'll bring some veggie sandwiches and water, and don't forget to bring your swimsuit for a dip in the lake afterwards. Can't wait to catch up and enjoy the outdoors together!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great news! I'm so happy for you. I remember you mentioning how much you enjoy being outdoors, so working at a grocery store near a nice location sounds like a perfect fit for you. As for me, I've been doing some freelance work here and there, but nothing too exciting. Let's definitely plan that hike we talked about and bring some veggie sandwiches for a picnic at the top of the mountain. I can't wait to spend some time outdoors with you!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. ",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " That third shift schedule sounds tough, but at least you'll have some peaceful moments in your hammock after work. And the fact that you can go hiking and relax by the lake sounds amazing. I'm happy for you! Maybe we can plan a hike together soon and bring some sandwiches and fruit for a nice picnic at the top of the mountain.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t10",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.",
        "memory_text": "User Description: Speaker B is kind, caring, and hopeful for group equality. They like camping and hiking, with a favorite trail being the Columbia Trail near home. They have a neighbor named John who sells camping gear and also loves hammocks. Speaker B's dog loves the hammock more than Speaker B.\n\nRelationship Description: Speaker B and the robot have a friendly and collaborative relationship. They enjoy planning hikes, picnics, and discussing camping equipment together.\n\nEvent Description: Speaker B and the robot plan to go hiking this weekend, with Speaker B suggesting a picnic at the top of the mountain. They discuss bringing sandwiches, fruit, water, and even swimming in a lake during their hike. Speaker B shares their preference for veggie sandwiches and their experience with swimming in cold water. Speaker A also mentions a hidden primitive camping spot off the main hiking trail. Speaker B finds it cool that Speaker A plans to buy a hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": " I appreciate your concern, but I think I'll be okay. I've been camping and hiking for years, so I'm used to being out in nature on my own. Plus, I always make sure to stay alert and aware of my surroundings. And speaking of hammocks, John actually sells some really sturdy ones that I trust completely. Maybe we should plan a camping trip soon and test out our new hammocks together!",
        "previous_summary": "Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\nSpeaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\nSpeaker A is looking for a job and new camping gear, specifically a hammock.\nSpeaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail.\nSpeaker A has a portable hammock for the hike and asks if Speaker B will bring theirs.\nSpeaker A decides not to bring the hammock due to extra weight in their bag."
    },
    {
        "utter_id": "e46-s5-t5",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " No luck with the lotto yet, but I'm not giving up hope! Maybe one day I'll hit the jackpot and be able to afford that city and country house I've been dreaming of. It would be the perfect place to play my blues music and relax after a long day on the farm.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t2",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " I hope so! I miss them so much. The older one is always up for new adventures, but the youngest is more of a homebody. I'm trying to convince him to explore his creative side with programming or writing. Have you been able to convince your sons to try new things as well?",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t6",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " That's great to hear that you live in Portugal! I'll be in Spain for about a week, but maybe we can arrange something for a quick meet up. And I'll definitely have to try some Portuguese cuisine while I'm there, I've heard it's delicious. And speaking of trying new things, I found this amazing Chinese restaurant that I think you would love. Maybe we can check it out together sometime!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t1",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!",
        "memory_text": "User Description:\nSpeaker A is an inventor who is super busy and has suggested starting a band, building a time machine, or becoming a chef. They love trying new food, especially Mexican and seafood dishes like chicken enchiladas, tacos, shrimp shish kabob, baked fish, grilled corn, and stuffed burgers. Speaker A used to foster puppies and is an animal person who loves meeting puppies from history.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and collaborative relationship, with Speaker B showing interest in becoming Speaker A's chef. They discuss cooking different cuisines around the world and share a passion for grilling and trying new food.\n\nEvent Description:\nShared events include Speaker A recommending indoor grilled veggies for fajitas, discussing the drawbacks of working as a chef, and considering a job as a line cook. Speaker B expresses interest in grilling steaks and trying grilled asparagus. They also talk about the impact of their jobs on their social lives and consider switching careers to gain free time.",
        "speaker": "Speaker B",
        "raw_prediction": " I agree, puppies are hard to beat in the cuteness department! But that new cat at the shelter does sound adorable. Maybe we can stop by and say hello after we finish grilling those steaks and asparagus. And hey, maybe we can even brainstorm some new food inventions while we're there!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t5",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?",
        "memory_text": "User Description:\nSpeaker A is an inventor who is super busy and has suggested starting a band, building a time machine, or becoming a chef. They love trying new food, especially Mexican and seafood dishes like chicken enchiladas, tacos, shrimp shish kabob, baked fish, grilled corn, and stuffed burgers. Speaker A used to foster puppies and is an animal person who loves meeting puppies from history.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and collaborative relationship, with Speaker B showing interest in becoming Speaker A's chef. They discuss cooking different cuisines around the world and share a passion for grilling and trying new food.\n\nEvent Description:\nShared events include Speaker A recommending indoor grilled veggies for fajitas, discussing the drawbacks of working as a chef, and considering a job as a line cook. Speaker B expresses interest in grilling steaks and trying grilled asparagus. They also talk about the impact of their jobs on their social lives and consider switching careers to gain free time.",
        "speaker": "Speaker B",
        "raw_prediction": " Grilled asparagus is a great choice! It's perfect for a side dish or even as a topping for your favorite dishes. I can share my recipe with you if you'd like. And who knows, maybe you'll become a master chef in no time!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t6",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old workaholic who is starting their career. They enjoy grilling and have not yet settled on a specific career path. Speaker B doesn't have a strong opinion on puppies, but they are interested in trying new things and exploring different cuisines.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship. They discuss various topics such as career recommendations, cooking, and volunteering at animal shelters. Speaker A shows interest in Speaker B's career choices and preferences, suggesting ideas like starting a band or working on a time machine together.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B talk about grilling delicious dishes like grilled corn and stuffed burgers. They also discuss cooking different types of cuisines while teleporting around the world. Speaker A shares their love for Mexican food and seafood, while Speaker B expresses interest in becoming a chef and trying out new recipes. Additionally, Speaker A mentions their volunteer work at animal shelters, particularly with dogs and cats, while Speaker B shows interest in volunteering and prefers cats over puppies. Speaker B also mentions their project of building a resume and applying for companies, while Speaker A suggests considering a career switch for more free time.",
        "speaker": "Speaker A",
        "raw_prediction": " Grilled asparagus is a great choice for your chef book! I usually pair it with a nice grilled salmon or even shrimp skewers. And when it comes to fajitas, I prefer chicken over beef. How about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t9",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?\nSpeaker A: I prefer chicken to beef. I pair it with beef fajitas andI think it's great to have with a glass of merlot. Do you like wine?\nSpeaker B: You're making me hungry!  Yes, I do love wine.  As a matter of fact, I used to live in the Bordeaux region in France, so my favorite wine is Bordeaux wine.  But I also love champagne and cognac.\nSpeaker A: Haha, I know right? I lived in the Champagne region for a bit! Always wanted to go to Bordeaux. How was it there?",
        "memory_text": "User Description:\nSpeaker A is an inventor who is super busy and has suggested starting a band, building a time machine, or becoming a chef. They love trying new food, especially Mexican and seafood dishes like chicken enchiladas, tacos, shrimp shish kabob, baked fish, grilled corn, and stuffed burgers. Speaker A used to foster puppies and is an animal person who loves meeting puppies from history.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and collaborative relationship, with Speaker B showing interest in becoming Speaker A's chef. They discuss cooking different cuisines around the world and share a passion for grilling and trying new food.\n\nEvent Description:\nShared events include Speaker A recommending indoor grilled veggies for fajitas, discussing the drawbacks of working as a chef, and considering a job as a line cook. Speaker B expresses interest in grilling steaks and trying grilled asparagus. They also talk about the impact of their jobs on their social lives and consider switching careers to gain free time.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so cool that you used to live in the Champagne region! I've always wanted to visit there. Bordeaux must have been amazing with all the beautiful vineyards. Maybe we can plan a trip there together someday and try all the different wines they have to offer.",
        "previous_summary": null
    }
]