[
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The child is supportive and caring towards the parent.\n3. The child offers help and reassurance to the parent.\n4. Both the parent and child express love and support for each other.\n5. The child is supportive and proud of their parent for making changes.\n6. The Child finds the Parent's story inspiring.",
        "speaker": "Parent",
        "raw_prediction": "Yes, I did feel that way at times. But having you there to listen and support me made all the difference. Thank you for always being there for me."
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.",
        "memory_text": "1. Mentee is feeling overwhelmed with the college application process.\n2. The Mentee has been offered a job and has decided to take the job in the city.\n3. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n4. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n5. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n6. Mentee feels like they are running out of time and is worried about the upcoming SAT.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way when you're in a new place. Remember, building new friendships takes time and effort. You'll find your community soon enough, just give it some time."
    },
    {
        "utter_id": "e2-s5-t13",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.",
        "memory_text": "1. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n2. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n3. Neighbor A enjoys spending time in Neighbor B's cozy home and wants to hang out more often.\n4. Neighbors A and B are on friendly terms and enjoy spending time together.\n5. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n6. Neighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.",
        "speaker": "Neighbors B",
        "raw_prediction": "I enjoy spending time with you too. Let's hang out more often and maybe work on mowing the lawn together next time."
    },
    {
        "utter_id": "e3-s5-t5",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n3. Co-worker B admires Co-worker A's resilience and positivity.\n4. Co-worker B appreciates Co-worker A's positivity and friendship.\n5. Co-worker B is supportive and willing to help in any way.\n6. Co-worker B commended Co-worker A for their bravery and willingness to help.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's okay, Co-worker A. I understand where you're coming from. Just remember, it's never too late to make things right and show your true intentions. Let's focus on finding a healthy way to express your feelings."
    },
    {
        "utter_id": "e4-s5-t8",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n3. Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\n4. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n5. Co-workers A and B have a positive and optimistic attitude towards their future collaboration.\n6. Co-worker B is glad to have been able to help Co-worker A and feels the trade worked out well for both of them.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad to hear that you're still excited about our future collaboration. Your support and encouragement mean a lot to me, and I can't wait to see what we can achieve together. Let's make sure to prioritize our health and well-being as we work towards our goals."
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.",
        "memory_text": "1. Classmates A has developed a crush on Classmates B, which Classmates B finds flattering.\n2. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\n3. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\n4. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.\n5. Both Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\n6. Classmates A and B are interested in biology and studying cells.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm sorry, I let my emotions get the best of me. Let's talk about this and clear up any misunderstandings."
    },
    {
        "utter_id": "e6-s5-t14",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is excited and supportive of Neighbors A's new ability.\n4. Neighbors A enjoys trying new things, like new recipes.\n5. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.\n6. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've been feeling a bit overwhelmed with work lately, but trying out new recipes and cooking has been a great stress-reliever for me."
    },
    {
        "utter_id": "e7-s5-t14",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.\nClassmates B: That's great to hear. And what about your past struggles with school and friendships? Do you feel like you've moved on from that?",
        "memory_text": "1. Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n2. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep.\n3. Classmate A and Classmate B both enjoy socializing and going out to parties together.\n4. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends.\n5. Classmates A considers talking to a therapist or counselor to address past issues.\n6. Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings.",
        "speaker": "Classmates A",
        "raw_prediction": "I've been considering talking to a therapist or counselor to help me address those past issues. I think it could really help me move forward and focus on the future."
    },
    {
        "utter_id": "e8-s5-t6",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.\nNeighbors B: It's always important to own up to our mistakes. It's like when you forgot your backpack in high school and had to deal with the consequences.",
        "memory_text": "1. Neighbors B reminds Neighbors A about taking responsibility for their mistakes in the past and learning from them.\n2. Neighbors A apologized to Neighbors B for their behavior and admitted to being wrong.\n3. Neighbor A apologized to Neighbor B for their behavior and expressed a desire to make amends.\n4. Neighbor B accepted Neighbor A's apology and mentioned that it was hurtful to be treated that way.\n5. Neighbors B offers help and support to Neighbors A in the situation.\n6. Neighbor A values their friendship with Neighbor B and wants to ensure it remains strong.",
        "speaker": "Neighbors A",
        "raw_prediction": "You're right, I definitely learned my lesson from that experience. It's all about growing and improving as a person. Thank you for being understanding and supportive through it all."
    },
    {
        "utter_id": "e9-s5-t2",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?",
        "memory_text": "1. Classmate B is supportive and encourages Classmate A to pursue their dream.\n2. Classmates A appreciates the support and encouragement from Classmates B.\n3. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n4. Classmates B is supportive and encourages Classmates A in their business venture.\n5. Classmates A wants to get to know Classmates B better and become friends.\n6. Classmate B offers to support and potentially collaborate with Classmate A in the future.",
        "speaker": "Classmates A",
        "raw_prediction": "I actually started as a hobby and gradually realized I had a passion for it. Your support and encouragement means a lot to me."
    },
    {
        "utter_id": "e10-s5-t14",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.\nCo-workers A: Of course I remember! I'm happy we're friends again.\nCo-workers B: Me too. And do you still have that baby doll and rattle you bought a couple of years ago?\nCo-workers A: Yes, actually! I gave them to my niece and she loves them.\nCo-workers B: That's awesome. And I still remember when you scratched my neck and helped me relax. Sometimes I still need that kind of release.",
        "memory_text": "1. Both Co-worker A and Co-worker B enjoy taking moments to connect with each other and find these moments make work more enjoyable.\n2. Co-worker A returned a watch to Co-worker B, making them happy again.\n3. Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.\n4. Co-worker A has a history of helping out Co-worker B and values their friendship.\n5. Co-worker A and Co-worker B had a disagreement but resolved it, becoming friends again.\n6. Co-worker A and Co-worker B excel at working well with others and resolving issues.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad I could help you out with that. Just let me know if you ever need a neck scratch or any kind of relaxation, I'm here for you."
    },
    {
        "utter_id": "e11-s5-t13",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.\nNeighbors A: Oh, gosh. That was so long ago. I can't even believe I had that kind of power over you.\nNeighbors B: I'm just glad we've both grown since then, and we can have a friendship that's based on mutual respect.\nNeighbors A: Absolutely. And now, I'm excited to explore my new neighborhood and get to know the people here. It feels like a fresh start.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors A is excited to explore the neighborhood and make new friends.\n3. Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.\n4. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.\n5. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n6. Neighbors A just moved to a new neighborhood and is getting to know the area.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sure you'll make new friends and create great memories in your new neighborhood. Change can be refreshing, and I'm excited to see how you'll flourish in this new environment."
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.",
        "memory_text": "1. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n2. Classmates A met the girl of their dreams at a party and have been texting her nonstop.\n3. Classmates A is dedicated to studying hard and taking extra classes to get into a good college.\n4. Classmates A is determined to make the relationship work, similar to their determination to get into college.\n5. Classmates A is willing to work hard to achieve their dreams.\n6. Classmates A had a moment of frustration in the past but has learned to channel that energy into studies.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! It's awesome that you've found someone special. I'm sure your determination and dedication will help make the relationship work just like how it helped you get into college."
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.",
        "memory_text": "1. Mentee credits Mentor for their help in achieving sobriety and expresses gratitude for the support.\n2. Mentor has been supportive of Mentee's journey to sobriety.\n3. Mentee found getting sober to be a challenging process but is now proud of their progress.\n4. Mentor is proud of Mentee for making positive changes and taking control of their life.\n5. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n6. Mentee values living in the moment and staying focused on their sobriety and goals.",
        "speaker": "Mentor",
        "raw_prediction": "That's fantastic to hear, Mentee. Living in the moment can truly enhance your sobriety journey and help you appreciate the progress you've made. Keep focusing on your goals and staying present – you're doing an amazing job."
    },
    {
        "utter_id": "e14-s5-t12",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?",
        "memory_text": "1. The Child is caring and offers help to the Parent.\n2. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n3. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent.\n6. The Parent is working and feels tired after a long day.",
        "speaker": "Parent",
        "raw_prediction": "Yes, I remember that! It was a really fun and creative activity. I appreciate all the time we spend together, it means a lot to me."
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.\nClassmates B: I'm proud of you. It's always great to see someone following their dreams.\nClassmates A: Thanks, it's been a journey, but I'm really happy with where I am now. It's crazy to think that years ago, I was so hesitant to even share this part of myself.\nClassmates B: It just goes to show that it's never too late to start pursuing what you love. Remember when we talked about you living your life on your own terms? You're doing just that.",
        "memory_text": "1. Classmates A has been pursuing their passions and enjoying life.\n2. Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth.\n3. Classmates B supports Classmates A's perspective on living authentically and free from others' opinions.\n4. Both Classmates A and B value the importance of trying new things and taking risks for personal development.\n5. Classmates A ended up taking Classmates B's advice and found success with it.\n6. Classmates B expresses a desire to see Classmates A happy and successful in life.",
        "speaker": "Classmates A",
        "raw_prediction": "I really appreciate your support and encouragement all this time. It means a lot to me. Thank you for believing in me and pushing me to step out of my comfort zone."
    },
    {
        "utter_id": "e16-s5-t9",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?",
        "memory_text": "1. Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader.\n2. Co-worker A used to fantasize about being a great leader and being respected and admired.\n3. Co-worker A has fantasies of being a great leader.\n4. Co-worker A has grown and become more confident over the years.\n5. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n6. Co-worker B acknowledges and supports Co-worker A's growth and progress.",
        "speaker": "Co-workers B",
        "raw_prediction": "I remember that time, but look how far we've come since then. You've grown so much and I'm genuinely proud of the leader you've become."
    },
    {
        "utter_id": "e17-s5-t10",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbors A did this as a gesture of appreciation for Neighbors B's actions in the neighborhood.\n3. Neighbors B values their friendship with Neighbors A.\n4. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n5. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n6. Neighbors A has developed romantic feelings for Neighbors B.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, that day at the park was so much fun. I really appreciated the time we spent together playing frisbee and having a picnic. It's nice to have those memories to look back on."
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.\nNeighbors B: That sounds like a great idea. You have the opportunity to do so much with your newfound wealth.\nNeighbors A: Definitely. It's funny how things can change so quickly. Just a few years ago, I was stuck in a job I hated and now I have all this freedom.",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors A took the leap to make a change and is glad they did.\n3. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n4. Neighbors A and B had a conversation a couple of years ago about needing a change.\n5. Neighbors A is feeling stagnant in their current job and is looking for more growth and challenge.\n6. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's truly amazing how life can take unexpected turns. I'm so happy for you and all the exciting possibilities ahead. You deserve all the success and happiness that comes your way."
    },
    {
        "utter_id": "e19-s5-t8",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.\nNeighbors B: I'm sorry to hear that. Have you considered looking for a new job?\nNeighbors A: I have, but with the current job market, it's really tough. Plus, I don't have a lot of experience in other fields.\nNeighbors B: Well, I'll keep an ear out for any job openings that might be a good fit for you. In the meantime, maybe try finding ways to de-stress after work? I find that exercise helps me when I'm feeling frustrated.",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A and B live in the same neighborhood and help each other with tasks.\n3. Neighbors A values appreciation and expresses gratitude for help received.\n4. Neighbors A and B are helpful towards each other.\n5. Neighbors B recalls when Neighbors A helped with their lawn, showing mutual support between them.\n6. Neighbors A and B have a positive and helpful relationship as neighbors.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thank you, I really appreciate your support and understanding. I'll definitely try to find ways to de-stress, and I'll keep looking for new job opportunities as well. Having you as a neighbor makes things a little easier."
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "1. Co-worker A and Co-worker B shared happy memories from their time working together.\n2. Co-worker A has a talent for solving puzzles and mysteries.\n3. Co-worker B was surprised when Co-worker A found out they were married.\n4. Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.\n5. Co-worker A enjoys solving puzzles and mysteries, even considering becoming a detective.\n6. Co-worker A suggests celebrating their detective work with drinks after work.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, I guess I do have a knack for uncovering surprises. Maybe I should consider a career change to detective work! But for now, let's celebrate with drinks after work."
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. The husband appreciates the little things in life, such as making it to the bus on time.\n3. Husband values the supportive community of believers at church and appreciates having his wife by his side.\n4. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n5. The husband's faith has been strong lately, and he is involved in various church ministries.\n6. The wife is glad to see the husband finding a sense of purpose and being happy.",
        "speaker": "Husband",
        "raw_prediction": "Yes, being a part of the church community has really given me a sense of purpose and fulfillment. It's wonderful to have the support of our church family and to be able to serve in ways that bring me joy."
    },
    {
        "utter_id": "e22-s5-t6",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?",
        "memory_text": "1. Co-worker A had a positive experience with a commander who helped them feel safe.\n2. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n3. Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.\n4. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n5. Co-worker B offers encouragement and believes things will work out in the end.\n6. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.",
        "speaker": "Co-workers A",
        "raw_prediction": "I've definitely considered it. I think it would be a great opportunity to make an even bigger impact and help more people feel supported and safe in their roles."
    },
    {
        "utter_id": "e23-s5-t12",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?\nStudent: It's going well. I'm really looking forward to spending more time with them and taking them on fun trips.\nTeacher: That sounds like a great plan. Speaking of fun, remember when you scared me in the hallway a few days ago?",
        "memory_text": "1. The student expresses excitement about retiring and spending time with their grandkids, already planning fun activities.\n2. The student is studying French at college and plans on learning Spanish and German as well.\n3. The teacher speaks Spanish and French fluently.\n4. The teacher encourages the student's retirement plans, highlighting the importance of focusing on family during retirement.\n5. The student has already made plans with their daughter and son-in-law to visit more often and take the grandkids on trips.\n6. The student felt rewarded by the experience and emphasized the importance of being aware of surroundings and acting quickly in emergencies.",
        "speaker": "Student",
        "raw_prediction": "I do remember that! I'm glad you were able to act quickly and everything turned out okay. It's so important to be aware of our surroundings, especially in unexpected situations."
    },
    {
        "utter_id": "e24-s5-t11",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.\nNeighbors A: Absolutely. And hey, on a related note, I wanted to talk to you about something else. Lately, I've been feeling really overwhelmed and stressed out.",
        "memory_text": "1. Neighbors A is feeling overwhelmed and stressed, mentioning having a lot on their plate.\n2. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n3. Neighbors B was read to from a book about personal development by Neighbors A, which had a positive impact on Neighbors A's career growth.\n4. Neighbors B admires Neighbors A's career advancement and expresses interest in borrowing the personal development book.\n5. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\n6. Neighbors A was recently promoted to manager and is struggling to adjust to the new responsibilities.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sorry to hear that you're feeling overwhelmed. I'm here for you and I want to support you however I can. Let's work together to find ways to help you manage your stress and workload."
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.",
        "memory_text": "1. Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable.\n2. Co-worker A was a leader in their country, making it prosperous and safe.\n3. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n4. Both co-workers show a supportive and caring attitude towards each other.\n5. Co-worker A is trying to improve their punctuality and cut back on drinking.\n6. Co-worker B is supportive and encourages Co-worker A to give people a chance.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you for your kind words. I'm trying to channel that same determination and make positive changes in my life now. Your support means a lot to me."
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?",
        "memory_text": "1. Neighbors A looks forward to playing with Neighbors B again when feeling better.\n2. Neighbors A and Neighbors B enjoy playing together with toys.\n3. Neighbors A appreciated the support and friendship of Neighbors B.\n4. Neighbors B is familiar with Neighbors A's dog and looking forward to playing with it again.\n5. Neighbors B expresses concern for Neighbors A's back pain.\n6. Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've thought about it, but my back has been acting up lately so I'm not sure if I could handle long hours of practicing and performing. But I do miss those days of jamming out with the band."
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.",
        "memory_text": "1. Co-worker A took over their family's business a few years ago and it has improved since then.\n2. Co-worker A has a family business that has been doing well recently.\n3. Co-worker A took over the family business and made changes to adapt to modern times.\n4. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n5. Co-worker A made changes to modernize processes and invest in new technology for the business.\n6. Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, it's been a journey for sure. I'm just glad I could apply those lessons to my current role here."
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?",
        "memory_text": "1. The coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\n2. The Coach is giving advice to the Athlete regarding their performance and focus.\n3. The coach encourages the athlete to continue their good work with nutrition and training.\n4. The athlete is concerned about nutrition and improving their diet.\n5. The Athlete is focused on improving their performance and energy levels.\n6. Both the Athlete and Coach emphasize the importance of small changes in diet impacting performance.",
        "speaker": "Athlete",
        "raw_prediction": "Yes, Coach, I've been making sure to include those bean sprouts in my meals. I've noticed a difference in my energy levels already. It's amazing how small changes in diet can really impact performance."
    },
    {
        "utter_id": "e30-s5-t4",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.",
        "memory_text": "1. Co-worker A plans to present the evidence clearly and persuasively in court.\n2. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n3. Co-worker A has presented evidence in front of a judge to support their position in the past.\n4. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n5. Co-worker A's evidence includes statistics and personal accounts from clients.\n6. Co-worker B is supportive and interested in the evidence collected by Co-worker A.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate your kind words. It means a lot to me that you find my arguments compelling. I always strive to present my evidence clearly and persuasively to make a strong case."
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.\nClassmates B: Definitely. It's the small acts of kindness that can make the biggest impact. Remembers when we talked about how I made sure the mix-up won't happen again? That was because I wanted to make a small impact, like you did for your neighbor.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A.\n2. Classmates A appreciates Classmates B's efforts and support.\n3. Classmates A appreciates the support and friendship of Classmates B.\n4. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n5. Classmates A and B started as acquaintances and have developed a strong friendship.\n6. Classmates A and B value their friendship and feel comfortable talking to each other about anything.",
        "speaker": "Classmates A",
        "raw_prediction": "That's true. Your responsibility and reliability definitely made a positive impact on the situation. It's great to have friends like you who always have my back."
    },
    {
        "utter_id": "e32-s5-t9",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband has long-awaited plans and is finally taking action on them.\n3. The husband got impatient and excited about his plans, leading him to leave without the wife.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband is inspired by his wife to take action on his dreams and goals.\n6. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.",
        "speaker": "Wife",
        "raw_prediction": "It's okay, husband. I appreciate your apology and your effort to make things right. I know you'll make up for it with this weekend getaway. Thank you for acknowledging your mistake and promising to involve me in your plans in the future."
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.",
        "memory_text": "1. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n2. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n3. Classmate B admires Classmate A's attitude and sees it as a good example for others.\n4. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n5. Classmates A is stranded in space, running out of oxygen and feeling lightheaded.\n6. Classmate B praises Classmate A's attention to detail and work ethic as truly impressive.",
        "speaker": "Classmates A",
        "raw_prediction": "Thanks, Classmates B. I learned from the best - your resilience and quick thinking during that scary experience in space really inspired me to keep a cool head in tough situations."
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.\nNeighbors B: Speaking of hard work, have you made any progress at your current job? I remember you were having some trouble with your boss.",
        "memory_text": "1. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n2. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n3. Neighbors A is trying to improve their behavior at work and be a better colleague.\n4. Neighbors B appreciated Neighbors A's support during this difficult situation.\n5. Neighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.\n6. Neighbors A is having issues at work, such as not pulling their weight and being rude to colleagues.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, I've been making a conscious effort to be more respectful and pull my weight at work. I've been trying to improve my behavior and relationships with my colleagues. It's definitely been a challenge, but I'm committed to making positive changes."
    },
    {
        "utter_id": "e35-s5-t4",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?",
        "memory_text": "1. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n2. Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.\n3. Co-worker A and Co-worker B met on a movie set and are now good friends.\n4. Co-worker A felt remorse for what they did and appreciated Co-worker B's understanding.\n5. Co-worker B emphasized the importance of learning from mistakes and working together as a team.\n6. Co-worker A is grateful for life experiences and is open to new possibilities in the future.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, I remember that moment. I appreciate your understanding and support during that time. It really helped me get through it and learn from the experience."
    },
    {
        "utter_id": "e36-s5-t11",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?",
        "memory_text": "1. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n2. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n3. Mentor became a mentor to help others going through similar situations.\n4. Mentor is from Italy and has lived in the United States.\n5. Mentee agrees to try the advice and express gratitude towards Mentor.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentor",
        "raw_prediction": "I am originally from Italy, but I have lived in the United States for many years now. It's been a wonderful experience to immerse myself in a different culture and learn from it."
    },
    {
        "utter_id": "e37-s5-t3",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.",
        "memory_text": "1. Neighbors A thanked Neighbors B for the suggestion.\n2. Neighbors B offered to help Neighbors A with the apology process.\n3. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\n4. Neighbors B emphasized the importance of apologizing to show care for the relationship.\n5. Neighbors A bought a necklace from Neighbors B's shop and loves it.\n6. Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.",
        "speaker": "Neighbors B",
        "raw_prediction": "I really appreciate that. It's nice to have someone you can rely on."
    },
    {
        "utter_id": "e38-s5-t11",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. \nClassmates A: Yeah, I guess it does. It’s just that I’ve been hurt before, and I don’t want to lose you as a friend too.",
        "memory_text": "1. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n2. Classmates A tends to overthink things and appreciated Classmates B's support and advice.\n3. Classmates B feels relieved to have someone to confide in about the secret.\n4. Classmates A and B are close and have a level of trust between them.\n5. Classmates A and B are supportive friends who look out for each other during stressful times.\n6. Classmates A offered help and support to Classmates B.",
        "speaker": "Classmates B",
        "raw_prediction": "Don't worry, you won't lose me as a friend. Our friendship means a lot to me, and I value the trust and support we have for each other. Let's take this one step at a time and see where it leads us."
    },
    {
        "utter_id": "e39-s5-t6",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?\nNeighbors A: I visited Brazil and Peru. The culture and food were incredible.\nNeighbors B: That sounds awesome. I've always wanted to go to Peru to see Machu Picchu.\nNeighbors A: Yes, Machu Picchu is amazing. The view from the top is breathtaking.\nNeighbors B: Have you thought about where you want to go next?",
        "memory_text": "1. Neighbors B admires Neighbors A's organization skills and wishes to improve their own organization.\n2. Neighbors A and B believe in doing nice things for others to bring the community together.\n3. Both Neighbors A and B believe in the importance of learning and self-improvement.\n4. Neighbors A and B both took a cooking class together last year.\n5. Neighbor B suggests finding other ways to relieve frustration and looking out for Neighbor A's well-being.\n6. Neighbor A is feeling frustrated and is considering going to a bar to find someone for a casual encounter.",
        "speaker": "Neighbors A",
        "raw_prediction": "I haven't really decided yet. Maybe somewhere in Europe. Do you have any recommendations?"
    },
    {
        "utter_id": "e40-s5-t9",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n3. Classmates A faced tough competition in middle school from a fast girl, motivating them to improve.\n4. Classmates A is always looking to challenge themselves and improve their skills.\n5. Classmates A is struggling with feeling competitive and the need to be the best at everything.\n6. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a great example of perseverance paying off. It's important to remember that pushing yourself to improve is a journey, not just about being the best at everything. Keep up the hard work!"
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmate B is a supportive friend who listens and offers to help.\n3. Classmates B supported Classmates A through a tough time by listening to them.\n4. Classmates B and Classmates A used to dance a lot in middle school.\n5. Classmates A has matured since then and learned from past mistakes.\n6. Classmate A appreciates having friends who are there for them during difficult times.",
        "speaker": "Classmates A",
        "raw_prediction": "Sure! I can definitely help you out with that. Let's sit down together and I'll show you a few options that might work well for what you need."
    },
    {
        "utter_id": "e42-s5-t7",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.",
        "memory_text": "1. Co-worker B reminds Co-worker A of their progress and potential for success.\n2. Co-worker A is adjusting to the night shift schedule and excited for a promotion.\n3. Co-worker B has moved on from their arrest and appreciates Co-worker A's concern and change in behavior.\n4. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n5. Co-workers A and B have worked together on a big story in the past.\n6. Co-worker A is a journalist who was recently promoted for being reliable.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic to hear! I've always believed in your potential and it's great to see you excelling in your new role. Keep up the good work and have confidence in yourself."
    },
    {
        "utter_id": "e43-s5-t3",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?\nClassmates B: I'm sorry,, but I can't disclose that information. It's not my place to tell.\nClassmates A: But how did you find out? I haven't told anyone.",
        "memory_text": "1. Classmates B warns Classmates A about the potential danger of dark alleys.\n2. Classmates A is curious and open to exploring new things and taking risks.\n3. Classmates A and B became friends when Classmates A transferred to the school.\n4. Classmates A encountered a mysterious woman in a dark alley, finding her intriguing.\n5. Classmates B advises Classmates A to be careful and aware while on the bus.\n6. Classmates A was nervous about fitting in but saw Classmates B as well-liked and wanted to be friends with them.",
        "speaker": "Classmates B",
        "raw_prediction": "I noticed some patterns in your behavior and the way you reacted to certain situations. It was just a gut feeling."
    },
    {
        "utter_id": "e44-s5-t8",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.\nNeighbors B: How about we go for a walk and you can talk to me about everything that's been on your mind?",
        "memory_text": "1. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\n2. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n3. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n4. Neighbors A and Neighbors B enjoy going for walks together, especially to the park.\n5. Neighbor A is grieving the recent loss of their grandmother.\n6. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a good idea. I really appreciate you being here for me, Neighbor B. Let's head to the park and talk. Thank you for always being such a good friend."
    },
    {
        "utter_id": "e45-s5-t5",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?",
        "memory_text": "1. Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal.\n2. Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\n3. Classmates A believes in hard work and dedication to achieve goals both in basketball and their job.\n4. Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.\n5. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n6. Classmates A sometimes doubts if they are good enough to make it to the professional level.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, I remember. You have a big dream and you're working hard towards it. Don't let this setback discourage you. Stay focused on your goal, believe in yourself, and keep pushing forward. Just like in basketball, you can overcome challenges with hard work and dedication."
    },
    {
        "utter_id": "e46-s5-t4",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?",
        "memory_text": "1. Classmates B finds Classmates A's involvement in the community admirable and important.\n2. Classmate A and Classmate B are classmates who attended a party together.\n3. Classmate A expresses a desire to find alternative ways to have fun and make a positive impact in the community.\n4. Classmate B agrees to keep the party a secret in exchange for Classmate A doing their homework for a week.\n5. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference.\n6. Classmates A is proactive and curious, taking the initiative to research topics of interest.",
        "speaker": "Classmates A",
        "raw_prediction": "I stumbled upon it while researching camping spots in the area. I thought it would be a nice change of pace from our usual weekend hangouts."
    },
    {
        "utter_id": "e47-s5-t13",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?",
        "memory_text": "1. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n2. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n3. Classmates A plays the guitar, takes lessons, and plays in a band.\n4. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A finds pursuing music rewarding and is passionate about it.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't thought about that yet, but it's definitely something I'd like to explore in the future. I'm really enjoying learning to play the guitar and it's been a great way for me to express myself."
    },
    {
        "utter_id": "e48-s5-t10",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? ",
        "memory_text": "1. Neighbor A enjoys building houses and finishing them quickly.\n2. Neighbor B reminds Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them.\n3. Neighbor B is looking forward to seeing the finished house and is excited about the new project.\n4. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n5. Neighbor A started construction on the house last week and plans to finish it in record time.\n6. Neighbors A helped Neighbors B build a new house with amazing features.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's actually going really well! I've made a lot of progress and I'm hoping to finish it in record time. Thanks for asking!"
    },
    {
        "utter_id": "e49-s5-t8",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.\nWife: Maybe it's time to take a step back and try something new. Have you ever tried writing in a different genre or experimenting with different styles?\nHusband: That's a good idea. I guess I just haven't had the courage to step out of my comfort zone.\nWife: Remember when you faced your fear of public speaking during your fifth-grade presentation? You can do this too. Sometimes, the biggest breakthroughs come from taking risks.",
        "memory_text": "1. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.\n2. The husband is open to learning more about movies, showing a willingness to try again.\n3. Wife suggests that husband should try using more modern language to be better understood.\n4. Husband agrees to try adapting to modern language for better communication with his wife.\n5. The wife remembers the husband being nervous before the presentation.\n6. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.",
        "speaker": "Husband",
        "raw_prediction": "You're right. I need to push myself out of my comfort zone and take some risks with my writing. Thanks for always believing in me and encouraging me to be better."
    }
]