[
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?",
        "memory_text": "- The Parent found hope and appreciated small moments even in difficult situations, which causes them to mention making mistakes in the past and trying to turn their life around.\n- The Parent and Child plan to watch the sunrise together in the future, and the parent suggests repeating the sunrise-watching tradition on a future weekend.\n- The Child finds the Parent's story inspiring and is supportive and proud of their parent for making changes, offering help and reassurance if needed.",
        "speaker": "Parent",
        "raw_prediction": "I did feel that way at times, but I learned the importance of listening and being heard through those tough experiences. It's something I try to remember every day.",
        "previous_summary": "The parent was taken to juvenile detention for getting into trouble with the law.\nThe child is supportive and caring towards the parent.\nThe parent expresses fear and upset about the situation.\nThe child offers help and reassurance to the parent.\nBoth the parent and child express love and support for each other.\nThe Parent has been in juvenile detention in the past.\nThe Parent found hope and appreciated small moments even in difficult situations.\nThe Child finds the Parent's story inspiring.\nThe Parent eventually got to see the sunrise after leaving detention.\nThe Parent and Child plan to watch the sunrise together in the future.\nThe parent mentions making mistakes in the past and trying to turn their life around.\nThe child is supportive and proud of their parent for making changes.\nThe parent wants to provide a safe and stable environment for the child.\nBoth the parent and child enjoy spending time together in their new home.\nThe parent and child have a special tradition of having breakfast together in the backyard and watching the sunrise.\nThe child recalls a memorable morning watching the sunrise with the parent.\nThe parent suggests repeating the sunrise-watching tradition on a future weekend.\nThe parent values independence and self-sufficiency.\nThe parent had a tough time when they got arrested and had to rely on a lawyer and the justice system for help.\nThe parent now lives in a little house in the suburbs that they love.\nThe child is supportive and willing to help out if needed.\nThe parent is currently focused on taking care of themselves and enjoying their independence."
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.",
        "memory_text": "1. The Mentor has been guiding and supporting the Mentee in their work for years, resulting in the Mentee expressing gratitude for the Mentor's guidance and support throughout the decision-making process. This has led to the Mentee feeling overwhelmed with the college application process, similar to how they took shoes from the store without paying because they couldn't afford them.\n\n2. The Mentor has been guiding and supporting the Mentee in their work for years, which prompted the Mentor to reassure the Mentee that many students feel the same way and that everyone works at their own pace. \n\n3. The Mentor has been guiding and supporting the Mentee in their work for years, ultimately causing the Mentee to be offered a job and decide to take the job in the city.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way when you're in a new place. Building a new support system takes time, but you'll find your rhythm. Just remember, you're not alone in this transition.",
        "previous_summary": "The Mentee has won the Nobel Peace Prize for advocating for women and girls.\nThe Mentor has been guiding and supporting the Mentee in their work for years.\nThe Mentee hopes to inspire others to join the cause of gender equality and fighting discrimination.\nThe Mentor believes the Mentee's work has been influential and that they will continue to make an impact in the world.\nThe Mentee has been offered a job and has decided to take the job in the city.\nThe Mentor is supportive and praises the Mentee for their mature decision-making process.\nThe Mentee weighed the pros and cons of each option before deciding on the job in the city.\nThe Mentor acknowledges the Mentee's work in advocacy for women and girls and praises their dedication to their values.\nThe Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\nMentee is feeling overwhelmed with the college application process.\nMentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\nMentee feels like they are running out of time and is worried about the upcoming SAT.\nMentor advises Mentee to break down studying into manageable chunks, schedule study sessions and breaks, and use resources like practice exams and review books.\nMentor emphasizes the importance of self-care for dealing with challenges.\nMentee took shoes from the store without paying because they couldn't afford them.\nMentor advised Mentee to go back to the store, apologize, and offer to pay for the shoes.\nMentor emphasized the importance of taking responsibility for actions and learning from the experience.\nMentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice."
    },
    {
        "utter_id": "e2-s5-t13",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.",
        "memory_text": "Neighbors A and B, who have known each other for years, enjoy spending time together and want to get to know each other even better. They reminisce about past events and plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. Both neighbors enjoy spending time outside and doing chores like mowing the lawn. Additionally, Neighbor A particularly enjoys spending time in Neighbor B's cozy home and wants to hang out more often.",
        "speaker": "Neighbors B",
        "raw_prediction": "I feel the same way. It's nice to have a good friend nearby.",
        "previous_summary": "Neighbors A and B don't know each other well and want to spend more time together.\nThey plan to hang out once a week, possibly watching a movie, getting coffee, or just talking.\nThey both agree to start this weekend and are looking forward to it.\nNeighbors A and B are on friendly terms and enjoy spending time together.\nNeighbors A and B have not seen each other in a while and are catching up.\nNeighbors A is looking for new hobbies to try out.\nNeighbors B enjoys cooking and suggests making something together.\nNeighbors A and B plan to start a monthly dinner party with other neighbors.\nThe first dinner party will involve making homemade pizzas.\nNeighbors A and Neighbors B are both neighbors who have known each other for years and have become good friends.\nNeighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.\nNeighbors B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides.\nNeighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\nNeighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\nNeighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.\nBoth Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\nNeighbor A's mom scolds them for ripping off the tag from their new shirt.\nNeighbor A feels pressured to look perfect all the time by their mom.\nNeighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\nNeighbor B is comforting and supportive towards Neighbor A.\nNeighbor A enjoys spending time in Neighbor B's cozy home and wants to hang out more often.\nNeighbor A and Neighbor B plan to have a movie night together soon."
    },
    {
        "utter_id": "e3-s5-t5",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.",
        "memory_text": "Co-worker B showed a willingness to assist others by helping a customer resolve an issue last week. This demonstrates Co-worker B's supportive nature and readiness to help in any way. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it, similar to when they spoke with the police about an incident where the women involved were thankful. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time. \nCo-worker B commended Co-worker A for their bravery and willingness to help, leading Co-worker A to try to stay positive and focus on their recovery despite it being a daunting task. Co-worker B admires Co-worker A's resilience and positivity, describing them as someone who can stay optimistic even in challenging situations, such as the accident where they lost their hands and feet.",
        "speaker": "Co-workers B",
        "raw_prediction": "I understand that you were struggling with your feelings, but it's important to always consider how your actions might impact others. It's essential to respect boundaries and choices, even when it's difficult.",
        "previous_summary": "Co-worker A witnessed a fight and intervened to separate the two women.\nCo-worker B commended Co-worker A for their bravery and willingness to help.\nCo-worker A spoke with the police about the incident and the women involved were thankful.\nCo-worker B mentioned helping a customer resolve an issue last week, showing a willingness to assist others.\nCo-worker A was in a car accident and lost their hands and feet.\nCo-worker A is alive but will need time to adjust to their new way of life.\nCo-worker B is supportive and willing to help in any way.\nCo-worker A will need all the help they can get during their recovery.\nCo-worker A is trying to stay positive and focus on their recovery, despite it being a daunting task.\nCo-worker A is remembered for being brave and strong in past situations.\nCo-worker A has a positive attitude and focuses on making people happy despite facing challenges like losing their hands and feet.\nCo-worker B admires Co-worker A's resilience and positivity.\nCo-worker A believes in surrounding oneself with positive energy and uplifting people.\nCo-worker A intervened to help two women who were fighting, showing bravery and a desire to make a positive impact.\nCo-worker A is humble and tries to make the world a better place by helping others.\nCo-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\nCo-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\nCo-worker A is described as positive and able to stay optimistic even in challenging situations, like the accident where they lost their hands and feet.\nCo-worker B appreciates Co-worker A's positivity and friendship."
    },
    {
        "utter_id": "e4-s5-t8",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.",
        "memory_text": "Co-worker A has been feeling off lately, but is grateful to Co-worker B for letting them borrow the horse and is having a great time riding her. This has motivated Co-worker A about the future and they are excited to work with Co-worker B. Co-worker B, who offered help and support to Co-worker A, is glad the trade worked out well for both of them. Additionally, Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership. Both co-workers believe they have the potential to create something great together.",
        "speaker": "Co-workers A",
        "raw_prediction": "I remember that conversation! I'm thrilled that you're still on board with the idea. I think we can really make something amazing happen together.",
        "previous_summary": "Co-worker A had a fall in the morning and feels dizzy and disoriented.\nCo-worker A is considering seeing a doctor to ensure everything is okay.\nCo-worker A has been feeling off lately.\nCo-worker B is supportive and encourages Co-worker A to prioritize their health.\nCo-worker A values their health to continue working at their best.\nCo-worker B offers help and support to Co-worker A.\nCo-worker A offered PersonZ to Co-worker B in exchange for one of their horses.\nCo-worker A wanted the chestnut mare that Co-worker B owns.\nCo-worker A has been riding PersonZ and finds her great.\nCo-worker A had anxiety about their health but after seeing a doctor everything was fine.\nCo-worker B is supportive and glad that Co-worker A is okay.\nCo-worker A is grateful to Co-worker B for letting them borrow the horse and is having a great time riding her.\nCo-worker B is generous and allows Co-worker A to ride any of their horses anytime.\nCo-worker A struggled in school, had troubled parents, and felt like they had little guidance growing up.\nCo-worker B was surprised to learn about Co-worker A's past struggles.\nCo-worker A now has a good job and is doing well, despite their difficult upbringing.\nCo-worker A expressed gratitude for the horse that Co-worker B gave them, mentioning it brings joy and happiness.\nCo-worker B is glad to have been able to help Co-worker A and feels the trade worked out well for both of them.\nCo-worker A wants to become business partners with Co-worker B in the future.\nCo-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\nBoth co-workers believe they have the potential to create something great together.\nCo-worker A feels motivated about the future and is excited to work with Co-worker B.\nCo-worker B agrees that their skill sets complement each other well.\nBoth co-workers are looking forward to starting their partnership and are open to seeking extra help if needed.\nCo-workers A and B have a positive and optimistic attitude towards their future collaboration."
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.",
        "memory_text": "Classmates A, who is passionate about science and interested in becoming a doctor or researcher to help people, has developed a crush on Classmates B, finding their interest in taking biology classes in college flattering. Classmates A is considering taking biology classes in college to learn more about how the body works. \nClassmates A finds it refreshing to talk to someone genuinely interested in science and learning, expressing admiration for Classmates B's intelligence and sense of humor. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.",
        "speaker": "Classmates A",
        "raw_prediction": "I just can't believe you would betray me like this. It's really disappointing.",
        "previous_summary": "Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\nClassmates A has developed a crush on Classmates B, which Classmates B finds flattering.\nBoth Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\nClassmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\nClassmates A and B are interested in biology and studying cells.\nClassmates A has taken an anatomy class and studied different types of cells that make up organ systems.\nClassmates B is considering taking biology classes in college to learn more about how the body works.\nClassmates A finds it refreshing to talk to someone genuinely interested in science and learning.\nBoth Classmates A and B enjoy talking to each other and consider themselves great study partners.\nClassmate A is balancing high school and college classes to be successful and help their family.\nClassmate A is considering majoring in biology or the medical field.\nClassmate A is passionate about science and interested in becoming a doctor or researcher to help people and make a difference.\nClassmate B admires Classmate A's dedication and believes they have a knack for science.\nClassmate A has seen Lady Gaga in concert three times before and is a big fan of her.\nClassmate B has never been to a Lady Gaga concert before.\nClassmate A loves Lady Gaga's music and message of acceptance and inclusivity.\nClassmate A's favorite Lady Gaga song is \"Born This Way.\"\nClassmate B's favorite Lady Gaga song is \"Bad Romance.\"\nBoth classmates are excited about seeing Lady Gaga in concert and are looking forward to singing and dancing along to her hits."
    },
    {
        "utter_id": "e6-s5-t14",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning. \nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B are discussing the idea of having telekinetic abilities. Neighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've been feeling a bit overwhelmed with work lately, but I'm trying to stay positive. How about you, how's everything going on your end?",
        "previous_summary": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner.\nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\nNeighbors A used sweet potatoes, carrots, Brussels sprouts, and squash for the roasted vegetables, cooked the quinoa in vegetable broth.\nNeighbors A focuses on healthy and flavorful plant-based meals.\nNeighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.\nNeighbors A and B are discussing the idea of having telekinetic abilities.\nNeighbors A mentions the practical uses of telekinesis, like grabbing things from a distance.\nNeighbors B expresses concerns about accidentally moving objects and causing unintended consequences.\nNeighbors A compares mastering telekinesis to cooking, requiring patience and trial-and-error.\nNeighbors A and B both acknowledge the potential benefits of telekinesis despite the risks involved.\nNeighbors A and B joke about the fun aspects of using telekinesis to surprise people.\nNeighbors A and B share a dream of developing telekinetic abilities together in the future.\nNeighbors A has gained the ability to move objects with their mind.\nNeighbors B is excited and supportive of Neighbors A's new ability.\nNeighbors A has been practicing moving small objects with their telekinesis.\nNeighbors A is overwhelmed but also excited about their new ability.\nNeighbors A enjoys trying new things, like new recipes.\nNeighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.\nNeighbors A is considering incorporating their telekinesis into their cooking in the future.\nNeighbor A is feeling unfulfilled with their job and wants to make a bigger impact.\nNeighbor A is considering looking for a new job but is unsure of what they want to do.\nNeighbor A feels there is no room for growth or new projects at their current job.\nNeighbor A is thinking about exploring new skills or hobbies outside of work, such as taking online courses or learning a new language.\nNeighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career.\nNeighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning."
    },
    {
        "utter_id": "e7-s5-t14",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.\nClassmates B: That's great to hear. And what about your past struggles with school and friendships? Do you feel like you've moved on from that?",
        "memory_text": "Classmates B admires Classmates A's outgoing nature and expresses a desire to be more like them. \nClassmates B appreciates Classmates A's gesture of buying coffee and responds positively to it. \nClassmates A agrees to try the suggestion and expresses gratitude towards Classmates B. \nClassmates B encourages Classmates A to work through their feelings and take steps towards a better future. \nClassmates A encourages Classmates B to initiate conversations and be friendly to make new friends. \nBoth Classmates A and B enjoy socializing and going out to parties together.",
        "speaker": "Classmates A",
        "raw_prediction": "I have definitely made progress in those areas too. I've been focusing on building new connections and embracing new opportunities.",
        "previous_summary": "Classmate A is outgoing and enjoys meeting new people and making friends.\nClassmate B admires Classmate A's outgoing nature and wants to be more like them.\nClassmate A encourages Classmate B to initiate conversations and be friendly to make new friends.\nClassmate A and Classmate B both enjoy socializing and going out to parties together.\nClassmate A and Classmate B enjoy singing karaoke together and look forward to future outings.\nClassmate A suggests planning a picnic in the park or a hike for the next outing with friends.\nClassmates A enjoys treating their friends to coffee.\nClassmates B appreciates Classmates A's gesture of buying coffee.\nClassmates A values quality friendships over quantity.\nClassmates A is social and enjoys meeting new people.\nClassmates A knows how to have fun but also understands the importance of balancing responsibilities.\nClassmates A and B both plan to relax at home later in the day.\nClassmates A and B are open to meeting for coffee again in the future.\nClassmates A had trouble sleeping and tried natural remedies like chamomile tea and lavender oil.\nClassmates B suggested meditation or breathing exercises to help Classmates A relax before bed.\nClassmates A agreed to try the suggestion and thanked Classmates B for it.\nClassmates A and B have shared memories of buying coffee from Starbucks and enjoying it together.\nClassmates A is looking forward to meeting up with Classmates B again after getting better sleep.\nClassmates A expresses regret about their past academic performance.\nClassmates A mentions lacking discipline, focus, and motivation.\nClassmates B suggests going back to school or taking courses to improve.\nClassmates A considers talking to a therapist or counselor to address past issues.\nClassmates B encourages Classmates A to work through their feelings and take steps towards a better future."
    },
    {
        "utter_id": "e8-s5-t6",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.\nNeighbors B: It's always important to own up to our mistakes. It's like when you forgot your backpack in high school and had to deal with the consequences.",
        "memory_text": "1. Neighbors A and B discussed the importance of caring for trees and the environment for future generations, which led to Neighbor B accepting Neighbor A's apology and expressing how hurtful the previous treatment was. This prompted Neighbor A to apologize and acknowledge their wrongdoing.\n   \n2. Neighbors A and B talked about the significance of preserving trees and the environment for the future, prompting Neighbor A to apologize to Neighbor B and show willingness to make things right. In response, Neighbor B reminded Neighbor A about the importance of taking responsibility for past mistakes and learning from them, which led to Neighbor A apologizing and admitting fault.\n\n3. Neighbors A and B recognized the value of using fallen trees for firewood or other purposes, which led to Neighbor A apologizing to Neighbor B and expressing a desire to mend their relationship. This apology caused Neighbors A and B to address their issues and maintain a friendly bond.",
        "speaker": "Neighbors A",
        "raw_prediction": "I remember that! It's so crucial to learn from our mistakes and be accountable for our actions. It's like how we should always strive to be better each day.",
        "previous_summary": "Neighbors A and B are observing wood that appears to be freshly cut from a tree.\nNeighbors A and B discuss the possibility of someone in the neighborhood using the wood for a project.\nNeighbors A recalls a previous storm that caused trees to fall down, leading to the availability of wood for projects.\nNeighbors A and B appreciate the resourcefulness of using fallen trees for firewood or other purposes.\nNeighbors A and B emphasize the importance of taking care of trees and the environment for future generations.\nNeighbor A apologized to Neighbor B for their behavior and expressed a desire to make amends.\nNeighbor B accepted Neighbor A's apology and mentioned that it was hurtful to be treated that way.\nNeighbor A values their friendship with Neighbor B and wants to ensure it remains strong.\nNeighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.\nNeighbor B suggested that the wood may be leftover from city tree trimming activities.\nNeighbors A forgot their backpack at home before going to school.\nNeighbors A stayed up all night studying for a test and feels terrible about forgetting the backpack.\nNeighbors A did not bring any notes or textbooks to school.\nNeighbors B suggests talking to the teacher to see if Neighbors A can take the test another day.\nNeighbors A feels like they should have been more prepared for the test.\nNeighbors B reminds Neighbors A about taking responsibility for their mistakes in the past and learning from them.\nNeighbors B offers help and support to Neighbors A in the situation.\nNeighbors A is good at fixing things, particularly electronics.\nNeighbors B appreciates Neighbors A's handy skills.\nNeighbors A left their backpack at home once and had to borrow notes from a classmate.\nNeighbors A values double-checking before leaving the house.\nNeighbors A apologized to Neighbors B for their behavior and admitted to being wrong.\nNeighbors A and B were able to resolve their issues and maintain a friendly relationship."
    },
    {
        "utter_id": "e9-s5-t2",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?",
        "memory_text": "- Classmates B is supportive and encourages Classmates A in their business venture. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans. Classmate A has always loved singing but never thought it was possible until now.\n- Classmates A appreciates the President's difficult decisions and actions to improve the country's situation. Classmates A is willing to work hard and learn the necessary strategies for business success. Classmate A wants to pursue a dream of becoming a singer.",
        "speaker": "Classmates A",
        "raw_prediction": "I actually started learning carpentry from my grandfather when I was young. He was a skilled craftsman and inspired me to pursue it as a career.",
        "previous_summary": "Classmate A supports the President and believes he is doing a good job.\nClassmate B disagrees with Classmate A and thinks the President is not handling things well.\nClassmate A appreciates the President's difficult decisions and actions to improve the country's situation.\nClassmate B believes the President could do more to address certain issues, particularly the economy.\nClassmate A mentions the President's policies to boost job growth as progress in the economy.\nClassmate B feels the President's actions in the economy were not sufficient to make a significant impact.\nBoth classmates acknowledge their differing opinions and agree to disagree on the President's performance.\nClassmate B hopes the President will consider their concerns and make improvements for the country's betterment.\nClassmates A is interested in entrepreneurship and has signed up for a seminar on starting a business.\nClassmates B is supportive and encourages Classmates A in their business venture.\nClassmates A has had a business idea for a while and is now taking steps to make it a reality.\nClassmates A is willing to work hard and learn the necessary strategies for business success.\nClassmates B mentions the importance of seeking advice from mentors and staying motivated and passionate about the business idea.\nClassmates A appreciates the support and encouragement from Classmates B.\nClassmates A wants to get to know Classmates B better and become friends.\nClassmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\nClassmates B is interested in starting their own business but doesn't know where to start.\nClassmates B has some concerns about the President's policies.\nBoth classmates plan to go to a new sandwich place for lunch together.\nClassmate A wants to pursue a dream of becoming a singer.\nClassmate B is supportive and encourages Classmate A to pursue their dream.\nClassmate A has always loved singing but never thought it was possible until now.\nClassmate A is considering reaching out to vocal coaches to improve singing skills.\nClassmate A has researched local open mic nights and talent showcases to start building a following.\nClassmate A plans to perform at an open mic night at a cafe next week.\nClassmate B offers to support and potentially collaborate with Classmate A in the future."
    },
    {
        "utter_id": "e10-s5-t14",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.\nCo-workers A: Of course I remember! I'm happy we're friends again.\nCo-workers B: Me too. And do you still have that baby doll and rattle you bought a couple of years ago?\nCo-workers A: Yes, actually! I gave them to my niece and she loves them.\nCo-workers B: That's awesome. And I still remember when you scratched my neck and helped me relax. Sometimes I still need that kind of release.",
        "memory_text": "Co-worker A's competence is recognized and appreciated in the workplace, contributing positively to the team dynamic. Both Co-worker A and Co-worker B emphasize the importance of effective communication and mutual understanding in their relationship. Co-worker A and Co-worker B cherish moments of connection, finding them essential for a more enjoyable work environment.   \nCo-worker A's gesture of returning Co-worker B's watch repaired their friendship, highlighting the significance of small acts of kindness. Co-worker A's thoughtful gift of a baby doll and rattle to their friend expecting a child showcases their caring nature. Co-worker A's decision to buy a baby doll and rattle for a friend's child despite not planning to have kids soon reflects their generous spirit.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad I could help you relax. It's important to take care of each other's well-being in the office.",
        "previous_summary": "Co-worker A is known for being competent and is trusted with important projects.\nCo-worker A enjoys helping others and takes pride in their work.\nCo-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.\nCo-worker A believes in leading by example to create a positive work culture.\nCo-worker A returned a watch to Co-worker B, making them happy again.\nCo-worker B thought they had lost the watch for good.\nCo-worker A is seen as competent and reliable by Co-worker B.\nCo-worker A strives to do their best in their work.\nCo-worker A and Co-worker B had a disagreement but resolved it, becoming friends again.\nBoth Co-worker A and Co-worker B value communication and understanding in relationships.\nCo-worker A and Co-worker B excel at working well with others and resolving issues.\nCo-worker A bought a baby doll and a rattle for themselves, even though they do not have any kids.\nCo-worker A used to love playing with dolls and stuffed animals as a child.\nCo-worker A had a teddy bear that they received as a gift from their grandma and used to carry it everywhere.\nCo-worker B received their watch back from Co-worker A a few months ago, which repaired their friendship.\nCo-worker A enjoys sharing stories about their adventures with the baby doll with Co-worker B.\nCo-worker A is giving Co-worker B a massage to help them relax.\nCo-worker A has a history of helping out Co-worker B and values their friendship.\nCo-worker B appreciates Co-worker A's competence and effort in their work.\nCo-worker A returned Co-worker B's watch a few years ago, leading to the rekindling of their friendship.\nCo-worker A is not planning on having kids soon but bought a baby doll and rattle as a gift for a friend who is expecting.\nCo-worker B finds the massage from Co-worker A relaxing and helps them feel at peace.\nBoth Co-worker A and Co-worker B enjoy taking moments to connect with each other and find these moments make work more enjoyable."
    },
    {
        "utter_id": "e11-s5-t13",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.\nNeighbors A: Oh, gosh. That was so long ago. I can't even believe I had that kind of power over you.\nNeighbors B: I'm just glad we've both grown since then, and we can have a friendship that's based on mutual respect.\nNeighbors A: Absolutely. And now, I'm excited to explore my new neighborhood and get to know the people here. It feels like a fresh start.",
        "memory_text": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there, feeling comfortable and safe, and has made good friends, including Neighbors B. This has led to Neighbors A being excited to explore the neighborhood, make new friends, and have a fresh start. \nNeighbors B used to obey Neighbors A's commands, but they have both grown since then and now have a friendship based on mutual respect.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's always exciting to have a fresh start and meet new people. I'm sure you'll make just as many great memories in your new neighborhood as you did here.",
        "previous_summary": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.\nNeighbor B has moved around a lot over the years but is considering settling down in the current neighborhood.\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past.\nNeighbors A finds peace and happiness by spending time with God daily, through prayer, reading the Bible, and listening to worship music.\nNeighbors A believes this routine has brought positive changes, helping them stay focused, calm, and grateful.\nNeighbors B is interested in practicing gratitude and shifting their perspective towards positivity.\nNeighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\nNeighbors A used to have power over Neighbors B, but no longer has it.\nNeighbors B used to obey Neighbors A's commands.\nNeighbors A finds spending time with God brings them peace and happiness.\nNeighbors A and B live in the same place and find comfort in it.\nNeighbors A values the relationship with Neighbors B and considers them like family.\nNeighbors A just moved to a new neighborhood and is getting to know the area.\nNeighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\nNeighbors A is excited to explore the neighborhood and make new friends.\nNeighbors A found a park and a coffee shop nearby that they want to visit.\nNeighbors B acknowledges Neighbors A's friendly and outgoing nature.\nNeighbors A appreciates having friendly faces around and hopes to make new friends soon."
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.",
        "memory_text": "- Classmates A had a moment of frustration in the past but has learned to channel that energy into studies, which caused them to show up to school in pajamas due to oversleeping after studying late.\n- Classmates A met the girl of their dreams at a party and have been texting her nonstop, which made them take off their belt and dislike wearing it all day.\n- Classmates A is dedicated to studying hard and taking extra classes to get into a good college, wanting to work hard to achieve their dreams, and not being afraid to be themselves and embracing their quirks, which their girlfriend appreciates.",
        "speaker": "Classmates B",
        "raw_prediction": "Oh, really? That's great to hear. How did you two meet at the party?",
        "previous_summary": "Classmate A takes off their belt and dislikes wearing it all day.\nClassmate B is working on finishing a history project.\nClassmate A is also working on an essay about the Industrial Revolution.\nClassmate A shares interesting information about the spinning jenny and its impact on the textile industry.\nClassmate B is interested in attending a new technology conference next month.\nClassmates A is dedicated to studying hard and taking extra classes to get into a good college.\nClassmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.\nClassmates A had a moment of frustration in the past but has learned to channel that energy into studies.\nClassmates A's grades are looking good according to their teacher.\nClassmates B noticed Classmates A's improvement and acknowledged their hard work.\nClassmates A showed up to school in pajamas due to oversleeping after studying late.\nClassmates A values being true to themselves and expressing their own style.\nClassmates B advises Classmates A to consider how others perceive them, especially in situations like applying to college.\nClassmates A believes that if a college rejects them for their style, it's not the right fit.\nClassmates A is willing to work hard to achieve their dreams.\nClassmates A met the girl of their dreams at a party and have been texting her nonstop.\nClassmates B is supportive of Classmates A's new relationship and believes they found someone who makes them happy.\nClassmates A is determined to make the relationship work, similar to their determination to get into college.\nClassmates A is not afraid to be themselves and embraces their quirks, which their girlfriend appreciates.\nClassmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\nClassmates A feels like everything is falling into place and is excited to see where the new relationship goes."
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.",
        "memory_text": "Mentor's encouragement and support have played a significant role in Mentee's journey to sobriety, for which Mentee expresses gratitude and credits Mentor. This positive change has made Mentor proud of Mentee's growth and ability to take control of their life.\n\nMentor's ongoing support for Mentee's sobriety journey has been well-received by Mentee, who values Mentor's willingness to share knowledge and help them achieve their goals.\n\nMentee's focus on living in the moment and feeling more connected to life resonates with their challenging but rewarding experience of getting sober. Mentee is now dedicated to sobriety and believes incorporating yoga into their routine will further benefit their mental and physical health.",
        "speaker": "Mentor",
        "raw_prediction": "That's wonderful to hear, Mentee. Living in the moment can truly enhance your overall well-being and outlook on life. Keep embracing that mindset, and you'll continue to see positive changes in your journey.",
        "previous_summary": "The Mentee is trying to live in the moment and feel more connected to their life.\nThe Mentor is supportive of the Mentee's approach and encourages them to continue.\nThe Mentee focuses on savoring the small details in life, such as food and nature.\nThe Mentee used to feel overwhelmed, but now feels more fulfilled by living in the moment.\nThe Mentor advises the Mentee to be gentle with themselves when they slip back into old patterns.\nBoth the Mentor and Mentee believe that living in the moment can bring joy and strength in facing challenges.\nMentee struggled with substance abuse since the age of 15, using it as an escape from problems.\nMentor has been supportive of Mentee's journey to sobriety.\nMentee found getting sober to be a challenging process but is now proud of their progress.\nMentor acknowledges Mentee's achievements and provides ongoing support and guidance.\nMentee credits Mentor for their help in achieving sobriety and expresses gratitude for the support.\nMentor advises Mentee to focus on living in the present moment to stay motivated in their journey.\nMentee has a history of substance abuse but has been sober for a year.\nMentor has been in the business for a long time and has a lot of experience.\nMentee admires Mentor's success and wants to learn from them.\nMentor is willing to share their knowledge with Mentee and help them achieve their goals.\nMentor advises Mentee to stay true to themselves and their values.\nMentee wants to make a name for themselves in the industry and believes learning from Mentor will help them achieve that.\nMentor is proud of Mentee for making positive changes and taking control of their life.\nMentee values living in the moment and staying focused on their sobriety and goals.\nThe Mentee is interested in a TV show and mentions enjoying the characters and humor.\nThe Mentor emphasizes the importance of relaxation and having hobbies outside of work.\nThe Mentee is considering trying yoga to help with stress and anxiety.\nThe Mentor has tried yoga before and found it helpful for managing stress.\nThe Mentee is dedicated to their sobriety and believes incorporating yoga into their routine will benefit their mental and physical health.\nThe Mentor encourages the Mentee to prioritize self-care and explore new ways to stay healthy and happy."
    },
    {
        "utter_id": "e14-s5-t12",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?",
        "memory_text": "- The Parent acknowledges being lazy about washing dishes and promises to contribute more to keeping the home clean.\n- The Parent has seen a doctor and is taking medicine for their illness.\n- The Parent expresses a desire to be a better role model for the Child and their siblings.\n- The Child is caring and offers help to the Parent.\n- The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.",
        "speaker": "Parent",
        "raw_prediction": "Yes, I remember that! It was a lot of fun. I'm glad you enjoy being creative too, just like me.",
        "previous_summary": "The Parent is working and feels tired after a long day.\nThe Child feels it is unfair that they have to do certain chores because the Parent is too tired.\nThe Child suggests creating a schedule for chores to ensure everyone contributes equally.\nThe Parent agrees to make an effort to start pulling their weight around the house and to follow the chore schedule.\nThe Parent witnessed a terrible accident while walking to work and was deeply affected by it.\nThe Parent emphasizes the importance of being aware of surroundings and being careful while driving or walking.\nThe Parent values cherishing moments with loved ones and stresses the unpredictability of life.\nThe Child recalls being advised by the Parent to look both ways before crossing the street.\nThe Parent acknowledges being lazy about washing dishes and promises to contribute more to keeping the home clean.\nThe Parent expresses a desire to be a better role model for the Child and their siblings.\nThe parent has adopted the child and is considering adopting more children, preferably younger ones aged 2 to 5.\nThe child is supportive of the parent's decision to adopt more children and believes they will provide a loving family for them.\nThe parent wants to adopt siblings so they can grow up together.\nThe child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent.\nThe parent promises to always try to be the best parent for all of their children.\nThe parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\nThe child emphasizes the importance of teamwork in the family for a happy home.\nThe Parent is feeling sick and has been in bed for days.\nThe Child is caring and offers help to the Parent.\nThe Parent has seen a doctor and is taking medicine for their illness.\nThe Child offers to bring water or make soup for the Parent while they are resting.\nThe Parent mentions a terrible accident they witnessed on the way to the Child's school.\nThe Parent expresses a desire to adopt more children in the future.\nThe Child supports the idea of the Parent adopting more children and hopes for a happy home for them."
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.\nClassmates B: I'm proud of you. It's always great to see someone following their dreams.\nClassmates A: Thanks, it's been a journey, but I'm really happy with where I am now. It's crazy to think that years ago, I was so hesitant to even share this part of myself.\nClassmates B: It just goes to show that it's never too late to start pursuing what you love. Remember when we talked about you living your life on your own terms? You're doing just that.",
        "memory_text": "Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth. This aligns with their shared value of trying new things and taking risks for personal development. As a result, Classmates A values living life on their own terms and being content with their choices. This attitude towards independence and happiness has led Classmates A to pursue their passions and find joy in life.",
        "speaker": "Classmates A",
        "raw_prediction": "I appreciate your support and encouragement. It really means a lot to me.",
        "previous_summary": "Classmates A and B are in the same class and have had previous conversations about study tips.\nClassmates A was initially hesitant about following Classmates B's advice.\nClassmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth.\nClassmates A ended up taking Classmates B's advice and found success with it.\nClassmates B is supportive and willing to offer help in the future.\nBoth Classmates A and B value the importance of trying new things and taking risks for personal development.\nClassmates A values living life on their own terms and being content with their choices.\nClassmates B supports Classmates A's perspective on living authentically and free from others' opinions.\nBoth speakers emphasize the importance of focusing on personal happiness and not being swayed by external judgments.\nClassmates B expresses a desire to see Classmates A happy and successful in life.\nClassmate A values independence and focuses on their own happiness.\nClassmate B emphasizes the importance of considering how actions may affect others.\nClassmate A is open to considering the impact of their actions on others and is willing to strike a balance between personal happiness and consideration for others.\nClassmate B emphasizes the importance of positively impacting others while living a fulfilling life.\nClassmates A and B went to the same high school.\nThey reconnected on Facebook after many years.\nThey are excited to catch up and potentially become good friends.\nClassmates A has been pursuing their passions and enjoying life.\nClassmates B has been working and traveling since high school.\nClassmates A values their happiness and living life on their own terms.\nClassmates B gave advice to Classmates A in the past that paid off.\nThey both look forward to seeing what the future holds now that they're connected again."
    },
    {
        "utter_id": "e16-s5-t9",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?",
        "memory_text": "1. [Co-worker A used to fantasize about being a great leader and being respected and admired.] - (SameTopic) - [Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.]\n2. [Co-worker A has fantasies of being a great leader.] - (SameTopic) - [Co-worker A felt stressed about their relationship with Co-worker B in the past.] - (Causes) - [Co-worker B advises Co-worker A to control their emotions and discuss the issue with Co-worker B.]",
        "speaker": "Co-workers B",
        "raw_prediction": "I do remember that time. It's important to address any issues that come up in the workplace. I'm glad we were able to work through it and continue to support each other.",
        "previous_summary": "Co-worker A has fantasies of being a great leader.\nCo-worker A imagines giving inspiring speeches and leading people into battle.\nCo-worker A is unsure if they have what it takes to be a real leader.\nCo-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader.\nCo-worker A considers taking on more responsibility at work as a start towards being a leader.\nCo-worker B believes that Co-worker A has the potential to be a great leader if they use their power for good.\nCo-worker A is feeling stressed about their relationship with Co-worker B.\nCo-worker B reassures Co-worker A that there are no issues from their side.\nCo-worker A is focused on getting along and working smoothly with Co-worker B.\nBoth Co-workers agree that a good working relationship is important.\nCo-worker A has aspirations of being a great leader and emphasizes the importance of communication.\nCo-worker B acknowledges the importance of communication and resolving conflicts.\nCo-worker B hints at the possibility of working together in a different capacity in the future.\nBoth Co-workers emphasize the importance of supporting each other as co-workers.\nCo-worker A felt stressed about their relationship with Co-worker B in the past.\nCo-worker A has grown and become more confident over the years.\nCo-worker A used to fantasize about being a great leader and being respected and admired.\nCo-worker B acknowledges and supports Co-worker A's growth and progress.\nBoth co-workers value improvement and pushing themselves to be better.\nCo-worker A feels embarrassed for losing control of their emotions.\nCo-worker B advises Co-worker A to control their emotions and discuss the issue with Co-worker B.\nCo-worker A assumes that Co-worker B wouldn't listen or care about their concerns.\nCo-worker A is willing to calm down and have a conversation with Co-worker B.\nCo-worker B advises Co-worker A to take small steps and have one conversation at a time."
    },
    {
        "utter_id": "e17-s5-t10",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?",
        "memory_text": "Neighbors A showed appreciation for Neighbors B's actions in the neighborhood, leading to Neighbors A being willing to take things slow in their relationship with Neighbors B. This resulted in Neighbors B reassuring Neighbor A about past embarrassing incidents and emphasizing their current friendship. \nNeighbors A ordered a large cheese pizza with extra sauce for Neighbors B, highlighting the value of their friendship. This conversation transitioned to Neighbor A's daughter starting high school, which has been a significant adjustment for the family.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, that park has been such a peaceful place to unwind. I still go there sometimes to clear my mind.",
        "previous_summary": "Neighbors A surprised Neighbors B with a pizza.\nNeighbors A ordered a large cheese pizza with extra sauce for Neighbors B.\nNeighbors A did this as a gesture of appreciation for Neighbors B's actions in the neighborhood.\nNeighbors B had tried the new restaurant down the street and found the food good but the service slow.\nNeighbors A ordered pizza for Neighbors B in the past.\nNeighbors A has developed romantic feelings for Neighbors B.\nNeighbors B values their friendship with Neighbors A.\nNeighbors A is willing to take things slow in their relationship with Neighbors B.\nBoth Neighbors A and B appreciate their friendship and are open to going back to being friends if the romantic relationship doesn't work out.\nNeighbor A recently discovered a park on Main Street with a playground and water park area.\nNeighbor A went to the park with their son, who had a great time.\nNeighbor A's daughter recently started high school, which has been a big adjustment for the family.\nNeighbor B has a son who also started high school and understands the challenges and excitement that come with it.\nBoth neighbors enjoy discovering new things in their neighborhood and spending time with their children.\nNeighbor A feels knowledgeable and like they understand everything, specifically about the history of their town.\nNeighbor B appreciates Neighbor A's thoughtfulness, mentioning a pizza Neighbor A ordered for them.\nNeighbor A is embarrassed about a past incident where they pushed Neighbor B's shoulder to gain acceptance.\nNeighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\nNeighbor A reminisces about simpler times and expresses missing them.\nNeighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\nBoth neighbors look forward to new adventures and discoveries in the future, appreciating the surprises and possibilities life offers."
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.\nNeighbors B: That sounds like a great idea. You have the opportunity to do so much with your newfound wealth.\nNeighbors A: Definitely. It's funny how things can change so quickly. Just a few years ago, I was stuck in a job I hated and now I have all this freedom.",
        "memory_text": "Neighbors B is supportive and believes Neighbors A's story about becoming a millionaire, suggesting looking up UFO sightings in the area. Neighbors A is tired from work and needs to catch up on sleep, but Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries, which caused Neighbors A to make a big career change recently and become much happier. Neighbors A plans to do some research and possibly report the sighting of the UFO, and suggests planning something else to do together over the weekend, while also planning to start looking for new opportunities soon and updating their resume and start networking, which changed when Neighbors A took the leap to make a change and is glad they did. Neighbors B is supportive of Neighbors A's decision to make a big career change and admires the courage it took.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's truly amazing how life can take unexpected turns. I'm glad to see how happy and fulfilled you are now.",
        "previous_summary": "Neighbors A saw something they believe to be a UFO and are still shaken up about it.\nNeighbors B is supportive and believes Neighbors A's story, suggesting looking up UFO sightings in the area.\nNeighbors A's husband thinks they are crazy for believing they saw a UFO.\nNeighbors A plans to do some research and possibly report the sighting of the UFO.\nNeighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience.\nNeighbor A is tired from work and needs to catch up on sleep.\nNeighbor B is upset that Neighbor A doesn't want to go to the party with them.\nNeighbor B is worried about looking stupid if they show up at the party alone.\nNeighbor A didn't know they wouldn't feel up for the party until now.\nNeighbor A suggests planning something else to do together over the weekend.\nNeighbor A mentions seeing a UFO and wants to discuss it with Neighbor B.\nNeighbors A is feeling stagnant in their current job and is looking for more growth and challenge.\nNeighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\nNeighbors A plans to start looking for new opportunities soon and needs to update their resume and start networking.\nNeighbors B has knowledge of people in different industries and is willing to help Neighbors A with their job search.\nNeighbors A believes they saw a UFO in their backyard and still thinks it was real, finding it crazy to think about.\nNeighbors A made a big career change recently and is much happier now.\nNeighbors B is considering taking a vacation to a town with beautiful beaches.\nNeighbors A and B had a conversation a couple of years ago about needing a change.\nNeighbors A took the leap to make a change and is glad they did.\nNeighbors B is supportive of Neighbors A's decision and admires the courage it took.\nNeighbors A and B have a friendly and supportive relationship."
    },
    {
        "utter_id": "e19-s5-t8",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.\nNeighbors B: I'm sorry to hear that. Have you considered looking for a new job?\nNeighbors A: I have, but with the current job market, it's really tough. Plus, I don't have a lot of experience in other fields.\nNeighbors B: Well, I'll keep an ear out for any job openings that might be a good fit for you. In the meantime, maybe try finding ways to de-stress after work? I find that exercise helps me when I'm feeling frustrated.",
        "memory_text": "Neighbor A mentioned the importance of keeping outside spaces clean and maintained for the future. This aligns with the mutual support Neighbors A and B show each other, as seen when Neighbors A helped with their lawn. Additionally, Neighbors A values appreciation and expresses gratitude for help received, highlighting the supportive and helpful dynamic between them.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I appreciate that. I'll give exercise a try and see if it helps me unwind after work.",
        "previous_summary": "Neighbor A mentioned cleaning up a tree house to prevent insects and spiders from living in it.\nNeighbor A emphasized the importance of keeping outside spaces clean and maintained for the future.\nNeighbor B recalled a past experience where their tree house was destroyed due to lack of proper care.\nNeighbor A highlighted the cost-effectiveness of taking care of belongings, whether inside or outside.\nNeighbors A and B live in the same neighborhood and help each other with tasks.\nNeighbors A emphasizes the importance of recognizing and thanking each other for acts of kindness.\nNeighbors B agrees and mentions the sense of community that is built through helping each other.\nNeighbors B recalls when Neighbors A helped with their lawn, showing mutual support between them.\nBoth neighbors appreciate the support and assistance they provide each other, making their neighborhood feel like a real community.\nNeighbors A and B are helpful towards each other.\nNeighbors B helped Neighbors A with groceries and picking out fruits and vegetables.\nNeighbors A cleaned a tree house to avoid bugs and spiders.\nNeighbors B enjoys keeping things clean and tidy.\nNeighbors A wants to rearrange their living room and Neighbors B has experience with rearranging furniture.\nNeighbors A and B are planning to work together to rearrange the living room over the weekend.\nNeighbors A is detail-oriented and strives for perfection.\nNeighbors B is supportive and understanding of Neighbors A's mistake.\nNeighbors A values appreciation and expresses gratitude for help received.\nNeighbors B values reciprocity and acknowledges the mutual help between them as neighbors.\nNeighbors A and B have a positive and helpful relationship as neighbors."
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "- Co-worker A and Co-worker B reminisced about happy memories from their time working together, sparking joy in their conversation.\n- Co-worker A, described as having \"Sherlock Holmes-like skills,\" expressed a desire to celebrate their detective work with drinks after work, hinting at their enjoyment of solving mysteries.\n- Co-worker A's talent for solving puzzles and mysteries was highlighted, leading to discussions about potentially pursuing a career as a detective.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, I guess I do have a knack for uncovering things. Maybe I missed my calling as a detective!",
        "previous_summary": "Co-worker A and Co-worker B are both excited about payday and being able to pay off bills.\nCo-worker A and Co-worker B both plan to treat themselves to a nice dinner with their paychecks.\nCo-worker B mentions that their store is getting new inventory next week, specifically a new line of athletic wear.\nCo-worker A and Co-worker B are both looking forward to the new athletic wear and mention getting a discount on their purchases.\nCo-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.\nCo-worker B is concerned about getting paid on time and has bills to pay.\nBoth co-workers work at a clothing store and are interested in upcoming sales.\nCo-worker A discovered that an employee was hiding clothes to sell on the side.\nCo-worker A suggests celebrating their detective work with drinks after work.\nCo-worker A is observant and did some research on social media to find out that Co-worker B is married.\nCo-worker B is married and had a weekend where they went hiking and had dinner with friends.\nCo-worker A enjoys solving puzzles and mysteries, even considering becoming a detective.\nBoth co-workers have tasks at work involving new inventory that needs to be put out.\nCo-worker A and Co-worker B used to work together at a clothing store.\nCo-worker A is upset about Ms\nCo-worker A has a talent for solving puzzles and mysteries.\nCo-worker B was surprised when Co-worker A found out they were married.\nCo-worker A and Co-worker B were able to pay their bills on time when working at the clothing store.\nCo-worker A and Co-worker B shared happy memories from their time working together."
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "The husband enjoys spending quality time with his friend and cherishes their bond, feeling uplifted and at ease in their presence. He also treasures the supportive community of believers at church and is actively engaged in various ministries, finding strength in his faith. \nBoth the husband and wife prioritize the small, meaningful moments in life that contribute to their overall happiness and well-being. \nThe husband values reliability in his relationships and eagerly anticipates collaborating on a podcast project. Additionally, he finds joy in the simple pleasures of life, like making it to the bus on time.",
        "speaker": "Husband",
        "raw_prediction": "Yes, being part of the church community has been truly fulfilling. I find so much joy in giving back and connecting with others through our shared faith.",
        "previous_summary": "The husband had a good time hanging out with his friend and feels refreshed and trusted around him.\nThe husband and his friend went for a walk and discussed ideas for a new project, possibly a podcast.\nThe wife is supportive of her husband's hobbies and interests, such as playing the guitar.\nThe husband values having someone trustworthy to spend time with and looks forward to working on the podcast project.\nThe husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\nThe husband had to run to catch the bus this morning but made it on time, finding the experience exhilarating.\nThe wife doesn't like rushing and feels like she might forget something important.\nThe husband appreciates the little things in life, such as making it to the bus on time.\nThe husband values spending time with his friend, feeling happy and content with their company.\nThe wife is glad that the husband has a friend he can trust and enjoy spending time with.\nThe husband believes it's important to cherish meaningful connections in life, like the one he has with his friend.\nBoth the husband and wife agree that it's the little things that add up and make life meaningful.\nHusband is grateful for his Christian upbringing and is passionate about his faith.\nHusband was baptized at eight years old and is involved in different ministries at church.\nWife is supportive of her husband's faith journey and values having a close relationship with him.\nHusband values the supportive community of believers at church and appreciates having his wife by his side.\nThe husband enjoys being outside and loves the weather after being stuck indoors at work.\nThe wife mentions that the husband had to run to catch the bus a couple of years ago.\nThe husband's faith has been strong lately, and he is involved in various church ministries.\nThe wife is glad to see the husband finding a sense of purpose and being happy.\nThe husband feels happy and content being outside in the beautiful weather."
    },
    {
        "utter_id": "e22-s5-t6",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?",
        "memory_text": "1. [Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.] - (React) - [Co-worker A had a positive experience with a commander who helped them feel safe.]\n2. [Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.] - (Want) - [Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director.]\n3. [Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.] - (Want) - [Co-worker A values making money and is interested in opportunities to do so.]",
        "speaker": "Co-workers A",
        "raw_prediction": "I've thought about it, but right now I'm really focused on making a difference in my current role.",
        "previous_summary": "Co-worker A had an argument with the director about the play they are putting on.\nCo-worker A believes the play has potential and needs more workshopping and refinement.\nCo-worker B suggests the director's concerns may be related to budget or timeline issues.\nCo-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director.\nCo-worker A has a meeting scheduled with the director to discuss the play further.\nCo-worker B offers encouragement and believes things will work out in the end.\nCo-worker A and Co-worker B had a previous debate about the best venue for a production but were able to reach a consensus.\nCo-worker A prioritizes making money and believes it is the most efficient use of time.\nCo-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\nCo-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.\nCo-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\nCo-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\nCo-worker A acknowledges trying to give back but still believes making money is the most efficient use of time and resources.\nCo-worker A is feeling targeted by Mary's behavior, including snide comments and dirty looks.\nCo-worker A has tried talking to Mary about the issue but was dismissed.\nCo-worker A is hesitant to bring up the problem with their supervisor for fear of being seen as a tattletale.\nCo-worker B suggests talking to the supervisor if Mary's behavior affects work.\nCo-worker A plans to address the issue with Mary to improve productivity.\nCo-worker A is still interested in making money but is currently focused on resolving the issue with Mary.\nCo-worker A had a positive experience with a commander who helped them feel safe.\nCo-worker A values making money and is interested in opportunities to do so.\nCo-worker A had an argument with the director about a play but didn't compromise.\nCo-worker A is self-aware about being stubborn and needing to learn to compromise.\nCo-worker A asked Mary about her mean behavior, and Mary mentioned personal issues were the cause."
    },
    {
        "utter_id": "e23-s5-t12",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?\nStudent: It's going well. I'm really looking forward to spending more time with them and taking them on fun trips.\nTeacher: That sounds like a great plan. Speaking of fun, remember when you scared me in the hallway a few days ago?",
        "memory_text": "The student had a heroic experience at the beach where they helped save a young kid from drowning. This event has made the student eager to retire and spend quality time with their grandchildren. Additionally, the student is currently studying French at college and intends to learn Spanish and German to become more well-rounded in language skills.\n\nThe teacher praised the student for their bravery and quick action in the emergency situation. This positive reinforcement may have contributed to the student feeling stressed lately, which could have led to the outburst. Furthermore, the student is excited about retiring and spending time with their grandkids, already planning fun activities.",
        "speaker": "Student",
        "raw_prediction": "Oh, I remember that! Sorry about that, I was in a rush that day.",
        "previous_summary": "The student had a heroic experience at the beach where they helped save a young kid from drowning.\nThe teacher praised the student for their bravery and quick action in the emergency situation.\nThe student felt rewarded by the experience and emphasized the importance of being aware of surroundings and acting quickly in emergencies.\nThe teacher encouraged the student to prioritize safety and continue helping others in need.\nThe student apologized to the teacher for yelling at them and scaring them in the hallway.\nThe student mentioned feeling stressed lately, which may have led to the outburst.\nThe teacher expressed understanding and encouraged the student to seek help when needed.\nThe student admitted to not talking to anyone about their stress and trying to deal with it alone.\nThe teacher offered support and reassured the student that they are there to talk to.\nThe student appreciated the teacher's support and apologized again for the incident.\nThe student is looking forward to retirement and spending time with their grandchildren.\nThe student has already made plans with their daughter and son-in-law to visit more often and take the grandkids on trips.\nThe teacher recalls a time when the student saved a child from drowning, showing their caring nature.\nThe student apologizes to the teacher for yelling in the hallway, acknowledging it was out of character and seeking to move past it.\nThe teacher advises the student on effective communication and problem-solving, emphasizing the importance of talking calmly and finding solutions together.\nThe student expresses excitement about retiring and spending time with their grandkids, already planning fun activities.\nThe teacher encourages the student's retirement plans, highlighting the importance of focusing on family during retirement.\nThe student is studying French at college and plans on learning Spanish and German as well.\nThe teacher speaks Spanish and French fluently.\nThe student believes in the importance of continuous learning and growth.\nThe student once saved a kid from drowning and had a moment of yelling at the teacher in the past.\nThe teacher and student have a positive and understanding relationship."
    },
    {
        "utter_id": "e24-s5-t11",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.\nNeighbors A: Absolutely. And hey, on a related note, I wanted to talk to you about something else. Lately, I've been feeling really overwhelmed and stressed out.",
        "memory_text": "Neighbor A's favorite book is \"The Great Gatsby.\" - (Cause) - Neighbor B was read to from a book about personal development by Neighbor A, which had a positive impact on Neighbor A's career growth. - (Cause) - Neighbor A feels like they are making a real impact at the company and is driven and motivated. - (Changed) - Neighbor A is feeling overwhelmed and stressed, mentioning having a lot on their plate.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sorry to hear that. Is there anything specific that's been causing you stress?",
        "previous_summary": "Neighbor A enjoys reading and sharing books with Neighbor B.\nNeighbor B enjoys listening to Neighbor A read and is interested in reading more.\nNeighbor A's favorite book is \"The Great Gatsby.\"\nNeighbor A and Neighbor B went to a concert together in the past and had a great time.\nNeighbors A recently got a new job as a secretary at a small marketing agency.\nNeighbors A aspires to be more important in the company and was promoted to manager after working harder and taking on more responsibility.\nNeighbors B was read to from a book about personal development by Neighbors A, which had a positive impact on Neighbors A's career growth.\nNeighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\nNeighbors B admires Neighbors A's career advancement and expresses interest in borrowing the personal development book.\nNeighbors A has a new workout routine, waking up at 5 a.m\nNeighbors A's workout routine consists of cardio, weightlifting, and a cool down.\nNeighbors A has been promoted to manager at their job and is taking on more responsibilities.\nNeighbors A feels like they are making a real impact at the company and is driven and motivated.\nNeighbors B is trying to get into a workout routine but is finding it hard to stay motivated.\nNeighbors A offers to help Neighbors B with getting into a workout routine.\nNeighbors A is feeling overwhelmed and stressed, mentioning having a lot on their plate.\nNeighbors A was recently promoted to manager and is struggling to adjust to the new responsibilities.\nNeighbors A tries to work out every morning to relieve stress but has been finding it difficult to maintain.\nNeighbors B offers to be more supportive and check in on Neighbors A more often.\nNeighbors B suggests working out together to make it more enjoyable for both of them.\nBoth neighbors emphasize the importance of taking care of each other as neighbors."
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.",
        "memory_text": "Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions. This reminds Co-worker A of the time when they were a leader in their country, making it prosperous and safe.",
        "speaker": "Co-workers A",
        "raw_prediction": "Those were some challenging times, but I appreciate the reminder of the positive impact I was able to make.",
        "previous_summary": "Co-worker A has been getting written up for being late to work.\nCo-worker B is concerned about Co-worker A's punctuality and drinking habits.\nCo-worker A is trying to improve their punctuality and cut back on drinking.\nCo-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\nBoth co-workers show a supportive and caring attitude towards each other.\nCo-worker A was a leader in their country, making it prosperous and safe.\nCo-worker A believes their success as a leader was due to determination and strength of character.\nCo-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable.\nCo-worker A has been successful in not being late to work for weeks.\nCo-worker A recently moved to a new duplex with two floors, having their bedroom on the first floor and another room on the second floor.\nCo-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\nCo-worker A enjoys the extra space in their new place and appreciates the separation between living and sleeping areas for privacy.\nCo-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\nCo-worker A went through a painful breakup and finds it hard to trust people.\nCo-worker B is supportive and encourages Co-worker A to give people a chance.\nCo-worker A is open to taking things slow and potentially finding a special person.\nCo-worker A and their ex have both moved on from the breakup."
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?",
        "memory_text": "- Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go. Neighbor A and Neighbor B enjoy playing together with toys. Neighbor B is familiar with Neighbor A's dog and looking forward to playing with it again. Neighbor A appreciated the support and friendship of Neighbor B.\n- Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience. Neighbor A looks forward to playing with Neighbor B again when feeling better. Neighbor A recently moved to London from their current location. Neighbor A moved to London in the past and had to learn how to manage stress.\n- Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go. Neighbor A and Neighbor B enjoy playing together with toys. Neighbor A appreciated the support and friendship of Neighbor B.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've thought about it, but with my recent move to London and focusing on my health, it's been on the back burner.",
        "previous_summary": "Neighbor A has been dealing with back pain for a few months but sought help from a chiropractor, avoiding surgery.\nNeighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience.\nNeighbor A found the chiropractor through a friend's recommendation and found the treatments to be relaxing.\nNeighbor B is experiencing neck pain and considering trying chiropractic care as a natural alternative to medication.\nNeighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.\nNeighbors A and Neighbors B enjoy playing together with toys.\nNeighbors A mentions having back pain and needing a break.\nNeighbors A has visited a chiropractor recently for their back pain.\nNeighbors B expresses concern for Neighbors A's back pain.\nNeighbors A plans to go back to the chiropractor for another session.\nNeighbors A looks forward to playing with Neighbors B again when feeling better.\nNeighbors A recently moved to London from their current location.\nNeighbors A packed up their belongings and moved into a small apartment in London.\nNeighbors A is enjoying the different culture and exploring the city.\nNeighbors A has already visited major tourist attractions like Big Ben and the London Eye.\nNeighbors A found some of their dog's toys while packing, indicating they have a golden retriever.\nNeighbors B is familiar with Neighbors A's dog and looking forward to playing with it again.\nNeighbors A burned the roast and felt angry and out of control.\nNeighbors B suggested trying anger management techniques like deep breathing or meditation.\nNeighbors A moved to London in the past and had to learn how to manage stress.\nNeighbors A appreciated the support and friendship of Neighbors B."
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.",
        "memory_text": "Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A. This experience taught Co-worker A the importance of being efficient and proactive.",
        "speaker": "Co-workers A",
        "raw_prediction": "It's been a journey, but I'm grateful for the lessons learned along the way.",
        "previous_summary": "Co-worker A gave Co-worker B a pen as a thoughtful gesture.\nCo-worker B finished a project and sent it to the manager for review.\nCo-worker A believes the project will be approved with flying colors.\nCo-worker B appreciates the pen and thanks Co-worker A for the gesture.\nCo-worker A took over the family business and made changes to adapt to modern times.\nCo-worker A's father was hesitant to hand over the business but now trusts Co-worker A.\nCo-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.\nBoth Co-worker A and Co-worker B value trust in their personal and professional relationships.\nCo-worker A has a family business that has been doing well recently.\nCo-worker A made changes to modernize processes and invest in new technology for the business.\nCo-worker B acknowledges the importance of finding a balance between work and relaxation.\nBoth co-workers enjoy relaxing and taking breaks from work to appreciate the beauty around them.\nCo-worker A fell down a flight of stairs and injured their leg.\nCo-worker B offered to help by getting crutches for Co-worker A.\nCo-worker A took over their family's business a few years ago and it has improved since then.\nCo-worker A gave Co-worker B a pen that they still use.\nCo-worker A is frustrated that they can't walk properly due to their leg injury.\nCo-worker A wishes they could be outside on the balcony enjoying the weather and music.\nCo-worker B suggested that Co-worker A should see a doctor for their leg injury."
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?",
        "memory_text": "1. The Coach and Athlete discuss the importance of maintaining focus and making small dietary changes to enhance performance.\n2. The Coach motivates the Athlete to continue their nutrition and training efforts, recognizing their progress and commitment.\n3. The Coach talks to the Athlete about the benefits of bean sprouts and the significance of a well-rounded diet for athletic performance.",
        "speaker": "Athlete",
        "raw_prediction": "I've been trying to incorporate more bean sprouts into my meals, and I've noticed a difference in my energy levels during training sessions.",
        "previous_summary": "The Athlete is experiencing taste issues with their gum.\nThe Coach is giving advice to the Athlete regarding their performance and focus.\nThe Athlete usually likes the flavor of the gum but is finding it distracting in this instance.\nThe Coach emphasizes the importance of not letting distractions affect the Athlete's focus during the game.\nThe Athlete decides to tough it out and stay focused on the game.\nThe Coach reminds the Athlete that little distractions can add up and impact performance.\nThe athlete is concerned about nutrition and improving their diet.\nThe coach provides information about the benefits of bean sprouts and the importance of a balanced diet for athletes.\nThe athlete has started adding bean sprouts to their salads and sandwiches and has noticed an improvement in how they feel.\nThe coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\nThe coach encourages the athlete to continue their good work with nutrition and training.\nThe Athlete is focused on improving their performance and energy levels.\nThe Athlete seeks approval and praise from the Coach.\nThe Coach encourages the Athlete to keep up the good work and acknowledges their achievements.\nThe Athlete has been taking on more responsibilities and has gained respect from other players.\nThe Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches.\nThe Coach has noticed the Athlete's improvement and dedication to improving skills.\nThe Athlete has incorporated bean sprouts into their diet to improve health, leading to increased energy and faster recovery.\nBoth the Athlete and Coach emphasize the importance of small changes in diet impacting performance."
    },
    {
        "utter_id": "e30-s5-t4",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument. This experience has led to Co-worker A presenting evidence in front of a judge to support their position in the past, where they denied that their reputation had any impact on Karen giving them the money.\n   \n2. Co-worker A plans to present the evidence clearly and persuasively in court, which has already changed to Co-worker A having presented evidence in front of a judge to support their position in the past. In that instance, Co-worker A denied that their reputation had any impact on Karen giving them the money.\n   \n3. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument. This has led Co-worker B to commend Co-worker A for having the courage to stand up and defend their beliefs, resulting in Co-worker A being willing to take on the project of building a deck for Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate that, thank you. It's important to present information clearly and convincingly, especially in a courtroom setting.",
        "previous_summary": "Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\nCo-worker B is supportive and interested in the evidence collected by Co-worker A.\nCo-worker A's evidence includes statistics and personal accounts from clients.\nCo-worker A believes their evidence is more compelling than the opposing side's evidence.\nCo-worker A plans to present the evidence clearly and persuasively in court.\nCo-worker A appreciates the support and hard work put into the case.\nCo-worker A tends to defend themselves physically when feeling attacked.\nCo-worker B believes that physical altercations are not the answer to conflicts.\nCo-worker A is perceived as dangerous by others due to their behavior in conflicts.\nCo-worker A has presented evidence in front of a judge to support their position in the past.\nCo-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\nCo-worker A convinced Karen to give them money for car repairs.\nThe car has been in the shop for a week.\nCo-worker A has a reputation for looking for fights.\nCo-worker B mentions that Co-worker A's reputation may have influenced Karen's hesitation to give them money.\nCo-worker A denies that their reputation had any impact on Karen giving them the money.\nCo-worker A agrees to be more conscious of how they come across to others in the future.\nCo-worker A is a skilled builder who recently completed building a house for Co-worker B.\nCo-worker B is happy with the house built by Co-worker A and is considering adding a deck to the house.\nCo-worker A is willing to take on the project of building a deck for Co-worker B.\nCo-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\nCo-worker A recommends a landscaping company to Co-worker B based on a positive past experience working with them."
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.\nClassmates B: Definitely. It's the small acts of kindness that can make the biggest impact. Remembers when we talked about how I made sure the mix-up won't happen again? That was because I wanted to make a small impact, like you did for your neighbor.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support, leading to Classmates B being supportive and helpful to Classmates A, which then results in Classmates B advising Classmates A to drive safely to avoid accidents.\n2. Classmates A appreciates Classmates B's efforts and support, as well as the support and friendship of Classmates B, where Classmates B was initially worried about Classmates A going out with friends but they value each other's opinions.\n3. Classmates A appreciates Classmates B's efforts and support, which motivates Classmates B to be supportive and helpful to Classmates A, and also leads to Classmates B initially being worried about Classmates A going out with friends but they value each other's opinions.",
        "speaker": "Classmates A",
        "raw_prediction": "I remember that conversation. It's always the little things that count the most. It's great that we can support each other in different ways.",
        "previous_summary": "Classmates B had to apologize for a mix-up due to two people having the same name.\nClassmates B made sure to double-check everything to resolve the issue and prevent it from happening again.\nClassmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\nClassmates A appreciates Classmates B's efforts and support.\nClassmates A is concerned about Classmates B's drinking habits and their impact on their health.\nClassmates B believes they can handle their alcohol consumption and knows their limits.\nClassmates A brings up a previous incident where there was a mix-up due to two people having the same name, emphasizing the importance of avoiding misunderstandings.\nClassmates B acknowledges the concern and agrees to limit their drinking to prevent further issues.\nClassmates A and B started as acquaintances and have developed a strong friendship.\nClassmates A is struggling to make friends and adjust to a new school.\nClassmates B has been supportive and helpful to Classmates A.\nBoth Classmates A and B are looking forward to hanging out outside of school.\nThey have had misunderstandings in the past but have worked through them to become better friends.\nClassmates A appreciates the support and friendship of Classmates B.\nClassmates A and B are making plans to spend time together outside of school.\nClassmates A got a new Ford Mustang car and took it for a test drive on the highway.\nClassmates A saved up for the car despite it being pricey.\nClassmates B advised Classmates A to drive safely to avoid accidents.\nClassmates A and B had a mix-up with names in the past but resolved the issue through communication.\nClassmates B was initially worried about Classmates A going out with friends but they value each other's opinions.\nClassmates A and B value their friendship and feel comfortable talking to each other about anything."
    },
    {
        "utter_id": "e32-s5-t9",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.",
        "memory_text": "The husband's excitement about his long-awaited plans drives him to take action and involve his wife in future plans. The wife expresses her past disappointment when the husband left without her, emphasizing the importance of keeping promises. The husband's dedication to his plans excites him, and both husband and wife are looking forward to their future together.",
        "speaker": "Wife",
        "raw_prediction": "Thank you for apologizing, husband. I appreciate it. Let's focus on the present and enjoy our upcoming getaway together.",
        "previous_summary": "The husband has long-awaited plans and is finally taking action on them.\nThe husband is driven to achieve his dreams and is putting effort into making them a reality.\nThe wife is supportive and proud of her husband for working towards his goals.\nThe husband acknowledges that it has taken him a while to reach this point but is excited about the progress he is making.\nThe wife offers her support and encouragement to the husband in his journey towards achieving his dreams.\nThe husband values the wife's encouragement and positivity in his pursuit of his goals.\nThe wife reassures the husband of her continuous support and belief in him.\nThe husband left without waiting for his wife, breaking a promise to her.\nThe wife was disappointed that the husband didn't wait for her and wanted to be included in his plans.\nThe husband got impatient and excited about his plans, leading him to leave without the wife.\nThe wife supports the husband's goals but wanted to be involved in them.\nThe husband apologized and promised to involve the wife in his plans in the future.\nThey discussed setting specific times for updates on progress and waiting for each other for certain events to avoid similar situations.\nThey also talked about supporting each other's goals and dreams more effectively.\nThe husband saved people from a runaway carriage and believes in taking action in difficult situations.\nThe husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\nThe wife brings up past disappointment when the husband left without her, breaking a promise to wait for her.\nThe husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.\nThe husband and wife enjoy dancing together and have known each other since they first met.\nThe husband is inspired by his wife to take action on his dreams and goals.\nThe wife stopped a runaway carriage, showing her bravery and willingness to protect others.\nBoth the husband and wife are supportive of each other's dreams and aspirations.\nThe husband acknowledges his wife's bravery and selflessness.\nThe wife admires the husband's determination and big heart.\nThe husband and wife are committed to each other and excited about their future together."
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.",
        "memory_text": "1. Classmates A praised Classmates B for their resilience and quick thinking during a scary experience in space.\n2. Classmates B admires Classmates A's attitude and sees it as a good example for others.\n3. Classmate A believes in giving 110% effort in everything they do.",
        "speaker": "Classmates A",
        "raw_prediction": "See, embarrassing moments happen to everyone. It's all about how you handle it. Just like you said, I believe in giving 110% effort in everything we do, even when we make mistakes.",
        "previous_summary": "Classmates A is stranded in space, running out of oxygen and feeling lightheaded.\nClassmates B suggests redirecting the ship towards a nearby planet or moon for help.\nClassmates A successfully lands on a moon but is running out of oxygen and needs to repair the ship to get back home.\nClassmates A and B have been on field trips to other planets or moons before, like Mars.\nClassmates A expresses gratitude for Classmates B's support during the difficult situation.\nClassmate A believes in doing their best at everything to avoid regrets later.\nClassmate B admires Classmate A's attitude and sees it as a good example for others.\nClassmate A feels that pushing themselves to do better helps them improve their skills and learn something new.\nClassmate A showed determination in fixing their spaceship after it was damaged in a meteor shower.\nClassmate A's perseverance in repairing the spaceship reflects their determination to not give up in challenging situations.\nClassmate B acknowledges Classmate A's success in their career due to their determination and refusal to settle for mediocrity.\nClassmate A values striving for excellence, taking pride in their work, and producing high-quality results.\nClassmate B praises Classmate A's attention to detail and work ethic as truly impressive.\nClassmate A is patient and helpful in teaching driving material to Classmate B.\nClassmate A emphasizes the importance of hard work and dedication in improving skills.\nClassmate B struggles with parallel parking but is grateful for Classmate A's patience.\nClassmate A believes in giving 110% effort in everything they do.\nBoth classmates value supporting and uplifting each other in their learning and growth.\nClassmates A found a fossil and is interested in researching it.\nClassmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\nClassmates B also mentioned that Classmates A helped them prepare for a driving test, showing patience and dedication.\nClassmates A helped Classmates B out of friendship and believes in supporting each other.\nClassmates A mentioned that life is full of surprises and anything is possible."
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.\nNeighbors B: Speaking of hard work, have you made any progress at your current job? I remember you were having some trouble with your boss.",
        "memory_text": "1. Neighbors A is taking responsibility for their actions and working on self-improvement, advised by Neighbors B to be more responsible at work.\n2. Neighbors B points out that Neighbors A's work attitude and behavior might be causing issues with their boss, leading Neighbors A to change and strive to be a better colleague.\n3. Neighbors B wishes for Neighbors A's success and stresses the significance of respect and effort at work, showcasing their supportive and friendly relationship.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, things have been going much better at work lately. I've been putting in more effort and my boss has noticed the positive changes. I'm hoping to continue improving and show that I'm a valuable member of the team.",
        "previous_summary": "Neighbors A is at risk of losing their job due to conflicts with colleagues.\nNeighbors B suggests that Neighbors A's attitude and behavior at work may be the reason for their boss wanting to fire them.\nNeighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.\nNeighbors B points out that it might be too late to change their boss's decision and emphasizes the importance of learning from mistakes.\nNeighbors A agrees to take responsibility for their actions and work on improving themselves.\nNeighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\nNeighbors A used to sneak out of their house at night to explore the city when they were younger.\nNeighbors B is familiar with a story about a girl who also used to sneak out of her house.\nNeighbors A was rebellious in their youth but never got caught by their parents.\nNeighbors A had some close calls while sneaking out, like almost getting caught by the neighbor's dog.\nNeighbors A mentioned wishing they had followed the rules more, particularly at work.\nNeighbors A is having issues at work, such as not pulling their weight and being rude to colleagues.\nNeighbors B advised Neighbors A to change their behavior at work and be a responsible adult.\nNeighbors A is trying to improve their behavior at work and be a better colleague.\nNeighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\nNeighbors A used to be rebellious and break rules, but they have learned from their past actions.\nNeighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\nNeighbors A noticed that Neighbors B's dog has been missing for a few days.\nNeighbors B just got back in town and was unaware of the dog's disappearance.\nNeighbors A suggested the possibility of dog-napping in the area.\nNeighbors B expressed distress at the thought of someone taking their beloved dog.\nNeighbors A reassured Neighbors B that they had nothing to do with the dog's disappearance.\nNeighbors B appreciated Neighbors A's support during this difficult situation."
    },
    {
        "utter_id": "e35-s5-t4",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?",
        "memory_text": "1. [Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.] - (React) - [Co-worker A and Co-worker B have a strong bond and mutual respect for each other's talents.]\n2. [Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.] - (Changed) - [Co-worker A and Co-worker B are optimistic about their creative futures and are considering entrepreneurship.]\n3. [Co-worker A and Co-worker B met on a movie set and are now good friends.] - (React) - [Co-worker A values the friendship and growth they've experienced with Co-worker B.]",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, that was a challenging time, but your encouragement and support helped me get through it. I appreciate that so much.",
        "previous_summary": "Co-worker A and Co-worker B met on a movie set and are now good friends.\nCo-worker A was initially intimidated by Co-worker B due to their talent as a director.\nCo-worker B was nervous about working with Co-worker A because of their talent as an actor.\nBoth Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\nThey both believe that their teamwork made the movie a success.\nCo-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.\nCo-worker A blew up a rabbit with a stick of dynamite out of anger and frustration.\nCo-worker A had a tough week on set, feeling overwhelmed and chaotic.\nCo-worker B expressed disapproval of Co-worker A's actions and suggested talking to the director to address the stressful situation.\nCo-worker A felt remorse for what they did and appreciated Co-worker B's understanding.\nCo-worker B emphasized the importance of learning from mistakes and working together as a team.\nCo-worker A has a fear of spiders since childhood and had a recent embarrassing incident related to it.\nCo-worker B acknowledges that some people have fears and suggests finding healthy ways to deal with frustrations.\nCo-worker A mentions a past event involving blowing up a rabbit with dynamite, indicating a history of poor coping mechanisms for frustration.\nCo-worker B encourages Co-worker A to try relaxation techniques or find a hobby to de-stress and overcome fears.\nCo-worker A is creative and talented in making jewelry.\nCo-worker B and Co-worker A met on a movie set where Co-worker A was focused on acting.\nCo-worker A has a past incident involving dynamite and a rabbit that still angers them.\nCo-worker A has grown as a person and as an artist, learning about empathy and compassion.\nCo-worker A had a childhood experience of freaking out over a spider.\nCo-worker A has overcome fears and anxieties to create beautiful earrings.\nCo-worker A is grateful for life experiences and is open to new possibilities in the future."
    },
    {
        "utter_id": "e36-s5-t11",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?",
        "memory_text": "1. Mentee is embracing the idea of teaching religion seriously and aims to positively impact people's lives, inspired by Mentor's advice.\n2. Mentor, having a desire to break free from the oppressive cult rules, supports Mentee in approaching teaching religion with openness and compassion, as they both seek to make a difference.\n3. Mentor, advocating for the importance of spiritual teachings in fostering connections and values, became a mentor to assist others in similar situations.",
        "speaker": "Mentor",
        "raw_prediction": "I come from a diverse background, which has allowed me to appreciate different cultures and traditions. It's been enriching to learn from various perspectives and experiences.",
        "previous_summary": "Mentee is feeling sleepy and struggling to get enough sleep due to staying up late watching TV or using social media.\nMentor advises Mentee to listen to their body, set a bedtime, and create a relaxing routine before sleep.\nMentor emphasizes the importance of getting enough sleep for physical and mental well-being.\nMentee agrees to try the advice and express gratitude towards Mentor.\nMentee is currently living in an abusive and controlling cult.\nMentor also wants to escape the oppressive rules of the cult.\nMentee has found a shelter for people who have been in abusive cults and is planning to escape there.\nMentor advises caution and careful planning to avoid raising suspicion from the cult.\nBoth Mentee and Mentor agree to pack their things and get ready to leave without letting anyone know.\nMentor suggests waiting for the right moment to leave to ensure a smooth escape.\nMentee expresses feeling suffocated and eager to leave the cult.\nMentee wants to teach religion to help people find meaning in their lives.\nMentor warns Mentee to be careful not to be preachy or judgmental while teaching religion.\nMentee agrees to teach in a way that allows people to make their own decisions about their beliefs.\nMentee is doing research on different religions and plans to speak with religious leaders for guidance.\nMentor suggests Mentee volunteer at a local church or religious organization to gain experience.\nMentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.\nMentor encourages Mentee to approach teaching religion with an open mind and heart.\nMentor is from Italy and has lived in the United States.\nMentor was born and raised in a restrictive religious community.\nMentor became a mentor to help others going through similar situations.\nMentee has been thinking about helping others who may be in abusive cults.\nMentor and Mentee have discussed escaping an abusive cult in the past.\nMentor believes teaching religion or spiritual beliefs can help people feel connected and live by values.\nMentee wants to make a positive impact in people's lives and is grateful for Mentor's support."
    },
    {
        "utter_id": "e37-s5-t3",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.",
        "memory_text": "- Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop. Neighbors B offered to help Neighbors A with the apology process.\n- Neighbors A's rug keeps curling up at the corners. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes. Both neighbors agreed that apologizing takes strength, not weakness.\n- Neighbors B has a great selection of earrings and is willing to help find the perfect match for the dress.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, that was a big help. It's nice to know we can rely on each other when needed.",
        "previous_summary": "Neighbors A spilled coffee on their shirt after tripping over a rug corner in the living room.\nNeighbors A's rug keeps curling up at the corners.\nNeighbors B suggested using rug grippers and a rug pad to keep the rug in place.\nNeighbors A thanked Neighbors B for the suggestion.\nNeighbors A saw puppies at the pet store and found them adorable, making their heart race and couldn't stop smiling.\nNeighbors A got to hold the puppies and found them cuddly and playful, wishing they could take them all home.\nNeighbors B once saw a litter of kittens at the animal shelter and found it hard to resist taking one home.\nBoth neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\nNeighbors A bought a necklace from Neighbors B's shop and loves it.\nNeighbors A got a necklace with a blue stone that matches well with work clothes.\nNeighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.\nNeighbors A has an upcoming wedding and needs accessories, specifically earrings.\nNeighbors B has a great selection of earrings and is willing to help find the perfect match for the dress.\nNeighbors A has a picture of the dress on their phone and will show it to Neighbors B.\nNeighbors B thinks they have the perfect pair of earrings to complement the dress.\nNeighbors A struggled with apologizing and admitting when they are wrong.\nNeighbors B emphasized the importance of apologizing to show care for the relationship.\nNeighbors A made an insensitive comment to a coworker, leading to the need for an apology.\nNeighbors A is considering writing a letter to apologize to the coworker.\nNeighbors B offered to help Neighbors A with the apology process.\nBoth neighbors agreed that apologizing takes strength, not weakness."
    },
    {
        "utter_id": "e38-s5-t11",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. \nClassmates A: Yeah, I guess it does. It’s just that I’ve been hurt before, and I don’t want to lose you as a friend too.",
        "memory_text": "1. Classmates A offered to provide support and stress-relieving massages to Classmates B, causing Classmates A to want to offer help and support to Classmates B, which made Classmate A recall a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n\n2. Classmates A had doubts about trusting Classmates B due to rumors about their reliability, which led to Classmates A and B being supportive friends who look out for each other during stressful times, and made Classmates B feel relieved to have someone to confide in about the secret.\n\n3. Classmates B assures Classmates A that they will do their part in the group project, prompting Classmates A to tend to overthink things and appreciate Classmates B's support and advice, and leading Classmate B to encourage self-compassion and finding a balance between striving for excellence and being kind to oneself.",
        "speaker": "Classmates B",
        "raw_prediction": "I understand your concerns. Let's take things slow and see where it goes. Our friendship is important to me, and I value our connection.",
        "previous_summary": "Classmates A and B are working on a group project together.\nClassmates A had doubts about trusting Classmates B due to rumors about their reliability.\nClassmates B assures Classmates A that they will do their part in the group project.\nBoth classmates acknowledge the importance of trust in group projects, especially when grades are at stake.\nClassmates A and B are students in the same class.\nClassmates A gave Classmates B a neck rub to help with stress.\nClassmates A offered to provide support and stress-relieving massages to Classmates B.\nClassmates B was stressed out but was able to relax and focus on work after the neck rub.\nClassmates A was worried about a situation but it turned out to be not a big deal.\nClassmates A tends to overthink things and appreciated Classmates B's support and advice.\nClassmates A and B are supportive friends who look out for each other during stressful times.\nClassmates A mentioned a new study group forming for an upcoming exam.\nClassmates A invited Classmates B to join the study group together for extra support and studying.\nClassmates A and B are close and have a level of trust between them.\nClassmates A discovered a secret that Classmates B has been keeping.\nClassmates B feels relieved to have someone to confide in about the secret.\nClassmates A offered help and support to Classmates B.\nClassmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\nClassmates A believes that simple actions can have a significant impact.\nClassmate A is very self-critical and struggles with feeling satisfied with their work.\nClassmate B encourages self-compassion and finding a balance between striving for excellence and being kind to oneself.\nClassmate A values setting high standards and is hesitant to lower them.\nClassmate B emphasizes the importance of making mistakes and learning from them for personal growth.\nClassmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\nBoth classmates believe in striving to be the best version of themselves while also being kind and compassionate towards themselves and others."
    },
    {
        "utter_id": "e39-s5-t6",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?\nNeighbors A: I visited Brazil and Peru. The culture and food were incredible.\nNeighbors B: That sounds awesome. I've always wanted to go to Peru to see Machu Picchu.\nNeighbors A: Yes, Machu Picchu is amazing. The view from the top is breathtaking.\nNeighbors B: Have you thought about where you want to go next?",
        "memory_text": "Neighbors A taught the kid the special move to help them feel better, and Neighbors B agreed to buy candy for the neighborhood kids to spread happiness. Neighbors B then admired Neighbors A's organization skills and expressed a desire to enhance their own organization. In response, Neighbor A showed willingness to take precautions and make smart decisions. \n\nNeighbors A won against a kid in chess by using a special move, which led both Neighbors A and B to believe in the value of doing good deeds to strengthen the community. Neighbor B, concerned about safety, cautioned against connecting with strangers. \n\nBoth Neighbors A and B share a belief in the significance of learning and self-improvement, as well as the importance of performing acts of kindness to foster unity. Neighbor B recommended alternative ways to manage stress and emphasized the importance of Neighbor A's well-being.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm considering visiting Japan next. The culture there is fascinating, and I've always wanted to experience it firsthand.",
        "previous_summary": "Neighbors A won against a kid in chess using a special move.\nNeighbors B suggested teaching the special move to the kid after winning.\nNeighbors A taught the kid the special move and the kid was relieved.\nNeighbors A and B both took a cooking class together last year.\nNeighbors B wants to try making something new in cooking and suggests looking at the cookbook from the class.\nBoth Neighbors A and B believe in the importance of learning and self-improvement.\nNeighbors A mentioned beating a kid at chess with a special move.\nNeighbors B remembers the incident.\nNeighbors A saw George at the store and exchanged waves.\nNeighbors B agrees to buy candy for the neighborhood kids to make them happy.\nNeighbors A and B believe in doing nice things for others to bring the community together.\nNeighbors A is very organized in their room and house and never wastes time searching for things.\nNeighbors B admires Neighbors A's organization skills and wishes to improve their own organization.\nNeighbors B mentions struggling with keeping their room tidy and wasting time looking for things.\nNeighbors A believes that being organized helps in planning ahead, thinking strategically, and winning games like chess.\nNeighbors B agrees that being organized could help them improve in their work and hobbies.\nNeighbor A is feeling frustrated and is considering going to a bar to find someone for a casual encounter.\nNeighbor B expresses concern about the safety of hooking up with strangers and advises caution.\nNeighbor A is open to taking precautions and being smart about their decisions.\nNeighbor B suggests finding other ways to relieve frustration and looking out for Neighbor A's well-being.\nNeighbor A mentions beating a kid at Chess with a special move and finding it worth it for the victory."
    },
    {
        "utter_id": "e40-s5-t9",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.",
        "memory_text": "Classmates A's experience facing tough competition in middle school from a fast girl motivated them to improve, which Classmates B acknowledges by emphasizing the importance of enjoying the journey and effort put in, not just focusing on winning. Both classmates value taking moments to relax and appreciate small things.\n\nClassmates B acknowledges Classmates A's determination and competitiveness, offering support and suggesting that Classmates A get their arm checked out as they had a muscle strain but did not go to the hospital.\n\nClassmates A's motivation to improve from tough competition in middle school was hindered by Classmates B offering support and suggesting they take a step back to find a balance. This support led to Classmates A expressing gratitude for the friendship and support of Classmates B.",
        "speaker": "Classmates B",
        "raw_prediction": "It's important to listen to your body and take care of yourself. It sounds like your determination is really paying off in various aspects of your life. Keep up the good work!",
        "previous_summary": "Classmates A is competitive and recently beat their brother in a race.\nClassmates B acknowledges Classmates A's determination and competitiveness.\nClassmates A faced tough competition in middle school from a fast girl, motivating them to improve.\nClassmates A is always looking to challenge themselves and improve their skills.\nClassmates A and their brother are both competitive and likely to have a rematch.\nClassmates A is struggling with feeling competitive and the need to be the best at everything.\nClassmates B offers support and suggests taking a step back to find a balance.\nClassmates A acknowledges the need to find a balance and accepts the advice given.\nClassmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.\nClassmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\nClassmates A is experiencing sudden pain in their left arm and is considering going to the hospital.\nClassmates B is offering support and suggesting that Classmates A get their arm checked out.\nClassmates A has not experienced similar pains in the past and is feeling worried about the situation.\nClassmates B offers to take Classmates A to the hospital, but Classmates A declines, saying they will manage.\nClassmates A reminisces about a past race with their brother and a conversation with Tyler about a personal issue.\nClassmates B is supportive and emphasizes the importance of having someone to talk to about personal matters.\nClassmates A expresses gratitude for the support and friendship of Classmates B.\nClassmate A and Classmate B are classmates.\nClassmate A had a muscle strain in their arm but did not go to the hospital.\nClassmate A emphasizes the importance of self-care and relaxation.\nClassmate B reminds Classmate A to trust their instincts and know when to seek medical attention.\nBoth classmates value taking moments to relax and appreciate small things."
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.",
        "memory_text": "- Classmates A acknowledges a mistake and plans to learn from it. This shows that Classmate B is a supportive friend who listens and offers to help. As friends who help each other with schoolwork, Classmates A and Classmates B have a strong bond.\n- Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility. This leads to the topic of how Classmates B and Classmates A used to dance a lot in middle school. Classmate A appreciates having friends who are there for them during difficult times, and Classmates B supported Classmates A through a tough time by listening to them.",
        "speaker": "Classmates A",
        "raw_prediction": "Sure! One program I found really helpful is Microsoft Excel for organizing data and creating spreadsheets. It's user-friendly and versatile.",
        "previous_summary": "Classmates A got grounded for a week for kicking a door and causing damage.\nClassmates B emphasizes the consequences of Classmates A's actions and the need for responsibility.\nClassmates A acknowledges the mistake and plans to learn from it.\nClassmates B mentions a past incident where they had to clean up spilled paint, highlighting the importance of learning from mistakes.\nBoth classmates have experienced making mistakes and learning from them.\nClassmates A and Sasha are friends who haven't caught up in a long time.\nClassmates A is interested in dance and asked Sasha for some dance tips.\nClassmates B and Classmates A used to dance a lot in middle school.\nClassmates A once kicked a door in and got grounded for a week because of it.\nClassmates A is considering taking a dance class for fun.\nClassmate A is going through a tough time at home due to their parents fighting.\nClassmate B is a supportive friend who listens and offers to help.\nClassmate A appreciates having friends who are there for them during difficult times.\nClassmate A mentioned going to a club to see Sasha dance, indicating a social aspect to their friendship dynamic.\nClassmates A and Classmates B are friends who help each other with schoolwork.\nClassmates A made a mistake in the past by kicking a door in and getting grounded.\nClassmates A has matured since then and learned from past mistakes.\nClassmates B supported Classmates A through a tough time by listening to them.\nClassmates B went to a club to see Sasha dance and did not get in trouble, showing maturity."
    },
    {
        "utter_id": "e42-s5-t7",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.",
        "memory_text": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions, which leads to Co-worker B moving on from their arrest and appreciating Co-worker A's concern and change in behavior. This reminds Co-worker B of Co-worker A's progress and potential for success. Co-worker A is adjusting to the night shift schedule and excited for a promotion.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic to hear! I'm really happy for you. It's great to see how much progress you've made.",
        "previous_summary": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions.\nCo-worker B has been arrested in the past partly because of Co-worker A's actions.\nCo-worker A feels remorseful about the situation that led to Co-worker B's arrest.\nCo-worker B points out that Co-worker A doesn't always consider how their actions can affect others.\nCo-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else.\nCo-worker A is adjusting to the night shift schedule and excited for a promotion.\nCo-worker B complimented Co-worker A's writing skills and reliability as a journalist.\nCo-workers A and B have worked together on a big story in the past.\nCo-worker A learned the importance of double-checking sources and accuracy from a tough story they covered.\nCo-worker A is managing the night shift by getting enough rest during the day and staying focused.\nCo-worker B mentioned that Co-worker A is responsible in their work, even if not always in other aspects of life.\nCo-worker A takes their job seriously and prioritizes being reliable.\nCo-worker A is nervous about making mistakes in their new position.\nCo-worker A is a journalist who was recently promoted for being reliable.\nCo-worker B reassures Co-worker A that making mistakes is okay as long as they learn from them.\nCo-worker A feels guilty about a past mistake involving Co-worker B's arrest.\nCo-worker B has moved on from their arrest and appreciates Co-worker A's concern and change in behavior.\nBoth Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes.\nCo-worker A is a journalist and a finalist in a singing competition.\nCo-worker B is supportive and encouraging towards Co-worker A.\nCo-worker A has been working hard on their singing skills and has a passion for music.\nCo-worker B reminds Co-worker A of their progress and potential for success.\nCo-worker A expresses nervousness and self-doubt despite their achievements.\nCo-worker B reassures Co-worker A and encourages them to have more confidence.\nCo-worker A appreciates Co-worker B's support and plans to perform in the final round of the competition."
    },
    {
        "utter_id": "e43-s5-t3",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?\nClassmates B: I'm sorry,, but I can't disclose that information. It's not my place to tell.\nClassmates A: But how did you find out? I haven't told anyone.",
        "memory_text": "- Classmates A was nervous about fitting in but saw Classmates B as well-liked and wanted to be friends with them. This made Classmates B open to trying to be more optimistic after the conversation.\n- Classmates B advises Classmates A to be careful and aware while on the bus, which is in the same topic as warning Classmates A about the potential danger of dark alleys.\n- Classmates A emphasizes the importance of resilience and staying positive even when things don't go as planned. This genuine friendship and positive attitude of Classmates A is appreciated by Classmates B, who encourages Classmates A to keep striving towards their goals. Classmates A, in turn, is curious and open to exploring new things and taking risks.\n- Classmates A believes in the power of positivity and its impact on life, which caused Classmates A and B to become friends when Classmates A transferred to the school. This is in the same topic as Classmates A not having trouble on the bus so far.",
        "speaker": "Classmates B",
        "raw_prediction": "I overheard a conversation between some classmates. I didn't mean to eavesdrop, but that's how I found out.",
        "previous_summary": "Classmates A believes in the power of positivity and its impact on life.\nClassmates B is open to trying to be more optimistic after the conversation.\nClassmates A emphasizes the importance of resilience and staying positive even when things don't go as planned.\nClassmates A and B discuss the benefits of a positive mindset in making a difference in the world.\nClassmates A believes that positivity is a fuel to keep one motivated and driven to make a real impact.\nBoth classmates agree that working together with a positive mindset can lead to accomplishing great things.\nClassmates A and B became friends when Classmates A transferred to the school.\nClassmates A was nervous about fitting in but saw Classmates B as well-liked and wanted to be friends with them.\nClassmates A values optimism and believes in the law of attraction.\nClassmates B appreciates the genuine friendship and positive attitude of Classmates A.\nBoth classmates believe in the power of positivity and working together to make a difference in the world.\nClassmates A doesn't have their own car yet and takes the bus.\nClassmates B usually drives their car to school.\nClassmates A finds taking the bus convenient.\nClassmates A hasn't had trouble on the bus so far.\nClassmates B advises Classmates A to be careful and aware while on the bus.\nClassmates A still believes they can make a difference in the world one day at a time.\nClassmates B encourages Classmates A to keep striving towards their goals.\nClassmates A encountered a mysterious woman in a dark alley, finding her intriguing.\nClassmates B warns Classmates A about the potential danger of dark alleys.\nClassmates A is curious and open to exploring new things and taking risks.\nClassmates A believes the mysterious woman might have a message to help make a positive change in the world."
    },
    {
        "utter_id": "e44-s5-t8",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.\nNeighbors B: How about we go for a walk and you can talk to me about everything that's been on your mind?",
        "memory_text": "Neighbor A recently moved to a new neighborhood and feels safer and happier there. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\nNeighbor A and Neighbor B are neighbors who catch up outside of their neighborhood. Neighbors A and Neighbors B like to grab a bite to eat together after their activities. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\nNeighbor A has a bit of a drive to get to the park where they are meeting with Neighbor B. Neighbors A and Neighbors B enjoy going for walks together, especially to the park. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a good idea. A walk in the park and a chat would be nice right now.",
        "previous_summary": "Neighbors A recently moved into the neighborhood and wanted to live in a nicer area.\nNeighbors B mentions that the neighborhood is more affluent compared to others in the area.\nNeighbors A was tired of living in a run-down apartment complex and wanted to improve their quality of life.\nNeighbors B asks about a mechanic, indicating that they have had previous conversations about this topic.\nNeighbors A found a reliable mechanic in the area and appreciated the recommendation.\nNeighbor A recently moved to a new neighborhood and feels safer and happier there.\nNeighbor A's old apartment building was not the best place to live in.\nNeighbor A has a bit of a drive to get to the park where they are meeting with Neighbor B.\nNeighbor B enjoys taking walks in the park after work to clear their mind.\nNeighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.\nNeighbor A suggested going to the park instead of grabbing coffee.\nNeighbor B is familiar with the park and goes there often for walks.\nNeighbors A and Neighbors B are planning to play video games together later.\nNeighbors A has Fortnite and FIFA 21 video games.\nNeighbors B is up for playing either Fortnite or FIFA, but prefers to start with FIFA.\nNeighbors A and Neighbors B enjoy going for walks together, especially to the park.\nThey have previously gone for walks instead of coffee and enjoyed it.\nNeighbors A and Neighbors B like to grab a bite to eat together after their activities.\nThey are planning to meet in an hour to play video games.\nNeighbor A is grieving the recent loss of their grandmother.\nNeighbor B is offering support and companionship to Neighbor A during their difficult time.\nNeighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\nNeighbor A finds solace in nature and believes that it helps in coping with their emotions.\nNeighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief."
    },
    {
        "utter_id": "e45-s5-t5",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?",
        "memory_text": "- Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal.\n- Classmates A started working at the grocery store last week and is enjoying the experience, learning about running a store.\n- Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\n- Classmates A believes in hard work and dedication to achieve goals both in basketball and their job.\n- Both classmates have a positive attitude towards each other and their respective goals.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, I remember. It's a tough journey, but you always said you believe in hard work and dedication to reach your goals.",
        "previous_summary": "Classmate A is nervous about an upcoming presentation and has been practicing a lot.\nClassmate B offers support and suggests practicing in front of friends or family for feedback.\nClassmate A has tried practicing in front of others but still feels nervous.\nClassmate B advises Classmate A to take deep breaths, stay confident, and focus on delivery.\nClassmate A acknowledges the advice and agrees to stay confident and focus on delivery.\nClassmate B emphasizes the importance of practice for improving comfort during presentations.\nClassmate A appreciates the support and understanding from Classmate B.\nClassmate B reassures Classmate A that they are all in it together and offers help if needed.\nClassmates A has a big dream of becoming a professional basketball player and works hard towards that goal.\nClassmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\nClassmates A practices basketball every day, both individually and with their team, and also does weight training to build strength.\nClassmates A sometimes doubts if they are good enough to make it to the professional level.\nClassmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\nClassmates A decided to work at the local grocery store for its proximity to home, flexible hours, and networking opportunities.\nClassmates A started working at the grocery store last week and is enjoying the experience, learning about running a store.\nClassmates A balances their job with basketball practice by scheduling shifts around practice time and requesting time off for games or tournaments.\nClassmates A believes in hard work and dedication to achieve goals both in basketball and their job.\nClassmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\nClassmate B brought goods to Classmate A's house and is supportive of their basketball dream.\nBoth classmates have a positive attitude towards each other and their respective goals."
    },
    {
        "utter_id": "e46-s5-t4",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?",
        "memory_text": "- [Classmates A and B found a perfect camping spot with a great view and level ground, free of debris, ensuring a comfortable night's sleep.]\n- [Classmate A's active involvement in the community inspires them to seek fun and impactful activities, leading to a decision to prioritize self-care in the future.]\n- [Classmate B admires Classmate A's community engagement and stresses the importance of allergy awareness, preparedness, and prevention.]",
        "speaker": "Classmates A",
        "raw_prediction": "I stumbled upon it while exploring the area earlier today. Just got lucky, I guess!",
        "previous_summary": "Classmates A is actively involved in an action committee focused on improving the community and creating positive change.\nClassmates A's committee is currently working on promoting environmental sustainability and advocating for increased public transportation options.\nClassmates B finds Classmates A's involvement in the community admirable and important.\nClassmates A's committee has had success in getting the local government to invest more in public transportation.\nBoth Classmates A and B believe in the importance of getting involved in the community to push for change and inspire others.\nClassmates A hopes to encourage others to get involved and create a ripple effect for positive change.\nClassmate A and Classmate B are classmates who attended a party together.\nClassmate A is concerned about the party being discovered and getting in trouble with the school.\nClassmate B agrees to keep the party a secret in exchange for Classmate A doing their homework for a week.\nClassmate B is involved in an action committee working on organizing a community clean-up day.\nClassmate A expresses a desire to find alternative ways to have fun and make a positive impact in the community.\nClassmates A is proactive and curious, taking the initiative to research topics of interest.\nClassmates A was part of an action committee in high school to improve the community.\nClassmates A is passionate about making a difference and believes in educating oneself and taking action for a better future.\nClassmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference.\nThe conversation revolves around the impact of plastic on the environment and the importance of taking action to address the issue.\nClassmate A is experiencing an allergic reaction with symptoms of itchy skin and a tight throat.\nClassmate B suggests that Classmate A should go see the nurse immediately and take antihistamines if available.\nClassmate B previously discussed allergies with Classmate A a few years ago.\nClassmate A realizes that their current allergic reaction could be related to the previous discussion on allergies.\nClassmate B emphasizes the importance of being cautious with allergies, carrying necessary medication, and taking precautions to prevent severe reactions.\nClassmate A agrees to take better care of themselves in the future."
    },
    {
        "utter_id": "e47-s5-t13",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?",
        "memory_text": "- Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n- Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams. Classmates A bought a sleek and red Mustang GT car, which Classmates B recently bought a red sports car and finds driving it to be fun and freeing.\n- Classmates A plays the guitar, takes lessons, and plays in a band, and has been dreaming of owning a Mustang GT since childhood.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't thought about it yet, but it's something I'd love to explore in the future. Thanks for the suggestion!",
        "previous_summary": "Classmates A and B are discussing beverage choices, with A considering between Coke and Sprite.\nClassmate B suggests Sprite Zero as a less sweet alternative to regular Sprite.\nClassmates A and B are both keeping up with the homework in their math class.\nThey both find the workload manageable and appreciate the gradual introduction of more difficult topics.\nThey are pleased with their teacher's understanding of their adjustment to the new school year.\nClassmates A plays the guitar, takes lessons, and plays in a band.\nClassmates B is interested in learning to play an instrument.\nClassmates A started playing the guitar because of a love for music and is working on their first album.\nClassmates A's band mostly plays at local bars and coffee shops.\nClassmates A's band is trying to build up their fan base and play at bigger venues.\nClassmates A finds pursuing music rewarding and is passionate about it.\nClassmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\nClassmates A bought a sleek and red Mustang GT car.\nClassmates A has been dreaming of owning a Mustang GT since childhood.\nClassmates B is working on a new original song on the guitar.\nClassmates A and B enjoy jamming together and plan to collaborate on music in the future.\nClassmates A plans to showcase their new car by driving it around town and to gigs.\nClassmates A and B plan to celebrate the new car with a drink.\nClassmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\nClassmates A is in a band and working on their first album.\nClassmates B recently bought a red sports car and finds driving it to be fun and freeing.\nClassmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences."
    },
    {
        "utter_id": "e48-s5-t10",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? ",
        "memory_text": "Neighbor A built a new house for Neighbor B with three bedrooms, two bathrooms, and a big backyard. This act of kindness helped Neighbor B in creating a new house with amazing features. Neighbor B expressed their appreciation by reminding Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them. This made Neighbor A feel motivated to believe that plants need sunlight, water, and love to thrive. \n\nNeighbor A, who enjoys building houses and finishing them quickly, also possesses skills in manipulation and getting what they want. \n\nNeighbor B, excited about the new project, is looking forward to seeing the finished house. Building the new house was challenging but rewarding for Neighbor A.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's coming along slowly, but I'm making progress. Thanks for asking!",
        "previous_summary": "Neighbor A is building a new house for Neighbor B with three bedrooms, two bathrooms, and a big backyard.\nNeighbor A enjoys building houses and finishing them quickly.\nNeighbor B is grateful and surprised by the generous offer from Neighbor A.\nNeighbor A started construction on the house last week and plans to finish it in record time.\nNeighbor B is looking forward to seeing the finished house and is excited about the new project.\nNeighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\nNeighbor B has not been up to anything interesting lately but is excited about the new house and looking forward to it.\nNeighbors A helped Neighbors B build a new house with amazing features.\nNeighbors A values their friendship with Neighbors B, describing them as a great neighbor.\nNeighbors A had help from friends in building the new house.\nNeighbors B is grateful for the help and quick completion of the new home.\nNeighbors B is enjoying the sunset from their new backyard, expressing gratitude towards Neighbors A.\nNeighbor A is considering a career as a con-artist, believing they are good at manipulating people.\nNeighbor B is against Neighbor A's idea, emphasizing the ethical and legal implications.\nNeighbor A believes they can make a lot of money without hurting anyone and plans to cover their tracks carefully.\nNeighbor A has skills in manipulation and getting what they want.\nNeighbor B reminds Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them.\nNeighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\nNeighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\nNeighbors A enjoys taking care of flowers and finds it calming.\nNeighbors B admires Neighbors A's gardening skills and wishes to have a green thumb.\nNeighbors A believes that plants need sunlight, water, and love to thrive.\nNeighbors B received a new house built by Neighbors A and is grateful for the extra space.\nNeighbors A found building the new house challenging but rewarding.\nBoth neighbors appreciate nature and the beauty of sunsets.\nNeighbors A and B value gratitude and being alive to witness incredible moments."
    },
    {
        "utter_id": "e49-s5-t8",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.\nWife: Maybe it's time to take a step back and try something new. Have you ever tried writing in a different genre or experimenting with different styles?\nHusband: That's a good idea. I guess I just haven't had the courage to step out of my comfort zone.\nWife: Remember when you faced your fear of public speaking during your fifth-grade presentation? You can do this too. Sometimes, the biggest breakthroughs come from taking risks.",
        "memory_text": "The wife is knowledgeable about movies and is willing to share her passion with the husband. Both the husband and wife express a desire for happiness and understanding in the situation. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is. \n\nThe husband is open to learning more about movies, showing a willingness to try again. Both the husband and wife express a desire for happiness and understanding in the situation. Wife suggests that husband should try using more modern language to be better understood. The husband gave a fifth-grade presentation in the past.\n\nThe husband is open to learning more about movies, showing a willingness to try again. Both the husband and wife express a desire for happiness and understanding in the situation. Husband agrees to try adapting to modern language for better communication with his wife. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.",
        "speaker": "Husband",
        "raw_prediction": "You're right. I need to channel that same courage into my writing. I'll give it a shot and see where it takes me. Thanks for the reminder.",
        "previous_summary": "The husband fell asleep during the wife's movie, showing a lack of interest or attention.\nThe wife is knowledgeable about movies and is willing to share her passion with the husband.\nThe husband is open to learning more about movies, showing a willingness to try again.\nThe husband and wife plan to have a movie night together in the future.\nThe husband has found a partner named Sarah and wants to marry her, despite still being married to his current wife.\nThe wife is surprised and upset by the husband's news and feels betrayed.\nThe husband acknowledges that it may be difficult for the wife but wants to be honest about his feelings for Sarah.\nThe wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\nThe husband claims to have a real connection with Sarah and wants to find a way to move forward while still considering his current marriage.\nThe wife is unsure about moving forward with the husband and Sarah and needs time to think about it.\nBoth the husband and wife express a desire for happiness and understanding in the situation.\nHusband uses old-fashioned language like \"thou\" and \"thee\" due to how he was taught to speak.\nWife suggests that husband should try using more modern language to be better understood.\nWife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.\nHusband admits caring for Sarah deeply but realizing his mistake and that his heart belongs to his wife.\nHusband agrees to try adapting to modern language for better communication with his wife.\nThe husband gave a fifth-grade presentation in the past.\nThe wife remembers the husband being nervous before the presentation.\nThe husband felt like he was being judged and humiliated during the presentation.\nThe husband talks differently than most people, using words like \"thou\" and \"thee.\"\nThe wife reassures the husband that it's okay to be different and encourages him to embrace who he is."
    }
]