[
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?",
        "memory_text": "- The Parent found hope and appreciated small moments even in difficult situations, which causes them to mention making mistakes in the past and trying to turn their life around.\n- The Parent and Child plan to watch the sunrise together in the future, and the parent suggests repeating the sunrise-watching tradition on a future weekend.\n- The Child finds the Parent's story inspiring and is supportive and proud of their parent for making changes, offering help and reassurance if needed.",
        "speaker": "Parent",
        "raw_prediction": "I did feel that way at times, but I learned the importance of listening and being heard through those tough experiences. It's something I try to remember every day."
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.",
        "memory_text": "1. The Mentor has been guiding and supporting the Mentee in their work for years, resulting in the Mentee expressing gratitude for the Mentor's guidance and support throughout the decision-making process. This has led to the Mentee feeling overwhelmed with the college application process, similar to how they took shoes from the store without paying because they couldn't afford them.\n\n2. The Mentor has been guiding and supporting the Mentee in their work for years, which prompted the Mentor to reassure the Mentee that many students feel the same way and that everyone works at their own pace. \n\n3. The Mentor has been guiding and supporting the Mentee in their work for years, ultimately causing the Mentee to be offered a job and decide to take the job in the city.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way when you're in a new place. Building a new support system takes time, but you'll find your rhythm. Just remember, you're not alone in this transition."
    },
    {
        "utter_id": "e2-s5-t13",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.",
        "memory_text": "Neighbors A and B, who have known each other for years, enjoy spending time together and want to get to know each other even better. They reminisce about past events and plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. Both neighbors enjoy spending time outside and doing chores like mowing the lawn. Additionally, Neighbor A particularly enjoys spending time in Neighbor B's cozy home and wants to hang out more often.",
        "speaker": "Neighbors B",
        "raw_prediction": "I feel the same way. It's nice to have a good friend nearby."
    },
    {
        "utter_id": "e3-s5-t5",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.",
        "memory_text": "Co-worker B showed a willingness to assist others by helping a customer resolve an issue last week. This demonstrates Co-worker B's supportive nature and readiness to help in any way. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it, similar to when they spoke with the police about an incident where the women involved were thankful. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time. \nCo-worker B commended Co-worker A for their bravery and willingness to help, leading Co-worker A to try to stay positive and focus on their recovery despite it being a daunting task. Co-worker B admires Co-worker A's resilience and positivity, describing them as someone who can stay optimistic even in challenging situations, such as the accident where they lost their hands and feet.",
        "speaker": "Co-workers B",
        "raw_prediction": "I understand that you were struggling with your feelings, but it's important to always consider how your actions might impact others. It's essential to respect boundaries and choices, even when it's difficult."
    },
    {
        "utter_id": "e4-s5-t8",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.",
        "memory_text": "Co-worker A has been feeling off lately, but is grateful to Co-worker B for letting them borrow the horse and is having a great time riding her. This has motivated Co-worker A about the future and they are excited to work with Co-worker B. Co-worker B, who offered help and support to Co-worker A, is glad the trade worked out well for both of them. Additionally, Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership. Both co-workers believe they have the potential to create something great together.",
        "speaker": "Co-workers A",
        "raw_prediction": "I remember that conversation! I'm thrilled that you're still on board with the idea. I think we can really make something amazing happen together."
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.",
        "memory_text": "Classmates A, who is passionate about science and interested in becoming a doctor or researcher to help people, has developed a crush on Classmates B, finding their interest in taking biology classes in college flattering. Classmates A is considering taking biology classes in college to learn more about how the body works. \nClassmates A finds it refreshing to talk to someone genuinely interested in science and learning, expressing admiration for Classmates B's intelligence and sense of humor. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.",
        "speaker": "Classmates A",
        "raw_prediction": "I just can't believe you would betray me like this. It's really disappointing."
    },
    {
        "utter_id": "e6-s5-t14",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning. \nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B are discussing the idea of having telekinetic abilities. Neighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've been feeling a bit overwhelmed with work lately, but I'm trying to stay positive. How about you, how's everything going on your end?"
    },
    {
        "utter_id": "e7-s5-t14",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.\nClassmates B: That's great to hear. And what about your past struggles with school and friendships? Do you feel like you've moved on from that?",
        "memory_text": "Classmates B admires Classmates A's outgoing nature and expresses a desire to be more like them. \nClassmates B appreciates Classmates A's gesture of buying coffee and responds positively to it. \nClassmates A agrees to try the suggestion and expresses gratitude towards Classmates B. \nClassmates B encourages Classmates A to work through their feelings and take steps towards a better future. \nClassmates A encourages Classmates B to initiate conversations and be friendly to make new friends. \nBoth Classmates A and B enjoy socializing and going out to parties together.",
        "speaker": "Classmates A",
        "raw_prediction": "I have definitely made progress in those areas too. I've been focusing on building new connections and embracing new opportunities."
    },
    {
        "utter_id": "e8-s5-t6",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.\nNeighbors B: It's always important to own up to our mistakes. It's like when you forgot your backpack in high school and had to deal with the consequences.",
        "memory_text": "1. Neighbors A and B discussed the importance of caring for trees and the environment for future generations, which led to Neighbor B accepting Neighbor A's apology and expressing how hurtful the previous treatment was. This prompted Neighbor A to apologize and acknowledge their wrongdoing.\n   \n2. Neighbors A and B talked about the significance of preserving trees and the environment for the future, prompting Neighbor A to apologize to Neighbor B and show willingness to make things right. In response, Neighbor B reminded Neighbor A about the importance of taking responsibility for past mistakes and learning from them, which led to Neighbor A apologizing and admitting fault.\n\n3. Neighbors A and B recognized the value of using fallen trees for firewood or other purposes, which led to Neighbor A apologizing to Neighbor B and expressing a desire to mend their relationship. This apology caused Neighbors A and B to address their issues and maintain a friendly bond.",
        "speaker": "Neighbors A",
        "raw_prediction": "I remember that! It's so crucial to learn from our mistakes and be accountable for our actions. It's like how we should always strive to be better each day."
    },
    {
        "utter_id": "e9-s5-t2",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?",
        "memory_text": "- Classmates B is supportive and encourages Classmates A in their business venture. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans. Classmate A has always loved singing but never thought it was possible until now.\n- Classmates A appreciates the President's difficult decisions and actions to improve the country's situation. Classmates A is willing to work hard and learn the necessary strategies for business success. Classmate A wants to pursue a dream of becoming a singer.",
        "speaker": "Classmates A",
        "raw_prediction": "I actually started learning carpentry from my grandfather when I was young. He was a skilled craftsman and inspired me to pursue it as a career."
    },
    {
        "utter_id": "e10-s5-t14",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.\nCo-workers A: Of course I remember! I'm happy we're friends again.\nCo-workers B: Me too. And do you still have that baby doll and rattle you bought a couple of years ago?\nCo-workers A: Yes, actually! I gave them to my niece and she loves them.\nCo-workers B: That's awesome. And I still remember when you scratched my neck and helped me relax. Sometimes I still need that kind of release.",
        "memory_text": "Co-worker A's competence is recognized and appreciated in the workplace, contributing positively to the team dynamic. Both Co-worker A and Co-worker B emphasize the importance of effective communication and mutual understanding in their relationship. Co-worker A and Co-worker B cherish moments of connection, finding them essential for a more enjoyable work environment.   \nCo-worker A's gesture of returning Co-worker B's watch repaired their friendship, highlighting the significance of small acts of kindness. Co-worker A's thoughtful gift of a baby doll and rattle to their friend expecting a child showcases their caring nature. Co-worker A's decision to buy a baby doll and rattle for a friend's child despite not planning to have kids soon reflects their generous spirit.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad I could help you relax. It's important to take care of each other's well-being in the office."
    },
    {
        "utter_id": "e11-s5-t13",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.\nNeighbors A: Oh, gosh. That was so long ago. I can't even believe I had that kind of power over you.\nNeighbors B: I'm just glad we've both grown since then, and we can have a friendship that's based on mutual respect.\nNeighbors A: Absolutely. And now, I'm excited to explore my new neighborhood and get to know the people here. It feels like a fresh start.",
        "memory_text": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there, feeling comfortable and safe, and has made good friends, including Neighbors B. This has led to Neighbors A being excited to explore the neighborhood, make new friends, and have a fresh start. \nNeighbors B used to obey Neighbors A's commands, but they have both grown since then and now have a friendship based on mutual respect.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's always exciting to have a fresh start and meet new people. I'm sure you'll make just as many great memories in your new neighborhood as you did here."
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.",
        "memory_text": "- Classmates A had a moment of frustration in the past but has learned to channel that energy into studies, which caused them to show up to school in pajamas due to oversleeping after studying late.\n- Classmates A met the girl of their dreams at a party and have been texting her nonstop, which made them take off their belt and dislike wearing it all day.\n- Classmates A is dedicated to studying hard and taking extra classes to get into a good college, wanting to work hard to achieve their dreams, and not being afraid to be themselves and embracing their quirks, which their girlfriend appreciates.",
        "speaker": "Classmates B",
        "raw_prediction": "Oh, really? That's great to hear. How did you two meet at the party?"
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.",
        "memory_text": "Mentor's encouragement and support have played a significant role in Mentee's journey to sobriety, for which Mentee expresses gratitude and credits Mentor. This positive change has made Mentor proud of Mentee's growth and ability to take control of their life.\n\nMentor's ongoing support for Mentee's sobriety journey has been well-received by Mentee, who values Mentor's willingness to share knowledge and help them achieve their goals.\n\nMentee's focus on living in the moment and feeling more connected to life resonates with their challenging but rewarding experience of getting sober. Mentee is now dedicated to sobriety and believes incorporating yoga into their routine will further benefit their mental and physical health.",
        "speaker": "Mentor",
        "raw_prediction": "That's wonderful to hear, Mentee. Living in the moment can truly enhance your overall well-being and outlook on life. Keep embracing that mindset, and you'll continue to see positive changes in your journey."
    },
    {
        "utter_id": "e14-s5-t12",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?",
        "memory_text": "- The Parent acknowledges being lazy about washing dishes and promises to contribute more to keeping the home clean.\n- The Parent has seen a doctor and is taking medicine for their illness.\n- The Parent expresses a desire to be a better role model for the Child and their siblings.\n- The Child is caring and offers help to the Parent.\n- The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.",
        "speaker": "Parent",
        "raw_prediction": "Yes, I remember that! It was a lot of fun. I'm glad you enjoy being creative too, just like me."
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.\nClassmates B: I'm proud of you. It's always great to see someone following their dreams.\nClassmates A: Thanks, it's been a journey, but I'm really happy with where I am now. It's crazy to think that years ago, I was so hesitant to even share this part of myself.\nClassmates B: It just goes to show that it's never too late to start pursuing what you love. Remember when we talked about you living your life on your own terms? You're doing just that.",
        "memory_text": "Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth. This aligns with their shared value of trying new things and taking risks for personal development. As a result, Classmates A values living life on their own terms and being content with their choices. This attitude towards independence and happiness has led Classmates A to pursue their passions and find joy in life.",
        "speaker": "Classmates A",
        "raw_prediction": "I appreciate your support and encouragement. It really means a lot to me."
    },
    {
        "utter_id": "e16-s5-t9",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?",
        "memory_text": "1. [Co-worker A used to fantasize about being a great leader and being respected and admired.] - (SameTopic) - [Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.]\n2. [Co-worker A has fantasies of being a great leader.] - (SameTopic) - [Co-worker A felt stressed about their relationship with Co-worker B in the past.] - (Causes) - [Co-worker B advises Co-worker A to control their emotions and discuss the issue with Co-worker B.]",
        "speaker": "Co-workers B",
        "raw_prediction": "I do remember that time. It's important to address any issues that come up in the workplace. I'm glad we were able to work through it and continue to support each other."
    },
    {
        "utter_id": "e17-s5-t10",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?",
        "memory_text": "Neighbors A showed appreciation for Neighbors B's actions in the neighborhood, leading to Neighbors A being willing to take things slow in their relationship with Neighbors B. This resulted in Neighbors B reassuring Neighbor A about past embarrassing incidents and emphasizing their current friendship. \nNeighbors A ordered a large cheese pizza with extra sauce for Neighbors B, highlighting the value of their friendship. This conversation transitioned to Neighbor A's daughter starting high school, which has been a significant adjustment for the family.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, that park has been such a peaceful place to unwind. I still go there sometimes to clear my mind."
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.\nNeighbors B: That sounds like a great idea. You have the opportunity to do so much with your newfound wealth.\nNeighbors A: Definitely. It's funny how things can change so quickly. Just a few years ago, I was stuck in a job I hated and now I have all this freedom.",
        "memory_text": "Neighbors B is supportive and believes Neighbors A's story about becoming a millionaire, suggesting looking up UFO sightings in the area. Neighbors A is tired from work and needs to catch up on sleep, but Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries, which caused Neighbors A to make a big career change recently and become much happier. Neighbors A plans to do some research and possibly report the sighting of the UFO, and suggests planning something else to do together over the weekend, while also planning to start looking for new opportunities soon and updating their resume and start networking, which changed when Neighbors A took the leap to make a change and is glad they did. Neighbors B is supportive of Neighbors A's decision to make a big career change and admires the courage it took.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's truly amazing how life can take unexpected turns. I'm glad to see how happy and fulfilled you are now."
    },
    {
        "utter_id": "e19-s5-t8",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.\nNeighbors B: I'm sorry to hear that. Have you considered looking for a new job?\nNeighbors A: I have, but with the current job market, it's really tough. Plus, I don't have a lot of experience in other fields.\nNeighbors B: Well, I'll keep an ear out for any job openings that might be a good fit for you. In the meantime, maybe try finding ways to de-stress after work? I find that exercise helps me when I'm feeling frustrated.",
        "memory_text": "Neighbor A mentioned the importance of keeping outside spaces clean and maintained for the future. This aligns with the mutual support Neighbors A and B show each other, as seen when Neighbors A helped with their lawn. Additionally, Neighbors A values appreciation and expresses gratitude for help received, highlighting the supportive and helpful dynamic between them.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I appreciate that. I'll give exercise a try and see if it helps me unwind after work."
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "- Co-worker A and Co-worker B reminisced about happy memories from their time working together, sparking joy in their conversation.\n- Co-worker A, described as having \"Sherlock Holmes-like skills,\" expressed a desire to celebrate their detective work with drinks after work, hinting at their enjoyment of solving mysteries.\n- Co-worker A's talent for solving puzzles and mysteries was highlighted, leading to discussions about potentially pursuing a career as a detective.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, I guess I do have a knack for uncovering things. Maybe I missed my calling as a detective!"
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "The husband enjoys spending quality time with his friend and cherishes their bond, feeling uplifted and at ease in their presence. He also treasures the supportive community of believers at church and is actively engaged in various ministries, finding strength in his faith. \nBoth the husband and wife prioritize the small, meaningful moments in life that contribute to their overall happiness and well-being. \nThe husband values reliability in his relationships and eagerly anticipates collaborating on a podcast project. Additionally, he finds joy in the simple pleasures of life, like making it to the bus on time.",
        "speaker": "Husband",
        "raw_prediction": "Yes, being part of the church community has been truly fulfilling. I find so much joy in giving back and connecting with others through our shared faith."
    },
    {
        "utter_id": "e22-s5-t6",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?",
        "memory_text": "1. [Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.] - (React) - [Co-worker A had a positive experience with a commander who helped them feel safe.]\n2. [Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.] - (Want) - [Co-worker A wants to ensure the best production for the audience and hopes to find a compromise with the director.]\n3. [Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.] - (Want) - [Co-worker A values making money and is interested in opportunities to do so.]",
        "speaker": "Co-workers A",
        "raw_prediction": "I've thought about it, but right now I'm really focused on making a difference in my current role."
    },
    {
        "utter_id": "e23-s5-t12",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?\nStudent: It's going well. I'm really looking forward to spending more time with them and taking them on fun trips.\nTeacher: That sounds like a great plan. Speaking of fun, remember when you scared me in the hallway a few days ago?",
        "memory_text": "The student had a heroic experience at the beach where they helped save a young kid from drowning. This event has made the student eager to retire and spend quality time with their grandchildren. Additionally, the student is currently studying French at college and intends to learn Spanish and German to become more well-rounded in language skills.\n\nThe teacher praised the student for their bravery and quick action in the emergency situation. This positive reinforcement may have contributed to the student feeling stressed lately, which could have led to the outburst. Furthermore, the student is excited about retiring and spending time with their grandkids, already planning fun activities.",
        "speaker": "Student",
        "raw_prediction": "Oh, I remember that! Sorry about that, I was in a rush that day."
    },
    {
        "utter_id": "e24-s5-t11",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.\nNeighbors A: Absolutely. And hey, on a related note, I wanted to talk to you about something else. Lately, I've been feeling really overwhelmed and stressed out.",
        "memory_text": "Neighbor A's favorite book is \"The Great Gatsby.\" - (Cause) - Neighbor B was read to from a book about personal development by Neighbor A, which had a positive impact on Neighbor A's career growth. - (Cause) - Neighbor A feels like they are making a real impact at the company and is driven and motivated. - (Changed) - Neighbor A is feeling overwhelmed and stressed, mentioning having a lot on their plate.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sorry to hear that. Is there anything specific that's been causing you stress?"
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.",
        "memory_text": "Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions. This reminds Co-worker A of the time when they were a leader in their country, making it prosperous and safe.",
        "speaker": "Co-workers A",
        "raw_prediction": "Those were some challenging times, but I appreciate the reminder of the positive impact I was able to make."
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?",
        "memory_text": "- Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go. Neighbor A and Neighbor B enjoy playing together with toys. Neighbor B is familiar with Neighbor A's dog and looking forward to playing with it again. Neighbor A appreciated the support and friendship of Neighbor B.\n- Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience. Neighbor A looks forward to playing with Neighbor B again when feeling better. Neighbor A recently moved to London from their current location. Neighbor A moved to London in the past and had to learn how to manage stress.\n- Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go. Neighbor A and Neighbor B enjoy playing together with toys. Neighbor A appreciated the support and friendship of Neighbor B.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've thought about it, but with my recent move to London and focusing on my health, it's been on the back burner."
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.",
        "memory_text": "Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A. This experience taught Co-worker A the importance of being efficient and proactive.",
        "speaker": "Co-workers A",
        "raw_prediction": "It's been a journey, but I'm grateful for the lessons learned along the way."
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?",
        "memory_text": "1. The Coach and Athlete discuss the importance of maintaining focus and making small dietary changes to enhance performance.\n2. The Coach motivates the Athlete to continue their nutrition and training efforts, recognizing their progress and commitment.\n3. The Coach talks to the Athlete about the benefits of bean sprouts and the significance of a well-rounded diet for athletic performance.",
        "speaker": "Athlete",
        "raw_prediction": "I've been trying to incorporate more bean sprouts into my meals, and I've noticed a difference in my energy levels during training sessions."
    },
    {
        "utter_id": "e30-s5-t4",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument. This experience has led to Co-worker A presenting evidence in front of a judge to support their position in the past, where they denied that their reputation had any impact on Karen giving them the money.\n   \n2. Co-worker A plans to present the evidence clearly and persuasively in court, which has already changed to Co-worker A having presented evidence in front of a judge to support their position in the past. In that instance, Co-worker A denied that their reputation had any impact on Karen giving them the money.\n   \n3. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument. This has led Co-worker B to commend Co-worker A for having the courage to stand up and defend their beliefs, resulting in Co-worker A being willing to take on the project of building a deck for Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate that, thank you. It's important to present information clearly and convincingly, especially in a courtroom setting."
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.\nClassmates B: Definitely. It's the small acts of kindness that can make the biggest impact. Remembers when we talked about how I made sure the mix-up won't happen again? That was because I wanted to make a small impact, like you did for your neighbor.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support, leading to Classmates B being supportive and helpful to Classmates A, which then results in Classmates B advising Classmates A to drive safely to avoid accidents.\n2. Classmates A appreciates Classmates B's efforts and support, as well as the support and friendship of Classmates B, where Classmates B was initially worried about Classmates A going out with friends but they value each other's opinions.\n3. Classmates A appreciates Classmates B's efforts and support, which motivates Classmates B to be supportive and helpful to Classmates A, and also leads to Classmates B initially being worried about Classmates A going out with friends but they value each other's opinions.",
        "speaker": "Classmates A",
        "raw_prediction": "I remember that conversation. It's always the little things that count the most. It's great that we can support each other in different ways."
    },
    {
        "utter_id": "e32-s5-t9",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.",
        "memory_text": "The husband's excitement about his long-awaited plans drives him to take action and involve his wife in future plans. The wife expresses her past disappointment when the husband left without her, emphasizing the importance of keeping promises. The husband's dedication to his plans excites him, and both husband and wife are looking forward to their future together.",
        "speaker": "Wife",
        "raw_prediction": "Thank you for apologizing, husband. I appreciate it. Let's focus on the present and enjoy our upcoming getaway together."
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.",
        "memory_text": "1. Classmates A praised Classmates B for their resilience and quick thinking during a scary experience in space.\n2. Classmates B admires Classmates A's attitude and sees it as a good example for others.\n3. Classmate A believes in giving 110% effort in everything they do.",
        "speaker": "Classmates A",
        "raw_prediction": "See, embarrassing moments happen to everyone. It's all about how you handle it. Just like you said, I believe in giving 110% effort in everything we do, even when we make mistakes."
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.\nNeighbors B: Speaking of hard work, have you made any progress at your current job? I remember you were having some trouble with your boss.",
        "memory_text": "1. Neighbors A is taking responsibility for their actions and working on self-improvement, advised by Neighbors B to be more responsible at work.\n2. Neighbors B points out that Neighbors A's work attitude and behavior might be causing issues with their boss, leading Neighbors A to change and strive to be a better colleague.\n3. Neighbors B wishes for Neighbors A's success and stresses the significance of respect and effort at work, showcasing their supportive and friendly relationship.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, things have been going much better at work lately. I've been putting in more effort and my boss has noticed the positive changes. I'm hoping to continue improving and show that I'm a valuable member of the team."
    },
    {
        "utter_id": "e35-s5-t4",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?",
        "memory_text": "1. [Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.] - (React) - [Co-worker A and Co-worker B have a strong bond and mutual respect for each other's talents.]\n2. [Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.] - (Changed) - [Co-worker A and Co-worker B are optimistic about their creative futures and are considering entrepreneurship.]\n3. [Co-worker A and Co-worker B met on a movie set and are now good friends.] - (React) - [Co-worker A values the friendship and growth they've experienced with Co-worker B.]",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, that was a challenging time, but your encouragement and support helped me get through it. I appreciate that so much."
    },
    {
        "utter_id": "e36-s5-t11",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?",
        "memory_text": "1. Mentee is embracing the idea of teaching religion seriously and aims to positively impact people's lives, inspired by Mentor's advice.\n2. Mentor, having a desire to break free from the oppressive cult rules, supports Mentee in approaching teaching religion with openness and compassion, as they both seek to make a difference.\n3. Mentor, advocating for the importance of spiritual teachings in fostering connections and values, became a mentor to assist others in similar situations.",
        "speaker": "Mentor",
        "raw_prediction": "I come from a diverse background, which has allowed me to appreciate different cultures and traditions. It's been enriching to learn from various perspectives and experiences."
    },
    {
        "utter_id": "e37-s5-t3",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.",
        "memory_text": "- Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop. Neighbors B offered to help Neighbors A with the apology process.\n- Neighbors A's rug keeps curling up at the corners. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes. Both neighbors agreed that apologizing takes strength, not weakness.\n- Neighbors B has a great selection of earrings and is willing to help find the perfect match for the dress.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, that was a big help. It's nice to know we can rely on each other when needed."
    },
    {
        "utter_id": "e38-s5-t11",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. \nClassmates A: Yeah, I guess it does. It’s just that I’ve been hurt before, and I don’t want to lose you as a friend too.",
        "memory_text": "1. Classmates A offered to provide support and stress-relieving massages to Classmates B, causing Classmates A to want to offer help and support to Classmates B, which made Classmate A recall a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n\n2. Classmates A had doubts about trusting Classmates B due to rumors about their reliability, which led to Classmates A and B being supportive friends who look out for each other during stressful times, and made Classmates B feel relieved to have someone to confide in about the secret.\n\n3. Classmates B assures Classmates A that they will do their part in the group project, prompting Classmates A to tend to overthink things and appreciate Classmates B's support and advice, and leading Classmate B to encourage self-compassion and finding a balance between striving for excellence and being kind to oneself.",
        "speaker": "Classmates B",
        "raw_prediction": "I understand your concerns. Let's take things slow and see where it goes. Our friendship is important to me, and I value our connection."
    },
    {
        "utter_id": "e39-s5-t6",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?\nNeighbors A: I visited Brazil and Peru. The culture and food were incredible.\nNeighbors B: That sounds awesome. I've always wanted to go to Peru to see Machu Picchu.\nNeighbors A: Yes, Machu Picchu is amazing. The view from the top is breathtaking.\nNeighbors B: Have you thought about where you want to go next?",
        "memory_text": "Neighbors A taught the kid the special move to help them feel better, and Neighbors B agreed to buy candy for the neighborhood kids to spread happiness. Neighbors B then admired Neighbors A's organization skills and expressed a desire to enhance their own organization. In response, Neighbor A showed willingness to take precautions and make smart decisions. \n\nNeighbors A won against a kid in chess by using a special move, which led both Neighbors A and B to believe in the value of doing good deeds to strengthen the community. Neighbor B, concerned about safety, cautioned against connecting with strangers. \n\nBoth Neighbors A and B share a belief in the significance of learning and self-improvement, as well as the importance of performing acts of kindness to foster unity. Neighbor B recommended alternative ways to manage stress and emphasized the importance of Neighbor A's well-being.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm considering visiting Japan next. The culture there is fascinating, and I've always wanted to experience it firsthand."
    },
    {
        "utter_id": "e40-s5-t9",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.",
        "memory_text": "Classmates A's experience facing tough competition in middle school from a fast girl motivated them to improve, which Classmates B acknowledges by emphasizing the importance of enjoying the journey and effort put in, not just focusing on winning. Both classmates value taking moments to relax and appreciate small things.\n\nClassmates B acknowledges Classmates A's determination and competitiveness, offering support and suggesting that Classmates A get their arm checked out as they had a muscle strain but did not go to the hospital.\n\nClassmates A's motivation to improve from tough competition in middle school was hindered by Classmates B offering support and suggesting they take a step back to find a balance. This support led to Classmates A expressing gratitude for the friendship and support of Classmates B.",
        "speaker": "Classmates B",
        "raw_prediction": "It's important to listen to your body and take care of yourself. It sounds like your determination is really paying off in various aspects of your life. Keep up the good work!"
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.",
        "memory_text": "- Classmates A acknowledges a mistake and plans to learn from it. This shows that Classmate B is a supportive friend who listens and offers to help. As friends who help each other with schoolwork, Classmates A and Classmates B have a strong bond.\n- Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility. This leads to the topic of how Classmates B and Classmates A used to dance a lot in middle school. Classmate A appreciates having friends who are there for them during difficult times, and Classmates B supported Classmates A through a tough time by listening to them.",
        "speaker": "Classmates A",
        "raw_prediction": "Sure! One program I found really helpful is Microsoft Excel for organizing data and creating spreadsheets. It's user-friendly and versatile."
    },
    {
        "utter_id": "e42-s5-t7",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.",
        "memory_text": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions, which leads to Co-worker B moving on from their arrest and appreciating Co-worker A's concern and change in behavior. This reminds Co-worker B of Co-worker A's progress and potential for success. Co-worker A is adjusting to the night shift schedule and excited for a promotion.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic to hear! I'm really happy for you. It's great to see how much progress you've made."
    },
    {
        "utter_id": "e43-s5-t3",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?\nClassmates B: I'm sorry,, but I can't disclose that information. It's not my place to tell.\nClassmates A: But how did you find out? I haven't told anyone.",
        "memory_text": "- Classmates A was nervous about fitting in but saw Classmates B as well-liked and wanted to be friends with them. This made Classmates B open to trying to be more optimistic after the conversation.\n- Classmates B advises Classmates A to be careful and aware while on the bus, which is in the same topic as warning Classmates A about the potential danger of dark alleys.\n- Classmates A emphasizes the importance of resilience and staying positive even when things don't go as planned. This genuine friendship and positive attitude of Classmates A is appreciated by Classmates B, who encourages Classmates A to keep striving towards their goals. Classmates A, in turn, is curious and open to exploring new things and taking risks.\n- Classmates A believes in the power of positivity and its impact on life, which caused Classmates A and B to become friends when Classmates A transferred to the school. This is in the same topic as Classmates A not having trouble on the bus so far.",
        "speaker": "Classmates B",
        "raw_prediction": "I overheard a conversation between some classmates. I didn't mean to eavesdrop, but that's how I found out."
    },
    {
        "utter_id": "e44-s5-t8",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.\nNeighbors B: How about we go for a walk and you can talk to me about everything that's been on your mind?",
        "memory_text": "Neighbor A recently moved to a new neighborhood and feels safer and happier there. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\nNeighbor A and Neighbor B are neighbors who catch up outside of their neighborhood. Neighbors A and Neighbors B like to grab a bite to eat together after their activities. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\nNeighbor A has a bit of a drive to get to the park where they are meeting with Neighbor B. Neighbors A and Neighbors B enjoy going for walks together, especially to the park. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a good idea. A walk in the park and a chat would be nice right now."
    },
    {
        "utter_id": "e45-s5-t5",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?",
        "memory_text": "- Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal.\n- Classmates A started working at the grocery store last week and is enjoying the experience, learning about running a store.\n- Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\n- Classmates A believes in hard work and dedication to achieve goals both in basketball and their job.\n- Both classmates have a positive attitude towards each other and their respective goals.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, I remember. It's a tough journey, but you always said you believe in hard work and dedication to reach your goals."
    },
    {
        "utter_id": "e46-s5-t4",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?",
        "memory_text": "- [Classmates A and B found a perfect camping spot with a great view and level ground, free of debris, ensuring a comfortable night's sleep.]\n- [Classmate A's active involvement in the community inspires them to seek fun and impactful activities, leading to a decision to prioritize self-care in the future.]\n- [Classmate B admires Classmate A's community engagement and stresses the importance of allergy awareness, preparedness, and prevention.]",
        "speaker": "Classmates A",
        "raw_prediction": "I stumbled upon it while exploring the area earlier today. Just got lucky, I guess!"
    },
    {
        "utter_id": "e47-s5-t13",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?",
        "memory_text": "- Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n- Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams. Classmates A bought a sleek and red Mustang GT car, which Classmates B recently bought a red sports car and finds driving it to be fun and freeing.\n- Classmates A plays the guitar, takes lessons, and plays in a band, and has been dreaming of owning a Mustang GT since childhood.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't thought about it yet, but it's something I'd love to explore in the future. Thanks for the suggestion!"
    },
    {
        "utter_id": "e48-s5-t10",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? ",
        "memory_text": "Neighbor A built a new house for Neighbor B with three bedrooms, two bathrooms, and a big backyard. This act of kindness helped Neighbor B in creating a new house with amazing features. Neighbor B expressed their appreciation by reminding Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them. This made Neighbor A feel motivated to believe that plants need sunlight, water, and love to thrive. \n\nNeighbor A, who enjoys building houses and finishing them quickly, also possesses skills in manipulation and getting what they want. \n\nNeighbor B, excited about the new project, is looking forward to seeing the finished house. Building the new house was challenging but rewarding for Neighbor A.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's coming along slowly, but I'm making progress. Thanks for asking!"
    },
    {
        "utter_id": "e49-s5-t8",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.\nWife: Maybe it's time to take a step back and try something new. Have you ever tried writing in a different genre or experimenting with different styles?\nHusband: That's a good idea. I guess I just haven't had the courage to step out of my comfort zone.\nWife: Remember when you faced your fear of public speaking during your fifth-grade presentation? You can do this too. Sometimes, the biggest breakthroughs come from taking risks.",
        "memory_text": "The wife is knowledgeable about movies and is willing to share her passion with the husband. Both the husband and wife express a desire for happiness and understanding in the situation. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is. \n\nThe husband is open to learning more about movies, showing a willingness to try again. Both the husband and wife express a desire for happiness and understanding in the situation. Wife suggests that husband should try using more modern language to be better understood. The husband gave a fifth-grade presentation in the past.\n\nThe husband is open to learning more about movies, showing a willingness to try again. Both the husband and wife express a desire for happiness and understanding in the situation. Husband agrees to try adapting to modern language for better communication with his wife. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.",
        "speaker": "Husband",
        "raw_prediction": "You're right. I need to channel that same courage into my writing. I'll give it a shot and see where it takes me. Thanks for the reminder."
    }
]