[
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "1. Speaker A mentions having eight grandchildren and already having blue hair. Speaker B has an oldest nephew who is about to turn 14.\n2. Both Speaker A's mother and Speaker A were librarians, but Speaker A is retired. Speaker B asks if the recommended book is fiction or nonfiction.\n3. Speaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one. Speaker A, a retired librarian, recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit.",
        "speaker": "Speaker B",
        "raw_prediction": "He's doing well, thank you for asking. He's getting ready for his birthday, and he's excited to finally be a teenager.",
        "previous_summary": "Speaker A is older and has eight grandchildren.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city."
    },
    {
        "utter_id": "e1-s5-t4",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.",
        "memory_text": "Speaker B, who does not know how to swim but enjoys watching swimming movies, wants Speaker A to teach them how to swim and programming. Speaker B also enjoys cruising in their car while listening to punk music and wants to listen to it while swimming and learning programming. On the other hand, Speaker A, who enjoys cruising and has a favorite club in school, causes Speaker A to plan snorkeling and other activities at their cruise destination. This leads to Speaker A and Speaker B discussing the potential of getting on a cruise ship together.",
        "speaker": "Speaker A",
        "raw_prediction": "That would be awesome! I'll make sure there's some time for swimming and programming on the cruise too.",
        "previous_summary": "Speaker A enjoys cruising and has a favorite club in school.\nSpeaker A knows how to swim since the age of 5.\nSpeaker A has planned a cruise to the Caribbeans.\nSpeaker B is afraid of cruises because they can't swim.\nSpeaker A is not nervous about going on a cruise.\nSpeaker A recommends hiking and exploring the local area for those who can't swim.\nSpeaker A and Speaker B discuss the potential of getting on a cruise ship together.\nSpeaker A plans to travel to the Caribbean for their next trip.\nSpeaker A offers to teach Speaker B how to swim and programming."
    },
    {
        "utter_id": "e2-s5-t11",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,\nSpeaker B: Yes, ice cream shops are the best! They have stir-ins, and the smells are heavenly! Ben and Jerry's used to have a blueberry cheesecake that was amazing! I have only had that and their strawberry flavors. Both were great!\nSpeaker A: YES! You get it. Now I want to go to an ice cream shop. I might apply for a part-time job at an ice cream shop since I'm not working.  Do you enjoy your job as a fry cook? I think the food & restaurant industries may be similar.",
        "memory_text": "Speaker A is interested in getting a dog and had a hamster named Leonardo in the past. Speaker A is considering getting a dog and already walks Speaker B's dog, Sparky. Speaker A enjoys running and listening to music as hobbies. Speaker A wants to try the famous hamburgers made by Speaker B at the diner. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce. Speaker B is busy and appreciates the offer to help with Sparky. Speaker B has invented a chilli dog casserole that Speaker A wants to try. Speaker B is also a high school student preparing for college, working at a diner at night.",
        "speaker": "Speaker B",
        "raw_prediction": "I do enjoy working as a fry cook at the diner. It's fast-paced but rewarding. An ice cream shop job sounds fun too! Good luck with your application process!",
        "previous_summary": "Speaker B is also a high school student preparing for college, working at a diner at night.\nSpeaker A plans to try the famous hamburgers made by Speaker B at the diner.\nSpeaker B had hamburgers for dinner with cheese, mustard, and lettuce.\nSpeaker A and Speaker B are involved in different fields of work, cooking and lab research.\nSpeaker B is considering giving up their night job to focus on lab work and school."
    },
    {
        "utter_id": "e3-s5-t3",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?",
        "memory_text": "Speaker A's cousin recently moved to Sweden, which has sparked Speaker A's interest in visiting the country. This desire to visit Sweden is leading Speaker A to consider saving money by taking on a second part-time job. Additionally, Speaker B, who is from Sweden, suggested checking out the volcanoes in the country for a unique experience.",
        "speaker": "Speaker B",
        "raw_prediction": "You should definitely add the Icehotel in Jukkasjärvi to your list of must-sees in Sweden!",
        "previous_summary": "Speaker A likes playing badminton and has a cousin who recently moved to Sweden.\nSpeaker A has a cousin in Sweden but has not visited the country.\nSpeaker A is considering visiting their cousin in Sweden and needs to save money for the trip.\nSpeaker A and Speaker B plan to travel to Sweden together.\nSpeaker B recommends checking out the volcanoes in Sweden for a unique experience."
    },
    {
        "utter_id": "e4-s5-t9",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?",
        "memory_text": "Speaker A enjoys being around horses, involved in horse breeding and taking care of them. Speaker B is concerned about the cost of owning horses, including medical fees and expenses like horse shoes, and also considers the psychological aspects of owning a horse, relating it to Freudian theories. \nSpeaker B's mom being a nurse and busy with work caused Speaker B to become a therapist, mentioning the ups and downs of the profession, and be a professional in a practice where it is illegal for them to have relationships with clients. \nSpeaker B, a therapist and a football fan supporting the Chiefs, talks about the profession's challenges and the legal restrictions on relationships with clients.",
        "speaker": "Speaker B",
        "raw_prediction": "I appreciate your concern, but as a professional, I always maintain strict boundaries with my clients. I believe I could provide you with the support you need without any conflicts.",
        "previous_summary": "Speaker B is a professional in a practice, where it is illegal for them to have relationships with clients.\nSpeaker B has been working in their own practice for about six years."
    },
    {
        "utter_id": "e5-s5-t9",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. \nSpeaker A: Oh wow! So Kyrie is a working dog? She helps your dad out on the farm?",
        "memory_text": "Speaker B loves nature and works with animals, currently re-reading 'Redwall' by Brian Jacques, which was a favorite book growing up. Speaker B has been busy with a new painting and has not had time to read, and Speaker A asks about Speaker B's new artwork and acknowledges their need for inspiration.\nSpeaker B is an artist who walks through nature for work and is interested in Pilates but dislikes the idea of having to follow specific steps in exercise.\nSpeaker A walks to work instead of driving, practices Pilates, and finds it great for beginners.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, exactly! She loves to help out and is always eager to be active. It's rewarding to see her in her element.",
        "previous_summary": "Speaker B lives in the country, loves nature, and works with animals.\nSpeaker B's family consists of a nurse mom, a farmer dad, and a sister."
    },
    {
        "utter_id": "e6-s5-t11",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.\nSpeaker A: That's a shame, I'm sure you could find a club to surf with at a local beach. Have you been out fishing recently?",
        "memory_text": "Speaker A was good at writing in school, while Speaker B was bad at math and preferred fishing. Speaker B is looking forward to taking a break from work and going fishing. Speaker B finds fishing easier than surfing, but is interested in trying surfing. Speaker B is willing to teach Speaker A how to fish and cook.\n\nSpeaker B loves fishing and spending time near the ocean, but doesn't have time to surf anymore due to working at a doctor's office. Speaker A enjoys surfing and music as a way to escape from daily life. Speaker B wishes they had time to go surfing and is considering getting lessons at a surf shop. Speaker B received a new recipe book for their birthday in May.",
        "speaker": "Speaker B",
        "raw_prediction": "I haven't been fishing in a while, but I'm hoping to go this weekend if the weather is nice.",
        "previous_summary": "Speaker B loves fishing and spending time near the ocean, but doesn't have time to surf anymore due to working at a doctor's office.\nSpeaker B is looking forward to taking a break from work and going fishing.\nSpeaker B caught a huge trout almost a meter long that bit their hand.\nSpeaker B finds fishing easier than surfing, but is interested in trying surfing."
    },
    {
        "utter_id": "e7-s5-t4",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? ",
        "memory_text": "Speaker A is a librarian and loves kids, mentioning having 3 children. This makes Speaker A busy with work, unable to spend as much time with them as they would like. Consequently, Speaker B, who has a lot of kids all grown up with kids of their own, enjoys spending time with their grandkids at the park. This led Speaker B to take their grandkids fishing once, with mixed reactions from the kids. Speaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been thinking about it, and I believe it could be a wonderful tradition for all of us. The kids seemed to enjoy it, and it's a great way to bond with nature.",
        "previous_summary": "Speaker B has a lot of kids, all grown up now and with kids of their own.\nSpeaker A has kids and is busy with work, unable to spend as much time with them as they would like.\nSpeaker B mentions having grandkids, implying they are older and have a family of their own.\nSpeaker B has grandkids and enjoys spending time with them at the park.\nSpeaker B took their grandkids fishing once, with mixed reactions from the kids.\nSpeaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature."
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?",
        "memory_text": "Speaker B prefers painting regular people over professionals and discovered their love for portraits through a self-portrait with pets. They also think pit bulls are lovely and have one that is kind and sweet. Additionally, Speaker B likes Persian cats and imagines their pets having interesting interactions. Speaker B's prices for a portrait start at $5000 to pay for college tuition, as they are an artist who did a painting for Elton John and has student debt from art school. Currently, Speaker B is working on other portraits and taking care of a sick dog.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a unique and fun portrait idea! As for the cat, I'm still exploring different shelters and breeders to find the perfect match.",
        "previous_summary": "Speaker B is in college, paints on the side, and has five dogs and three rats.\nSpeaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\nSpeaker B has five dogs and enjoys taking them to the park.\nSpeaker B is working on other portraits and taking care of a sick dog.\nSpeaker B likes Persian cats and imagines their pets having interesting interactions."
    },
    {
        "utter_id": "e9-s5-t10",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?",
        "memory_text": "Speaker B is planning an Alaskan vacation but has not planned much yet. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.\nSpeaker A is working on going back in time. Speaker B is planning an Alaskan vacation but has not planned much yet. Speaker A and Speaker B are planning a trip to Alaska together.\nSpeaker B has programming experience but has not created their own invention. Speaker B is planning an Alaskan vacation but has not planned much yet. Speaker B is unsure about what else there is to do in Alaska besides hiking.",
        "speaker": "Speaker A",
        "raw_prediction": "It's probably a good idea to have a hiking guide, especially with the potential grizzly encounters. Your friend can still show you around, but having a professional guide could ensure your safety.",
        "previous_summary": "Speaker A is concerned about the safety of Speaker B and suggests getting a hiking tour guide.\nSpeaker B is not a fan of fishing but is interested in hiking and seeing a moose.\nSpeaker A is nervous about traveling alone and prefers having someone familiar around during new adventures.\nSpeaker B is comfortable traveling alone and enjoys the spontaneity it allows."
    },
    {
        "utter_id": "e10-s5-t4",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?",
        "memory_text": "1. Speaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods. Speaker A owns a restaurant and recently experienced a fire incident but managed to put it out.\n2. Speaker A enjoys the interaction with people at work and the variety of experiences that come with it. Speaker A enjoys working at the restaurant despite the busy schedule.\n3. Speaker A works at a restaurant and invited Speaker B to visit. Speaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.",
        "speaker": "Speaker A",
        "raw_prediction": "Definitely! I always save room for dessert at work. The tiramisu is one of my favorites.",
        "previous_summary": "Speaker A works at a restaurant and invited Speaker B to visit.\nSpeaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods."
    },
    {
        "utter_id": "e11-s5-t8",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?\nSpeaker B: I haven't! Just karate! Have you been thinking of taking some classes?\nSpeaker A: I want to take some martial art classes at school next year. What do you sggest I try?\nSpeaker B: I mean I always recommend Karate since that's what I study! I can bring you by the dojo sometime if you want to see what it is like. \nSpeaker A: OMG!! That would be so awesome, Yes please.  When is a good time for you?\nSpeaker B: Awesome! Tomorrow afternoon anytime between 3-6 would work for me!\nSpeaker A: Perfect. I will meet you at the Dojo at 3pm. I really appriciate it, and I will buy you lunch after too. \nSpeaker B: That's great! I can bring some guest passes to the pool I lifeguard at as well! I'm working this weekend if you want to come when I am working. Where do you want to eat?",
        "memory_text": "Speaker B has a background in football and karate, but is currently a lifeguard at the beach. They are considering a career change to the IT sector due to their computer skills and the growing demand for employees in that sector.",
        "speaker": "Speaker A",
        "raw_prediction": "Let's grab some sushi after the dojo visit tomorrow. I've been craving it lately.",
        "previous_summary": "Speaker B is a football fan who was the captain of their team and is currently a lifeguard at the beach.\nSpeaker B currently works as a lifeguard, which is physically demanding and not suitable for a long-term career.\nSpeaker A has fair skin and burns easily, using SPF-80 sunscreen.\nSpeaker B tans easily and only uses sunscreen on specific areas like the tops of their feet and face."
    },
    {
        "utter_id": "e12-s5-t4",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.",
        "memory_text": "Speaker A is working at a pizza shop to pay for college and studying computer science, and wants to develop apps for differently abled youth. Speaker A is interested in teaching computer science, specifically in the field of robotics. \nSpeaker A is working at a pizza shop to pay for college and studying computer science. Speaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics. Speaker B is studying linguistics but mentions feeling limited in job opportunities. \nSpeaker B majoring in linguistics causes Speaker A to be interested in teaching computer science, specifically in the field of robotics.",
        "speaker": "Speaker A",
        "raw_prediction": "Thank you! I'm lucky to have supportive parents. How about you, do your parents support your decision to pursue teaching?",
        "previous_summary": "Speaker A is working at a pizza shop to pay for college and studying computer science.\nSpeaker A is living with their grandparents and helps them out."
    },
    {
        "utter_id": "e13-s5-t8",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?",
        "memory_text": "Speaker A, who enjoys visiting the zoo and grew up in big cities, suggests taking the pets to the zoo and mentions that most major cities have good zoos. Speaker B, interested in finding family discounts for the zoo, wants to take their daughter's school on a field trip to the zoo.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys, which is the same topic where Speaker A mentions taking the pets to the zoo. Speaker B's daughter likes monkeys and is starting to assert her independence.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I did get to see Joshua. He was quite active that day. Have you been to the zoo recently?",
        "previous_summary": "Speaker B just moved to America and is unfamiliar with the places.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\nSpeaker B's child wants to visit the zoo, particularly to see the monkeys.\nSpeaker B is interested in finding family discounts for the zoo.\nSpeaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua."
    },
    {
        "utter_id": "e14-s5-t3",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?",
        "memory_text": "Speaker B enjoys watching Disney movies with her kids, which Speaker A recently experienced when watching the movie 'Luca'. \nSpeaker B, a stay-at-home mom, used to prefer romance and horror movies, but now enjoys watching Disney movies with her kids, who loved 'Luca'. \nSpeaker A and Speaker B both enjoy discussing movies, with Speaker B recommending 'Miracle' to Speaker A.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds amazing! I've never been to Hawaii, but I'm sure it'll be a beautiful experience. As for me, just staying busy with the kids and enjoying some family time.",
        "previous_summary": "Speaker A is a plumber.\nSpeaker A has booked a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.\nSpeaker A has seen the Disney movie 'Luca' recently.\nSpeaker B's kids enjoyed watching 'Luca' and said it was good."
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.",
        "memory_text": "Speaker A invited Speaker B to visit and mentioned looking into flights, causing Speaker A to plan to take Speaker B on tours and attend folk concerts during the visit.\n\nSpeaker A invited Speaker B to visit and mentioned looking into flights, causing Speaker B to plan to visit Speaker A and be interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\n\nSpeaker B is interested in visiting Alaska and mentions getting blackout curtains due to the midnight sun, causing Speaker B to find flights that work for their schedule and price and will be visiting Speaker A in a couple of weeks, which in turn causes Speaker A to be excited about the trip.",
        "speaker": "Speaker A",
        "raw_prediction": "You might not need to rent a car, it's definitely possible to walk and bike around here in the summer. The snow melts pretty quickly once summer hits.",
        "previous_summary": "Speaker A drives a smart car and used to have a long commute in Alaska.\nSpeaker A mentions the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer.\nSpeaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\nSpeaker A plans to take Speaker B on tours and attend folk concerts during the visit."
    },
    {
        "utter_id": "e16-s5-t7",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.\nSpeaker A: Oh, I definitely will. Thanks for the motivation. Is this going to me your first festival?",
        "memory_text": "Speaker A enjoys Mexican food and drinks, and plays music for fun. Speaker A enjoys going to bars and loves the ladies. Speaker A and Speaker B enjoy bluegrass music.\n\nSpeaker B is a mechanic who enjoys working on cars. Speaker B is not going out drinking much due to their wife's pregnancy. Speaker B's wife is pregnant, so they are considering attending a local festival for just a day. Speaker B's wife is pregnant and has three more months to go until the due date.\n\nSpeaker A owns a Subaru Legacy and mentions having a baby on the way. Speaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy. Speaker A and Speaker B discuss the logistics of attending a festival with a small baby.",
        "speaker": "Speaker B",
        "raw_prediction": "No, I've been to a few festivals before, but this will be the first one with a baby on the way.",
        "previous_summary": "Speaker B is a mechanic who enjoys working on cars.\nSpeaker B dislikes public transportation and enjoys going to festivals, but misses doing so.\nSpeaker B's wife is pregnant, so they are considering attending a local festival for just a day.\nSpeaker B's wife is pregnant and has three more months to go until the due date.\nSpeaker B is currently working on building cribs and will take two months off when the baby is born."
    },
    {
        "utter_id": "e17-s5-t3",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?",
        "memory_text": "Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe because Speaker B's grandmother was the matriarch of the family, known for cooking large meals for family gatherings. \nSpeaker A likes cooking new dishes and following recipes occasionally as a change from preferring surfing and growing up in a beach town.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a plan! I'd be happy to show you how to make spicy fried rice.",
        "previous_summary": "Speaker B is going to buy their first new car and got fired from Cisco for their singing.\nSpeaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking."
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?",
        "memory_text": "Speaker A used to work part-time at a supermarket but now plays soccer as a striker and has a match next week. They are a member of a soccer team and enjoy playing in tournaments. \nSpeaker A is a college student majoring in Humanities, not currently employed but used to work part-time at a supermarket. Lately, Speaker A has been scoring well in soccer.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm pretty flexible, so just let me know when works for you and I'll try to make it work.",
        "previous_summary": "Speaker B is 26 years old, works 12 hours a day, has a background in Humanities but now works as a law clerk.\nSpeaker B is currently working and mentioned the importance of taking breaks from work.\nSpeaker B is considering looking for a new job for higher pay but is comfortable at the current job."
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "Speaker A mentioning their neighbor John, who loves soccer, leads Speaker B to study sports medicine, play soccer, and aim to join their college team. This interest causes Speaker B to seek internships in sports medicine and enjoy surfing instead. Speaker B's professors being supportive in writing letters for an internship application causes Speaker A to offer advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field. Speaker B, as a college student playing soccer with peers, transitions to looking for internships in sports medicine, asking professors for letters of recommendation. This change results in Speaker B struggling to find internships and feeling disadvantaged compared to those with connections.",
        "speaker": "Speaker A",
        "raw_prediction": "I had a few injuries from playing sports when I was younger, and they just caught up with me over the years. It's great that you're focused on internships and making connections in your field. Keep pushing forward, it will pay off in the long run!",
        "previous_summary": "Speaker A is retired and spends most days hiking.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B is interested in sports medicine and enjoys surfing."
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "Speaker A works as a zookeeper and loves animals, especially white tigers. Speaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one. \n\nSpeaker B has two terrier dogs as pets. Speaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature. Speaker B asks Speaker A if they have had a pet raccoon before. \n\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker A has a pet raccoon and has a friend who found baby raccoons.",
        "speaker": "Speaker A",
        "raw_prediction": "It's all about finding a good balance and making sure their needs are met. I'm sure your terriers are loving the extra time with you now!",
        "previous_summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations."
    },
    {
        "utter_id": "e21-s5-t4",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!",
        "memory_text": "Speaker B, who lives in the city they grew up in and loves animals, has a cat that recently had a kitten, which caused them to have two sick kitties and recently receive a rescue. This situation led Speaker A, who has a parrot named Tasha, to be interested in adopting a rescue kitten. \nSpeaker B, who lives in the city they grew up in and loves animals, has a cat that recently had a kitten, which caused them to have two sick kitties and recently receive a rescue. This led Speaker B to have 3 cats, two of which are sick, and look for someone to adopt one of them, which made Speaker A interested in training tips for the kittens and open to adopting one despite having a parrot. \nSpeaker A, who has a pet parrot named Tasha and has red hair that makes them stand out, has a pet named Tasha who speaks Mandarin, and is interested in adopting a rescue kitten.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been doing some research on introducing cats to birds. It seems like a slow and careful introduction process is key to help them get along.",
        "previous_summary": "Speaker A is a country girl who loves animals and is a lacto-ovo vegetarian.\nSpeaker A has a pet parrot named Tasha and has red hair that makes them stand out.\nSpeaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\nSpeaker A's parrot Tasha has seen cats before and ignores them.\nSpeaker A has a parrot as a pet and is considering adopting a rescue kitten.\nSpeaker A is interested in training tips for the kittens and is open to adopting one despite having a parrot."
    },
    {
        "utter_id": "e22-s5-t10",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.\nSpeaker B: I will someday. just not in the summer when all the bugs are out! Where do you go hiking the most?\nSpeaker A: I like to go hiking in the local trails here. I am familiar with them and there's so many routes that I can take. Sadly, the bugs are as bad here as they are anywhere else.....\nSpeaker B: They can't be that bad in the fall right? I hope? Do you camp most every weekend?\nSpeaker A: A least a couple of times a month. Sometimes, yeah, I go every weekend to relax. Being in nature is so relaxing to me. And nah the bugs aren't too bad in the fall and winter. There's a beautiful river along one trail that I bet you'd love to see. \nSpeaker B: That sounds like it would be relaxing. I would probable be okay if we didn't run into any wolves, bears etc. Have you ever came across any predators when you were camping?",
        "memory_text": "Speaker A enjoys camping and hiking as free activities. Speaker B enjoys taking cruises and is not as into the outdoors as Speaker A. Speaker A enjoys camping trips and looking for wild animals in the woods. Speaker A enjoys hiking, birdwatching, and spotting rare animals. Speaker A has never been on a cruise and may consider trying one in the future. Speaker A and Speaker B both enjoy being outdoors, but Speaker B prefers the fresh air over being in the mud and rain. Speaker B shared tips on repelling mosquitos using sprays with 20% DEET and other active ingredients. Speaker A enjoys going on camping trips and hiking trails in parks. Speaker A is a personal trainer who loves camping in remote areas. Speaker B recently went on a long hike and enjoyed it. Speaker A is nervous about the Appalachian Trail hike, as they don't usually do full day hikes.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been lucky so far and haven't run into any predators while camping. It's always good to be aware of your surroundings though, just in case.",
        "previous_summary": "Speaker A has a pet parrot named Tasha and works as a personal trainer leading hikes.\nSpeaker A enjoys going on camping trips and hiking trails in parks.\nSpeaker A enjoys camping trips and looking for wild animals in the woods.\nSpeaker A is comfortable around animals in the woods but admits a bear would make them jumpy.\nSpeaker A enjoys hiking, birdwatching, and spotting rare animals."
    },
    {
        "utter_id": "e23-s5-t8",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!",
        "memory_text": "Speaker B enjoys painting and taking naps, while Speaker A has a passion for producing horror movies and believes everyone loves them. Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\n\nSpeaker B's father's involvement in producing horror movies influenced Speaker B's favorite genre, which aligns with Speaker A's passion for producing horror movies and belief that everyone loves them. Speaker A also likes mid-century design and is a fan of horror movies.\n\nSpeaker B's father's involvement in producing horror movies influenced Speaker B's favorite genre. This led to a change in Speaker A's preference, as they now prefer classic horror movies like Halloween or Friday the 13th over modern ones.",
        "speaker": "Speaker A",
        "raw_prediction": "Thanks for asking! My interview practice is going well. I'm feeling confident about it. And it's great to hear that your actors are easy to work with. It must make the production process smoother.",
        "previous_summary": "Speaker A recently moved to a new city and has two older brothers.\nSpeaker A has recently received a call for a job interview and is excited about it.\nSpeaker A is new to the city and has not been out much since arriving.\nSpeaker A has had flustered moments in past interviews but believes in staying calm.\nSpeaker A is applying for a project coordinator role at a charity but aspires to become a project manager in the future.\nSpeaker A finds job searching challenging and hopes to settle in the new city soon with a steady income.\nSpeaker A is preparing for an upcoming interview and is nervous about it.\nSpeaker A is nervous about an upcoming interview and wishes for a government job like Speaker B's."
    },
    {
        "utter_id": "e24-s5-t7",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?\nSpeaker A: My last final is on English. I think I will do well, I just have to do a little more studying. Would you be willing to help me study?",
        "memory_text": "Speaker B is excelling in the sports medicine class, causing Speaker A to struggle with maintaining good grades and only excel in gym.\nSpeaker B and Speaker A both find history class boring and overwhelming, with Speaker B eager to finish school to escape their mother's strictness.\nSpeaker B is pressured to maintain straight A's in sports medicine to avoid embarrassing their mother who runs the school.",
        "speaker": "Speaker B",
        "raw_prediction": "Of course, I'd be happy to help you study for your English final. Just let me know when you want to review together.",
        "previous_summary": "Speaker A struggles with history class and finds it boring.\nBoth speakers value good grades and believe it can lead to better job opportunities.\nSpeaker A struggles to maintain good grades and finds gym to be the only subject they excel in.\nSpeaker A advises Speaker B to take breaks and prioritize their own happiness and well-being."
    },
    {
        "utter_id": "e25-s5-t9",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.\nSpeaker A: That's good advice! Thank you! I saw on the news Cali has been getting a lot of rain. Have you still been able to run on the beach each day?",
        "memory_text": "Speaker B has been to Italy in the past and enjoyed the food there, while Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\n\nSpeaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them, while Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker B appreciates the idea of superhuman powers and is interested in historical events that involve such figures.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, the rain has been a bit of a challenge, but I try to get out there when I can. It's always refreshing to run on the beach, rain or shine.",
        "previous_summary": "Speaker B suggests California as a destination for Speaker A's trip.\nSpeaker B has lived in California for 30 years and loves the weather and beaches there.\nSpeaker B goes to the beach everyday if possible, with their 5-year-old daughter who loves to swim and play in the sand.\nSpeaker B has tried surfing before but is not very good at it.\nSpeaker B runs for exercise and started running in high school with track.\nSpeaker B finds running on sand more difficult but suggests running at the water's edge where it's wet."
    },
    {
        "utter_id": "e26-s5-t4",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.",
        "memory_text": "Speaker B lives in a rural area with a farm and can relate to cooking. Speaker B's husband is a great cook and enjoys making Asian food with lots of prep work. \nSpeaker B lives in a rural area with a farm and can relate to cooking. Speaker A is interested in running a business with their cooking skills. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker. \nSpeaker B lives in a rural area with a farm and can relate to cooking. Speaker B also mentions having a farm with animals like chickens, ducks, pigs, goats, and growing crops like corn, strawberries, and pumpkins. Speaker A owns a farm and enjoys cooking and baking. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, shrimp fried rice typically includes eggs. That's perfect since you have your own fresh eggs from your farm. It's great to use ingredients you already have on hand.",
        "previous_summary": "Speaker B also owns a farm with produce and hens for eggs.\nSpeaker A has 14 chickens and uses their eggs for baking."
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!",
        "memory_text": "Speaker B enjoys taking their houseboat out and works as a bartender. Speaker A and their brother enjoy going to a Brazilian steakhouse for dinner. Speaker B has one sibling, a little brother. Speaker A's brother enjoys Brazilian food, specifically steak. Speaker B prefers to keep holidays local with their brother instead of having big family gatherings.\nSpeaker B expressed interest in trying healing methods mentioned by Speaker A. Speaker A is interested in Speaker B's job as a bartender. Speaker B works as a bartender and enjoys meeting different people.",
        "speaker": "Speaker A",
        "raw_prediction": "That's awesome, crab legs and shrimp are delicious! I think certain foods can definitely be healing, like bone broth and turmeric. Have you ever tried incorporating those into your diet?",
        "previous_summary": "Speaker A is involved in healing work and mentioned hot latina salsa.\nSpeaker A recommended self-massage, essential oils, reiki, meditation, and self-awareness for healing.\nSpeaker A finds being on the water therapeutic and relaxing.\nSpeaker A is a Reiki practitioner who also works with meditation."
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "Speaker B is knowledgeable about plants and gardening, with a thriving garden. Speaker B is working on a teleportation machine that is currently small and requires substantial energy sources. Speaker B mentions the Chinese advancements in thermal nuclear generators and the need for a Manhattan Project for alternative energy. Speaker B is also interested in space exploration and plant science, expressing concerns about the fuels used for space travel. ",
        "speaker": "Speaker A",
        "raw_prediction": "I'm managing school alright, but now with this garden project, it feels like I'll have a whole new responsibility on my hands!",
        "previous_summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker A's parents are teachers.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden."
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?\nSpeaker B: For about four years. It's an industry in flux which is stressful. I need stability for my family at this point. It has changed my focus, which I'm not used to yet. Are you considering any other options for work?",
        "memory_text": "Speaker B's mother is a dentist, and Speaker A expresses interest in speaking to her about it, causing Speaker A to consider becoming a dentist and wanting to talk to Speaker B's mother.\nSpeaker A, who is 27 years old, has been looking at dental programs in colleges and is considering going back to school for dentistry in the future.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been looking into dental programs at colleges, considering going back to school for dentistry in the future.",
        "previous_summary": "Speaker A is 27 years old and hopes to change careers soon.\nSpeaker A's father was in the military.\nSpeaker A works for a small local business with a demanding schedule.\nSpeaker A does not have children and spends time working and reading.\nSpeaker A considers quitting their job to work at Disney World.\nSpeaker A is considering becoming a dentist and wants to talk to Speaker B's mother who is a dentist.\nSpeaker A has been looking at dental programs in colleges.\nSpeaker A has not found a dental program yet but plans to keep looking.\nSpeaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\nSpeaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.\nSpeaker A is considering going back to school for dentistry in the future."
    },
    {
        "utter_id": "e30-s5-t11",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?\nSpeaker B: Not up close, but I noticed a lot in shop windows in certain areas. I love Japan -- they're so welcoming. One of our acquaintances GAVE me a kimono. She said it's customary to try to share their culture. Kind of different from America in my opinion.  \nSpeaker A: Oh, that sounds wonderful. It's impressive how much things that came from there and how giving a culture they are. America is definetly a lot different from them, have you visted different states in America?\nSpeaker B: Oh yes. I live in North Carolina, but I've been to almost every state. Alaska was by far my favorite, but I'm kind of a loner and it feels like a lot of people there are, so maybe I just relate. But the scenery and landscapes are unbelievably beautiful. What's your favorite place you've been to?\nSpeaker A: I just visited Italy recently, it was much better than I had first anticipated, similar to Alaska with all the landscapes and scenery! Now I'm planning to go to Japan, do you have any recommendations on what to do there?",
        "memory_text": "Speaker A enjoys art and music, specifically painting. Speaker A and Speaker B both like the color turquoise. Speaker B keeps a turquoise lotus origami on their desk from Japan. Speaker A wishes to visit the country where origami was originally created, possibly Japan.\n\nSpeaker B has visited 20 countries and enjoys the color turquoise. Speaker B enjoys traveling and visiting gardens. Speaker B was recommended volunteering by Speaker A and has traveled to Japan and Italy, enjoying the art and food. Speaker B had to deal with Japan's visa requirements, which were expensive but worth it.",
        "speaker": "Speaker B",
        "raw_prediction": "Definitely visit the temples and gardens in Japan, they are absolutely stunning. And the food is just incredible, make sure to try some authentic sushi and ramen!",
        "previous_summary": "Speaker B was recommended volunteering by Speaker A and has traveled to Japan and Italy, enjoying the art and food.\nSpeaker B likes small family-owned restaurants with fresh homemade pasta in Italy.\nSpeaker B has visited Japan and found it to be an amazing country.\nSpeaker B had to deal with Japan's visa requirements, which were expensive but worth it."
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?",
        "memory_text": "Speaker B, who used to teach Film Studies and carefully chooses what movies to watch, has a sister who shares the same opinion about age as Speaker A. Speaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman. \nSpeaker B, who has kids and enjoys watching movies with them, enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy. Speaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\nSpeaker B, who used to teach Film Studies and carefully chooses what movies to watch, highlighted Eddie Murphy's success in cop roles in movies like Beverly Hills Cop trilogy and \"I-SPY.\"",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I did find Pulp Fiction funny, and as for the violence, I think it might be a bit too intense for kids to watch.",
        "previous_summary": "Speaker B has kids and enjoys watching movies with them.\nSpeaker B allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s.\nSpeaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences."
    },
    {
        "utter_id": "e32-s5-t6",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?",
        "memory_text": "Speaker A has a strong connection to jello, particularly cherry flavor, due to their grandma making it at family dinners. This causes Speaker A to have a grandmother who teaches them various jello recipes. Speaker A learned how to make jello from their grandma, turning it into a family tradition. Speaker A suggests that Speaker B can consider their grandmother as a surrogate grandma for learning jello recipes.",
        "speaker": "Speaker A",
        "raw_prediction": "Skiing has been great! It's a fun way to spend time together. How about you, any fun activities planned with your kids?",
        "previous_summary": "Speaker B recently quit their job at Cisco to pursue snowboarding.\nSpeaker A loves boating and water sports, mentioning that they are better at water skiing than wakeboarding.\nSpeaker B expresses interest in trying water skiing next.\nSpeaker A has been water skiing for 15 years and has 3 kids who also water ski.\nSpeaker B is excited to join Speaker A's family for a water skiing trip and wants to learn from Speaker A's kids."
    },
    {
        "utter_id": "e33-s5-t3",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?",
        "memory_text": "- Speaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop. As a result, Speaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\n- Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Consequently, Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\n- Speaker A prefers tamer video games and is not a fan of horror movies. This leads to Speaker A being hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. In response, Speaker B mentions that Resident Evil can be scary and provides some tips for playing it.",
        "speaker": "Speaker B",
        "raw_prediction": "How about trying out a game like Stardew Valley or Minecraft? They're more relaxed and less intense compared to Resident Evil.",
        "previous_summary": "Speaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop.\nSpeaker A does not play video games often but may consider trying them.\nSpeaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\nSpeaker A prefers tamer video games and is not a fan of horror movies.\nSpeaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\nSpeaker A and Speaker B both enjoy playing video games in their free time.\nSpeaker B is interested in trying the Jurassic Park game.\nSpeaker A enjoys playing the Jurassic Park game but mentions its lack of multiplayer and outdated graphics.\nSpeaker A and Speaker B plan to meet next week Friday at 6 pm to play games and order pizza."
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...",
        "memory_text": "Speaker A and Speaker B enjoy visiting the zoo and discussing hobbies and interests. Speaker B's girlfriend loves pandas and penguins at the zoo, and they go there regularly. Speaker A has been to the zoo before and likes seeing exotic birds. Speaker A prefers cockatoos over kittens as pets. \nSpeaker A's sister recently got married, which was exciting for them. Speaker A enjoys pandas and penguins at the zoo and goes with their sister. This caused Speaker A's sister to become a dog person with a yellow lab. Speaker B is willing to be a cool uncle to his sister's future children but does not want kids of his own. \nSpeaker B, who has a cat that recently had a kitten, also enjoys visiting the zoo. Speaker A enjoys pandas and penguins at the zoo and goes with their sister. This causes Speaker A's sister to become a dog person with a yellow lab. Speaker B is open to being a cool uncle to his sister's future children but does not want kids of his own.",
        "speaker": "Speaker A",
        "raw_prediction": "That's a great idea! I'll have to plan a trip with her soon.",
        "previous_summary": "Speaker A works at a local fast-food restaurant to pay bills and enjoys reading and gardening.\nSpeaker A's sister recently got married, which was exciting for them.\nSpeaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\nSpeaker A's sister is a dog person with a yellow lab.\nSpeaker A has a sister who owns a corgi."
    },
    {
        "utter_id": "e35-s5-t10",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?",
        "memory_text": "Speaker A works at a coffee shop that their mom owned, which is why they plan to get a portrait of their father's face next to a slogan they already have tattooed on their chest.\nSpeaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father, and is saving up for their next tattoo at the coffee shop.\nSpeaker A's favorite tattoo is the one dedicated to their late father, saying \"for you I shall live\", and they plan to get a portrait of their father's face next to a slogan they already have tattooed on their chest.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been working on a mural project in the city, combining different art styles. It's been a great way to express myself creatively.",
        "previous_summary": "Speaker A loves the show Friends and enjoys visiting graffiti-filled places.\nSpeaker A and Speaker B have a conversation about their personal interests and trips they have taken for work."
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "Speaker A is interested in animals, specifically raccoons and bearded dragons. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather. \nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B has been taking care of the raccoon for over a month and is interested in training it. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.",
        "speaker": "Speaker A",
        "raw_prediction": "I've thought about adopting a dog, but my work keeps me pretty busy. Maybe someday when things calm down a bit.",
        "previous_summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker A fosters dogs and is used to them coming and going."
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?",
        "memory_text": "Speaker B's fascination with animals allows them to understand Speaker A's comparison of their grandchildren to animals. This is because Speaker A's grandchildren are old enough to entertain themselves with technology or watching TV. Additionally, Speaker A enjoys watching movies with their grandchildren. Speaker B, on the other hand, has a young son and finds solace in reading books, especially those about animals. This interest in animals is shared with Speaker A, who mentions watching movies with their grandchildren.",
        "speaker": "Speaker A",
        "raw_prediction": "Actually, yes! There's a movie adaptation of the book I'm reading. It's quite thrilling!",
        "previous_summary": "Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.\nSpeaker B has a son and enjoys reading books, particularly about animals.\nSpeaker A watches Netflix shows rated over 3.5 stars after running out of things to watch."
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?",
        "memory_text": "- Speaker A recently visited a hair salon and now has a kitten from their cat, enjoying taking them on trips. Speaker A used to leave their cats with a friend while traveling, but now they bring the kitten along.\n- Speaker B loves dogs, yet Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels. Speaker A used to leave their cats with a friend while traveling, but now they bring the kitten along.\n- Speaker A has a cat that recently had a kitten and mentions having a Mini car, smaller compared to Speaker B's Subaru. Speaker A changed from having a Subaru and a cat named Ginger to considering naming a new kitten Marmalade.",
        "speaker": "Speaker A",
        "raw_prediction": "The weather is perfect for iced tea, not too hot or too cold. I might just enjoy a glass with Pumpkin lounging by my side.",
        "previous_summary": "Speaker A is from a city known for great iced teas and prefers unsweetened iced tea.\nSpeaker A enjoys drinking tea and water.\nSpeaker A lives on the Moon, where it is cold with very little traffic."
    },
    {
        "utter_id": "e39-s5-t5",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? ",
        "memory_text": "Speaker B recently divorced their wife and loves to scuba dive in Hawaii when not working. Speaker A is scared of sharks but finds the idea of going into a steel cage with them interesting. Speaker A finds it amusing that Speaker B prefers animals to humans. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n\nSpeaker B recently divorced their wife and loves to scuba dive in Hawaii when not working. Speaker B has two pet snakes named Hansel and Gretel. Speaker A finds it amusing that Speaker B prefers animals to humans. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.\n\nSpeaker A is a student planning to go to college next year and wants to study neuroscience. Speaker A does not have any pets and expresses an interest in scuba diving. Speaker B has an interest in diving and is planning to take neuroscience classes using the GI Bill. Speaker A is interested in scuba diving and neuroscience, with experience in a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": "I wish I could, but I don't think most dorms allow pets. I'll have to find a way to visit Hansel and Gretel during breaks.",
        "previous_summary": "Speaker A is a student planning to go to college next year and wants to study neuroscience.\nSpeaker B has two pet snakes named Hansel and Gretel."
    },
    {
        "utter_id": "e40-s5-t5",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?",
        "memory_text": "Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout. Speaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\nSpeaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat. Speaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker B",
        "raw_prediction": "The last camping trip I went on was to a national park nearby. It was an amazing experience being so close to nature and disconnecting from the busy world for a while.",
        "previous_summary": "Speaker A recently gave birth to twins and is a stay-at-home mom.\nSpeaker A wants more children and feels lonely due to their husband's frequent traveling."
    },
    {
        "utter_id": "e41-s5-t10",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.",
        "memory_text": "Speaker A is pursuing an athletic training degree in college, teaching jiu-jitsu, and is lactose intolerant. \nSpeaker A is enrolled in a class on the history of martial arts and is majoring in athletic training. \nBoth Speaker A and Speaker B are interested in martial arts and enjoy learning new things.",
        "speaker": "Speaker A",
        "raw_prediction": "London has some great food options. Donairs sound delicious, I'll have to check them out next time I visit!",
        "previous_summary": "Speaker A has never been out of the United States and thinks it would be nice to visit England.\nSpeaker A is interested in trying new restaurants, mentioning Taco Bell as their favorite.\nSpeaker B enjoys fancy restaurants and mentioned Sufi as their favorite in London."
    },
    {
        "utter_id": "e42-s5-t4",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?",
        "memory_text": "Speaker B is looking to redecorate their house and is considering adding more colorful elements to the room to make the purple sofas work. Speaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture.\nSpeaker B regrets their green and purple color scheme, recently purchased purple sofas for their home, and is willing to give away their purple furniture.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets and plans to meet up with Speaker A to discuss the furniture exchange. Speaker A has devices to keep bugs away and offers to share the product names with Speaker B.",
        "speaker": "Speaker A",
        "raw_prediction": "I got my patio furniture from a local store that had a great sale. I can share the details with you when we meet up.",
        "previous_summary": "Speaker B is looking for furniture shop to buy furniture, has two dogs, and works near a mall.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets.\nSpeaker A and Speaker B are discussing furniture and home decor choices.\nSpeaker B recently purchased purple sofas for their home.\nSpeaker B is considering adding more colorful elements to the room to make the purple sofas work.\nSpeaker A is looking to redecorate their house and likes purple furniture.\nSpeaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\nSpeaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture."
    },
    {
        "utter_id": "e43-s5-t11",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. \nSpeaker A: That's a good idea! I definitely haven't seen enough of them. Should we bring anyone else along on our trip?",
        "memory_text": "Speaker A's mother being a pediatrician causes Speaker A to have kids and be familiar with Greek mythology. This leads to Speaker B and their kids being excited about their upcoming trip to Greece. \nSpeaker B enjoying being outside and reading Star Wars novels is the same topic as Speaker B being excited about visiting Greece for the first time and loving Athena, considering her a perfect goddess for a librarian. This leads to Speaker B planning a trip to Greece in the next three months with a family of five, recommending visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece. \nSpeaker B wanting to bring three kids causes Speaker A to have kids and be familiar with Greek mythology. This makes Speaker A want to travel around Europe, visiting capital cities of each country, and react by booking a plane ticket to Rome on a whim, leaving in two weeks.",
        "speaker": "Speaker B",
        "raw_prediction": "We could invite some friends or family to join us on our European adventure. The more, the merrier!",
        "previous_summary": "Speaker A has a dog named Wylie.\nSpeaker B has three kids.\nSpeaker A and Speaker B both enjoy reading and are librarians.\nSpeaker A has traveled around Europe before, visiting capital cities of each country.\nSpeaker A's favorite cities from the trip were Rome, Berlin, Madrid, and Helsinki.\nSpeaker A enjoys traveling but prefers not to do it alone.\nSpeaker B is planning to leave for a trip later in the summer, likely a month before school starts.\nSpeaker A hasn't planned their trip out yet but is open to suggestions."
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.",
        "memory_text": "Speaker B has run a marathon before and found it tough but rewarding. This experience led Speaker A to seek advice on how to recover from marathon training. Speaker A then invited Speaker B to run together and train for the Alps marathon, offering motivation and planning to meet at the beach at 0600. Speaker B got into motivational speaking because they needed it themselves to battle depression and anxiety, which was suggested by Speaker A to combine with something more active to avoid dwelling on negative thoughts. Speaker B, who travels frequently for work and misses their wife and kids, also finds solace in fishing and the outdoors, similar to their background in San Francisco.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll definitely need those motivational quotes at 4 am to get me out of bed for our training sessions. Looking forward to pushing through the tough moments together.",
        "previous_summary": "Speaker B is a motivational speaker who travels to schools and conferences to give pep talks.\nSpeaker B's job involves motivating people to be successful and follow their dreams.\nSpeaker B got into motivational speaking because they needed it themselves to battle depression and anxiety.\nSpeaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600."
    },
    {
        "utter_id": "e45-s5-t10",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.",
        "memory_text": "Speaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality. Speaker A plans to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip. Speaker A applied to work at a grocery store near a hiking trail.\n\nSpeaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality. Speaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite. Speaker A and Speaker B have gone hiking together before and plan to meet up for another hike. Speaker A suggests bringing water for the hike and mentions having a picnic at the top of the mountain.\n\nSpeaker A does not care about voting and plans to send their parents a postcard. Speaker A is looking for a job and new camping gear, specifically a hammock. Speaker A will use the money earned from the store to buy the hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": "I've thought about that. I plan to set up my hammock in a safe spot and not too far from the house, so I'll be cautious. Plus, I can always set an alarm to make sure I wake up on time.",
        "previous_summary": "Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\nSpeaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\nSpeaker A is looking for a job and new camping gear, specifically a hammock.\nSpeaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail.\nSpeaker A has a portable hammock for the hike and asks if Speaker B will bring theirs.\nSpeaker A decides not to bring the hammock due to extra weight in their bag."
    },
    {
        "utter_id": "e46-s5-t8",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?",
        "memory_text": "Speaker A suggests that Speaker B's kids could try milking cows on the farm, which Speaker B finds amusing. They then discuss different strategies for playing the lotto and the potential outcomes if they win.\n\nSpeaker A and Speaker B both bought lotto tickets for a big jackpot.\n\nSpeaker A, who has never been to college and values the peaceful life of working on the farm, suggests that Speaker B and their family could stay over at the farm after the concert. Additionally, both speakers dream of having a city and country house or a summer and winter home.",
        "speaker": "Speaker A",
        "raw_prediction": "It really does sound like a dream come true. Having the best of both worlds would be amazing.",
        "previous_summary": "Speaker B is not a fan of country music and comes from a family that focuses on their real estate company.\nSpeaker B expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm.\nSpeaker B appreciates the convenience of city living but also values what the country has to offer.\nSpeaker B is open to moving to the country to be further away from neighbors.\nBoth speakers dream of having a city and country house or a summer and winter home.\nBoth speakers acknowledge the pros and cons of city and country living."
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "Speaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend. Speaker A has two sons, one of whom has a girlfriend and the other is secretive and possibly gay. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next. Speaker A's sons will be coming for winter break from Europe. Speaker B's younger son would be jealous of Speaker A's sons' European tour. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I've heard a lot about her. I hope we'll get along well when I finally meet her.",
        "previous_summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker A's sons will be coming for winter break from Europe."
    },
    {
        "utter_id": "e48-s5-t11",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?\nSpeaker A: No, I had a cousin that I went with.  We stayed in a hotel in Miami too and I got so sunburned on the beach!  I'm sure the art museum will be good if it isn't too crowded.  Was your concert crowded?\nSpeaker B: It was so crowded, but my older brothers went with me and kept me from getting squished. Make sure you wear sunscreen when you visit the beach this time!\nSpeaker A: Yes, I know to put on SPF 75 this time!  So what is the art museum in Sao Paulo like?",
        "memory_text": "Speaker B, who has 2 older and 1 younger brother and whose father used to be a farmer, was born in Brazil, specifically in San Paulo. This is why Speaker B recommends visiting the Museum of Art of São Paulo in the city. In response, Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend. \n\nSpeaker B, who has 2 older and 1 younger brother and whose father used to be a farmer, was born in Brazil, specifically in San Paulo. This connection leads to Speaker A being interested in music concerts and planning a trip to Sao Paulo, ultimately causing Speaker A to plan a visit to the Museum of Art of São Paulo next week with their boyfriend. \n\nSpeaker A's love for Disney music is a common topic with Speaker B, who enjoys living in the city for the accessibility to food and live music. This shared interest leads Speaker B to recommend visiting the Museum of Art of São Paulo in the city, resulting in Speaker A planning to visit the museum next week with their boyfriend.",
        "speaker": "Speaker B",
        "raw_prediction": "The art museum in São Paulo is absolutely stunning. You'll love the variety of galleries and the sculpture garden outside. It's definitely worth a visit!",
        "previous_summary": "Speaker B recommends visiting the Museum of Art of São Paulo in the city.\nSpeaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend."
    },
    {
        "utter_id": "e49-s5-t10",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?\nSpeaker A: I prefer chicken to beef. I pair it with beef fajitas andI think it's great to have with a glass of merlot. Do you like wine?\nSpeaker B: You're making me hungry!  Yes, I do love wine.  As a matter of fact, I used to live in the Bordeaux region in France, so my favorite wine is Bordeaux wine.  But I also love champagne and cognac.\nSpeaker A: Haha, I know right? I lived in the Champagne region for a bit! Always wanted to go to Bordeaux. How was it there?\nSpeaker B: I didn't know that you also lived in France for a while!  I love French food, especially the bread and fruit pastries.  Living in Bordeaux was fun!  I had the chance to visit all the prehistoric caves with paintings in the Southwest region of France.  Plus, Spain was just a few hours away by train, so I visited Spain quite a few times as well.  Oh, the good old times.  If only I were this excited about my career!",
        "memory_text": "Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters - (SameTopic) - Speaker A loves animals, especially puppies, and visits shelters in every city they go to.\n\nSpeaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat - (Want) - Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.",
        "speaker": "Speaker A",
        "raw_prediction": "It sounds like you had a great time in France! Visiting Spain often must have been amazing. What's stopping you from being excited about your career now?",
        "previous_summary": "Speaker B is a 26-year-old workaholic who is unsure about their career and doesn't have strong opinions on puppies.\nSpeaker B is interested in trying different careers and is considering becoming a chef for Speaker A who loves Mexican food and seafood.\nSpeaker B is interested in becoming a chef but hasn't had the time to apply for jobs.\nSpeaker B's current job keeps them busy with little free time, affecting their social life.\nSpeaker B is working on a project to build their resume and is unsure about the type of work they want to do."
    }
]