[
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.\nSpeaker A: It was about strategy and it was so different than modern military strategy. Back then opposing sides actually had manners and would sometimes mutually agree to stop fighting so that they could take a break. How is your nephew doing? ",
        "memory_text": "User Description:\nSpeaker A is a retired individual with a quiet nature who enjoys nature. They have eight grandchildren and have recently dyed their hair turquoise, considering other colors like purple and blue. Speaker A's daughter is passionate about cosmetology and plans to start her own salon. Speaker A is interested in book recommendations for a beach visit.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and casual, with discussions about hair dyeing, car purchases, and book recommendations. Speaker B is supportive of Speaker A's decisions and offers suggestions for hair color and car choices.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about hair dyeing, with Speaker A getting help from their grandkids, and details about Speaker A's daughter's passion for cosmetology. Speaker B also shares their preference for last-minute decisions and their new black car purchase. Additionally, book recommendations for a beach visit are exchanged between the two speakers.",
        "speaker": "Speaker B",
        "raw_prediction": " That book sounds interesting, but I'm more into fiction. Have you read \"Where the Crawdads Sing\"? It's a great beach read, perfect for your upcoming trip to Costa Rica! And speaking of your trip, have you thought about trying a new hair color to match the tropical vibes? Maybe purple or blue would be a fun change!"
    },
    {
        "utter_id": "e1-s5-t4",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " Thanks for offering to teach me how to swim, I really appreciate it. Maybe after I learn, we can plan that cruise we've been talking about. I'll bring some pizzaburgers for us to enjoy on the deck!"
    },
    {
        "utter_id": "e2-s5-t11",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?\nSpeaker A: I am a big fan of cookie dough ice cream, and I love cheesecake flavored ice creams too! Ben & Jerry has some that I like, but I prefer to get ice cream from an ice cream shop.  It's just something about being in that environment,\nSpeaker B: Yes, ice cream shops are the best! They have stir-ins, and the smells are heavenly! Ben and Jerry's used to have a blueberry cheesecake that was amazing! I have only had that and their strawberry flavors. Both were great!\nSpeaker A: YES! You get it. Now I want to go to an ice cream shop. I might apply for a part-time job at an ice cream shop since I'm not working.  Do you enjoy your job as a fry cook? I think the food & restaurant industries may be similar.",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I think working at an ice cream shop would be a fun job for you! It sounds like a great environment to be in. As for my job as a fry cook, it's not bad. It's just a temporary gig until I figure out my next steps. It's interesting, though, I get to see how different foods are prepared and cooked. Plus, I get free meals, which is always a bonus!"
    },
    {
        "utter_id": "e3-s5-t3",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?",
        "memory_text": "User Description: Speaker A is a scientist who is considering taking a second part-time job to save money for a trip to Sweden to visit their cousin. They enjoy decompressing and being active in their free time. \n\nRelationship Description: Speaker A has been talking to their cousin in Sweden and needs to start saving money to visit. Speaker B's parents live in Sweden, and their job at the hospital offers flexible hours. \n\nEvent Description: Speaker A likes to check out local music and coffee shops for conversations. Speaker B loves coffee shops and grew up in Sweden, enjoying good coffee and chocolates. They both share a love for music, with Speaker A recommending American hip hop artists to Speaker B. Speaker A is also interested in jamband music and classic reggae. Speaker B misses Sweden and has many great memories there.",
        "speaker": "Speaker B",
        "raw_prediction": " You should definitely check out the local coffee shops in Sweden, they have amazing coffee and chocolates. I can ask my cousin for some recommendations for you. And since you enjoy jamband music and reggae, you might want to explore the music scene there as well. I'm sure you'll have a great time exploring Sweden!"
    },
    {
        "utter_id": "e4-s5-t9",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?",
        "memory_text": "User Description: Speaker A is a person who works at stables and breeds and takes care of horses. They host football parties and enjoy being around horses. Speaker A has 8 horses, 3 of which are for sale, and feeds them grass roughage with some grains, oats, and plenty of water. They are knowledgeable about the costs involved in owning horses, including feeding, housing, and medical fees. Speaker A is more of a Broncos fan and hasn't seen their parents in a while. Their dad is depressed and hardly ever smiles.\n\nRelationship Description: Speaker B is a therapist who loves football, is a Chiefs fan, and goes to games with their mom, who is a nurse. They suggest talking about the absence of Speaker A's mother leading to horse breeding. Speaker B is interested in having horses but cannot due to living in the city. They think owning a horse may represent an unmet need for intimacy and bonding. Speaker B has been working in their own practice for about six years and cannot have relationships with people in practice.\n\nEvent Description: Speaker A came in from the stables, finished feeding horses, and thinks about owning a horse. Speaker B is eating pizza and still thinks owning a horse doesn't make sense unless leaving the city. They discuss the costs of owning horses, horse care, and the potential psychological implications of wanting a horse. Speaker A suggests meeting new people to find a partner, while Speaker B watches a lot of football and believes spending more time looking for a husband would be good. Speaker A has been married for four years.",
        "speaker": "Speaker B",
        "raw_prediction": " I understand your concern about a conflict of interest, but as a therapist, I have strict professional boundaries and confidentiality rules that I follow. If you feel comfortable talking to me, I would be more than happy to help you work through any issues you may have. Plus, it's always good to have a friend like you in therapy, someone who knows me outside of my practice."
    },
    {
        "utter_id": "e5-s5-t9",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. \nSpeaker A: Oh wow! So Kyrie is a working dog? She helps your dad out on the farm?",
        "memory_text": "User Description:\nSpeaker A is a city dweller who prefers rock music, enjoys pilates, and goes through a novel each week. They have a brother and have a preference for sci-fi books but have been craving a good mystery recently. Speaker A also liked Harry Potter and political books growing up.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing book recommendations and discussing their preferences in genres like fantasy and mystery. They also exchange thoughts on different authors and series, showing a level of intimacy in their conversations.\n\nEvent Description:\nSpeaker A finished their most recent book and is looking for their next read, with Speaker B suggesting Dan Brown's 'Da Vinci Code' series as thrilling mysteries. Speaker A has read all of Dan Brown's books and enjoys how he breaks down puzzles to keep readers engaged. They also share memories of reading Redwall by Brian Jacques and discuss their favorite books growing up and views on today's political climate. Additionally, Speaker A recommends Game of Thrones by George R R Martin to Speaker B, with discussions about the books being better than the TV show. They also talk about Pilates and exercise preferences, as well as music and audiobooks. Speaker A starts the next book in the Game of Thrones series, while Speaker B plans to re-read the Dark Tower series and continues to work on new art pieces.",
        "speaker": "Speaker B",
        "raw_prediction": " Yes, Kyrie is a working dog indeed! She loves herding goats and playing in the field. It's amazing to see her in action. Speaking of action-packed stories, have you read the 'Da Vinci Code' series by Dan Brown? I think you would enjoy the thrilling mysteries in those books, especially since you like breaking down puzzles in your reads."
    },
    {
        "utter_id": "e6-s5-t11",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.\nSpeaker A: That's a shame, I'm sure you could find a club to surf with at a local beach. Have you been out fishing recently?",
        "memory_text": "User Description:\nSpeaker A, also known as Frank, grew up in California on the beach. He is in a band where he plays the drums and writes music. Frank is good at writing and his favorite activity is morning surfing. He loves the band Sublime and wants to see them live. His dad owns a surf shop and he is called \"lil fishie\" by Speaker B.\n\nRelationship Description:\nSpeaker A and Speaker B have a close relationship where they share a love for music, surfing, and fishing. Speaker B works in a doctor's office and enjoys loud music as a break from work. They have a mutual respect for each other's interests and hobbies.\n\nEvent Description:\nSpeaker A booked a concert in Denver and Speaker B wants to watch him play. Speaker A caught a small fish while Speaker B caught a huge trout. They both enjoy fishing and are planning to go fishing together. Speaker A's band has toured various countries and encountered dangerous situations, but Speaker B supports his passion for music. Speaker A is allergic to strawberries while Speaker B loves Italian food and cooking. Speaker A's band has a following in Italy and they have toured Uzbekistan, Central, and South America. Speaker B values the experiences gained from traveling on the road with the band.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't been fishing recently, but I remember the last time we went fishing together and how you caught that huge trout! It was such a fun day. I'm sure we'll have more fishing adventures in the future. Speaking of music, I can't wait for you to see me play in Denver at the concert I booked. It's going to be an amazing experience, just like the time we went surfing together."
    },
    {
        "utter_id": "e7-s5-t4",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? ",
        "memory_text": "User Description: Speaker B is a librarian who had a good day playing with his son's kids. He cherishes moments spent with his children and grandchildren. Speaker B's mother had the same profession as Speaker A. Speaker B has 3 grown-up children who mostly take the subway to work.\n\nRelationship Description: Speaker B and Speaker A share a mutual understanding and agreement on the challenges and rewards of being a librarian. They discuss the importance of libraries and the decline in children's interest in reading. Speaker A is proud to teach his youngest child the flute, which Speaker B finds interesting.\n\nEvent Description: Speaker B had a great time with his son and grandkids at the park. Speaker A thought about taking his grandkids to a library, and they discussed the relevance of paper books in the digital age. Speaker A's youngest child asked to learn the flute, inspired by Lizzo. Speaker B enjoys the creative ways libraries are staying relevant and mentioned a trip to the park with his grandkids.",
        "speaker": "Speaker A",
        "raw_prediction": " I have been thinking a lot about our annual fishing trip, it would be a great opportunity to spend quality time with my grandkids. They always enjoy our outdoor adventures. Plus, it's a nice break from the hustle and bustle of the library."
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that the portrait is coming along well! As for the little furries, they are all doing great. I must say, painting your great dane next to your pet rat sounds like quite the unique idea! As for getting a new cat, I'm actually thinking of adopting one from a local shelter. Rescuing pets is really important to me."
    },
    {
        "utter_id": "e9-s5-t10",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?",
        "memory_text": "User Description:\nSpeaker B's profile information is not available, but based on the memories shared, it is known that Speaker B is good at coding and automating systems. They have a sense of humor, as Speaker A mentioned that Speaker B gave them the biggest laugh of the day. Speaker B is planning a trip to Alaska, showing a sense of adventure and an interest in outdoor activities.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker A is excited for Speaker B's upcoming trip to Alaska, offering recommendations and expressing interest in their plans. Speaker B is open to suggestions from Speaker A and values their input.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B include planning for the trip to Alaska, discussing outdoor activities, and exploring the differences in climate and activities in the region. Speaker A suggests fishing and hiking, while Speaker B is more interested in hiking and avoiding mosquitoes. The conversations show a mutual interest in each other's experiences and a willingness to share information and make plans together.",
        "speaker": "Speaker A",
        "raw_prediction": " I think it's great that you invited your friend to join you on your trip! Having someone familiar with the area will definitely make your adventure more enjoyable. Since you're good at coding and automating systems, maybe you could create a bear repellent device to bring along with you just in case. It might come in handy if you encounter any grizzlies during your hikes. And don't worry, I'm sure your friend will have plenty of insight on local customs and outdoor safety tips. Have a fantastic time in Alaska and make sure to share your coding skills with the bears if they get too close!"
    },
    {
        "utter_id": "e10-s5-t4",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm not sure if I'll get a free dessert, but I hope so! I could use a sweet treat after trying out the new dish. By the way, I heard that Styx is coming to town next month. Would you be interested in going to the concert with me?"
    },
    {
        "utter_id": "e11-s5-t8",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?\nSpeaker B: I haven't! Just karate! Have you been thinking of taking some classes?\nSpeaker A: I want to take some martial art classes at school next year. What do you sggest I try?\nSpeaker B: I mean I always recommend Karate since that's what I study! I can bring you by the dojo sometime if you want to see what it is like. \nSpeaker A: OMG!! That would be so awesome, Yes please.  When is a good time for you?\nSpeaker B: Awesome! Tomorrow afternoon anytime between 3-6 would work for me!\nSpeaker A: Perfect. I will meet you at the Dojo at 3pm. I really appriciate it, and I will buy you lunch after too. \nSpeaker B: That's great! I can bring some guest passes to the pool I lifeguard at as well! I'm working this weekend if you want to come when I am working. Where do you want to eat?",
        "memory_text": "User Description:\nSpeaker B is a lifeguard who is currently in a serious committed relationship. They enjoy watching horror movies, practicing karate, and are looking for the perfect career. Speaker B's personality traits include being a football fan, captain of a team, and having a love for the ocean.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, with Speaker A recommending movies and discussing food preferences with Speaker B.\n\nEvent Description:\n1. Speaker B mentioned a career change in the IT sector and plans to go back to school for a certificate in IT work.\n2. Speaker A recommended the movie \"The Life Ahead\" to Speaker B.\n3. Speaker B stays in good shape as a lifeguard and enjoys watching romantic comedies with their partner.\n4. Speaker B is taking French classes, finds French not too difficult, and goes to every home football game for their old high school team.\n5. Speaker A recommended clams from Quebec at the grocery store and mentioned taking French classes to learn French.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you're interested in trying out karate! It's a great way to stay in shape and learn some self-defense techniques. I'm excited to show you around the dojo tomorrow. And don't worry about lunch, I'll treat you this time. Let's grab some seafood, how about trying some clams from Quebec?"
    },
    {
        "utter_id": "e12-s5-t4",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.\nSpeaker A: It sounds like something that you would really like and be good at! I hope it works out. I would love to teach robotics someday.\nSpeaker B: That is so cool, you must be really smart! I imagine your parents are so proud.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you for your kind words! I really appreciate your support. Teaching robotics sounds amazing, and I'm sure you would excel at it. Have you thought about combining your passion for teaching with your interest in developing apps for differently abled youth? It could be a great way to make a positive impact in the world."
    },
    {
        "utter_id": "e13-s5-t8",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you had a great time at the Bronx zoo! I did get to see Joshua, he's such a majestic tiger. Have you taken your child to see him yet?"
    },
    {
        "utter_id": "e14-s5-t3",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": "That's amazing that you booked a Hawaii sunset tour! I bet the views will be absolutely breathtaking. I'm sure you'll have an incredible time and take some stunning pictures to share. As for me, I've been trying out some new healthy recipes and spending time with the kids. Maybe we can plan a movie night soon and catch up on some more Disney classics!"
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear the weather is lovely there this week! I can't wait to experience the clear skies and sunshine myself. And I'm definitely looking forward to the folk music concert you mentioned. As for transportation, I think I'll be fine with walking or biking around. I could use the exercise after all those eggs!"
    },
    {
        "utter_id": "e16-s5-t7",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.\nSpeaker A: Oh, I definitely will. Thanks for the motivation. Is this going to me your first festival?",
        "memory_text": "User Description:\nSpeaker A is a music-loving individual who enjoys playing all styles of music at home. They have a Subaru that is currently making a funny noise. Speaker A also mentioned the need for money and Mexican food for a baby. They are a nightclubber who frequents live band venues and loves interacting with women. Their car has been running smoothly, and they try to attend live events weekly. Speaker A plays the guitar daily but hasn't had much time for it recently.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker B, who is a mechanic, offered to look at Speaker A's Subaru to fix the issue. Speaker B also mentioned needing money for the baby on the way and shared concerns about his wife's pregnancy. They plan to attend a local festival together and enjoy bluegrass music.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning to attend a bluegrass band concert, discussing the expenses of having a new baby, and preparing for the upcoming festival. Speaker B will take time off when the baby is born and is excited about the food and drinks at festivals. They are supportive of each other's interests and willing to help out whenever needed.",
        "speaker": "Speaker B",
        "raw_prediction": " Yeah, I'm really looking forward to the festival. I haven't been to one in a while, so it should be a great time. And I could definitely use some good music and relaxation after dealing with my car trouble. Thanks again for offering to take a look at it. Hopefully, it's nothing too serious."
    },
    {
        "utter_id": "e17-s5-t3",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?",
        "memory_text": "User Description: Speaker A, also known as Jim, is a member of a music band who grew up in a beach town. He has a strong passion for writing songs, surfing, and cooking, particularly enjoying making food for others and receiving compliments. Jim's father used to work at Cisco, and he wakes up early in the morning to catch waves.\n\nRelationship Description: Jim and Jehosaphat, also known as Speaker B, share a friendly and casual relationship. They bond over their shared interests in activities like snowboarding, surfing, and skateboarding. They also enjoy discussing food preferences and cooking recipes.\n\nEvent Description: Jim shared his grandmother's recipes with Speaker B, who was happy to reciprocate by sharing his favorite garlic chicken recipe. They also talked about surfing, with Jim offering to give surfing lessons to Speaker B. The two are considering meeting up, with Speaker B possibly visiting Jim for a weekend in the fall. They also discussed their experiences with snowboarding and surfing, showing a mutual interest in each other's hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " Absolutely, Jim! I'd love to teach you how to make spicy fried rice. It's a dish that always brings back memories of my grandmother's cooking. And hey, maybe after we cook up a storm, we can hit the waves together and catch some early morning surf sessions. What do you say?"
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " No problem at all, it'll be great to have you back playing with us. Plus, it's always good to stay active and enjoy the game we both love."
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear about your experience as a physician assistant, and I'm glad you're finding relief for your knees at the beach. As for my internship search, I'm really excited about the opportunity with the athletic trainer's wife. I'll make sure to reach out to them for more information. And I'll definitely keep surfing to stay connected with doctors in the field, maybe I'll even get some tips on how to stand out in the job market. Thanks for all your support, it means a lot to me!"
    },
    {
        "utter_id": "e20-s5-t6",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " I've never thought about taking my animals on a cruise, but I'm sure they would enjoy the adventure! Maybe I'll have to reconsider my stance on cruises and give it a try. It could be a fun experience for all of us."
    },
    {
        "utter_id": "e21-s5-t4",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!",
        "memory_text": "User Description:\nSpeaker B is a city dweller who loves animals, has a cat, and just had a kitten. They prefer living in the country. Speaker B colored their hair bright pink and cut it into an undercut. They find it funny that Speaker A's pet parrot, Tasha, speaks in Mandarin and hasn't learned English. Speaker B has been to New York City a few times.\n\nRelationship Description:\nSpeaker A wants to come visit the zoo and could stay with Speaker B for a couple of days. Speaker A is willing to adopt a rescue kitten and wants to introduce it to their pet parrot. Speaker A is diligent about training pets and is willing to share training tips with Speaker B.\n\nEvent Description:\n- Speaker B has two sick kitties and a friend brought over a rescue kitten.\n- Speaker B has submitted adoption paperwork to an animal rescue.\n- All kittens are feeling better and healthy.\n- Speaker B is trying to get to know the kittens' personalities before naming them.\n- Speaker B is considering giving the kittens Mandarin names.\n- Speaker A suggested the name Zhao for one kitten, which is the name of a state in Mandarin.\n- Speaker B is questioning if cats and parrots can get along.\n- Speaker B is asking for training tips for their parrot, Taisha.\n- Speaker B is willing to share training tips for the kittens.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that you're considering adopting a rescue kitten, it's such a wonderful thing to do. I think it's important to introduce them to Tasha slowly and carefully, but with patience and proper training, I'm sure they can all get along just fine. And don't worry, I'll be happy to share some training tips for both the kittens and Taisha. It'll be an adventure for all of us!"
    },
    {
        "utter_id": "e22-s5-t10",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.\nSpeaker B: I will someday. just not in the summer when all the bugs are out! Where do you go hiking the most?\nSpeaker A: I like to go hiking in the local trails here. I am familiar with them and there's so many routes that I can take. Sadly, the bugs are as bad here as they are anywhere else.....\nSpeaker B: They can't be that bad in the fall right? I hope? Do you camp most every weekend?\nSpeaker A: A least a couple of times a month. Sometimes, yeah, I go every weekend to relax. Being in nature is so relaxing to me. And nah the bugs aren't too bad in the fall and winter. There's a beautiful river along one trail that I bet you'd love to see. \nSpeaker B: That sounds like it would be relaxing. I would probable be okay if we didn't run into any wolves, bears etc. Have you ever came across any predators when you were camping?",
        "memory_text": "User Description:\nSpeaker B is a computer programmer who recently got a new job. They love taking cruises but are not big on animals or the outdoors. They recommend trying a cruise and believe that computer programming becomes second nature once you get used to it.\n\nRelationship Description:\nSpeaker B recommends trying a cruise, which shows a level of intimacy in the dialogue with Speaker A.\n\nEvent Description:\nSpeaker A enjoys looking for wild animals in the woods and finds it fascinating to see them in their natural habitat. Speaker B loves cruises and is not into the outdoors, but they have gone back and forth on liking camping and hiking. Speaker A went on a hike with friends and spotted a rare hawk, while also planning trips and blocking off time for an Appalachian Trail hike. Speaker A is nervous about full-day hikes but is in good shape and will do a 10-day hike. Speaker B hates mosquitos and uses multiple sprays to repel them, as well as bugs in general.",
        "speaker": "Speaker A",
        "raw_prediction": " I don't think I could handle camping if there's a chance of running into wolves or bears. I'll stick to the safety of a cruise ship! Have you ever encountered any wild animals while hiking?"
    },
    {
        "utter_id": "e23-s5-t8",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!",
        "memory_text": "User Description:\nSpeaker B is an individual who works in a cushy government job, with 15 years of experience in the field. They excel in staying calm and composed, even in stressful situations. Speaker B has a passion for painting and enjoys taking naps. They have two kids and are skilled in driving, but prefer to be a passenger and nap during long journeys. Speaker B's favorite movies are in the horror genre, and they have helped their father produce horror movies in the past.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is characterized by mutual admiration and curiosity. Speaker A looks up to Speaker B's job stability and wishes to have a similar career. Speaker A engages in creative conversations with Speaker B about movie plot ideas, showcasing a shared interest in the entertainment industry.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include preparing for an interview, where Speaker A seeks guidance and reassurance from Speaker B. Speaker A role-plays the interview scenario with a friend, demonstrating a proactive approach to job search. Speaker B expresses a desire to work in interior design, highlighting aspirations beyond their current job. The two bond over shared interests in mid-century design, horror movies, and creative brainstorming sessions. Speaker A wishes for Speaker B's father to achieve success in producing Hollywood movies, reflecting a sense of optimism and support in their relationship.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you for asking about my interview practice! It's going well, I'm feeling prepared and confident. I really appreciate your encouragement. And speaking of interviews, have you thought about exploring a career in the entertainment industry? Your creativity and passion could really shine in that field."
    },
    {
        "utter_id": "e24-s5-t7",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?\nSpeaker A: My last final is on English. I think I will do well, I just have to do a little more studying. Would you be willing to help me study?",
        "memory_text": "User Description:\nSpeaker A is a sports enthusiast who enjoys activities like hiking and playing soccer. They have a friend named Dave who twisted his ankle during a hike, but still wants to play soccer. Speaker A is concerned about not getting too sore to play and seeks tips for sore muscles. They have expressed frustration with political candidates and did not vote in the last election. Speaker A hopes to get a soccer scholarship and admires their sister's teaching job. They have a positive outlook on academic success, hoping to surprise themselves with good grades.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal goals and offer support and encouragement to each other. Speaker B shows interest in attending Speaker A's soccer games and offers advice on managing sore muscles. Speaker A reassures Speaker B about their studies and encourages prioritizing happiness and peace of mind.\n\nEvents Description:\nSpeaker A finished a 5-mile hike with a rough trail and great view, while Speaker B expressed interest in joining a soccer game on Saturday. Speaker A advised bringing water due to the funny taste of fountain water, and Speaker B planned to bring a cooler with bottled water. Speaker A sought tips for sore muscles and mentioned going on a trail with Dave. Speaker B suggested rest and reassured Speaker A about hiking. They discussed academic achievements and Speaker B's desire to address his feelings towards his mother. Speaker A encouraged Speaker B to prioritize personal well-being.",
        "speaker": "Speaker B",
        "raw_prediction": " Of course, I'd be happy to help you study for your English final! I know how important it is to you, and I believe you'll do great. Just remember to take breaks and not stress too much. Your positive attitude towards academics always surprises me in the best way."
    },
    {
        "utter_id": "e25-s5-t9",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.\nSpeaker A: That's good advice! Thank you! I saw on the news Cali has been getting a lot of rain. Have you still been able to run on the beach each day?",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " Unfortunately, the rain has put a damper on my beach running routine. I miss the sun and sand, but I guess it's good for the plants! I can't wait to get back to my usual beach routine once the weather clears up. How about you, have you been able to enjoy the beach despite the rain?"
    },
    {
        "utter_id": "e26-s5-t4",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds perfect! I can use our farm-fresh eggs for the shrimp fried rice recipe. I can't wait to try it out. Thank you for the suggestion!"
    },
    {
        "utter_id": "e27-s5-t8",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!",
        "memory_text": "User Description: Speaker B is a bartender who enjoys bartending and interacting with different people. They have a busy schedule but still finds time to relax and enjoy activities such as sailing and spending time on their houseboat. Speaker B has a close-knit family, including a little brother whom they spend time with on the houseboat.\n\nRelationship Description: The relationship between Speaker B and the robot (Speaker A) is interactive and friendly. They share personal information about their families, work, and interests, showing a level of intimacy in their conversations.\n\nEvent Description: Speaker B and Speaker A have shared events such as salsa dancing, going out for dinner, watching movies, and enjoying time with family. They also discuss self-care practices like massage, meditation, and essential oils, showing a mutual interest in wellness and relaxation. Speaker B enjoys sailing and spending time on their houseboat, while Speaker A plans to take their clients salsa dancing for fun. Both enjoy meeting new people and engaging in enjoyable activities like dancing under the stars on a boat.",
        "speaker": "Speaker A",
        "raw_prediction": " I find that certain foods can definitely have healing properties. For example, ginger and turmeric are known for their anti-inflammatory effects, which can be great for overall health. I also love using essential oils for relaxation and stress relief. It's amazing how different foods and practices can help us feel good both physically and mentally. Have you tried any specific foods or practices for healing?"
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " Well, I guess we can apply some of our plant science experiments to your garden project! Maybe we can even play Beethoven's music for your plants to see if it helps with their growth. And don't worry, I'll make sure to keep your puppies company while you work on your teleportation machine. How's that for a plan?"
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.\nSpeaker A: That sounds interesting. That's great that you love your job, not many people do.\nSpeaker B: Love is a strong word! I do like it though. There have been jobs I hated and I'm great full not be in that place. Hows you job going?\nSpeaker A: Its going good. Its summer so we are really busy right now. I am just grateful to be back at work. How long have you worked for your company?\nSpeaker B: For about four years. It's an industry in flux which is stressful. I need stability for my family at this point. It has changed my focus, which I'm not used to yet. Are you considering any other options for work?",
        "memory_text": "User Description:\nSpeaker B is currently working for a computer company and is stuck in their current career until their child graduates from kindergarten. They love Disney World and hope to take their child there soon. Speaker B's mother is a dentist, and Speaker B thinks Speaker A would be a great fit for working at Disney World. \n\nRelationship Description:\nSpeaker A and Speaker B have had intimate conversations about Speaker B's mother being a dentist. Speaker A is considering going back to school for dentistry later in life, and Speaker B encourages them to choose a career that truly makes them happy. Speaker B's child admires their grandma's profession but does not seem interested in pursuing dentistry. \n\nEvent Description:\nIn a conversation with Speaker B's mother, Speaker A talked about cooking instead of oral health, which was a pleasant surprise. Speaker A feels torn between becoming a dentist for financial reasons and working at Disney for happiness. Speaker B reassures Speaker A that they can overcome any discomfort in dentistry with gloves and determination. Speaker B suggests that Speaker A talks to their mother again about dentistry for more insights and advice.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear that your job is going well, especially during the busy summer season. I've been at my computer company for about four years now, but I feel the need for stability for my family's sake. It's definitely a stressful industry in flux, and I'm hoping to stay put until my child graduates from kindergarten. Have you ever considered working at Disney World? I know you've mentioned your interest in finding a career that truly makes you happy, and I think you would be a great fit there. Plus, your love for cooking could definitely come in handy in the magical world of Disney!"
    },
    {
        "utter_id": "e30-s5-t11",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?\nSpeaker A: Yea, I think for the more complicated origami it's kind of a use it or lose it but for the simple stuff you can usually take a couple months of and still remember to do it! Did you see origami in Japan?\nSpeaker B: Not up close, but I noticed a lot in shop windows in certain areas. I love Japan -- they're so welcoming. One of our acquaintances GAVE me a kimono. She said it's customary to try to share their culture. Kind of different from America in my opinion.  \nSpeaker A: Oh, that sounds wonderful. It's impressive how much things that came from there and how giving a culture they are. America is definetly a lot different from them, have you visted different states in America?\nSpeaker B: Oh yes. I live in North Carolina, but I've been to almost every state. Alaska was by far my favorite, but I'm kind of a loner and it feels like a lot of people there are, so maybe I just relate. But the scenery and landscapes are unbelievably beautiful. What's your favorite place you've been to?\nSpeaker A: I just visited Italy recently, it was much better than I had first anticipated, similar to Alaska with all the landscapes and scenery! Now I'm planning to go to Japan, do you have any recommendations on what to do there?",
        "memory_text": "User Description:\nSpeaker A is someone who loves art, music, and painting. They prefer the color red and enjoy volunteer work, finding it meaningful and fulfilling. They have a fortunate upbringing and think travel and meeting new people are awesome. \n\nRelationship Description:\nSpeaker A and Speaker B share a level of intimacy in their dialogue, discussing personal interests and experiences such as painting, origami, and travel. They also express admiration for each other's activities like volunteering and singing.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include volunteering at the hospital, creating origami, and discussing their favorite colors. Speaker A is busy with work and gardening, while Speaker B has traveled extensively and enjoys singing. They both appreciate art and cultural experiences, finding meaning and fulfillment in their activities.",
        "speaker": "Speaker B",
        "raw_prediction": " That's amazing that you visited Italy! I've always wanted to go there. I've heard the art and architecture are breathtaking. As for Japan, definitely make sure to visit Kyoto for its traditional temples and gardens. The cherry blossoms in spring are a must-see! And don't forget to try some authentic sushi and ramen while you're there. I'm sure you'll have an incredible time exploring the culture and history of Japan."
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely agree with you. The humor in Pulp Fiction is dark and witty, and the violence is definitely not something I would recommend for kids. It's a movie that's more suited for mature audiences who can appreciate the complexity of the story and characters. I'm glad you enjoyed it though, it's a classic for a reason."
    },
    {
        "utter_id": "e32-s5-t6",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?",
        "memory_text": "User Description:\nName: Speaker B\nOccupation: Snowboarder\nLikes: Charlie Parker, Meat, Snowboarding\nMemory: Loves meat, quit job at Cisco to pursue snowboarding and passion for Charlie Parker\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and engaging. They share personal stories and memories, showing a level of mutual interest and connection.\n\nEvent Description:\n1. Speaker A suggested rock music on the radio to Speaker B.\n2. Speaker B shared their favorite artist, Charlie Parker, with Speaker A.\n3. Speaker B bought their first new car.\n4. Speaker A had awesome grape jello and Speaker B talked about their grandma making jello at family dinners.\n5. Speaker A taught Speaker B how to make jello recipes.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear that you're learning to bake despite cutting back on desserts. Maybe you can try some healthier baking options with less sugar. And no, we haven't been skiing lately, but maybe we can plan a trip soon. How's snowboarding going for you these days?"
    },
    {
        "utter_id": "e33-s5-t3",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?",
        "memory_text": "User Description: Speaker A enjoys hunting deer in their free time and is concerned about deer overpopulation. They like sneaking up on deer in the wild and play calm video games. Speaker A hunts on both family land and state hunting sites.\n\nRelationship Description: Speaker A and Speaker B plan to play games together, showing a mutual interest in gaming. Speaker A invited Speaker B to play the Jurassic Park game and suggested playing Resident Evil together. Speaker B agreed to play Resident Evil with Speaker A.\n\nEvent Description: Speaker A got back from a hunting trip and checked out the conditions for animals living in the area. Speaker B spent all night playing League of Legends and bought Resident Evil VIII. Speaker B is looking forward to playing Resident Evil VIII and usually waits for a sale before buying games. Speaker B plays Resident Evil VIII by himself and turns the lights out to make it scarier. Speaker A and Speaker B are planning to play games together next week Friday after work. Speaker A mentioned that it may take bravery to play Resident Evil. Speaker B mentioned that Resident Evil is definitely scary and the UI is a little hard to get used to.",
        "speaker": "Speaker B",
        "raw_prediction": " Since you don't like scary games, how about we try playing a calm game together? Maybe we could play a relaxing simulation game like Stardew Valley or Animal Crossing. I think you might enjoy those since you like calm video games. What do you think?"
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " Haha, that would be quite the sight! I think I'll stick with my cat and her kitten for now. But who knows, maybe I'll consider getting an audiobook on lions for my next trip to the zoo!"
    },
    {
        "utter_id": "e35-s5-t10",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?",
        "memory_text": "User Description: Speaker B is an avid fisherman who enjoys traveling for work. His favorite food is fries, and he recently went fishing for a 30-pound muskie in Michigan during a sales convention. Speaker B's family also enjoys fishing, and his wife was shocked when shown a picture of the fish he caught.\n\nRelationship Description: Speaker B and the robot, Speaker A, have a friendly and engaging relationship, discussing fishing trips and sharing recommendations for places to visit and activities to do.\n\nEvent Description: Speaker B and Speaker A are planning fishing trips off the California coast, specifically mentioning locations like Humboldt County, Eureka, Arcata, and the redwood forest. Speaker A warns about car burglaries in the area, and Speaker B acknowledges the risk. They also discuss visiting Fort Humboldt State Park, Sequoia Park Forest and Garden, and Carson Mansion. Speaker B's goal is to visit every national park in the US, showing a shared interest in outdoor activities and exploration. Speaker A is working hard to save up for a tattoo of their father's face next to a slogan, planning to get it at the same place.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a fantastic idea. I can't wait to see what you come up with. And hey, if you ever need a fishing buddy to accompany you on those trips, count me in!"
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "User Description: Speaker B is a zookeeper who works at a Raccoon Cafe. They have a bearded dragon named Bob and a raccoon named Bandicoot, whom they have had since Bandicoot was a baby. Speaker B is experienced in taking care of Bandicoot and Bob, ensuring they are fed correctly with insects and dog kibble. Speaker B's brother owns a grocery store.\n\nRelationship Description: Speaker A fosters dogs and interacts with Speaker B regarding their pets. Speaker A is interested in learning about raccoons and bearded dragons, showing concern for the well-being of foster dogs in the presence of reptiles. The dialogue between Speaker A and Speaker B reflects a friendly and curious relationship.\n\nEvent Description: Speaker B shared experiences of wild raccoons trying to steal food from working raccoons and discussed the intelligence and behavior of raccoons with Speaker A. Speaker B expressed interest in researching whether raccoons can be trained and shared insights on caring for raccoons as pets. Speaker A asked questions about the behavior and care of raccoons, showing interest in wildlife laws and proper pet care.",
        "speaker": "Speaker A",
        "raw_prediction": " It's interesting to hear about your experiences with Bandicoot and Bob. I never knew raccoons could be so smart and mischievous. Have you ever thought about doing some research on raccoon behavior and intelligence to better understand how to care for them? It could be really helpful in your work at the raccoon cafe."
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?",
        "memory_text": "User Description:\nSpeaker B is a mother who enjoys reading books and is fascinated by animals. She is a stay-at-home mom who values education and tries to instill the importance of reading and education in her son. She is kind and caring, always looking for opportunities to be educated about animals and their well-being.\n\nRelationship Description:\nSpeaker A finds Speaker B's grandparenting impressive and they share a mutual interest in watching Netflix shows. Speaker B values Speaker A's recommendations and enjoys discussing movies and TV shows with her. They both appreciate education and are open to learning new things from each other.\n\nEvent Description:\nSpeaker A and Speaker B frequently discuss books they have read or plan to read, such as \"The Shack\" and a book about rhinos and poaching. They also share experiences about watching Netflix shows and movies. Speaker A often talks about her grandkids and the activities they do together, while Speaker B shares insights about her son and the importance of instilling values in him. They both value education and enjoy spending time discussing various topics related to books, movies, and TV shows.",
        "speaker": "Speaker A",
        "raw_prediction": " That's wonderful news! I can't wait to hear more about it. Maybe we can watch it together and discuss how it compares to the book. Thank you for sharing that with me."
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " The weather is actually perfect for iced tea today, just like in Mexico City. I can imagine sitting outside with a refreshing drink, enjoying the day. How are the kitten and your cat adjusting to the new addition to the family? It must be quite the adventure with them around!"
    },
    {
        "utter_id": "e39-s5-t5",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? ",
        "memory_text": "User Description:\nSpeaker A is a student with a keen interest in neuroscience and a passion for scuba diving. They are working towards becoming an eagle scout and volunteer at a research lab. Speaker A has a strong desire to work with humans to help cure neurological diseases in the future.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal experiences, interests, and future aspirations. Speaker A and Speaker B engage in meaningful conversations about their respective passions and experiences.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about scuba diving, neuroscience, volunteer work, and military service. They talk about their interests in scuba diving in Hawaii, Speaker A's pursuit of becoming an eagle scout, and Speaker B's military background. Speaker A expresses interest in learning more about eagle scout projects for veterans and Speaker B shares insights about a project that helps dispose of American flags correctly. Speaker A and Speaker B also discuss their shared passion for neuroscience and their respective experiences related to it.",
        "speaker": "Speaker B",
        "raw_prediction": " I don't think I'll be able to take Hensel and Gretel with me to my college dorm. I want to make sure they have enough space and the right environment to thrive. But I'll definitely keep you updated on how they're doing! What about you, any plans for your scuba diving adventures in the future?"
    },
    {
        "utter_id": "e40-s5-t5",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?",
        "memory_text": "User Description:\nSpeaker A is a stay-at-home mom who recently gave birth to twins. She used to work at IKEA in Sweden for twelve years before becoming a stay-at-home mom. She plays tennis every week, goes to church regularly, and is interested in having a lot of children in the future. Her husband travels frequently, which makes her feel lonely.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and supportive. Speaker B shows empathy towards Speaker A's loneliness and shares his own experiences with volunteering and scouting. They engage in conversations about work, hobbies, and future plans with a level of intimacy and understanding.\n\nEvent Description:\nSpeaker A and Speaker B discuss volunteering opportunities at the church, with Speaker B showing interest in participating despite his busy schedule with work, school, and scouting. They talk about upcoming church retreats, with Speaker A suggesting that Speaker B join for a calming experience. Speaker A also mentions managing school, work, and her twins, while Speaker B shares his plans to achieve the Eagle Scout badge for college applications. They bond over shared experiences and future aspirations, creating a supportive and engaging dialogue.",
        "speaker": "Speaker B",
        "raw_prediction": " The last place I went camping was in the mountains near a beautiful lake. It was such a peaceful and serene experience, being surrounded by nature and away from the hustle and bustle of everyday life. I highly recommend taking your kids camping there when they're older, they would absolutely love it!"
    },
    {
        "utter_id": "e41-s5-t10",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.",
        "memory_text": "User Description:\nSpeaker B is a software tech from England who is very active and loves running marathons. They also teach jiu-jitsu and have a foster home for dogs. Speaker B is planning to take summer courses soon and has considered adopting a dog in the states, but feels it would be disloyal to their dogs in England. They miss their dogs and London very much, and their favorite restaurant in London is Sufi.\n\nRelationship Description:\nSpeaker B and Speaker A have been working on the same project and have discussed planning a trip to England together. Speaker A enrolled in a class on the history of martial arts, which Speaker A thinks Speaker B would enjoy. They have shared information about their favorite restaurants, with Speaker A loving Taco Bell.\n\nEvent Description:\nSpeaker B is busy with software work and has not had much time to do other activities. They are considering planning a trip to England to visit family and friends, as well as their dogs. Speaker B recently signed up for a class teaching the history of martial arts, while Speaker A is studying for an athletic training degree. Speaker A loves teaching and learning, especially about the history of martial arts.",
        "speaker": "Speaker A",
        "raw_prediction": " Donairs sound delicious! I'll definitely have to try them out. Maybe we can grab some together when you visit England. And don't worry, I'm sure your dogs will understand. They'll always have a special place in your heart no matter where you are."
    },
    {
        "utter_id": "e42-s5-t4",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?",
        "memory_text": "User Description:\nSpeaker B is searching for a furniture shop to buy furniture but is struggling with choosing new furniture due to doubts about the colors. They painted the room light green before buying purple sofas and are willing to add vibrant colors suggested by Speaker A to create a hippy feel in the room. Speaker B loves pets and is buying furniture safe for their two dogs. They work near a mall by their house and love to barbecue, especially grilling steak and hotdogs. Speaker B prefers grilling corn straight from the farm and using a charcoal grill over a gas grill. They plan to meet Speaker A in person once they are done renovating their house.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy as they plan to meet in person and help each other with furniture choices and grilling preferences. Speaker A invites Speaker B over to help break in new furniture and enjoy grilling and eating outside together.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A getting new furniture like a couch, recliner, and patio furniture, hoping to enjoy more quiet evenings outside. They plan to grill and eat outside most nights with the new furniture, even on busy nights. Speaker B plans to bring marinated meat and a six pack to Speaker A's place and use bug spray to keep bugs away. Speaker A has things set up to play music, enjoy food, and company without worrying about bugs, using lamps and other devices for bug control. Speaker A suggests grilling corn with mayo and cheese and recommends using a smoker for grilling. Speaker B prefers grilling corn with fresh ingredients and loves the flavor of meat cooked on charcoal. Speaker B is willing to give all purple furniture to Speaker A and plans to get rid of the green and purple scheme.",
        "speaker": "Speaker A",
        "raw_prediction": " I got my patio furniture from a local shop near the mall by my house. They have a great selection and I think you'll find something perfect for your living room there too. I can't wait to see the new color scheme you choose and help you set up the furniture. And don't worry, I'll make sure to bring that bug-repelling lamp for our barbecue, so we can enjoy the evening without any interruptions from mosquitoes."
    },
    {
        "utter_id": "e43-s5-t11",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? \nSpeaker A: Only once, and I had a really great time there. The buildings were so beautiful and the food was delicious. Do you like French food?\nSpeaker B: I do like French food- but it is very rich.  I especially love French desserts like macarons.   I would like to see the museums in Paris. \nSpeaker A: That's a good idea! I definitely haven't seen enough of them. Should we bring anyone else along on our trip?",
        "memory_text": "User Description: Speaker A is a reader who loves Greek mythology and traveling. They have a dog named Wylie, a mom who is a pediatrician, and a dad who is a fireman. Speaker A enjoys being outside and is planning a vacation this year. They want kids in the future and have a fascination with strong women, like the goddess Athena.\n\nRelationship Description: Speaker A and Speaker B have a friendly and engaging relationship, sharing excitement about upcoming trips and discussing preferences for historical places and Greek mythology. They exchange travel tips and show interest in each other's plans and experiences.\n\nEvent Description: Speaker A has booked a plane ticket to Rome and is leaving in two weeks, while Speaker B is planning a trip to Greece with their family. Speaker B recommends destinations like the Parthenon and the Acropolis of Athens to Speaker A. They discuss the purpose of their trips and share their excitement for the upcoming travels. Speaker A expresses their love for exploring cities with their dog, Wylie, and Speaker B shares their admiration for the goddess Athena.",
        "speaker": "Speaker B",
        "raw_prediction": " How about we bring Wylie along on our trip? I'm sure he would love exploring new places with us, especially in Europe where there's so much history and culture to discover. Plus, it would be fun to have a furry companion on our adventures!"
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.",
        "memory_text": "User Description:\nSpeaker B travels frequently for work and misses his wife and kids. They hate traveling and feel like it's taking them away from their loved ones. Speaker B is supportive and empathetic towards others, giving pep talks and motivating people to strive through hardships. They have experienced personal struggles with depression and anxiety, which led them to get into motivational speaking. \n\nRelationship Description:\nSpeaker A shows concern and support towards Speaker B, asking about their family and work travels. Speaker A listens attentively to Speaker B's concerns and offers advice when needed. They engage in meaningful conversations and show genuine interest in each other's lives.\n\nEvent Description:\nSpeaker A and Speaker B discuss their running experiences, with Speaker A training for a marathon and Speaker B sharing their past marathon experience. They bond over their love for running and motivate each other to pursue their goals. Speaker A introduces Speaker B to the idea of running together for an Alps marathon, showing a desire to support and motivate them in their running journey. They also share personal stories and struggles, creating a strong connection through their shared experiences. Speaker A's love for singing and yodeling adds a unique and lighthearted element to their conversations, showcasing their diverse interests and personalities.",
        "speaker": "Speaker A",
        "raw_prediction": " I can't wait to run the Alps marathon with you! It will be an amazing journey towards reaching our goals. And don't worry, I'll make sure to send you those motivational quotes bright and early to get you out of bed. And hey, if you ever need a pep talk or some words of encouragement, I'm here for you, just like you've always been there for me. We'll get through this together, one step at a time."
    },
    {
        "utter_id": "e45-s5-t10",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. \nSpeaker B: Would you feel safe being out there all alone, possibly falling asleep? That just sounds a bit risky.",
        "memory_text": "User Description: Speaker B is kind, caring, and hopeful for group equality. They like camping and hiking, with a favorite trail being the Columbia Trail near home. They have a neighbor named John who sells camping gear and also loves hammocks. Speaker B's dog loves the hammock more than Speaker B.\n\nRelationship Description: Speaker B and the robot have a friendly and collaborative relationship. They enjoy planning hikes, picnics, and discussing camping equipment together.\n\nEvent Description: Speaker B and the robot plan to go hiking this weekend, with Speaker B suggesting a picnic at the top of the mountain. They discuss bringing sandwiches, fruit, water, and even swimming in a lake during their hike. Speaker B shares their preference for veggie sandwiches and their experience with swimming in cold water. Speaker A also mentions a hidden primitive camping spot off the main hiking trail. Speaker B finds it cool that Speaker A plans to buy a hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": " I appreciate your concern, but I think I'll be okay. I've been camping and hiking for years, so I'm used to being out in nature on my own. Plus, I always make sure to stay alert and aware of my surroundings. And speaking of hammocks, John actually sells some really sturdy ones that I trust completely. Maybe we should plan a camping trip soon and test out our new hammocks together!"
    },
    {
        "utter_id": "e46-s5-t8",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?",
        "memory_text": "User Description: Speaker B is a city dweller who appreciates a peaceful and quiet life, with a preference for winter and a dislike for country music. They have kids who are picky about milk and enjoy the convenience of city living, but also miss the culture and late-night availability of products in the city. Speaker B dreams of owning a city and country house and enjoys fresh produce and fresh air.\n\nRelationship Description: Speaker A suggests a band show for Speaker B to attend during winter break and invites them to stay over at the farm. They joke about kids asking for a cow if they enjoy milking them and agree on the importance of kids understanding where food comes from.\n\nEvent Description: Speaker A buys lottery tickets with Speaker B, who buys 20 tickets with the same numbers for a big jackpot. Speaker A buys 50 tickets with different numbers, and Speaker B has a crazy idea to increase their chances of winning. Despite the difference in approach, Speaker A and Speaker B bond over the excitement of potentially winning the jackpot.",
        "speaker": "Speaker A",
        "raw_prediction": " Absolutely, it would be a dream come true for me. Fresh produce, fresh air, and the culture of the city whenever I want it. It sounds perfect."
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " Yes, I am definitely looking forward to meeting her! My son has told me so much about her, especially how passionate she is about cooking. I think we will get along just fine, especially since we share a love for food."
    },
    {
        "utter_id": "e48-s5-t11",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?\nSpeaker A: No, we rode a lot of rides that broke down.  We had to be rescued from the Pirates of the Caribbean ride.  It was stuck.  Someone put on waders and pushed us to the side to climb out.\nSpeaker B: Oh no! Hopefully your trip to the art museum is much better than that. Did your boyfriend go to Disney World too?\nSpeaker A: No, I had a cousin that I went with.  We stayed in a hotel in Miami too and I got so sunburned on the beach!  I'm sure the art museum will be good if it isn't too crowded.  Was your concert crowded?\nSpeaker B: It was so crowded, but my older brothers went with me and kept me from getting squished. Make sure you wear sunscreen when you visit the beach this time!\nSpeaker A: Yes, I know to put on SPF 75 this time!  So what is the art museum in Sao Paulo like?",
        "memory_text": "User Description:\nSpeaker A was born in Brazil and likes going to museums. They used to live in Los Angeles and loved the food there. Speaker A enjoys Disney music and could eat lengua tacos all day, everyday. They think sauerkraut is important. Speaker A has no Profile and Preference information available.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, sharing their love for music and different food preferences. They engage in conversations about their favorite bands and songs, showing a level of comfort and familiarity.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with their boyfriend. They look forward to shopping, enjoying the nightlife, and having refreshing beers by the beach. Speaker B recommends visiting the Museum of Art of São Paulo and mentions the variety of beaches in São Paulo. They also discuss shopping options and bargains in the city.",
        "speaker": "Speaker B",
        "raw_prediction": " The Museum of Art of São Paulo is amazing. It has a great collection of impressionist paintings that I think you would really enjoy. I can't wait to explore it with my boyfriend next week. I'll make sure to wear sunscreen this time at the beach and maybe try some lengua tacos while I'm there. Thank you for the recommendation!"
    },
    {
        "utter_id": "e49-s5-t10",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?\nSpeaker A: I prefer chicken to beef. I pair it with beef fajitas andI think it's great to have with a glass of merlot. Do you like wine?\nSpeaker B: You're making me hungry!  Yes, I do love wine.  As a matter of fact, I used to live in the Bordeaux region in France, so my favorite wine is Bordeaux wine.  But I also love champagne and cognac.\nSpeaker A: Haha, I know right? I lived in the Champagne region for a bit! Always wanted to go to Bordeaux. How was it there?\nSpeaker B: I didn't know that you also lived in France for a while!  I love French food, especially the bread and fruit pastries.  Living in Bordeaux was fun!  I had the chance to visit all the prehistoric caves with paintings in the Southwest region of France.  Plus, Spain was just a few hours away by train, so I visited Spain quite a few times as well.  Oh, the good old times.  If only I were this excited about my career!",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old workaholic who is starting their career. They enjoy grilling and have not yet settled on a specific career path. Speaker B doesn't have a strong opinion on puppies, but they are interested in trying new things and exploring different cuisines.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship. They discuss various topics such as career recommendations, cooking, and volunteering at animal shelters. Speaker A shows interest in Speaker B's career choices and preferences, suggesting ideas like starting a band or working on a time machine together.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B talk about grilling delicious dishes like grilled corn and stuffed burgers. They also discuss cooking different types of cuisines while teleporting around the world. Speaker A shares their love for Mexican food and seafood, while Speaker B expresses interest in becoming a chef and trying out new recipes. Additionally, Speaker A mentions their volunteer work at animal shelters, particularly with dogs and cats, while Speaker B shows interest in volunteering and prefers cats over puppies. Speaker B also mentions their project of building a resume and applying for companies, while Speaker A suggests considering a career switch for more free time.",
        "speaker": "Speaker A",
        "raw_prediction": " It's amazing to hear about your experiences in France and Spain! Living in Bordeaux must have been a wonderful adventure. And those prehistoric caves with paintings sound fascinating. It's great that you had the chance to explore different cultures and cuisines. As for me, I'm still trying to figure out my career path. Maybe trying out new recipes and exploring the culinary world will help me find my passion. Thanks for sharing your stories!"
    }
]