[
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.",
        "memory_text": "1. The child is supportive and caring towards the parent.\n2. Both the parent and child express love and support for each other.\n3. The Parent found hope and appreciated small moments even in difficult situations.\n4. The child is supportive and proud of their parent for making changes.\n5. The parent values independence and self-sufficiency.\n6. The Child finds the Parent's story inspiring.",
        "speaker": "Parent",
        "raw_prediction": "I'm glad to hear that, it means a lot to me to be able to listen and support you.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.",
        "memory_text": "1. Mentee is feeling overwhelmed with the college application process.\n2. The Mentee has been offered a job and has decided to take the job in the city.\n3. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n4. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n5. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n6. Mentee feels like they are running out of time and is worried about the upcoming SAT.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way when you're in a new place. Remember, building new friendships takes time and effort. You'll find your community soon enough, just give it some time.",
        "previous_summary": "The Mentor has been guiding and supporting the Mentee in their work for years.\nThe Mentee has been offered a job and has decided to take the job in the city.\nThe Mentor is supportive and praises the Mentee for their mature decision-making process.\nMentor emphasizes the importance of self-care for dealing with challenges."
    },
    {
        "utter_id": "e1-s5-t9",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.\nMentor: That's just a fear, Mentee. You can join clubs or organizations that interest you to meet like-minded people. You could also start volunteering around the city to meet new people.\nMentee: Those are good suggestions, Mentor. I'll consider joining a club or volunteering.\nMentor: And remember, it's also important to keep in touch with your old friends. You can schedule video calls or even plan a visit back home.\nMentee: That's true, I'll make sure to keep in touch. Thanks for the advice, Mentor.\nMentor: Anytime, Mentee. Is there anything else you want to talk about or any updates you'd like to share?\nMentee: Actually, I did make a new friend at work. We've been hanging out after work sometimes and it's been nice.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n3. The Mentee has been offered a job and has decided to take the job in the city.\n4. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n5. The Mentor is supportive and praises the Mentee for their mature decision-making process.\n6. The Mentee weighed the pros and cons of each option before deciding on the job in the city.",
        "speaker": "Mentor",
        "raw_prediction": "That's great to hear, Mentee! Building new friendships takes time, but it seems like you're already making progress. I'm glad you're feeling more settled in the city.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t7",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?",
        "memory_text": "1. Neighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.\n2. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n3. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n4. Neighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.\n5. Neighbors B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides.\n6. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, I remember that! It was quite the sight to see. Do you need any help with the yard work next time?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t9",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.",
        "memory_text": "1. Neighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.\n2. Neighbors B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides.\n3. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n4. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n5. Neighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.\n6. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.",
        "speaker": "Neighbors B",
        "raw_prediction": "Definitely, it's surprising how much of a workout mowing the lawn can be. I remember you mentioning that. We should definitely have some extra water on hand next time to stay hydrated.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t12",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.",
        "memory_text": "1. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n2. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n3. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n4. Neighbors B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides.\n5. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n6. Neighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks for letting me relax in your armchair that day. It was a nice break from the heat outside.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t14",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.\nNeighbors B: I feel the same way. We should plan something fun to do together.",
        "memory_text": "1. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n2. Neighbors A and B are on friendly terms and enjoy spending time together.\n3. Neighbor A enjoys spending time in Neighbor B's cozy home and wants to hang out more often.\n4. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n5. Neighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.\n6. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a great idea! Maybe next time we can work on mowing the lawn together and then relax in your cozy home.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t18",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.\nNeighbors B: I feel the same way. We should plan something fun to do together.\nNeighbors A: Absolutely. Hey, do you remember when I ripped off the tag from my shirt?\nNeighbors B: Yeah, your mom was pretty upset about that.\nNeighbors A: I didn't think it was a big deal, but she sure did. Do you ever have disagreements like that with your parents?\nNeighbors B: Sometimes, but not often. We have a pretty good relationship.",
        "memory_text": "1. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n2. Neighbors A and B are on friendly terms and enjoy spending time together.\n3. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n4. Neighbors A and Neighbors B are both neighbors who have known each other for years and have become good friends.\n5. Neighbors A and B have not seen each other in a while and are catching up.\n6. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's great to hear. It's important to have a good relationship with your parents. Family is everything.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t5",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n3. Co-worker B admires Co-worker A's resilience and positivity.\n4. Co-worker B appreciates Co-worker A's positivity and friendship.\n5. Co-worker B is supportive and willing to help in any way.\n6. Co-worker B commended Co-worker A for their bravery and willingness to help.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's okay, Co-worker A. I understand where you're coming from. Just remember, it's never too late to make things right and show your true intentions. Let's focus on finding a healthy way to express your feelings.",
        "previous_summary": "Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\nCo-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\nCo-worker A is described as positive and able to stay optimistic even in challenging situations, like the accident where they lost their hands and feet.\nCo-worker B appreciates Co-worker A's positivity and friendship."
    },
    {
        "utter_id": "e4-s5-t5",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n3. Co-worker B is supportive and glad that Co-worker A is okay.\n4. Co-worker B is glad to have been able to help Co-worker A and feels the trade worked out well for both of them.\n5. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n6. Co-worker A values their health to continue working at their best.",
        "speaker": "Co-workers B",
        "raw_prediction": "I appreciate your offer, it means a lot to me. Let's work together and support each other, that way we can both succeed.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t2",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?",
        "memory_text": "1. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\n2. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\n3. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.\n4. Classmates A has developed a crush on Classmates B, which Classmates B finds flattering.\n5. Both Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\n6. Classmates A and B are interested in biology and studying cells.",
        "speaker": "Classmates A",
        "raw_prediction": "I've really enjoyed our time together studying biology and talking about cells. I was wondering if you'd like to grab lunch together sometime and maybe explore more than just being study partners.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.",
        "memory_text": "1. Classmates A has developed a crush on Classmates B, which Classmates B finds flattering.\n2. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\n3. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.\n4. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\n5. Both Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\n6. Classmates A and B are interested in biology and studying cells.",
        "speaker": "Classmates A",
        "raw_prediction": "I apologize for the misunderstanding. I must have overheard something incorrectly. Let's focus on our biology project instead.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t6",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.",
        "memory_text": "1. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n2. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n3. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people.\n4. Neighbors B is excited and supportive of Neighbors A's new ability.\n5. Neighbors A and B are discussing the idea of having telekinetic abilities.\n6. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yeah, you're right. I'll have a chat with her about it later. Thanks for the advice!",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t9",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is excited and supportive of Neighbors A's new ability.\n4. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.\n5. Neighbors A enjoys trying new things, like new recipes.\n6. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.",
        "speaker": "Neighbors B",
        "raw_prediction": "You're welcome! Just remember that it's okay to prioritize your own well-being sometimes. Let me know how it goes with your mom.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t14",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is excited and supportive of Neighbors A's new ability.\n4. Neighbors A enjoys trying new things, like new recipes.\n5. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.\n6. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.",
        "speaker": "Neighbors A",
        "raw_prediction": "I've been feeling a bit overwhelmed with work lately, but trying out new recipes and cooking has been a great stress-reliever for me.",
        "previous_summary": "Neighbor A is feeling unfulfilled with their job and wants to make a bigger impact.\nNeighbor A is considering looking for a new job but is unsure of what they want to do.\nNeighbor A feels there is no room for growth or new projects at their current job.\nNeighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career."
    },
    {
        "utter_id": "e6-s5-t15",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is excited and supportive of Neighbors A's new ability.\n4. Neighbors A enjoys trying new things, like new recipes.\n5. Neighbor A is feeling unfulfilled with their job and wants to make a bigger impact.\n6. Neighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's exciting to hear! Your new skills and experiences from learning to cook could definitely open up some new doors for you. Have you thought about how you could incorporate your passion for cooking into your career aspirations?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t2",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?",
        "memory_text": "1. Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n2. Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings.\n3. Classmate A and Classmate B both enjoy socializing and going out to parties together.\n4. Classmates A is social and enjoys meeting new people.\n5. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep.\n6. Classmate B admires Classmate A's outgoing nature and wants to be more like them.",
        "speaker": "Classmates A",
        "raw_prediction": "I've been thinking about taking up a new hobby and maybe even joining a club or organization. I feel like it's time for me to step out of my comfort zone and really start living life to the fullest.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t6",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.",
        "memory_text": "1. Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n2. Classmate A and Classmate B both enjoy socializing and going out to parties together.\n3. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends.\n4. Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings.\n5. Classmates A and B are open to meeting for coffee again in the future.\n6. Classmates A is social and enjoys meeting new people.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad you're on board! I think with our combined skills and passion for socializing, we could really make this project successful. Let's make it happen!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?",
        "memory_text": "1. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.\n2. Neighbors B appreciates Neighbors A's handy skills.\n3. Neighbor A values their friendship with Neighbor B and wants to ensure it remains strong.\n4. Neighbors B offers help and support to Neighbors A in the situation.\n5. Neighbors A and B are observing wood that appears to be freshly cut from a tree.\n6. Neighbors A and B discuss the possibility of someone in the neighborhood using the wood for a project.",
        "speaker": "Neighbors A",
        "raw_prediction": "Neighbors A: Thanks for noticing! Actually, I've been doing a lot of yard work lately. Speaking of which, have you seen that wood near our backyard?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t3",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.",
        "memory_text": "1. Neighbors B offers help and support to Neighbors A in the situation.\n2. Neighbors B appreciates Neighbors A's handy skills.\n3. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.\n4. Neighbor A values their friendship with Neighbor B and wants to ensure it remains strong.\n5. Neighbors A and B discuss the possibility of someone in the neighborhood using the wood for a project.\n6. Neighbors A and B are observing wood that appears to be freshly cut from a tree.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's great to hear! Your hard work is definitely paying off. If you ever need a spotter or someone to work out with, just let me know.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.",
        "memory_text": "1. Classmate B is supportive and encourages Classmate A to pursue their dream.\n2. Classmates A appreciates the support and encouragement from Classmates B.\n3. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n4. Classmates B is supportive and encourages Classmates A in their business venture.\n5. Classmate B offers to support and potentially collaborate with Classmate A in the future.\n6. Classmates A is willing to work hard and learn the necessary strategies for business success.",
        "speaker": "Classmates B",
        "raw_prediction": "That's wonderful that you found something you're passionate about and have a strong foundation in. Have you ever thought about starting your own carpentry business?",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t4",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?",
        "memory_text": "1. Classmate B is supportive and encourages Classmate A to pursue their dream.\n2. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n3. Classmates A appreciates the support and encouragement from Classmates B.\n4. Classmate B offers to support and potentially collaborate with Classmate A in the future.\n5. Classmates B is supportive and encourages Classmates A in their business venture.\n6. Classmates A has had a business idea for a while and is now taking steps to make it a reality.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, I recently finished a custom-built bookshelf for a client. It was challenging, but I loved every minute of it. Thank you for always being so supportive of my carpentry work.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t3",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.",
        "memory_text": "1. Neighbors A is excited to explore the neighborhood and make new friends.\n2. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n3. Neighbors B acknowledges Neighbors A's friendly and outgoing nature.\n4. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.\n5. Neighbors A just moved to a new neighborhood and is getting to know the area.\n6. Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's wonderful! Chicago is a fantastic city with so much to offer. I'm glad you had a great experience exploring it.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t6",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.\n3. Neighbors A is excited to explore the neighborhood and make new friends.\n4. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n5. Neighbors A just moved to a new neighborhood and is getting to know the area.\n6. Neighbor B has moved around a lot over the years but is considering settling down in the current neighborhood.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's true. I'm really glad I decided to stay. It's amazing how much this neighborhood has become like home to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t9",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.\n3. Neighbors A finds spending time with God brings them peace and happiness.\n4. Neighbors A finds peace and happiness by spending time with God daily, through prayer, reading the Bible, and listening to worship music.\n5. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n6. Neighbors A is excited to explore the neighborhood and make new friends.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's wonderful to hear. It's amazing how much our neighborhood has become a place of comfort and belonging for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t11",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.\nNeighbors A: Oh, gosh. That was so long ago. I can't even believe I had that kind of power over you.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.\n3. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n4. Neighbors A finds spending time with God brings them peace and happiness.\n5. Neighbors A is excited to explore the neighborhood and make new friends.\n6. Neighbors B acknowledges Neighbors A's friendly and outgoing nature.",
        "speaker": "Neighbors B",
        "raw_prediction": "Haha, it's all good. We've come a long way since then. It's nice to see how much you've grown and found your place in our neighborhood.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t13",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.\nNeighbors A: Oh, gosh. That was so long ago. I can't even believe I had that kind of power over you.\nNeighbors B: I'm just glad we've both grown since then, and we can have a friendship that's based on mutual respect.\nNeighbors A: Absolutely. And now, I'm excited to explore my new neighborhood and get to know the people here. It feels like a fresh start.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors A is excited to explore the neighborhood and make new friends.\n3. Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there.\n4. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.\n5. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n6. Neighbors A just moved to a new neighborhood and is getting to know the area.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sure you'll make new friends and create great memories in your new neighborhood. Change can be refreshing, and I'm excited to see how you'll flourish in this new environment.",
        "previous_summary": "Neighbors A just moved to a new neighborhood and is getting to know the area.\nNeighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\nNeighbors A is excited to explore the neighborhood and make new friends.\nNeighbors A found a park and a coffee shop nearby that they want to visit.\nNeighbors B acknowledges Neighbors A's friendly and outgoing nature.\nNeighbors A appreciates having friendly faces around and hopes to make new friends soon."
    },
    {
        "utter_id": "e13-s5-t6",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.",
        "memory_text": "1. Mentee credits Mentor for their help in achieving sobriety and expresses gratitude for the support.\n2. Mentor has been supportive of Mentee's journey to sobriety.\n3. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n4. Mentee found getting sober to be a challenging process but is now proud of their progress.\n5. Mentor is proud of Mentee for making positive changes and taking control of their life.\n6. Mentee has a history of substance abuse but has been sober for a year.",
        "speaker": "Mentee",
        "raw_prediction": "Thank you, Mentor. I couldn't have done it without your support and encouragement. Your guidance has truly made a difference in my life.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.",
        "memory_text": "1. Mentee credits Mentor for their help in achieving sobriety and expresses gratitude for the support.\n2. Mentor has been supportive of Mentee's journey to sobriety.\n3. Mentee found getting sober to be a challenging process but is now proud of their progress.\n4. Mentor is proud of Mentee for making positive changes and taking control of their life.\n5. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n6. Mentee values living in the moment and staying focused on their sobriety and goals.",
        "speaker": "Mentor",
        "raw_prediction": "That's fantastic to hear, Mentee. Living in the moment can truly enhance your sobriety journey and help you appreciate the progress you've made. Keep focusing on your goals and staying present – you're doing an amazing job.",
        "previous_summary": "The Mentee is trying to live in the moment and feel more connected to their life.\nThe Mentor is supportive of the Mentee's approach and encourages them to continue.\nThe Mentee focuses on savoring the small details in life, such as food and nature.\nThe Mentee used to feel overwhelmed, but now feels more fulfilled by living in the moment.\nThe Mentor advises the Mentee to be gentle with themselves when they slip back into old patterns.\nBoth the Mentor and Mentee believe that living in the moment can bring joy and strength in facing challenges.\nMentee has a history of substance abuse but has been sober for a year.\nMentee values living in the moment and staying focused on their sobriety and goals."
    },
    {
        "utter_id": "e14-s5-t4",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?",
        "memory_text": "1. The Child is caring and offers help to the Parent.\n2. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n3. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n4. The Parent is working and feels tired after a long day.\n5. The Parent expresses a desire to be a better role model for the Child and their siblings.\n6. The Child offers to bring water or make soup for the Parent while they are resting.",
        "speaker": "Parent",
        "raw_prediction": "Parent: Well, people can submit their ads to me, and I'll post them on the website for a fee. It's been keeping me busy, but I enjoy the challenge. Thank you for being supportive, Child.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t6",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?",
        "memory_text": "1. The Child is caring and offers help to the Parent.\n2. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n3. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The Parent is working and feels tired after a long day.\n6. The Parent expresses a desire to adopt more children in the future.",
        "speaker": "Parent",
        "raw_prediction": "I'm not sure, but I'm hopeful that it will work out. It's a new venture for me, and I'm excited to see where it goes. Thank you for asking, it means a lot to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t7",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.",
        "memory_text": "1. The Child is caring and offers help to the Parent.\n2. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n3. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n4. The Parent is working and feels tired after a long day.\n5. The Parent expresses a desire to be a better role model for the Child and their siblings.\n6. The Parent expresses a desire to adopt more children in the future.",
        "speaker": "Child",
        "raw_prediction": "I believe in you, Parent. Your creativity and hard work will surely pay off in the end.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t13",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?\nParent: Yes, I do remember that. That was a fun afternoon.",
        "memory_text": "1. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n2. The Child is caring and offers help to the Parent.\n3. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The Parent is working and feels tired after a long day.\n6. The child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent.",
        "speaker": "Child",
        "raw_prediction": "I really enjoyed that time, Parent. It's moments like those that make me grateful for our bond and the love you show us every day.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t14",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?\nParent: Yes, I do remember that. That was a fun afternoon.\nChild: It was! Maybe we can do that again someday.",
        "memory_text": "1. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n2. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n3. The Child is caring and offers help to the Parent.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The Parent is working and feels tired after a long day.\n6. The child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent.",
        "speaker": "Parent",
        "raw_prediction": "I would love that, Child. Your creativity always inspires me, and I appreciate your willingness to help me with my projects. Let's plan another craft day soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.",
        "memory_text": "1. Classmates A has been pursuing their passions and enjoying life.\n2. Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth.\n3. Both Classmates A and B value the importance of trying new things and taking risks for personal development.\n4. Classmates B supports Classmates A's perspective on living authentically and free from others' opinions.\n5. Classmates A ended up taking Classmates B's advice and found success with it.\n6. Classmates A was initially hesitant about following Classmates B's advice.",
        "speaker": "Classmates B",
        "raw_prediction": "I'm so proud of you for stepping out of your comfort zone and following your passion. It's inspiring to see you living authentically and making a positive impact on others. Keep up the great work!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t5",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.",
        "memory_text": "1. Co-worker B acknowledges and supports Co-worker A's growth and progress.\n2. Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader.\n3. Co-worker A has grown and become more confident over the years.\n4. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n5. Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.\n6. Co-worker A has fantasies of being a great leader.",
        "speaker": "Co-workers B",
        "raw_prediction": "I have no doubt that your leadership skills will shine through in this new role. Communication is key, and I know you'll excel in that aspect as well. Congratulations on your promotion!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t13",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.\nCo-workers A: Oh yeah, I still try to keep up with it whenever I can. It's important to stay physically and mentally fit, especially with this new job.",
        "memory_text": "1. Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader.\n2. Co-worker A used to fantasize about being a great leader and being respected and admired.\n3. Co-worker A has grown and become more confident over the years.\n4. Co-worker A has fantasies of being a great leader.\n5. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n6. Co-worker B acknowledges and supports Co-worker A's growth and progress.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear! Your dedication to training and self-improvement will definitely serve you well in your new leadership role. I have no doubt that you'll excel and continue to grow.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t1",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbors A did this as a gesture of appreciation for Neighbors B's actions in the neighborhood.\n3. Neighbors A surprised Neighbors B with a pizza.\n4. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n5. Neighbors A has developed romantic feelings for Neighbors B.\n6. Neighbor A went to the park with their son, who had a great time.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that the breathing exercise helped you relax. It's important to take care of yourself, especially during stressful times.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t7",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbor A is embarrassed about a past incident where they pushed Neighbor B's shoulder to gain acceptance.\n3. Neighbors A did this as a gesture of appreciation for Neighbors B's actions in the neighborhood.\n4. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n5. Neighbors A has developed romantic feelings for Neighbors B.\n6. Neighbors B values their friendship with Neighbors A.",
        "speaker": "Neighbors B",
        "raw_prediction": "Oh, don't even worry about that anymore. We've come a long way since then and our friendship means more to me than any past incidents.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t4",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n3. Neighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience.\n4. Neighbors A and B had a conversation a couple of years ago about needing a change.\n5. Neighbors A took the leap to make a change and is glad they did.\n6. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm still figuring that part out, but I'm definitely going to make sure it's put to good use. I'm so grateful for this unexpected opportunity.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t6",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?",
        "memory_text": "1. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n2. Neighbors A made a big career change recently and is much happier now.\n3. Neighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience.\n4. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n5. Neighbors A and B have a friendly and supportive relationship.\n6. Neighbors A and B had a conversation a couple of years ago about needing a change.",
        "speaker": "Neighbors A",
        "raw_prediction": "I have thought about investing some of it, but I want to be smart about it and make sure I do my research first. It's a big responsibility to manage this kind of money.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n3. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n4. Neighbors A took the leap to make a change and is glad they did.\n5. Neighbors A and B had a conversation a couple of years ago about needing a change.\n6. Neighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's a great idea! With your entrepreneurial spirit, I have no doubt you'll be successful. It's inspiring to see you taking charge of your financial future like this.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t12",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.\nNeighbors B: That sounds like a great idea. You have the opportunity to do so much with your newfound wealth.\nNeighbors A: Definitely. It's funny how things can change so quickly. Just a few years ago, I was stuck in a job I hated and now I have all this freedom.\nNeighbors B: Speaking of jobs, have you thought about what you want to do now? You don't really have to work if you don't want to.\nNeighbors A: I know, but I don't think I could ever completely give up working. Plus, I have some ideas for businesses that I want to pursue. I think this money will give me the push I need to start something new.\nNeighbors B: I'm excited to see what you come up with. You're definitely one of the most driven people I know.",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors A is feeling stagnant in their current job and is looking for more growth and challenge.\n3. Neighbors A took the leap to make a change and is glad they did.\n4. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n5. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n6. Neighbors A and B had a conversation a couple of years ago about needing a change.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks for always believing in me and supporting me, it means a lot. I'm grateful for this opportunity and I can't wait to see where this new chapter takes me.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t2",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A values appreciation and expresses gratitude for help received.\n3. Neighbors B recalls when Neighbors A helped with their lawn, showing mutual support between them.\n4. Neighbors A is detail-oriented and strives for perfection.\n5. Neighbors A and B are helpful towards each other.\n6. Neighbors B values reciprocity and acknowledges the mutual help between them as neighbors.",
        "speaker": "Neighbors A",
        "raw_prediction": "I really appreciate your understanding. I just feel like I let everyone down when things don't go perfectly. Thank you for being there for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t7",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.\nNeighbors B: I'm sorry to hear that. Have you considered looking for a new job?\nNeighbors A: I have, but with the current job market, it's really tough. Plus, I don't have a lot of experience in other fields.",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A and B live in the same neighborhood and help each other with tasks.\n3. Neighbors B recalls when Neighbors A helped with their lawn, showing mutual support between them.\n4. Neighbors A and B are helpful towards each other.\n5. Neighbors A wants to rearrange their living room and Neighbors B has experience with rearranging furniture.\n6. Neighbors A values appreciation and expresses gratitude for help received.",
        "speaker": "Neighbors B",
        "raw_prediction": "I understand how challenging that must be. If you need any help or advice on exploring other career options, I'm here to support you.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n3. Co-worker A and Co-worker B shared happy memories from their time working together.\n4. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n5. Co-worker A and Co-worker B used to work together at a clothing store.\n6. Co-worker A has a talent for solving puzzles and mysteries.",
        "speaker": "Co-workers A",
        "raw_prediction": "That's amazing! I bet you sounded fantastic. How did it feel to sing in front of everyone?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t13",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.\nCo-workers B: Oh gosh, yes. I forget sometimes that not everyone knows. But yeah, I've been married for a few years now.\nCo-workers A: Crazy how time flies. Like when we found out Ms. Singh was leaving our school. I still can't believe that was two years ago.",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker A and Co-worker B shared happy memories from their time working together.\n3. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n4. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n5. Co-worker A has a talent for solving puzzles and mysteries.\n6. Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.",
        "speaker": "Co-workers B",
        "raw_prediction": "Yeah, time really does fly by. It feels like just yesterday we were all saying goodbye to her. It's amazing how much has changed since then.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t16",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.\nCo-workers B: Oh gosh, yes. I forget sometimes that not everyone knows. But yeah, I've been married for a few years now.\nCo-workers A: Crazy how time flies. Like when we found out Ms. Singh was leaving our school. I still can't believe that was two years ago.\nCo-workers B: I know, right? She was such a great teacher. Speaking of which, have you heard anything about her lately?\nCo-workers A: Not really. I think she moved to another state, but I'm not sure where.\nCo-workers B: Ah, okay. Well, hopefully she's doing well wherever she is. But hey, getting back to your solo, I think you should definitely do it again sometime.",
        "memory_text": "1. Co-worker A and Co-worker B shared happy memories from their time working together.\n2. Co-worker B was surprised when Co-worker A found out they were married.\n3. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n4. Co-worker A has a talent for solving puzzles and mysteries.\n5. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n6. Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate the support! Maybe I'll have to sing \"Amazing Grace\" again at the next church event. Thanks for the encouragement.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t3",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n3. The wife is glad to see the husband finding a sense of purpose and being happy.\n4. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n5. The husband feels happy and content being outside in the beautiful weather.\n6. The husband values spending time with his friend, feeling happy and content with their company.",
        "speaker": "Wife",
        "raw_prediction": "Thank you, it really does make a difference. I appreciate all the effort you put into making our home a cozy retreat.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t7",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.",
        "memory_text": "1. The husband appreciates the little things in life, such as making it to the bus on time.\n2. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n3. The wife mentions that the husband had to run to catch the bus a couple of years ago.\n4. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n5. The wife is glad to see the husband finding a sense of purpose and being happy.\n6. The husband enjoys being outside and loves the weather after being stuck indoors at work.",
        "speaker": "Wife",
        "raw_prediction": "It's those small victories that make the day a little brighter, right? I'm just glad you made it on time and didn't have to wait out in the cold!",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t2",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.",
        "memory_text": "1. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n2. Co-worker A had a positive experience with a commander who helped them feel safe.\n3. Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.\n4. Co-worker B offers encouragement and believes things will work out in the end.\n5. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n6. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I appreciate that. It's important to me to make a positive impact wherever I can.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t7",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.\nCo-workers B: That's a great attitude to have. Speaking of leadership, do you think you would ever want to take on a higher position in the company?\nCo-workers A: I'm always open to new opportunities, but I don't want to do it just for the sake of having more power. If I could make a bigger difference in that role, then I would consider it.",
        "memory_text": "1. Co-worker A had a positive experience with a commander who helped them feel safe.\n2. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n3. Co-worker A believes that making money can lead to fulfillment and provide the freedom to pursue hobbies and interests.\n4. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n5. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\n6. Co-worker A values making money and is interested in opportunities to do so.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's a really admirable perspective to have. It's important to prioritize making a positive impact over just seeking a higher position for the sake of it. It's clear that your focus is on using your skills to benefit others, and that's truly inspiring.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t1",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.",
        "memory_text": "1. Classmates B complimented Classmates A on their suit and brought up a past conversation about feelings.\n2. Classmate B feels relieved that they can still be friends with Classmate A.\n3. Classmates B appreciates Classmates A's honesty about their feelings, but doesn't feel the same way.\n4. Classmate A has been hiding their feelings for Classmate B and finally confesses to being in love with them.\n5. Classmates A values their friendship with Classmates B and looks forward to wearing a black suit to a wedding reception.\n6. Classmates A is excited for a wedding reception and plans to dance with the bride.",
        "speaker": "Classmates B",
        "raw_prediction": "Wow, I feel the same way. It's great that we can all still be friends and support each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t3",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.",
        "memory_text": "1. Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable.\n2. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n3. Co-worker A has been getting written up for being late to work.\n4. Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\n5. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n6. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear! It sounds like you're making progress in being more responsible with your tasks. Keep it up!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t6",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?",
        "memory_text": "1. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n2. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n3. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n4. Co-worker A has been getting written up for being late to work.\n5. Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable.\n6. Co-worker A is trying to improve their punctuality and cut back on drinking.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, that was definitely a wake-up call for me. I'm trying to be more responsible and avoid situations like that in the future. I appreciate your support in helping me stay on track.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t12",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.\nCo-workers A: Wow, that was a long time ago. But I appreciate the compliment. It's nice to be reminded of my successes.\nCo-workers B: Yeah, and even though you had some rough times in your personal life, like that painful breakup, you still managed to pick yourself up and move forward.",
        "memory_text": "1. Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable.\n2. Co-worker A was a leader in their country, making it prosperous and safe.\n3. Both co-workers show a supportive and caring attitude towards each other.\n4. Co-worker B is supportive and encourages Co-worker A to give people a chance.\n5. Co-worker A believes their success as a leader was due to determination and strength of character.\n6. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, that breakup was tough, but I've learned a lot from it. It's all about moving forward and focusing on being the best version of myself now. Thanks for always being so supportive, it means a lot to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t2",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?",
        "memory_text": "1. Co-worker B finished a project and sent it to the manager for review.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A believes the project will be approved with flying colors.\n4. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n5. Co-worker A gave Co-worker B a pen that they still use.\n6. Co-worker B acknowledges the importance of finding a balance between work and relaxation.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, I made sure to include everything. I even gave her a pen as a small token of appreciation.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t4",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.",
        "memory_text": "1. Co-worker A believes the project will be approved with flying colors.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n4. Co-worker B finished a project and sent it to the manager for review.\n5. Both Co-worker A and Co-worker B value trust in their personal and professional relationships.\n6. Co-worker B acknowledges the importance of finding a balance between work and relaxation.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I always try to go the extra mile. It's important to me that our projects are successful and that our boss sees the effort we put in.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.",
        "memory_text": "1. Co-worker A took over their family's business a few years ago and it has improved since then.\n2. Co-worker A has a family business that has been doing well recently.\n3. Co-worker A took over the family business and made changes to adapt to modern times.\n4. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n5. Co-worker A made changes to modernize processes and invest in new technology for the business.\n6. Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, it's been a journey for sure. I'm just glad I could apply those lessons to my current role here.",
        "previous_summary": "Co-worker A took over the family business and made changes to adapt to modern times.\nCo-worker A has a family business that has been doing well recently.\nCo-worker A made changes to modernize processes and invest in new technology for the business.\nCo-worker A took over their family's business a few years ago and it has improved since then."
    },
    {
        "utter_id": "e29-s5-t4",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.",
        "memory_text": "1. The Coach is giving advice to the Athlete regarding their performance and focus.\n2. The coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\n3. The Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches.\n4. The Coach reminds the Athlete that little distractions can add up and impact performance.\n5. The Athlete decides to tough it out and stay focused on the game.\n6. The Athlete seeks approval and praise from the Coach.",
        "speaker": "Athlete",
        "raw_prediction": "I'll make sure to keep that in mind and plan accordingly, Coach. Thank you for your guidance.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t6",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?",
        "memory_text": "1. The coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\n2. The Coach is giving advice to the Athlete regarding their performance and focus.\n3. The coach encourages the athlete to continue their good work with nutrition and training.\n4. The athlete is concerned about nutrition and improving their diet.\n5. The Athlete is focused on improving their performance and energy levels.\n6. Both the Athlete and Coach emphasize the importance of small changes in diet impacting performance.",
        "speaker": "Athlete",
        "raw_prediction": "Yes, Coach, I've been making sure to include those bean sprouts in my meals. I've noticed a difference in my energy levels already. It's amazing how small changes in diet can really impact performance.",
        "previous_summary": "The athlete is concerned about nutrition and improving their diet.\nThe coach provides information about the benefits of bean sprouts and the importance of a balanced diet for athletes.\nThe athlete has started adding bean sprouts to their salads and sandwiches and has noticed an improvement in how they feel.\nThe coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\nThe Athlete has incorporated bean sprouts into their diet to improve health, leading to increased energy and faster recovery.\nBoth the Athlete and Coach emphasize the importance of small changes in diet impacting performance."
    },
    {
        "utter_id": "e30-s5-t3",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.",
        "memory_text": "1. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n2. Co-worker A agrees to be more conscious of how they come across to others in the future.\n3. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n4. Co-worker B is supportive and interested in the evidence collected by Co-worker A.\n5. Co-worker A's evidence includes statistics and personal accounts from clients.\n6. Co-worker A is a skilled builder who recently completed building a house for Co-worker B.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear! It really does show in your interactions with others. Your confidence and ability to connect with people definitely shine through.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t10",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?\nCo-workers A: Yeah, I remember. But she eventually gave me the cash, and I was able to take care of what I needed to.\nCo-workers B: That's good. And speaking of taking care of things, your carpentry skills are amazing. I loved the house you built for me last year.",
        "memory_text": "1. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n2. Co-worker A is a skilled builder who recently completed building a house for Co-worker B.\n3. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n4. Co-worker A has presented evidence in front of a judge to support their position in the past.\n5. Co-worker A's evidence includes statistics and personal accounts from clients.\n6. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you! I'm glad you're happy with the house. It was a pleasure working on that project for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t11",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?\nCo-workers A: Yeah, I remember. But she eventually gave me the cash, and I was able to take care of what I needed to.\nCo-workers B: That's good. And speaking of taking care of things, your carpentry skills are amazing. I loved the house you built for me last year.\nCo-workers A: Thanks! I really love building houses. It's a great feeling to take a blueprint and turn it into someone's dream home.",
        "memory_text": "1. Co-worker A is a skilled builder who recently completed building a house for Co-worker B.\n2. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n3. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n4. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n5. Co-worker A's evidence includes statistics and personal accounts from clients.\n6. Co-worker A has presented evidence in front of a judge to support their position in the past.",
        "speaker": "Co-workers B",
        "raw_prediction": "You definitely have a talent for bringing dreams to life. Your dedication and craftsmanship shine through in every project you take on.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t3",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A.\n2. Classmates A appreciates Classmates B's efforts and support.\n3. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n4. Classmates A appreciates the support and friendship of Classmates B.\n5. Classmates A and B are making plans to spend time together outside of school.\n6. Classmates A and B started as acquaintances and have developed a strong friendship.",
        "speaker": "Classmates B",
        "raw_prediction": "That's so thoughtful of you to lend a hand like that. Your kindness never fails to impress me.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A.\n2. Classmates A appreciates Classmates B's efforts and support.\n3. Classmates A appreciates the support and friendship of Classmates B.\n4. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n5. Classmates A and B value their friendship and feel comfortable talking to each other about anything.\n6. Classmates A and B started as acquaintances and have developed a strong friendship.",
        "speaker": "Classmates B",
        "raw_prediction": "You have a big heart, and it's inspiring to see how willing you are to help others. Your neighbor is lucky to have you as a friend.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t2",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?",
        "memory_text": "1. The wife supports the husband's goals but wanted to be involved in them.\n2. The husband has long-awaited plans and is finally taking action on them.\n3. The husband is inspired by his wife to take action on his dreams and goals.\n4. The husband got impatient and excited about his plans, leading him to leave without the wife.\n5. The wife offers her support and encouragement to the husband in his journey towards achieving his dreams.\n6. The husband apologized and promised to involve the wife in his plans in the future.",
        "speaker": "Husband",
        "raw_prediction": "I was thinking of going to that cozy cabin in the mountains that you've always wanted to visit.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t9",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband has long-awaited plans and is finally taking action on them.\n3. The husband got impatient and excited about his plans, leading him to leave without the wife.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband is inspired by his wife to take action on his dreams and goals.\n6. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.",
        "speaker": "Wife",
        "raw_prediction": "It's okay, husband. I appreciate your apology and your effort to make things right. I know you'll make up for it with this weekend getaway. Thank you for acknowledging your mistake and promising to involve me in your plans in the future.",
        "previous_summary": "The husband left without waiting for his wife, breaking a promise to her.\nThe wife was disappointed that the husband didn't wait for her and wanted to be included in his plans.\nThe husband got impatient and excited about his plans, leading him to leave without the wife.\nThe husband apologized and promised to involve the wife in his plans in the future.\nThe husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action."
    },
    {
        "utter_id": "e32-s5-t12",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.\n3. The husband got impatient and excited about his plans, leading him to leave without the wife.\n4. The husband has long-awaited plans and is finally taking action on them.\n5. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n6. The wife brings up past disappointment when the husband left without her, breaking a promise to wait for her.",
        "speaker": "Husband",
        "raw_prediction": "Wow, I do remember that! You were amazing, wife. Your quick thinking and bravery saved the day. I'm lucky to have you by my side.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t13",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband acknowledges his wife's bravery and selflessness.\n3. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.\n4. The wife reassures the husband of her continuous support and belief in him.\n5. The husband is inspired by his wife to take action on his dreams and goals.\n6. The wife stopped a runaway carriage, showing her bravery and willingness to protect others.",
        "speaker": "Wife",
        "raw_prediction": "Thank you, husband. Your support means everything to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t16",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.\nWife: Thanks, husband. And speaking of good times, I had so much fun at the dance a few weeks ago. Dancing with you always puts me in a good mood.\nHusband: Same here, wife. I love spending time with you, and I feel grateful for every moment we get to share. \nWife: I feel the same way, husband. And, I appreciate you doing the dishes for me today so we could have this conversation.",
        "memory_text": "1. The wife reassures the husband of her continuous support and belief in him.\n2. The husband apologized and promised to involve the wife in his plans in the future.\n3. The husband is inspired by his wife to take action on his dreams and goals.\n4. The husband and wife are committed to each other and excited about their future together.\n5. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n6. The wife offers her support and encouragement to the husband in his journey towards achieving his dreams.",
        "speaker": "Husband",
        "raw_prediction": "Anything for you, wife. I'm glad we are able to communicate openly and support each other in our journey together.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t1",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.",
        "memory_text": "1. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n2. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n3. Neighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\n4. Neighbors A is trying to improve their behavior at work and be a better colleague.\n5. Neighbors B appreciated Neighbors A's support during this difficult situation.\n6. Neighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's great to hear! I'm glad you're feeling positive about it. Remember, success isn't just about the product, but also about how you treat others and the effort you put in at work. I believe in you!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t5",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.",
        "memory_text": "1. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n2. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n3. Neighbors A is trying to improve their behavior at work and be a better colleague.\n4. Neighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\n5. Neighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.\n6. Neighbors A is having issues at work, such as not pulling their weight and being rude to colleagues.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's fantastic news! It sounds like you're really putting in the effort to make this product a success. I have no doubt that your hard work will pay off in the end.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.\nCo-workers B: That's right. It's important to have someone to talk to when you're feeling overwhelmed or upset.\nCo-workers A: And speaking of talking it out, do you remember when I was a kid and I ran to our parents screaming because of that spider?\nCo-workers B: Ha, yes I do! It's funny to think about now, but phobias are no laughing matter.\nCo-workers A: Absolutely. And on a lighter note, I made a pair of wire earrings the other day. It was so much fun to create something beautiful with my own hands.",
        "memory_text": "1. Co-worker A has overcome fears and anxieties to create beautiful earrings.\n2. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n3. Co-worker B encourages Co-worker A to try relaxation techniques or find a hobby to de-stress and overcome fears.\n4. Co-worker B acknowledges that some people have fears and suggests finding healthy ways to deal with frustrations.\n5. Co-worker A and Co-worker B met on a movie set and are now good friends.\n6. Co-worker A is creative and talented in making jewelry.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic! I'm so proud of you for pushing past your fears and creating something so beautiful. Your talent really shines through in your jewelry making.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t5",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.",
        "memory_text": "1. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n2. Mentor became a mentor to help others going through similar situations.\n3. Mentee agrees to try the advice and express gratitude towards Mentor.\n4. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n5. Mentee has been thinking about helping others who may be in abusive cults.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentor",
        "raw_prediction": "I completely agree. Empathy and understanding are key factors in building strong and supportive relationships. It's wonderful to see your commitment to making a positive impact on people's lives through teaching religion with an open mind and heart. Your dedication to helping those who may be in abusive cults is truly admirable. Keep up the great work!",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t9",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?",
        "memory_text": "1. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n2. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n3. Mentor became a mentor to help others going through similar situations.\n4. Mentee agrees to try the advice and express gratitude towards Mentor.\n5. Mentee has been thinking about helping others who may be in abusive cults.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentor",
        "raw_prediction": "Yes, I have. It's important to be open to different cultures and experiences to truly understand and appreciate the diversity in our world. It can broaden our perspectives and make us more empathetic towards others.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t12",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?\nMentor: I'm originally from Italy.",
        "memory_text": "1. Mentor is from Italy and has lived in the United States.\n2. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n3. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n4. Mentor became a mentor to help others going through similar situations.\n5. Mentee agrees to try the advice and express gratitude towards Mentor.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentee",
        "raw_prediction": "That's fascinating! I bet living in Italy and then the United States has given you a unique perspective on different cultures and ways of life. I admire your openness and willingness to learn from different experiences.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t2",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.",
        "memory_text": "1. Neighbors A thanked Neighbors B for the suggestion.\n2. Neighbors A bought a necklace from Neighbors B's shop and loves it.\n3. Neighbors B emphasized the importance of apologizing to show care for the relationship.\n4. Neighbors B offered to help Neighbors A with the apology process.\n5. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\n6. Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.",
        "speaker": "Neighbors A",
        "raw_prediction": "Absolutely, I couldn't agree more. And I really appreciate your willingness to help me with the apology process. It means a lot to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t2",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?",
        "memory_text": "1. Classmates A and B are students in the same class.\n2. Classmates A offered help and support to Classmates B.\n3. Classmates A tends to overthink things and appreciated Classmates B's support and advice.\n4. Classmates A and B are close and have a level of trust between them.\n5. Classmates A was worried about a situation but it turned out to be not a big deal.\n6. Classmates A and B are working on a group project together.",
        "speaker": "Classmates A",
        "raw_prediction": "I was really stressing out about that project deadline, but thanks to your help and advice, I feel a lot better now. Thank you for being there for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmates A tends to overthink things and appreciated Classmates B's support and advice.\n3. Classmates A discovered a secret that Classmates B has been keeping.\n4. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\n5. Classmates A and B are students in the same class.\n6. Classmates A had doubts about trusting Classmates B due to rumors about their reliability.",
        "speaker": "Classmates A",
        "raw_prediction": "I agree, our connection is special. But there's something I need to tell you.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t7",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?\nNeighbors A: I visited Brazil and Peru. The culture and food were incredible.\nNeighbors B: That sounds awesome. I've always wanted to go to Peru to see Machu Picchu.\nNeighbors A: Yes, Machu Picchu is amazing. The view from the top is breathtaking.\nNeighbors B: Have you thought about where you want to go next?\nNeighbors A: Yeah, I'm thinking about visiting Australia and Antarctica next. I want to see the Great Barrier Reef and the penguins.",
        "memory_text": "1. Neighbors B admires Neighbors A's organization skills and wishes to improve their own organization.\n2. Neighbors A and B believe in doing nice things for others to bring the community together.\n3. Both Neighbors A and B believe in the importance of learning and self-improvement.\n4. Neighbors A and B both took a cooking class together last year.\n5. Neighbor A is feeling frustrated and is considering going to a bar to find someone for a casual encounter.\n6. Neighbor B suggests finding other ways to relieve frustration and looking out for Neighbor A's well-being.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds like an incredible trip! Australia and Antarctica are definitely on my bucket list too. I'm sure you'll have an amazing time exploring those destinations. Don't forget to take lots of pictures!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.",
        "memory_text": "1. Classmates A is always looking to challenge themselves and improve their skills.\n2. Classmates B acknowledges Classmates A's determination and competitiveness.\n3. Classmates A faced tough competition in middle school from a fast girl, motivating them to improve.\n4. Classmates A is struggling with feeling competitive and the need to be the best at everything.\n5. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n6. Classmates B is supportive and emphasizes the importance of having someone to talk to about personal matters.",
        "speaker": "Classmates A",
        "raw_prediction": "It really is. I'm just trying to make sure I don't get too caught up in trying to be the best all the time. I want to enjoy the process too.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t11",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.\nClassmates B: It's important to listen to your body and take care of yourself.\nClassmates A: Exactly. And sometimes, it's nice to just take a break and enjoy a quiet moment to yourself.",
        "memory_text": "1. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n2. Classmates B acknowledges Classmates A's determination and competitiveness.\n3. Classmates A is always looking to challenge themselves and improve their skills.\n4. Classmates A is struggling with feeling competitive and the need to be the best at everything.\n5. Classmates A faced tough competition in middle school from a fast girl, motivating them to improve.\n6. Classmate A emphasizes the importance of self-care and relaxation.",
        "speaker": "Classmates B",
        "raw_prediction": "That's so true. Taking time for yourself is just as important as working hard. It's all about finding that balance.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t2",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmates A has matured since then and learned from past mistakes.\n3. Classmates B supported Classmates A through a tough time by listening to them.\n4. Classmates B and Classmates A used to dance a lot in middle school.\n5. Classmates A acknowledges the mistake and plans to learn from it.\n6. Classmate B is a supportive friend who listens and offers to help.",
        "speaker": "Classmates A",
        "raw_prediction": "I learned about coding, graphic design, and even some basic troubleshooting techniques. It was really eye-opening.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmate B is a supportive friend who listens and offers to help.\n3. Classmates B supported Classmates A through a tough time by listening to them.\n4. Classmates B and Classmates A used to dance a lot in middle school.\n5. Classmates A has matured since then and learned from past mistakes.\n6. Classmate A appreciates having friends who are there for them during difficult times.",
        "speaker": "Classmates A",
        "raw_prediction": "Sure! I can definitely help you out with that. Let's sit down together and I'll show you a few options that might work well for what you need.",
        "previous_summary": "Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility.\nClassmates B mentions a past incident where they had to clean up spilled paint, highlighting the importance of learning from mistakes.\nBoth classmates have experienced making mistakes and learning from them.\nClassmates A and Classmates B are friends who help each other with schoolwork."
    },
    {
        "utter_id": "e41-s5-t8",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?\nClassmates A: Yeah, I also learned some basic coding languages like HTML and CSS. It was challenging but really interesting.\nClassmates B: Wow, that sounds cool. Do you think you'll pursue coding further?",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmates A is considering taking a dance class for fun.\n3. Classmates B and Classmates A used to dance a lot in middle school.\n4. Classmate B is a supportive friend who listens and offers to help.\n5. Classmates A has matured since then and learned from past mistakes.\n6. Classmates A is interested in dance and asked Sasha for some dance tips.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm not sure yet, but I'm definitely considering it. It's always good to have more skills under my belt.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t2",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?\nClassmates B: I'm sorry,, but I can't disclose that information. It's not my place to tell.",
        "memory_text": "1. Classmates B warns Classmates A about the potential danger of dark alleys.\n2. Classmates A is curious and open to exploring new things and taking risks.\n3. Classmates B advises Classmates A to be careful and aware while on the bus.\n4. Classmates A and B became friends when Classmates A transferred to the school.\n5. Classmates B appreciates the genuine friendship and positive attitude of Classmates A.\n6. Classmates A doesn't have their own car yet and takes the bus.",
        "speaker": "Classmates A",
        "raw_prediction": "That's okay, I understand. I appreciate your honesty and respect for privacy.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t2",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?",
        "memory_text": "1. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\n2. Neighbor A is grieving the recent loss of their grandmother.\n3. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n4. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n5. Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.\n6. Neighbor A recently moved to a new neighborhood and feels safer and happier there.",
        "speaker": "Neighbors A",
        "raw_prediction": "No, I haven't. I'm not sure if I even want to at this point. It's still so raw for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t4",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.",
        "memory_text": "1. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\n2. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n3. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n4. Neighbor A recently moved to a new neighborhood and feels safer and happier there.\n5. Neighbor A is grieving the recent loss of their grandmother.\n6. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thank you for saying that, Neighbor B. It means a lot to hear that from you. Your support really helps me through this tough time.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?",
        "memory_text": "1. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\n2. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n3. Neighbor A is grieving the recent loss of their grandmother.\n4. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n5. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n6. Neighbor A recently moved to a new neighborhood and feels safer and happier there.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thank you, Neighbor B. I appreciate your support and kindness. Maybe we can go for a walk in the park together. Nature always helps me clear my mind and feel a little better.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t8",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.\nNeighbors B: How about we go for a walk and you can talk to me about everything that's been on your mind?",
        "memory_text": "1. Neighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief.\n2. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n3. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n4. Neighbors A and Neighbors B enjoy going for walks together, especially to the park.\n5. Neighbor A is grieving the recent loss of their grandmother.\n6. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a good idea. I really appreciate you being here for me, Neighbor B. Let's head to the park and talk. Thank you for always being such a good friend.",
        "previous_summary": "Neighbor B enjoys taking walks in the park after work to clear their mind.\nNeighbor B is familiar with the park and goes there often for walks.\nNeighbors A and Neighbors B enjoy going for walks together, especially to the park.\nNeighbor B is offering support and companionship to Neighbor A during their difficult time.\nNeighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\nNeighbor A finds solace in nature and believes that it helps in coping with their emotions.\nNeighbor A appreciates the emotional support and understanding from Neighbor B during their time of grief."
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed.\n2. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n3. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n4. Classmate A appreciates the support and understanding from Classmate B.\n5. Classmate B advises Classmate A to take deep breaths, stay confident, and focus on delivery.\n6. Classmate A has tried practicing in front of others but still feels nervous.",
        "speaker": "Classmates A",
        "raw_prediction": "I know, I messed up big time. I just don't know what to do now.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t3",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.",
        "memory_text": "1. Classmates B finds Classmates A's involvement in the community admirable and important.\n2. Classmate A and Classmate B are classmates who attended a party together.\n3. Classmate A expresses a desire to find alternative ways to have fun and make a positive impact in the community.\n4. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference.\n5. Classmate A is concerned about the party being discovered and getting in trouble with the school.\n6. Classmate A agrees to take better care of themselves in the future.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, this spot is really ideal for camping. I'm glad you found it. It's so peaceful here. And hey, I remember how passionate you are about finding ways to make a positive impact in the community. That's really admirable.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t5",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.",
        "memory_text": "1. Classmate A expresses a desire to find alternative ways to have fun and make a positive impact in the community.\n2. Classmates A is proactive and curious, taking the initiative to research topics of interest.\n3. Classmates B finds Classmates A's involvement in the community admirable and important.\n4. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference.\n5. Classmate A and Classmate B are classmates who attended a party together.\n6. Classmate B agrees to keep the party a secret in exchange for Classmate A doing their homework for a week.",
        "speaker": "Classmates B",
        "raw_prediction": "That's really cool that you took the time to explore and found this hidden gem. Your adventurous spirit always leads to discovering interesting places.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t7",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n4. Classmates B is interested in learning to play an instrument.\n5. Classmates A and B are both keeping up with the homework in their math class.\n6. Classmates A finds pursuing music rewarding and is passionate about it.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, maybe I can start by learning to play an instrument. It's something I've always wanted to do.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t16",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.\nClassmates B: That sounds like a challenge, but also kind of exciting. I'm in!",
        "memory_text": "1. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n2. Classmates A plays the guitar, takes lessons, and plays in a band.\n3. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n4. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A finds pursuing music rewarding and is passionate about it.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad you're up for the challenge! I'll be right there with you every step of the way. Let's work together to make that goal a reality.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t4",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?",
        "memory_text": "1. Neighbor A enjoys building houses and finishing them quickly.\n2. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n3. Neighbor B reminds Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them.\n4. Neighbor A started construction on the house last week and plans to finish it in record time.\n5. Neighbors A helped Neighbors B build a new house with amazing features.\n6. Neighbor A has skills in manipulation and getting what they want.",
        "speaker": "Neighbors A",
        "raw_prediction": "I have tried that approach before, but sometimes I just get so caught up in the process.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t15",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.\nNeighbors A: Speaking of London, have you heard about those recent cases of identity theft? It's terrible that people like that exist.",
        "memory_text": "1. Neighbor B reminds Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them.\n2. Neighbors A helped Neighbors B build a new house with amazing features.\n3. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n4. Neighbors B is enjoying the sunset from their new backyard, expressing gratitude towards Neighbors A.\n5. Neighbor A enjoys building houses and finishing them quickly.\n6. Neighbor B is looking forward to seeing the finished house and is excited about the new project.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, I've heard about it. It's important to stay vigilant and protect our personal information. But let's focus on the positive and plan that community event we were talking about. It's a great opportunity to make a difference in our city.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t17",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.\nNeighbors A: Speaking of London, have you heard about those recent cases of identity theft? It's terrible that people like that exist.\nNeighbors B: Yes, it's scary to think someone could steal your identity and ruin your life like that.\nNeighbors A: Exactly, that's why I always try to be a kind person and help others when I can. Like arranging flowers in a vase, for example. Small acts of kindness can make a big difference. ",
        "memory_text": "1. Neighbor B reminds Neighbor A of their potential to do good things, referencing a house that Neighbor A built for them.\n2. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n3. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n4. Neighbors A helped Neighbors B build a new house with amazing features.\n5. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n6. Neighbors B is enjoying the sunset from their new backyard, expressing gratitude towards Neighbors A.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's a wonderful perspective to have. It's those small acts of kindness that truly make a difference in the world.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t4",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?",
        "memory_text": "1. Wife suggests that husband should try using more modern language to be better understood.\n2. The husband is open to learning more about movies, showing a willingness to try again.\n3. Both the husband and wife express a desire for happiness and understanding in the situation.\n4. The wife is knowledgeable about movies and is willing to share her passion with the husband.\n5. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.\n6. Husband agrees to try adapting to modern language for better communication with his wife.",
        "speaker": "Husband",
        "raw_prediction": "I haven't thought about that, but it's a great idea! I'll give it a try and see if it helps spark some new ideas. Thank you for being so supportive and willing to help me out.",
        "previous_summary": null
    }
]