[
    {
        "dataID": "e0",
        "summary": "Speaker A is older and has eight grandchildren.\nSpeaker B is 28 years old, turning 29 next week.\nSpeaker B is excited about Easter weekend and spring break.\nSpeaker B recently got a new blue hair color and a new Easter dress.\nSpeaker A used to have quiet spring breaks, contrasting with Speaker B's plans for a more adventurous one.\nSpeaker B received a new car from their mom and plans to drive during spring break.\nBoth Speaker A's mother and Speaker A were librarians, but Speaker A is retired.\nSpeaker A is older and mentions having blue hair already.\nSpeaker B dyed their hair with henna and enjoys experimenting with different hair colors.\nSpeaker A is considering dying their hair red and then purple for fun with their grandkids.\nSpeaker A finds getting old no fun and jokes about the inevitability of grey hair.\nSpeaker B loves grey hair and plans to dye their hair a cool shade of grey.\nSpeaker B's new dress is blue, but more of a turquoise shade.\nSpeaker B's new car is black, and it is their first new car after driving pre-owned cars before.\nSpeaker A is getting their hair dyed turquoise by their youngest grandchild, who wants to pursue hairdressing as a profession.\nSpeaker B bought a red VW Tiguan due to a good deal and concerns about rising car prices.\nSpeaker A is worried about gas mileage and asks about the fuel efficiency of Speaker B's car.\nSpeaker B plans to touch up their hair for the summer due to sun and pool damage.\nSpeaker A, a retired librarian, recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit.\nSpeaker B asks if the recommended book is fiction or nonfiction.\nSpeaker A has a granddaughter who is a cosmetologist and helped dye their hair in streaks.\nSpeaker A's granddaughter is 14 years old and has dreams of starting her own salon or working at a high-end salon in a big city.\nSpeaker B has an oldest nephew who is about to turn 14.\nSpeaker B is going on a trip but has not started packing yet\nSpeaker A and Speaker B both have a sense of humor, as seen by their use of \"lol\" in the conversation."
    },
    {
        "dataID": "e1",
        "summary": "Speaker A enjoys cruising and has a favorite club in school.\nSpeaker A recently got a new job in computer programming.\nSpeaker A knows how to swim since the age of 5.\nSpeaker A had cube steak and gravy for dinner.\nSpeaker B works as a shipping clerk at warehouse for 15 hours a week.\nSpeaker B enjoys cruising in their car while listening to punk music.\nSpeaker B does not know how to swim but enjoys watching swimming movies.\nSpeaker B's favorite food is a pizzaburger.\nSpeaker A has planned a cruise to the Caribbeans.\nSpeaker B is afraid of cruises because they can't swim.\nSpeaker A is not nervous about going on a cruise.\nSpeaker A enjoys the food and the adventure of cruises.\nSpeaker A has planned to do snorkeling and other activities at their cruise destination.\nSpeaker A recommends hiking and exploring the local area for those who can't swim.\nSpeaker B is interested in exploring the area and asks about car rentals for that purpose.\nSpeaker A just started a new job in computer programming.\nSpeaker B's workplace doesn't have much competition, which they appreciate.\nSpeaker A is planning a snorkeling trip and has signed up for several trips.\nSpeaker A and Speaker B discuss the potential of getting on a cruise ship together.\nSpeaker A mentions that immersion is the cure for many fears.\nSpeaker A finds their new job tedious and repetitive but rewarding.\nSpeaker B is stressed often and uses pizzaburgers to cope with stress.\nSpeaker A finds swimming relaxing and uses it to destress from their job.\nSpeaker A plans to travel to the Caribbean for their next trip.\nSpeaker A offers to teach Speaker B how to swim and programming.\nSpeaker B is interested in learning programming and is already practicing.\nSpeaker B enjoys punk music and wants to listen to it while swimming and learning programming.\nSpeaker B is looking forward to eating a pizza burger in a pool with punk music playing."
    },
    {
        "dataID": "e2",
        "summary": "Speaker A is a high school student planning to go to college, achieving straight A's.\nSpeaker B is also a high school student preparing for college, working at a diner at night.\nSpeaker A enjoys running and listening to music as hobbies.\nSpeaker B works on weekends at a research lab, showing an interest in neuroscience.\nSpeaker A's parents are blue-collar workers, not supporting their education.\nSpeaker B lives alone with a deaf dog and finds inspiration in neuroscience.\nSpeaker A's dad is a steel worker, emphasizing the value of hard work in life.\nSpeaker B has a deaf dog named Sparky, a beagle breed.\nSpeaker A is interested in getting a dog and had a hamster named Leonardo in the past.\nSpeaker A suggests getting a border collie breed for running and exercise.\nSpeaker B had another dog named Paco when they were younger.\nSpeaker A offers to take Sparky for a walk to help out and spend time with the dog.\nSpeaker B is busy and appreciates the offer to help with Sparky.\nSpeaker A plans to try the famous hamburgers made by Speaker B at the diner.\nSpeaker A is considering getting a dog and already walks Speaker B's dog, Sparky.\nSpeaker B's dog is deaf and needs to be kept on a lead due to recall difficulties.\nSpeaker A and Speaker B discuss the challenges and rewards of having a dog with hearing issues.\nSpeaker B's dog is very loving and attentive, possibly because of the deafness.\nSpeaker A and Speaker B agree on the unconditional love and attention dogs provide.\nSpeaker B had hamburgers for dinner with cheese, mustard, and lettuce.\nSpeaker A had cheesy ham and potato soup for dinner.\nSpeaker A is a freshman in school, trying to finish in 3 years.\nSpeaker B is close to finishing school with just two more weeks left.\nSpeaker A and Speaker B are involved in different fields of work, cooking and lab research.\nSpeaker B is considering giving up their night job to focus on lab work and school.\nSpeaker A recommends taking summer classes to get ahead and make friends with classmates.\nSpeaker B is planning to major in molecular biology.\nSpeaker B has invented a chilli dog casserole that Speaker A wants to try."
    },
    {
        "dataID": "e3",
        "summary": "Speaker A enjoys driving and mentioned going to an art museum over the weekend.\nSpeaker A likes playing badminton and has a cousin who recently moved to Sweden.\nSpeaker B is from Sweden and mentioned playing tennis and going to church on Sunday.\nSpeaker B moved to the US around 12 years ago.\nSpeaker B has twins and mentioned being ready for bedtime after chasing them around.\nSpeaker A and Speaker B discussed the differences between Sweden and the US, including coffee breaks.\nSpeaker A is an atheist and works as a scientist.\nSpeaker B attends a Methodist church, was not raised with religion in Sweden, and moved to the United States for a job opportunity in medicine.\nSpeaker B's husband attends church regularly, and they have children who attend Sunday School.\nSpeaker B works in medicine with a hospital and has flexibility in their job to balance work with family and hobbies like tennis.\nSpeaker A has a cousin in Sweden but has not visited the country.\nSpeaker A is a scientist with a job that can be difficult and requires decompression time.\nSpeaker B works at a hospital with flexible hours that allow for family time.\nSpeaker B's parents still live in Sweden, and they find it expensive to travel there.\nSpeaker B has not visited Sweden for a long time due to the high expenses.\nSpeaker A is considering visiting their cousin in Sweden and needs to save money for the trip.\nSpeaker A appreciates flexibility in their job but wishes for more.\nSpeaker B has not tried playing badminton but is interested in being more active.\nSpeaker A has a flexible job and is considering taking a second part-time job to save money for travel.\nSpeaker B misses Sweden and has fond memories of the country.\nSpeaker A and Speaker B plan to travel to Sweden together.\nSpeaker B recommends checking out the volcanoes in Sweden for a unique experience.\nBoth Speaker A and Speaker B enjoy exploring local music and coffee shops when traveling.\nSpeaker B grew up in Sweden and developed an interest in good coffee and chocolates.\nSpeaker B enjoys both Swedish dance music and American hip hop.\nSpeaker A recommends American hip hop artists like Wu-Tang, Dr\nSpeaker A stopped listening to new hip hop music around 2010 and shifted to jamband music and classic reggae.\nSpeaker B is unfamiliar with classic reggae music and asks for a description of the vibe."
    },
    {
        "dataID": "e4",
        "summary": "Speaker A is involved in horse breeding and taking care of horses.\nSpeaker B is a therapist and a football fan, supporting the Chiefs.\nSpeaker B has blonde hair and enjoys going to football games with their mom.\nSpeaker B's mom is a nurse and busy with work.\nSpeaker A hasn't seen their parents in a while and is concerned about their father's well-being.\nSpeaker B offers to talk about the absence of Speaker A's mother and suggests lying down on their couch.\nSpeaker A hosts football parties and loves football season.\nSpeaker B is a therapist, mentioning the ups and downs of the profession.\nSpeaker A works at a stable and enjoys being around horses.\nSpeaker B's mom is doing well, and Speaker B plans to visit her next weekend.\nSpeaker A owns 8 horses, but 3 are for sale.\nSpeaker A feeds the horses grass roughage with some grains, particularly oats.\nSpeaker B lives in the city and is interested in having a horse in the future.\nSpeaker A suggests that Speaker B could pay a fee to a ranch to take care of a horse.\nSpeaker A mentions the high cost of maintaining horses, including feeding, housing, and medical expenses.\nSpeaker A estimates the cost of having 8 horses to be around $100 per horse per month.\nSpeaker B is concerned about the cost of owning horses, including medical fees and expenses like horse shoes.\nSpeaker A mentions that horses often hurt themselves while exercising, leading to potential medical costs.\nSpeaker A is married and has been for four years.\nSpeaker A met their husband on an online site.\nSpeaker A mainly knows about horses and doesn't know much about psychology.\nSpeaker B is a professional in a practice, where it is illegal for them to have relationships with clients.\nSpeaker B has been working in their own practice for about six years.\nSpeaker B is considering the psychological aspects of owning a horse, relating it to Freudian theories.\nSpeaker B watches a lot of football and is thinking about spending more time looking for a husband."
    },
    {
        "dataID": "e5",
        "summary": "Speaker A is a city dweller who walks to work instead of driving.\nSpeaker B lives in the country, loves nature, and works with animals.\nSpeaker B is an artist who walks through nature for work.\nSpeaker A is a reader who goes through a novel each week.\nSpeaker B enjoys listening to country music but rock is their favorite.\nSpeaker A's favorite exercise is pilates.\nSpeaker B's family consists of a nurse mom, a farmer dad, and a sister.\nSpeaker A has only one brother.\nSpeaker B gets along somewhat with their sister.\nSpeaker A enjoys reading sci-fi and mysteries, while Speaker B prefers fantasy books.\nSpeaker A has read Dan Brown's 'Da Vinci Code' series and appreciates how he breaks down puzzles in his writing.\nSpeaker B is currently re-reading 'Redwall' by Brian Jacques, which was a favorite book growing up.\nSpeaker A also enjoyed reading 'Redwall' growing up and keeps an eye out for similar books.\nSpeaker A's favorite books growing up were Harry Potter and political books, with a focus on government and politics in school.\nSpeaker B enjoys Dan Brown's writing but acknowledges that there are occasional bad books.\nSpeaker B asks about Speaker A's thoughts on today's political climate.\nSpeaker A enjoys reading fantasy books and recommends \"A Game of Thrones\" by George R\nSpeaker B is behind on reading and has not read the books or seen the TV show.\nSpeaker A believes that books are always better than their TV adaptations.\nSpeaker B has been busy with a new painting and has not had time to read.\nSpeaker A practices Pilates and finds it great for beginners.\nSpeaker B is interested in Pilates but dislikes the idea of having to follow specific steps in exercise.\nSpeaker A emphasizes the importance of proper form in exercise to prevent injuries.\nSpeaker A is a fan of the Game of Thrones series and enjoys audiobooks.\nSpeaker B enjoys reading the Odd Thomas and Dark Tower series and finds inspiration for their artwork during nature walks.\nSpeaker A recommends the new album by Highly Suspect to Speaker B.\nSpeaker B prefers silence when reading and creating artwork to maintain focus.\nSpeaker A asks about Speaker B's new artwork and acknowledges their need for inspiration."
    },
    {
        "dataID": "e6",
        "summary": "Speaker A grew up in California on the beach and loves morning surfing.\nSpeaker A is in a band where they play the drums and write music, with 4 members including the singer who is their best friend.\nSpeaker B loves fishing and spending time near the ocean, but doesn't have time to surf anymore due to working at a doctor's office.\nSpeaker B listens to Sublime a lot while relaxing on the beach.\nSpeaker A wants to see Sublime live one day but doesn't go to many concerts other than the ones their band plays in.\nSpeaker A was good at writing in school, while Speaker B was bad at math and preferred fishing.\nSpeaker A is in a band and plays music, possibly a musician.\nSpeaker B works in a doctor's office in a general practice.\nSpeaker B is looking forward to taking a break from work and going fishing.\nSpeaker A is planning a concert in Denver and offers to get tickets for Speaker B.\nSpeaker A enjoys surfing and music as a way to escape from daily life.\nSpeaker A grew up on the beach and is good at surfing, nicknamed \"lil fishie\".\nSpeaker B caught a huge trout almost a meter long that bit their hand.\nSpeaker B finds fishing easier than surfing, but is interested in trying surfing.\nSpeaker A went fishing once and caught a fish that was only 2 inches long.\nSpeaker A is preoccupied with not dying when surfing.\nSpeaker B wishes they had time to go surfing and is considering getting lessons at a surf shop.\nSpeaker A is part of a band that tours different countries for their music.\nSpeaker A's band visited Italy, Uzbekistan, and smaller countries in Central and South America.\nSpeaker A enjoys Italian food and had a positive experience with the food in Italy.\nSpeaker B is a passionate cook who enjoys making Italian dishes like pasta, risotto, and pizza.\nSpeaker A is allergic to strawberries.\nSpeaker B received a new recipe book for their birthday in May.\nSpeaker A is not a good cook and may need help catching and cooking fish.\nSpeaker B is willing to teach Speaker A how to fish and cook.\nSpeaker A enjoys eating fish, particularly salmon or tuna."
    },
    {
        "dataID": "e7",
        "summary": "Speaker A is a librarian and loves kids, mentioning having 3 children.\nSpeaker B's mother was also a librarian like Speaker A.\nSpeaker B has a lot of kids, all grown up now and with kids of their own.\nSpeaker B's kids do not go to work by boat like Speaker A.\nSpeaker A loves playing the flute but does not do it for a living.\nSpeaker B asks if Speaker A plays in a band or symphony.\nSpeaker A has kids and is busy with work, unable to spend as much time with them as they would like.\nSpeaker B's mother was a librarian, which seems to have influenced their perspective on the job.\nSpeaker A and Speaker B agree on the importance of reading and the value of libraries, despite the rise of the internet.\nSpeaker B mentions having grandkids, implying they are older and have a family of their own.\nSpeaker B feels that the internet has made finding books easier for kids compared to going to a library.\nSpeaker A is a retired librarian who enjoys implementing creative activities in their library.\nSpeaker B has grandkids and enjoys spending time with them at the park.\nSpeaker A and Speaker B both acknowledge the decline in interest and use of libraries due to the rise of the internet.\nSpeaker B is aware of libraries adapting to stay relevant by adding maker spaces with tools like 3D printers.\nSpeaker A mentions that paper books are kept relevant by those who cherish physical copies.\nSpeaker A and Speaker B discuss the importance of learning new skills at any age.\nSpeaker A sees parents bringing in their little kids to the library as encouraging.\nSpeaker A has children and grandchildren, with at least one child interested in learning the flute.\nSpeaker B has grandkids who are more interested in phones and tablets than musical instruments.\nSpeaker A plans to teach their youngest child how to play the flute because she was inspired by the singer Lizzo.\nSpeaker B took their grandkids fishing once, with mixed reactions from the kids.\nSpeaker A's other children are addicted to tablets and phones, unlike the youngest one who is interested in music.\nSpeaker B likes the idea of making the fishing trip an annual tradition to get the grandkids more interested in nature."
    },
    {
        "dataID": "e8",
        "summary": "Speaker A reads a novel a week, lives in the city, and goes to pilates class.\nSpeaker B is in college, paints on the side, and has five dogs and three rats.\nSpeaker A has a brother and might commission a family portrait from Speaker B.\nSpeaker B's prices for a portrait start at $5000 to pay for college tuition.\nBoth speakers enjoy walking in the city and staying busy with their respective activities.\nSpeaker A is getting a portrait done of themselves and their brother, interested in couponing deals.\nSpeaker B is an artist, did a painting for Elton John and has student debt from art school.\nSpeaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\nSpeaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\nSpeaker A has been bitten by a dachshund and a Chihuahua.\nSpeaker A used to work at a doggie daycare where there was a mean dog named Maggie.\nSpeaker A is interested in getting a dog and likes Akitas.\nSpeaker B has five dogs and enjoys taking them to the park.\nSpeaker B thinks pit bulls are lovely and has one that is kind and sweet.\nSpeaker B is a painter and is working on a portrait for Speaker A.\nSpeaker B is busy with school and taking care of their five dogs, so working at a doggy daycare would be too much.\nSpeaker A is getting their portrait painted by Speaker B.\nSpeaker B is working on other portraits and taking care of a sick dog.\nSpeaker A is considering getting kittens and thinks rats can be smart.\nSpeaker A prefers adopting pets from shelters rather than from breeders.\nSpeaker B likes Persian cats and imagines their pets having interesting interactions.\nBoth Speaker A and Speaker B enjoy the company of their pets and think they are smart and playful."
    },
    {
        "dataID": "e9",
        "summary": "Speaker A is able to teleport by thinking clearly about a place.\nSpeaker A is an inventor who built a transporter before learning to teleport innately.\nSpeaker A is working on going back in time.\nSpeaker A uses the energy of puppies to power the teleportation machine.\nSpeaker A struggles with teleporting clothes, aiming for a full closet.\nSpeaker B works in IT and enjoys running.\nSpeaker B is aware of the movie \"Jumper\" and enjoyed it.\nSpeaker B is involved in programming work.\nSpeaker A has a therapist and has experienced disassociation or imagining themselves in different places due to past experiences.\nSpeaker A mentioned having a childhood experience with a squirrel that \"flew\" briefly due to jumping on a trampoline.\nSpeaker B is going to Alaska for a vacation in two weeks and has some experience with flying on airplanes.\nSpeaker B has programming experience but has not created their own invention.\nSpeaker A and Speaker B share a sense of humor and make each other laugh during the conversation.\nSpeaker A is familiar with Alaska and outdoor activities like fishing and hiking.\nSpeaker A is concerned about the safety of Speaker B and suggests getting a hiking tour guide.\nSpeaker B is planning an Alaskan vacation but has not planned much yet.\nSpeaker B is not a fan of fishing but is interested in hiking and seeing a moose.\nSpeaker A is nervous about traveling alone and prefers having someone familiar around during new adventures.\nSpeaker B is comfortable traveling alone and enjoys the spontaneity it allows.\nSpeaker A and Speaker B are planning a trip to Alaska together.\nSpeaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\nSpeaker B jokes about being eaten by mosquitoes during their time outdoors in Alaska.\nSpeaker B is unsure about what else there is to do in Alaska besides hiking.\nSpeaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.\nSpeaker B mentions that southern Alaska has warmer temperatures in the summer.\nSpeaker A mentions that Alaska has mountains and glaciers, unsure if skiing is possible there.\nSpeaker A talks about the common perceptions of Alaska being cold, dark, and known for oil drilling.\nSpeaker B agrees that Alaska is beautiful but acknowledges the presence of mosquitoes."
    },
    {
        "dataID": "e10",
        "summary": "Speaker A works at a restaurant and invited Speaker B to visit.\nSpeaker A mentions having five grandchildren.\nSpeaker A is an omnivore.\nSpeaker A enjoys the band 21 Pilots and is going to their concert.\nSpeaker B enjoys old bands like Styx and Journey.\nSpeaker B is interested in going rock climbing with Speaker A.\nSpeaker B loves the beach and Mediterranean food.\nSpeaker A owns a restaurant and recently experienced a fire incident but managed to put it out.\nSpeaker B watches their grandchildren, indicating they are likely a grandparent.\nSpeaker B's grandchildren are now grown and behave well, though they fight with each other.\nSpeaker A attended a concert where the performers were surprisingly talented live.\nSpeaker B attended an Aerosmith concert back in their glory days and enjoyed it.\nSpeaker A is a fan of Aerosmith and admires Steven Tyler for his talent and good character.\nSteven Tyler is aging, and Speaker B doubts if he sings as much these days.\nSteven Tyler is involved in charitable activities like donating time and money to homeless shelters.\nSpeaker B's favorite Aerosmith song is \"Love In An Elevator.\"\nSpeaker A is a restaurant worker who enjoys working there but finds it very busy.\nSpeaker A enjoys classic rock music, specifically mentioning Aerosmith as a favorite.\nSpeaker A had to put out a fire at work, which was unexpected but seems to have been handled without issues.\nSpeaker B is interested in learning about pop music, specifically Kpop.\nSpeaker B's grandchildren like pop music and talk about it, which Speaker B doesn't seem familiar with.\nSpeaker A enjoys the interaction with people at work and the variety of experiences that come with it.\nSpeaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners.\nSpeaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods.\nSpeaker B has grandchildren who enjoy kpop bands and might make Speaker B go to a concert with them someday.\nSpeaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.\nSpeaker A enjoys working at the restaurant despite the busy schedule.\nSpeaker B enjoys spending time with their grandchildren and feels blessed to do so.\nSpeaker B jokes about teleporting to an Aerosmith concert if the kpop concert gets too crazy."
    },
    {
        "dataID": "e11",
        "summary": "Speaker A is a student working on a marketing degree and enjoys watching movies in foreign languages.\nSpeaker B is a football fan who was the captain of their team and is currently a lifeguard at the beach.\nSpeaker A and Speaker B both have interests in learning new languages.\nSpeaker A hopes to create ads for movies after graduating.\nSpeaker B is in a serious committed relationship and enjoys horror movies.\nSpeaker A has a love for seafood and imagines wanting to eat fish while watching them swim.\nSpeaker B practices karate and works as a lifeguard but is looking for a different career.\nSpeaker A enjoys seafood and ordered a big seafood platter.\nSpeaker A is studying marketing and enjoys it.\nSpeaker A believes that IT and AI are where the future lucrative jobs are.\nSpeaker B is considering a career change to the IT sector due to their computer skills and the growing demand for employees in that sector.\nSpeaker A watched a foreign film featuring Sophia Lauren on Netflix that was nominated for a Golden Globe.\nSpeaker B's partner prefers romantic comedies over horror movies.\nSpeaker A recommends a movie called \"The Life Ahead\" and enjoys foreign films with subtitles.\nSpeaker B practices Karate and holds a green belt, being involved in other activities and considering going back to school for a certificate in IT work.\nSpeaker B currently works as a lifeguard, which is physically demanding and not suitable for a long-term career.\nSpeaker B tans easily and takes precautions against sunburn and skin cancer due to the nature of their job.\nSpeaker A has fair skin and burns easily, using SPF-80 sunscreen.\nSpeaker B tans easily and only uses sunscreen on specific areas like the tops of their feet and face.\nSpeaker B enjoys water-related activities and movies like \"Jaws\".\nSpeaker A is taking a French class and plans to learn French to dig for clams in Quebec.\nSpeaker B signed up for classes at the local college and has a background in football and karate.\nSpeaker A has taken Spanish classes in the past and finds similarities between French and Spanish.\nSpeaker B attends football games at their old high school and finds that their football background helps in karate footwork."
    },
    {
        "dataID": "e12",
        "summary": "Speaker A is working at a pizza shop to pay for college and studying computer science.\nSpeaker B plays soccer and volunteers at their mom's school in the after-school program.\nSpeaker B is majoring in linguistics and hopes to turn it into a practical job.\nSpeaker B lives with their mom and is currently in college.\nSpeaker A is living with their grandparents and helps them out.\nSpeaker A used to play football a lot but now enjoys hanging out with friends and playing video games.\nSpeaker A likes playing games from the Elder Scrolls Series, Witcher, Legend of Zelda, and Super Mario Bros.\nSpeaker A does not usually play 1st person shooters unless they have more to offer.\nSpeaker B is part of a local amateur soccer team and used to play World of Warcraft a lot in high school and college.\nSpeaker B now casually plays Overwatch and enjoys 1st person shooter games for their quick pick-up-and-play nature.\nSpeaker B has tried playing soccer with the kids in their mom's after school program but they weren't very interested.\nSpeaker A is studying computer science and wants to develop apps for differently abled youth.\nSpeaker B is considering getting a masters degree after completing their bachelors and potentially becoming a college professor in linguistics.\nSpeaker A believes in the importance of giving back and helping youth access resources.\nSpeaker A and B both value education and continuous learning.\nSpeaker A is involved with a football league and is looking forward to playing games.\nSpeaker B plays on a soccer team and has a match coming up.\nSpeaker A mentions being out of practice with exercise but is looking to get back into it.\nSpeaker B suggests trying the game Elder Scrolls, knowing Speaker A plays World of Warcraft.\nSpeaker B volunteers at their mom's after school program and plans to volunteer at a neighboring university.\nSpeaker A is interested in teaching computer science, specifically in the field of robotics.\nSpeaker B is studying linguistics but mentions feeling limited in job opportunities."
    },
    {
        "dataID": "e13",
        "summary": "Speaker A has a cat that spilled their iced tea and now has a kitten.\nSpeaker B used to have pets but they are now with their wife.\nSpeaker B is away from their child and glad that the pets are with them.\nSpeaker A enjoys visiting the zoo and grew up in big cities.\nSpeaker B just moved to America and is unfamiliar with the places.\nSpeaker A suggests taking the pets to the zoo and mentions that most major cities have good zoos.\nSpeaker B works in metal factories in cities due to the state of British Leyland.\nSpeaker A compares having a kitten to being a grandparent and mentions starting their own zoo.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\nSpeaker B is a parent who is busy with work and childcare after a divorce.\nSpeaker B's child wants to visit the zoo, particularly to see the monkeys.\nSpeaker A thinks that Speaker B works too much at the factory.\nSpeaker B is interested in finding family discounts for the zoo.\nSpeaker B is considering calling in sick to work to go to the zoo with their child.\nSpeaker A is offering advice and seems to have experience with children.\nSpeaker B has a young daughter who is 8 years old and is becoming independent.\nSpeaker B's daughter likes monkeys and is starting to assert her independence.\nSpeaker A suggests that the daughter's mother's absence may be contributing to her independence.\nSpeaker B finds parenting challenging but values family time over getting a nanny for help.\nSpeaker A believes in learning from everyday experiences, including parenting.\nSpeaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua.\nSpeaker B is a parent, pushing for their daughter's school to take a field trip to the zoo.\nSpeaker B is hesitant about getting a pet at home, considering a fish but ruling out cats or dogs for now.\nSpeaker A suggests getting a pet for responsibility, mentioning that kittens are great companions.\nSpeaker A assures Speaker B that kittens are not as much work as expected and can be left for short periods, even mentioning kitty daycares.\nSpeaker B expresses concern about leaving a kitten alone during their family camping adventures."
    },
    {
        "dataID": "e14",
        "summary": "Speaker A is a plumber.\nSpeaker B is a stay-at-home mom.\nSpeaker B enjoys watching movies with her kids.\nSpeaker A prefers watching the sunset over movies.\nSpeaker B lives in California.\nSpeaker A and Speaker B have a light-hearted conversation.\nSpeaker A enjoys watching sunsets and mentioned seeing a great sunset recently.\nSpeaker B lives in California and appreciates the stunning sunsets there.\nSpeaker B has kids who love the beach, even though they find sand annoying.\nSpeaker B's kids enjoy watching Disney movies, which Speaker B also finds good.\nSpeaker B prefers romance and horror movies, which their kids do not enjoy.\nSpeaker B's kids are in school, giving Speaker B some free time during the day.\nSpeaker A and Speaker B both enjoy sunsets and movies, with Speaker A preferring the beach for watching sunsets.\nSpeaker A has booked a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.\nSpeaker B is a stay-at-home mom with kids, finding it hard to take time for themselves.\nSpeaker A works two jobs and struggles to make time for themselves, but still manages to plan a trip to Hawaii.\nSpeaker B enjoys romance movies as a small escape into a new world.\nSpeaker A believes in making the most out of every moment, possibly learned from watching sunsets.\nSpeaker B finds being a stay-at-home mom both busy and rewarding, feeling like it's a 24/7 job.\nSpeaker A and Speaker B both have families.\nSpeaker A has seen the Disney movie 'Luca' recently.\nSpeaker B's kids enjoyed watching 'Luca' and said it was good.\nSpeaker B's husband enjoys Disney sports movies, such as 'Miracle'.\n'Miracle' is about the 1980 U.S\nSpeaker A also enjoys watching sports movies on Disney.\n'Miracle' and 'Remember the Titans' are available on Disney Plus.\nSpeaker B recommends Speaker A to watch 'Miracle'."
    },
    {
        "dataID": "e15",
        "summary": "Speaker A drives a smart car and used to have a long commute in Alaska.\nSpeaker B lives on the 32nd floor and describes themselves as a typical plumber.\nSpeaker A has blue eyes and blonde hair, while Speaker B is balding and overweight.\nSpeaker A plans to retire down south on a beach for warm weather.\nSpeaker A's family is from the north, and they prefer the warmth of the south.\nSpeaker B enjoys warm days, cool mornings, and eating poached eggs.\nSpeaker B jokes about eating eggs by the truckload if their father still had a truck.\nSpeaker A owns a smart car, which is all-electric and can park itself.\nSpeaker A has visited Alaska and describes it as beautiful, suggesting cheap flights to Anchorage.\nSpeaker A mentions the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer.\nSpeaker B is interested in visiting Alaska and mentions getting blackout curtains due to the midnight sun.\nSpeaker A suggests going on hikes in Alaska to see wildlife and mentions glaciers as a potential attraction.\nSpeaker A invited Speaker B to visit and mentioned looking into flights.\nSpeaker A mentioned the warm weather at their location.\nSpeaker A recommended using Kayak and Priceline to find cheap flights.\nSpeaker A and Speaker B discussed airlines charging extra fees.\nSpeaker A mentioned the wildlife, including elk and wolves.\nSpeaker A mentioned a vibrant music scene with folk and indie rock in dive bars.\nSpeaker B found flights that work for their schedule and price and will be visiting Speaker A in a couple of weeks.\nSpeaker A has invited Speaker B to visit them and is excited about the trip.\nSpeaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\nSpeaker A plans to take Speaker B on tours and attend folk concerts during the visit.\nSpeaker A mentions making poached eggs for breakfast and taking sleds pulled by dogs.\nSpeaker B is interested in going whale watching and asks about a wolf petting zoo."
    },
    {
        "dataID": "e16",
        "summary": "Speaker A enjoys Mexican food and drinks, and plays music for fun.\nSpeaker A owns a Subaru Legacy and mentions having a baby on the way.\nSpeaker A suggests eating the American version of Mexican food for those who do not like spicy food.\nSpeaker B is a mechanic who enjoys working on cars.\nSpeaker B agrees to look at Speaker A's Subaru Legacy for the funny noise it makes.\nSpeaker A does not live in Mexico but likes Mexican food and women.\nSpeaker A had their car fixed and appreciates the work done.\nSpeaker B's wife is pregnant and currently in the second trimester, still working.\nSpeaker B is not going out drinking much due to their wife's pregnancy.\nSpeaker A enjoys going to bars and loves the ladies.\nSpeaker A frequents live band venues and plays music at home.\nSpeaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy.\nSpeaker A has a car that was recently fixed by Speaker B.\nSpeaker A enjoys attending live events weekly but hasn't had time to play the guitar.\nSpeaker B dislikes public transportation and enjoys going to festivals, but misses doing so.\nSpeaker B's wife is pregnant, so they are considering attending a local festival for just a day.\nSpeaker A and Speaker B discuss the logistics of attending a festival with a small baby.\nSpeaker A is a guitar player and values jam time over social time.\nSpeaker A is not sure if they will ever settle down with a partner and have kids.\nSpeaker A mentions Drunky, who is likely a pet.\nSpeaker B's wife is pregnant and has three more months to go until the due date.\nSpeaker B is currently working on building cribs and will take two months off when the baby is born.\nSpeaker A and Speaker B enjoy bluegrass music."
    },
    {
        "dataID": "e17",
        "summary": "Speaker A is part of a music band and plays the drums.\nSpeaker B is going to buy their first new car and got fired from Cisco for their singing.\nSpeaker A's father used to work at Cisco and now owns a surf shop.\nSpeaker B is a pro snowboarder and enjoys snowboarding, surfing, and skateboarding.\nSpeaker A prefers surfing and grew up in a beach town.\nSpeaker A wakes up early in the morning to catch waves, while Speaker B likes to eat huge steaks after snowboarding.\nSpeaker A enjoys cooking and finds it helpful for stress relief.\nSpeaker A cooked steak, fried potatoes, and shrimp for dinner with their father.\nSpeaker A likes cooking new dishes and following recipes occasionally.\nSpeaker A plays the drums and loves making food for others.\nSpeaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker B's hobbies include snowboarding, listening to music, singing, spending time with family, and cooking.\nSpeaker A's hobbies include writing songs, surfing, and being on the water early in the morning.\nSpeaker A enjoys surfing and offers to give Speaker B lessons.\nSpeaker A's father rents out surf equipment from his shop.\nSpeaker B is interested in visiting Speaker A but mentions waiting for airfare prices to drop.\nSpeaker B is interested in the weather in October at Speaker A's location.\nSpeaker A learned how to surf from their dad, who owns a surf shop.\nSpeaker A is more familiar with warm climates and waves, rather than cold weather sports like snowboarding.\nSpeaker B enjoys both surfing and snowboarding but prefers surfing due to the cold weather associated with snowboarding.\nSpeaker B learned to snowboard in their teens and enjoys the rush it provides.\nSpeaker B's grandmother was the matriarch of the family, known for cooking large meals for family gatherings."
    },
    {
        "dataID": "e18",
        "summary": "Speaker A is a college student majoring in Humanities, not currently employed but used to work part-time at a supermarket.\nSpeaker B is 26 years old, works 12 hours a day, has a background in Humanities but now works as a law clerk.\nSpeaker B enjoys music, particularly black sabbath, and wishes to be a film reviewer.\nSpeaker A enjoys playing soccer but is not into music.\nSpeaker A is a college student studying Humanities and wants to finish college before looking for a job.\nSpeaker A plays soccer as a striker and has a match next week.\nSpeaker B is currently working and mentioned the importance of taking breaks from work.\nSpeaker B is considering looking for a new job for higher pay but is comfortable at the current job.\nSpeaker B started looking for jobs towards the end of college to secure a job for after graduation.\nSpeaker A plans to meet up with Speaker B to discuss career prospects and borrow college books.\nSpeaker A joked about treating Speaker B to lunch, indicating Speaker B is currently low on cash.\nSpeaker A is seeking career advice from a guidance counselor and is open to suggestions.\nSpeaker B knows someone working in HR and is willing to connect Speaker A with them.\nSpeaker A expresses interest in working in HR and appreciates the recommendation.\nSpeaker B accidentally hit the 'enter' button on their keyboard due to a spider landing on it.\nSpeaker A and Speaker B both have arachnophobia and fear spiders.\nSpeaker B was once bitten by a spider at work due to a prank pulled by their boss.\nSpeaker B is considering asking for a raise at work.\nSpeaker A is undecided about their career path, considering humanities or teaching.\nSpeaker B works as a clerk for a law firm and enjoys the work but wishes it paid better.\nSpeaker B has limited opportunities for advancement within the firm.\nSpeaker A is a member of a soccer team and enjoys playing in tournaments.\nSpeaker A has been scoring well in soccer recently.\nSpeaker B played intramural soccer in college and is a fan of Manchester United.\nSpeaker A is a fan of Arsenal and enjoys watching international teams play."
    },
    {
        "dataID": "e19",
        "summary": "Speaker A is retired and spends most days hiking.\nSpeaker B is a college student who plays soccer with other students.\nSpeaker B's mother runs a local high school, and Speaker B is her only child.\nSpeaker A mentions their neighbor John who loves soccer.\nSpeaker A and Speaker B discuss the importance of treating everyone equally.\nSpeaker A does not care for voting, leading to a discussion with Speaker B about it.\nSpeaker A is older, mentioning the competitiveness of college sports now compared to when they were growing up.\nSpeaker B is studying sports medicine and plays soccer, looking to join their college team in the future.\nSpeaker B is looking for internships in the sports medicine field and has asked professors for letters of recommendation.\nSpeaker A enjoys hiking along the coast and collecting shells, mentioning that their knees can't handle much else.\nSpeaker B has been going to the beach a lot and is learning to surf from friends in Jersey.\nSpeaker A used to surf when they were younger, while Speaker B is currently not good at it.\nSpeaker A used to surf and is trying to get back into it.\nSpeaker B is a beginner surfer getting help from experienced friends.\nSpeaker A is interested in getting tips from locals and knows someone named John who could help.\nSpeaker B is training for soccer and hopes to make the school team as a walk-on player.\nSpeaker B is focused on building stamina and sharp reflexes for soccer.\nSpeaker B's professors have been supportive in writing letters for an internship application.\nSpeaker A is offering advice and encouragement to Speaker B regarding the internship hunt, mentioning the medical field.\nSpeaker B is struggling with finding internships and feels like they are at a disadvantage compared to others with connections.\nSpeaker B is interested in sports medicine and enjoys surfing.\nSpeaker A suggests that surfing could be a way for Speaker B to make connections in the medical field.\nSpeaker B jokes about pretending to get hurt surfing to meet a doctor, showing a sense of humor and creativity."
    },
    {
        "dataID": "e20",
        "summary": "Speaker A works as a zookeeper and loves animals, especially white tigers.\nSpeaker B works part-time in an AC warehouse pulling parts.\nSpeaker B has two terrier dogs as pets.\nSpeaker A has a pet raccoon named Journey and a bearded dragon named Sid.\nSpeaker B enjoys going on cruises for fun.\nSpeaker A does not play music for the animals at the zoo to keep them calm.\nSpeaker A's pet raccoon enjoys eating pizza.\nSpeaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets.\nSpeaker B finds their job repetitive and hopes for a promotion to make it more interesting.\nSpeaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out.\nSpeaker B mentions using dish soap to get grease off hands and suggests vinegar for neutralizing odors.\nSpeaker A works at a zoo and is willing to help Speaker B get an entry-level position there.\nSpeaker B is looking for a new job and is excited about the opportunity at the zoo.\nSpeaker A mentions that entry-level positions at the zoo involve cleaning enclosures and feeding less dangerous animals but offer decent pay, training, benefits, and assistance with schooling.\nSpeaker B is grateful for the opportunity and is looking forward to playing music for the animals, starting with something safer than the white tiger.\nSpeaker A and Speaker B share a love for music and plan to have a house concert with their pets.\nSpeaker A mentions having dogs and Speaker B admires them for their peaceful nature.\nSpeaker A has a pet raccoon and has a friend who found baby raccoons.\nSpeaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.\nSpeaker A has been working at their job for almost 10 years and has only taken 3 vacations.\nSpeaker B is interested in taking a Disney cruise and has been watching videos on YouTube about them.\nSpeaker A is not interested in going on a cruise and would prefer camping as a vacation.\nSpeaker A's friend found two baby raccoons in her yard, one of which was given to Speaker A to keep as a pet.\nSpeaker B asks Speaker A if they have had a pet raccoon before."
    },
    {
        "dataID": "e21",
        "summary": "Speaker A is a country girl who loves animals and is a lacto-ovo vegetarian.\nSpeaker A has a pet parrot named Tasha and has red hair that makes them stand out.\nSpeaker B lives in the city they grew up in, loves animals, and has a cat that recently had a kitten.\nSpeaker B prefers living in the country, colored their hair bright pink, and cut it into an undercut.\nSpeaker A has a pet named Tasha who speaks Mandarin.\nSpeaker A is considering visiting Speaker B's zoo.\nSpeaker B has two sick kitties and recently received a rescue.\nSpeaker A plans to stay in an apartment near Speaker B if they visit.\nSpeaker A's neighbor will look after Tasha while Speaker A is away.\nSpeaker B finds it amusing that Tasha speaks Mandarin and mutters things under her breath.\nSpeaker A has a parrot named Tasha and is interested in adopting a rescue kitten.\nSpeaker B has 3 cats, two of which are sick, and is looking for someone to adopt one of them.\nSpeaker A's parrot Tasha has seen cats before and ignores them.\nSpeaker A has been learning Mandarin and Tasha has started saying Chinese phrases instead of English ones.\nSpeaker A wants to visit China and is planning to travel somewhere in the US first, likely New York City\nSpeaker B has been to New York City a few times and enjoys the city.\nSpeaker A has a parrot as a pet and is considering adopting a rescue kitten.\nSpeaker B recently filled out adoption paperwork for rescue kittens and is considering giving them Mandarin names based on their personalities.\nSpeaker A suggested the name Zhao for one of the kittens.\nSpeaker A is learning Mandarin.\nSpeaker B has an older mellow cat and is concerned about training the new energetic kittens.\nSpeaker A is interested in training tips for the kittens and is open to adopting one despite having a parrot.\nSpeaker B values well-trained pets and believes it is important for owners to train their animals properly.\nSpeaker B asked for advice on training Taisha the parrot."
    },
    {
        "dataID": "e22",
        "summary": "Speaker A has a pet parrot named Tasha and works as a personal trainer leading hikes.\nSpeaker A is a vegetarian.\nSpeaker B is a computer programmer who recently got a new job.\nSpeaker B enjoys taking cruises and is not as into the outdoors as Speaker A.\nSpeaker A enjoys going on camping trips and hiking trails in parks.\nSpeaker A has never been on a cruise and may consider trying one in the future.\nSpeaker A is a personal trainer who loves camping in remote areas.\nSpeaker B recently started a new job working with computers and is interested in joining Speaker A's gym.\nSpeaker A enjoys camping and hiking as free activities.\nSpeaker B went on a cruise to Cuba and loves ice cream.\nSpeaker A plans to recommend healthy and delicious food options to Speaker B.\nSpeaker A believes ice cream is not a healthy food choice.\nSpeaker A enjoys camping trips and looking for wild animals in the woods.\nSpeaker A leads hikes for the group they camp with, which are usually an hour or two long.\nSpeaker A is comfortable around animals in the woods but admits a bear would make them jumpy.\nSpeaker A and Speaker B both enjoy being outdoors, but Speaker B prefers the fresh air over being in the mud and rain.\nSpeaker B loves going on cruises, exploring new places in warmer climates, and has not been camping for a long time.\nSpeaker B gets scared by bugs and creepy crawlies in the outdoors.\nSpeaker B recently went on a long hike and enjoyed it\nSpeaker A is considering a cruise for next year as something different from camping trips.\nSpeaker A enjoys hiking, birdwatching, and spotting rare animals.\nSpeaker A has planned several camping trips for the summer and will be doing a part of the Appalachian Trail.\nSpeaker A has clients and has blocked off time for their trips.\nSpeaker A is nervous about the Appalachian Trail hike, as they don't usually do full day hikes.\nSpeaker A's Appalachian Trail hike will last for 10 days.\nSpeaker B dislikes bugs and is not a fan of camping, hiking, or the outdoors.\nSpeaker B shared tips on repelling mosquitos using sprays with 20% DEET and other active ingredients."
    },
    {
        "dataID": "e23",
        "summary": "Speaker A recently moved to a new city and has two older brothers.\nSpeaker B has two kids and enjoys painting and taking naps.\nSpeaker A enjoys driving and can drive long distances without stopping.\nSpeaker B's father was involved in producing horror movies, which influenced Speaker B's favorite genre.\nSpeaker A used to help their father on a farm in the past.\nSpeaker B prefers to be a passenger and let their kids do the driving.\nSpeaker B has a government job and mentioned taking a nap during work.\nSpeaker A has recently received a call for a job interview and is excited about it.\nSpeaker A is new to the city and has not been out much since arriving.\nSpeaker A has had flustered moments in past interviews but believes in staying calm.\nSpeaker B has been working for the government for 15 years.\nSpeaker B is not entirely satisfied with their job and wishes it was more rewarding.\nSpeaker A is applying for a project coordinator role at a charity but aspires to become a project manager in the future.\nSpeaker A finds job searching challenging and hopes to settle in the new city soon with a steady income.\nSpeaker A is preparing for an upcoming interview and is nervous about it.\nSpeaker B has a government job that pays the bills but wishes they could work in interior design.\nSpeaker A has a passion for producing horror movies and believes everyone loves them.\nSpeaker B's dad works on smaller projects and has never been involved in a major Hollywood film.\nSpeaker B's dad's work on smaller projects allows him more free time for hobbies like fishing.\nSpeaker A used to work on their dad's farm and reflects on the balance between work and free time.\nSpeaker B acknowledges the tendency to always want what one doesn't have, highlighting the human experience.\nSpeaker B prefers mid-century design and enjoys watching the show Mad Men.\nSpeaker A also likes mid-century design and is a fan of horror movies.\nSpeaker B creates horror movies with their dad, coming up with plot ideas through creative conversations.\nSpeaker A prefers classic horror movies like Halloween or Friday the 13th over modern ones.\nSpeaker A is nervous about an upcoming interview and wishes for a government job like Speaker B's.\nSpeaker B feels that having a government job is both good and bad, comparing it to having tenure as a college professor."
    },
    {
        "dataID": "e24",
        "summary": "Speaker A goes hiking and does not vote.\nSpeaker B is on their way to college and studying sports medicine.\nSpeaker B plays soccer and does not have any siblings.\nSpeaker B's mother runs the school where they are looking for a job.\nSpeaker A's neighbor John cannot play sports anymore due to an injury.\nSpeaker A believes that sports show how all can work equally.\nBoth Speaker A and Speaker B do not vote because they do not believe in the candidates.\nSpeaker A enjoys hiking and just finished a 5-mile hike with a friend named Dave.\nThe trail on the hike was rough and unsafe due to bad weather, with trees down and loose rocks.\nDave twisted his ankle during the hike but still wants to play soccer on Saturday.\nSpeaker B is interested in joining a soccer game on Saturday that Speaker A mentioned.\nThe soccer game is scheduled for 3 pm at the park, and Speaker A suggests bringing water due to the fountain having a funny taste.\nSpeaker B plans to bring a cooler with bottled water for everybody to avoid the funny-tasting water.\nSpeaker A is involved in sports and soccer.\nSpeaker B has sports medicine training and is taking an exam in that subject.\nSpeaker B has been getting all A's in the sports medicine class.\nSpeaker A struggles with history class and finds it boring.\nSpeaker A wishes to get better grades and is hopeful for a soccer scholarship.\nBoth speakers value good grades and believe it can lead to better job opportunities.\nSpeaker A struggles to maintain good grades and finds gym to be the only subject they excel in.\nSpeaker B studies sports medicine and feels pressured to maintain straight A's to avoid embarrassing their mother who runs the school.\nSpeaker A advises Speaker B to take breaks and prioritize their own happiness and well-being.\nSpeaker B feels overwhelmed by their mother's strictness and is eager to finish school to escape it.\nSpeaker B acknowledges the need to have a conversation with their mother about the pressure they feel."
    },
    {
        "dataID": "e25",
        "summary": "Speaker A is planning for a spring break trip and recently bought a dress for Easter.\nSpeaker B has a child referred to as \"the little monster\" and is a parent.\nSpeaker B suggests California as a destination for Speaker A's trip.\nSpeaker A changed their hair color to blue and is turning 29 next week.\nSpeaker A received a new car from their mom.\nSpeaker B recently turned 30.\nSpeaker A is going to a hair appointment for their birthday.\nSpeaker B has lived in California for 30 years and loves the weather and beaches there.\nSpeaker A lives in Indiana and is not a fan of the weather there, wishing to move to California someday.\nSpeaker B goes to the beach everyday if possible, with their 5-year-old daughter who loves to swim and play in the sand.\nSpeaker B's daughter is lucky to grow up close to the beach, only a fifteen-minute walk away.\nSpeaker B has tried surfing before but is not very good at it.\nSpeaker A has a daughter and mentions working and having to take time off.\nSpeaker A runs casually for exercise and is trying to build up stamina.\nSpeaker A prefers sprinting over long-distance running and is envious of Speaker B's ability to run on the beach.\nSpeaker B runs for exercise and started running in high school with track.\nSpeaker B finds running on sand more difficult but suggests running at the water's edge where it's wet.\nSpeaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology.\nSpeaker B has been to Italy in the past and enjoyed the food there.\nSpeaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.\nSpeaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\nSpeaker B enjoys Greek mythology and did a case study on Poseidon, the God of the Sea, Earthquakes, and Horses.\nSpeaker B appreciates the idea of superhuman powers and is interested in historical events that involve such figures."
    },
    {
        "dataID": "e26",
        "summary": "Speaker A enjoys cooking and baking, possibly considering turning it into a business.\nSpeaker B lives in a rural area with a farm and can relate to cooking.\nSpeaker A is from the south of India and prefers warm summer weather.\nSpeaker A plays sports, particularly tennis, and admires Serena Williams.\nSpeaker B does not cook, but enjoys listening to country music and drives trucks for a living.\nSpeaker A believes tennis is beneficial for building muscle and stamina.\nSpeaker A and Speaker B have a conversation about music preferences with Speaker B liking older country music and also enjoying rock and metal.\nSpeaker B's partner is in a rock band called EXHALE where he writes, sings, and plays rhythm guitar\nSpeaker B also mentions having a farm with animals like chickens, ducks, pigs, goats, and growing crops like corn, strawberries, and pumpkins.\nSpeaker A bakes muffins and bread but is conscious of their impact on their weight.\nBoth Speaker A and Speaker B discuss the challenges of maintaining a healthy balance as they age.\nSpeaker A owns a farm and enjoys cooking and baking.\nSpeaker B also owns a farm with produce and hens for eggs.\nSpeaker A has 14 chickens and uses their eggs for baking.\nSpeaker A primarily cooks Indian food and bakes a lot of rice dishes.\nSpeaker A is interested in running a business with their cooking skills.\nSpeaker B's husband is a great cook and Speaker B is not skilled in cooking.\nSpeaker B finds the idea of running a business with cooking stressful.\nSpeaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken.\nSpeaker B is not a cook but is interested in learning about cooking with a pressure cooker.\nSpeaker A recommends the pressure cooker for its efficiency and ease of use, suggesting it to Speaker B.\nSpeaker A has given a pressure cooker as a gift and uses it for recipes like lamb shanks.\nSpeaker B's husband is an avid cook who enjoys making Asian food with lots of prep work.\nSpeaker B is more focused on the end results of cooking rather than the process itself."
    },
    {
        "dataID": "e27",
        "summary": "Speaker A is involved in healing work and mentioned hot latina salsa.\nSpeaker B has 4 brothers and sisters, enjoys taking their houseboat out, and works as a bartender.\nSpeaker A recommended self-massage, essential oils, reiki, meditation, and self-awareness for healing.\nSpeaker B expressed interest in trying healing methods mentioned by Speaker A.\nSpeaker A enjoys salsa dancing and is planning to go out dancing.\nSpeaker B is relaxing on the water on a nice day.\nSpeaker A finds being on the water therapeutic and relaxing.\nSpeaker B's sister joined them on the water and is taking a nap in a hammock.\nSpeaker A plans to grab dinner with their brother before dancing.\nSpeaker A and their brother enjoy going to a Brazilian steakhouse for dinner.\nSpeaker A is interested in Speaker B's job as a bartender.\nSpeaker B enjoys bartending mainly for the fun aspect and the tips they receive.\nSpeaker B goes sailing during the summer for the best \"scenery.\"\nSpeaker B has one sibling, a little brother.\nSpeaker B has 16 aunts and uncles but doesn't keep up with them due to being spread out across the country.\nSpeaker B prefers to keep holidays local with their brother instead of having big family gatherings.\nSpeaker A is a Reiki practitioner who also works with meditation.\nSpeaker B enjoys sailing and has a houseboat where they spend time with their family.\nSpeaker A is planning to take their clients salsa dancing for fun.\nSpeaker B works as a bartender and enjoys meeting different people.\nSpeaker A's brother enjoys Brazilian food, specifically steak.\nSpeaker B's family enjoys dancing on the boat at night under the stars."
    },
    {
        "dataID": "e28",
        "summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker B is an inventor working on a teleportation machine and a time machine.\nSpeaker A's parents are teachers.\nSpeaker B has five puppies and loves them.\nSpeaker B is a fan of Beethoven and hopes to meet him by time traveling.\nSpeaker A plays the clarinet in a band concert and has a solar investment for their office building.\nSpeaker B is working on a teleportation machine that is currently small and requires substantial energy sources.\nSpeaker B is focused on developing renewable energy sources for their inventions.\nSpeaker B mentions the Chinese advancements in thermal nuclear generators and the need for a Manhattan Project for alternative energy.\nBoth speakers agree on the importance of addressing energy availability for the good of society and all living things, emphasizing redundancy and distribution for energy independence.\nSpeaker A is interested in nuclear energy and space exploration, mentioning fusion experiments.\nSpeaker B is also interested in space exploration and plant science, expressing concerns about the fuels used for space travel.\nSpeaker A mentions the idea of solar-powered space travel but doubts its feasibility.\nSpeaker B mentions having a teleportation machine and expresses interest in a journey to Mars.\nSpeaker A does not want to be sent to space by Elon Musk and expresses skepticism about his ideas.\nSpeaker B acknowledges Elon Musk's profit and hopes for technology to benefit more people.\nSpeaker A mentions parents who are teachers and expresses concern about weight gain.\nSpeaker B mentions weight gain from spending time at the computer and plans to work in the garden more.\nSpeaker A struggles with gardening but finds the idea of space plants intriguing.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden.\nSpeaker A is interested in space and jokes about sneaking aboard a spaceflight.\nSpeaker B jokes about sending space weeds into space and enjoys the idea of it.\nSpeaker A jokes about space weeds and expresses a desire to see space."
    },
    {
        "dataID": "e29",
        "summary": "Speaker A is 27 years old and hopes to change careers soon.\nSpeaker A's father was in the military.\nSpeaker A works for a small local business with a demanding schedule.\nSpeaker B works for a computer company and is unable to change careers until their child graduates.\nSpeaker B loves meeting new people and enjoys Disney World more than their child.\nSpeaker B's mother is a dentist and would disapprove of eating sweets.\nSpeaker A enjoys reading and has not been to Disney World but has read a lot about it.\nSpeaker A does not have children and spends time working and reading.\nSpeaker A enjoys reading books about ice cream, Disney World, and computers.\nSpeaker B has a child in kindergarten and is interested in taking them to Disney World.\nSpeaker A considers quitting their job to work at Disney World.\nSpeaker B's mother is a dentist and Speaker A expresses interest in speaking to her about it.\nSpeaker A is considering becoming a dentist and wants to talk to Speaker B's mother who is a dentist.\nSpeaker A prefers late morning for a meeting.\nSpeaker A wants to help others overcome fear of dentists.\nSpeaker B's mother is a dentist with her own practice.\nSpeaker B is willing to help set up a meeting between Speaker A and their mother.\nSpeaker A is open to meeting for lunch and is flexible with food choices.\nSpeaker A has been looking at dental programs in colleges.\nSpeaker A has not found a dental program yet but plans to keep looking.\nSpeaker A has no dietary restrictions.\nSpeaker A is considering a career in dentistry but is also interested in working at Disney for happiness.\nSpeaker B's mother is a dentist and loves her job.\nSpeaker B's child is interested in dentistry because of their grandma but does not want to pursue it as a career.\nSpeaker A is unsure about having their hands in someone's dirty mouth as a dentist.\nSpeaker A is torn between choosing a career in dentistry for the money or working at Disney for happiness.\nSpeaker A is considering going back to school for dentistry in the future.\nSpeaker A believes most dentists are old, but Speaker B mentions their mother is one of the young ones in the profession."
    },
    {
        "dataID": "e30",
        "summary": "Speaker A enjoys art and music, specifically painting.\nSpeaker B enjoys running and singing.\nSpeaker A prefers the color red and has a love for cars.\nSpeaker B has visited 20 countries and enjoys the color turquoise.\nSpeaker B's parents are high school sweethearts and support them in whatever they do.\nSpeaker A had a fortunate upbringing and enjoys helping people through volunteer work.\nSpeaker A finds meaning and fulfillment in doing volunteer work.\nSpeaker A is busy with gardening and volunteering at the hospital.\nSpeaker A and Speaker B both like the color turquoise.\nSpeaker B enjoys traveling and visiting gardens.\nSpeaker B is interested in singing and wants a studio in their house.\nSpeaker A is working on painting projects in their craft room.\nSpeaker A mentioned the high prices of new cars and doubts getting one.\nSpeaker B prefers running and biking over using a car for transportation.\nSpeaker A volunteers at a hospital and enjoys making origami crafts, specifically a 3D modular swan with glue.\nSpeaker B was recommended volunteering by Speaker A and has traveled to Japan and Italy, enjoying the art and food.\nSpeaker B keeps a turquoise lotus origami on their desk from Japan.\nSpeaker A is interested in trying to make a lotus origami next.\nSpeaker A and Speaker B both enjoy meeting interesting people through their volunteer work and travels.\nSpeaker A met someone at the hospital who visited Italy and enjoyed the art museums and restaurants there.\nSpeaker B likes small family-owned restaurants with fresh homemade pasta in Italy.\nSpeaker A enjoys origami and tried making a Lotus flower successfully.\nSpeaker A learned origami by themselves in their craft room.\nSpeaker A's favorite color was used for the Lotus flower.\nSpeaker A wishes to visit the country where origami was originally created, possibly Japan.\nSpeaker B has visited Japan and found it to be an amazing country.\nSpeaker B had to deal with Japan's visa requirements, which were expensive but worth it.\nSpeaker A plans to visit Italy first before going to Japan.\nSpeaker A offered to teach Speaker B origami in a few weeks.\nSpeaker B is interested in making origami animals and finds the idea cute.\nSpeaker A mentioned that making just the heads of origami animals is easier than the whole body."
    },
    {
        "dataID": "e31",
        "summary": "Speaker A moved from Alaska to their current location.\nSpeaker A enjoys programming and plans to go for a long run after work.\nSpeaker B has kids and enjoys watching movies with them.\nSpeaker B just turned 40 and considers themselves too old for certain activities.\nSpeaker A does not think 40 is old.\nSpeaker B has a sister who shares the same opinion about age as Speaker A.\nSpeaker B used to teach Film Studies and carefully chooses what movies to watch.\nSpeaker B enjoys watching suspense films, action, SF, horror, westerns, drama, and occasional good comedy.\nSpeaker B allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s.\nSpeaker B is not close with their sister and they have grown apart after their parents passed away.\nSpeaker B enjoys reading, playing music, watching movies, and hiking in their free time.\nSpeaker A used to hike in Alaska when they lived there.\nSpeaker A and Speaker B both enjoy steak dinners.\nSpeaker A prefers sirloin while Speaker B likes ribeye.\nSpeaker A likes peppercorn sauce and thick cut chips with their steak.\nSpeaker A prefers their steak cooked medium.\nSpeaker B enjoys their steak medium rare.\nSpeaker B recommends trying wagyu beef.\nSpeaker B aspires to live a luxurious life like a top of the range wagyu cow.\nSpeaker A is interested in watching movies, mentioned Pulp Fiction and Uma Thurman.\nSpeaker A relies on Speaker B for movie suggestions, mentioning a preference for comedies.\nSpeaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences.\nSpeaker B recommended \"Coming 2 America\" and \"I-SPY\" starring Eddie Murphy.\nSpeaker A enjoyed the movie \"Coming to America\" and expressed interest in watching its sequel.\nSpeaker A was disappointed with the movie \"Showtime\" starring Eddie Murphy and DeNiro.\nSpeaker B highlighted Eddie Murphy's success in cop roles in movies like Beverly Hills Cop trilogy and \"I-SPY.\""
    },
    {
        "dataID": "e32",
        "summary": "Speaker A has two moms who are not meat eaters.\nSpeaker B recently quit their job at Cisco to pursue snowboarding.\nSpeaker A enjoys eating meat.\nSpeaker A and Speaker B have different tastes in music.\nSpeaker B's favorite artist is Charlie Parker.\nSpeaker B is going to buy their first new car.\nSpeaker A is eating their favorite jello.\nSpeaker B values following their passions for snowboarding and music.\nSpeaker A has a strong connection to jello, particularly cherry flavor, due to their grandma making it at family dinners.\nSpeaker B also enjoys jello, with cherry being their favorite flavor as well.\nSpeaker A learned how to make jello from their grandma, turning it into a family tradition.\nSpeaker B regrets not having the opportunity to spend quality time with their grandparents, who were busy running a grocery store before they passed away.\nSpeaker A has a grandmother who teaches them various jello recipes.\nSpeaker B does not do a lot of cooking or baking but is interested in learning.\nSpeaker A suggests that Speaker B can consider their grandmother as a surrogate grandma for learning jello recipes.\nSpeaker B enjoys snowboarding but will focus on wakeboarding as summer approaches.\nSpeaker A loves boating and water sports, mentioning that they are better at water skiing than wakeboarding.\nSpeaker B expresses interest in trying water skiing next.\nSpeaker A has been water skiing for 15 years and has 3 kids who also water ski.\nSpeaker B is excited to join Speaker A's family for a water skiing trip and wants to learn from Speaker A's kids.\nSpeaker A takes their boat out every day and wishes they had a houseboat.\nSpeaker B is considering living in a houseboat when they are old and retired."
    },
    {
        "dataID": "e33",
        "summary": "Speaker A enjoys hunting in their free time and is concerned about deer overpopulation.\nSpeaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop.\nSpeaker B's favorite champion in League of Legends is Alistar.\nSpeaker A does not play video games often but may consider trying them.\nSpeaker A does not know who Alistar is and does not have any other hobbies besides hunting.\nSpeaker A enjoys hunting deer and checking out conditions for animals living in the area.\nSpeaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\nSpeaker B plays Resident Evil VIII alone in the dark to make it scarier.\nSpeaker A prefers tamer video games and is not a fan of horror movies.\nSpeaker A hunts on their own or family-owned land as well as state hunting sites.\nSpeaker B has never shot a real gun before but is interested in joining Speaker A for hunting.\nSpeaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\nSpeaker B is interested in playing Jurassic Park: World but has not played it yet.\nSpeaker A and Speaker B both enjoy playing video games in their free time.\nSpeaker B likes to play golf when not playing video games.\nSpeaker A has tried golfing but feels they are not good at it.\nSpeaker A suggests going hunting with Speaker B, who is inexperienced and willing to learn.\nSpeaker A and Speaker B plan to teach each other hunting and golfing respectively.\nBoth Speaker A and Speaker B enjoy spending time outdoors.\nSpeaker B finds hunting peaceful and a great way to enjoy nature.\nSpeaker A enjoys hunting and is planning to teach Speaker B how to hunt.\nSpeaker A is experiencing gun trouble and plans to take it to the shop for repair.\nSpeaker B is interested in trying the Jurassic Park game.\nSpeaker A enjoys playing the Jurassic Park game but mentions its lack of multiplayer and outdated graphics.\nSpeaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\nSpeaker A and Speaker B plan to meet next week Friday at 6 pm to play games and order pizza.\nSpeaker B mentions that Resident Evil can be scary and provides some tips for playing it."
    },
    {
        "dataID": "e34",
        "summary": "Speaker A works at a local fast-food restaurant to pay bills and enjoys reading and gardening.\nSpeaker A's sister recently got married, which was exciting for them.\nSpeaker B followed their father's footsteps and works for Ford Motors.\nSpeaker B has a cat that recently had a kitten and enjoys visiting the zoo.\nSpeaker A does not have a favorite food and is not a picky eater.\nSpeaker A and Speaker B discuss hobbies and interests, with Speaker A enjoying gardening and reading, and Speaker B enjoying visiting the zoo.\nSpeaker A enjoys seeing pandas and penguins at the zoo and goes with their sister.\nSpeaker B's girlfriend enjoys pandas and penguins at the zoo, and they go to the zoo every few weeks.\nSpeaker A takes several shifts at work, making reading more convenient in between.\nSpeaker B used to read a lot when younger but has trouble getting into it again, considering trying audiobooks.\nSpeaker A tried audiobooks but found it difficult to focus, not good at multitasking.\nSpeaker B hopes to have better luck with audiobooks to get back into reading.\nSpeaker A is well-read and enjoys fantasy books.\nSpeaker B likes poetry and fantasy books, and has a pet cat.\nSpeaker A has been to the zoo before and enjoys seeing exotic birds.\nSpeaker B's girlfriend has a cockatoo that makes a lot of noise.\nSpeaker A's sister is a dog person with a yellow lab.\nSpeaker A prefers cockatoos over kittens as pets.\nSpeaker B is considering adopting a kitten from a friend.\nSpeaker A has a sister who owns a corgi.\nSpeaker A is not interested in having children due to the responsibility and financial aspect.\nSpeaker B is open to being a cool uncle to his sister's future children but does not want kids of his own.\nSpeaker B's girlfriend owns a cockatoo named John.\nSpeaker A is focused on saving money and not planning to have children in the near future."
    },
    {
        "dataID": "e35",
        "summary": "Speaker A works at a coffee shop that their mom owned.\nSpeaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father.\nSpeaker B is married with two boys and grew up in San Francisco.\nSpeaker B travels a lot for their job.\nSpeaker B is an avid fisherman.\nSpeaker A loves the show Friends and enjoys visiting graffiti-filled places.\nSpeaker B loves fries.\nSpeaker A's favorite tattoo is the one dedicated to their late father, saying \"for you I shall live\".\nSpeaker A works at a coffee shop and is saving up for their next tattoo.\nSpeaker A plans to get a portrait of their father's face next to a slogan they already have tattooed on their chest.\nSpeaker B recently went to Michigan for a work sales convention but managed to fish during a canceled day.\nSpeaker B caught a 30-pound muskie in Michigan, a fish with a mouth full of teeth that is not very tasty.\nSpeaker B enjoys fishing and wishes their wife and sons could have joined them on the trip.\nSpeaker A and Speaker B have a conversation about their personal interests and trips they have taken for work.\nSpeaker A is familiar with Humboldt County, mentioning Eureka, Arcata, the bay area, the treasure coast, the lost coast, and the redwood forest.\nSpeaker A warns Speaker B about the high rate of car burglaries in Humboldt County.\nSpeaker B is planning a fishing trip off the California coast and will be visiting Humboldt County, specifically Eureka.\nSpeaker B chose Humboldt County based on travel blog recommendations and Speaker A's positive feedback.\nSpeaker A mentions the lenient penal system towards property crimes in California, specifically in San Francisco due to the new District Attorney.\nSpeaker A is knowledgeable about various sites and parks.\nSpeaker B is planning a trip and interested in visiting national parks.\nSpeaker A mentions Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion.\nSpeaker B is interested in seeing the Sequoia trees, including the famous drive-through tree.\nSpeaker B's goal is to visit every national park in the US.\nSpeaker A did not visit the drive-through tree and asks Speaker B to let them know if they do.\nSpeaker B is curious about the history of the Carson Mansion."
    },
    {
        "dataID": "e36",
        "summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker B works as a zoo keeper and enjoys it.\nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper.\nSpeaker A's job involves troubleshooting, including the common phrase \"did you try turning it on and off again?\".\nSpeaker B's brother owns a grocery store and thinks people can be dumb there.\nSpeaker A is interested in animals, specifically raccoons and bearded dragons.\nSpeaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon.\nBandicoot is 3 years old, while Bob the bearded dragon is 7 months old.\nBandicoot was a rescue and has been at the Raccoon Cafe since he was a baby.\nSpeaker A has not interacted closely with raccoons but admires them.\nSpeaker B considers raccoons intelligent and funny.\nRaccoons are known for being able to escape despite efforts to secure trash containers.\nSpeaker B has only had Bob the bearded dragon for about a month.\nSpeaker A visited a pet store and saw a bearded dragon for the first time.\nSpeaker B owns a raccoon named Bandicoot and a bearded dragon named Bob.\nSpeaker A fosters dogs and is concerned about adding a bearded dragon to their household.\nSpeaker B's raccoon Bandicoot is not bothered by the bearded dragon Bob.\nSpeaker A is worried about the raccoon potentially eating the bearded dragon.\nSpeaker A hears raccoons and cats fighting in their neighborhood.\nSpeaker B has been taking care of the raccoon for over a month and is interested in training it.\nSpeaker B believes raccoons can make good pets if cared for properly.\nSpeaker B mentioned that raccoons cannot legally be sold as pets, but can be rescued and cared for before being released back into the wild.\nSpeaker A fosters dogs and is used to them coming and going.\nSpeaker A is allergic to cats, so they do not foster them.\nSpeaker B has a dog named Bandicoot and is willing to bring him over for extra company.\nSpeaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.\nSpeaker A does not have bears around their area.\nSpeaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather."
    },
    {
        "dataID": "e37",
        "summary": "Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.\nSpeaker A is tired after spending time with their energetic grandchildren.\nSpeaker B has a son and enjoys reading books, particularly about animals.\nSpeaker B is fascinated by animals and can relate to Speaker A's comparison of their grandchildren to animals.\nSpeaker A is older and babysits their grandchildren about four days a week and most weekends.\nSpeaker B is a parent to a young son who keeps them busy throughout the day.\nSpeaker A's grandchildren are old enough to entertain themselves by using technology or watching TV.\nSpeaker A enjoys watching Jeopardy with their grandchildren and cooking for them, with the busiest time being the weekend.\nSpeaker A watches Netflix shows rated over 3.5 stars after running out of things to watch.\nSpeaker B is looking forward to having more time to themselves once their son starts preschool next year.\nSpeaker B is planning to buy school supplies for their son and will check local stores or order online.\nSpeaker A has grandchildren and enjoys watching movies with them.\nSpeaker B has a pre-schooler who enjoys watching movies like Toy Story, Beauty and the Beast, and The Lion King.\nSpeaker A's grandchildren have watched Toy Story multiple times.\nSpeaker B's son loves Woody from Toy Story.\nBoth Speaker A and Speaker B are fans of Jeopardy and miss Alex Trebek.\nSpeaker B's wife likes Ken Jennings as a potential host for Jeopardy.\nSpeaker A was influenced by Alex Trebek and Ken Jennings to develop a love for books and reading.\nSpeaker B values reading and education for a successful life and tries to instill this in their son.\nSpeaker A has grandchildren and mentions watching them.\nSpeaker B is a mother to a son who is going to start going to school soon.\nSpeaker B is considering volunteering at an animal shelter when her son starts school.\nSpeaker B is concerned about her son growing older and not being around as much next year.\nSpeaker A suggests taking naps during quiet times and mentions watching her grandkids.\nSpeaker A and Speaker B discuss their children getting older and becoming more independent."
    },
    {
        "dataID": "e38",
        "summary": "Speaker B is from Mexico City and loves Mexican food.\nSpeaker A is from a city known for great iced teas and prefers unsweetened iced tea.\nSpeaker A drives a Mini Cooper and recently visited a hair salon.\nSpeaker B recently purchased a Subaru Legacy.\nSpeaker A has a cat that recently had a kitten.\nSpeaker B loves dogs.\nSpeaker A mentions having a Mini car, which is smaller compared to Speaker B's Subaru.\nSpeaker B is planning a road trip to San Diego, California, with their new car.\nSpeaker B has two kids and appreciates the extra space in the new car for backpacks and toys.\nSpeaker A has a kitten from their cat and enjoys taking them on trips.\nSpeaker A lives on the Moon, where it is cold with very little traffic.\nSpeaker A prefers flying over driving for trips.\nSpeaker A has never been to San Diego but wants to go.\nSpeaker A usually leaves their cats with a friend while traveling.\nSpeaker A enjoys drinking tea and water.\nSpeaker B is planning a trip to San Diego with their kids.\nSpeaker B is excited for the trip and looking forward to trying the best iced tea.\nSpeaker B is open to trying flavored packets to get their kids to drink more water.\nSpeaker B offers to give recommendations for the best food in Mexico City to Speaker A.\nSpeaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\nSpeaker B went on a trip to San Diego with kids, struggled with parking for the Subaru.\nSpeaker B is not a cat person but ends up taking care of stray cats brought home by kids.\nSpeaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels."
    },
    {
        "dataID": "e39",
        "summary": "Speaker A is a student planning to go to college next year and wants to study neuroscience.\nSpeaker B recently divorced their wife and loves to scuba dive in Hawaii when not working.\nSpeaker A is working on becoming an Eagle Scout and volunteers at a research lab.\nSpeaker B is a veteran and knows of Eagle Scout projects for veterans, including one that helps dispose of American flags correctly.\nSpeaker B has two pet snakes named Hansel and Gretel.\nSpeaker B has experience scuba diving in Hawaii and found it to be amazing and beautiful.\nSpeaker A does not have any pets and expresses an interest in scuba diving.\nSpeaker A is scared of sharks but finds the idea of going into a steel cage with them interesting.\nSpeaker B mentions studying Neuroscience classes next year, hinting at being a student.\nSpeaker A is knowledgeable about shark behavior, seals, and neuroscience.\nSpeaker B has an interest in diving and is planning to take neuroscience classes using the GI Bill.\nSpeaker A plans to work with humans in neuroscience to help cure neurological diseases.\nSpeaker B prefers animals to humans but acknowledges the importance of curing diseases.\nSpeaker A finds it amusing that Speaker B prefers animals to humans.\nSpeaker A has a positive outlook on scientific progress in curing diseases through research.\nSpeaker B is excited about taking neuroscience classes next year.\nSpeaker A is interested in scuba diving and neuroscience, with experience in a research lab.\nSpeaker B is a veteran who went to the army after high school, interested in neuroscience and seeking advice on studying it.\nSpeaker A has a friend who is a professional scuba diver and plans to go diving with them.\nSpeaker B goes to Hawaii for scuba diving and is considering studying marine life or a different type of animal.\nSpeaker B's classes related to neuroscience will start next year.\nSpeaker A's interest in neuroscience was further fueled by their experience in a research lab and being in the Eagle Scouts.\nSpeaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies."
    },
    {
        "dataID": "e40",
        "summary": "Speaker A recently gave birth to twins and is a stay-at-home mom.\nSpeaker A used to work at IKEA in Sweden for twelve years.\nSpeaker A plays tennis every week and goes to church.\nSpeaker A wants more children and feels lonely due to their husband's frequent traveling.\nSpeaker B works at a fast-food place and loves ice cream.\nSpeaker B is not yet in college but hopes to become an Eagle Scout.\nSpeaker B finds fulfillment in being a stay-at-home mom despite feeling lonely.\nSpeaker A is involved in church activities and mentioned a church retreat\nSpeaker B is a member of the boy scouts and works at a fast food place\nSpeaker B has not taken any vacations recently but has vacation days saved up\nSpeaker A suggested that Speaker B join one of the church retreats in the future.\nSpeaker A has twins and loves being a parent, mentioning a desire for triplets.\nSpeaker A is involved in a church choir and organizing a retreat, looking for volunteers.\nSpeaker A appreciates Speaker B's involvement with the scout troop and invites them to a youth retreat.\nSpeaker B is busy with scouts, school, work, and tennis, but willing to take vacation days for the retreat.\nSpeaker B believes in the unique connection between twins and their ability to communicate.\nSpeaker A has twins and is involved with their church as a volunteer.\nSpeaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout.\nSpeaker B plans to earn the Eagle Scout badge for college applications.\nSpeaker B is considering attending a local community college for the first couple of years."
    },
    {
        "dataID": "e41",
        "summary": "Speaker A is a college student who teaches jiu-jitsu and is lactose intolerant.\nSpeaker B is a software tech from England who runs marathons and has lived in the US since 2004.\nSpeaker B runs a foster home for dogs and misses their dogs from their home country.\nSpeaker A is planning to take summer courses soon and is very active, enjoying martial arts.\nSpeaker A is enrolled in a class on the history of martial arts and is majoring in athletic training.\nSpeaker B is busy debugging software and is a runner.\nSpeaker B has dogs in England and plans to visit family and friends there\nSpeaker A has never been out of the United States and thinks it would be nice to visit England.\nSpeaker B has considered adopting a dog in the states but feels it would be disloyal to their dogs in England.\nSpeaker A is taking a history of martial arts class and enjoys it.\nSpeaker B is from London, England and misses it.\nSpeaker A has never left the US but wants to visit England.\nSpeaker B enjoys visiting local restaurants in London.\nSpeaker A and Speaker B have not booked any holidays recently.\nSpeaker A is interested in trying new restaurants, mentioning Taco Bell as their favorite.\nSpeaker A is a martial arts teacher and student and is pursuing an athletic training degree in college.\nSpeaker B enjoys fancy restaurants and mentioned Sufi as their favorite in London.\nSpeaker B is involved in software work and recently signed up for an online class about the history of martial arts.\nSpeaker B is interested in planning a trip to England with Speaker A over spring break.\nBoth Speaker A and Speaker B are interested in martial arts and enjoy learning new things."
    },
    {
        "dataID": "e42",
        "summary": "Speaker A is a country music fan, lives on a corn and bean farm, and enjoys driving trucks and tractors.\nSpeaker B is looking for furniture shop to buy furniture, has two dogs, and works near a mall.\nSpeaker A and Speaker B both enjoy barbecuing and have a love for pets.\nSpeaker A's favorite season is winter and enjoys the country lifestyle.\nSpeaker B is in the process of renovating their house to meet their living standards with their pets.\nSpeaker A and Speaker B are discussing furniture and home decor choices.\nSpeaker B recently purchased purple sofas for their home.\nSpeaker A suggests ways to incorporate the purple sofas into the existing light green paint in the room.\nSpeaker B is considering adding more colorful elements to the room to make the purple sofas work.\nSpeaker A and Speaker B both acknowledge their lack of expertise in interior decorating.\nSpeaker A is looking to redecorate their house and likes purple furniture.\nSpeaker B regrets their green and purple color scheme and is willing to give away their purple furniture.\nSpeaker A and Speaker B plan to meet up to discuss the furniture exchange.\nSpeaker B plans to grill steaks this weekend and prefers using an old charcoal grill over a gas one.\nSpeaker A recommends seasoning everything and using a smoker for grilling.\nSpeaker A enjoys grilling corn with mayo and cheese.\nSpeaker B prefers getting corn straight from the farm for grilling.\nSpeaker A suggests trying grilled corn with cotija and mayo.\nSpeaker A likely lives on a corn farm.\nSpeaker A recently bought new furniture for their house, including a couch, recliner, and patio furniture.\nSpeaker A is looking forward to spending quiet evenings outside during the summer, possibly grilling most nights.\nSpeaker B suggests making enough barbeque for leftovers on nights when grilling is not possible, due to time or energy constraints.\nSpeaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.\nSpeaker B plans to bring a new marinade and a six pack of beer for the gathering.\nSpeaker A has devices to keep bugs away and offers to share the product names with Speaker B.\nSpeaker A and Speaker B reminisce about bug-repelling candles advertised on TV."
    },
    {
        "dataID": "e43",
        "summary": "Speaker A's mother is a pediatrician.\nSpeaker A has a dog named Wylie.\nSpeaker A's father is a fireman.\nSpeaker B has three kids.\nSpeaker B commutes to work by boat because they live in Amsterdam with many canals.\nSpeaker B enjoys being outside and reading Star Wars novels.\nSpeaker A and Speaker B both enjoy reading and are librarians.\nSpeaker A has kids and is familiar with Greek mythology.\nSpeaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian.\nSpeaker B's lucky number is three, which coincides with the number of kids they have, being the third born in their family, and the uniform number when they played handball.\nSpeaker A believes the world needs more strong women and agrees with the importance of the present time for them to rise.\nSpeaker A's lucky number is 7.\nSpeaker B appreciates the significance of the number 12, relating it to the 12 goddesses in mythology.\nSpeaker B is planning a trip to Greece in the next three months with a family of five.\nSpeaker A has traveled around Europe before, visiting capital cities of each country.\nSpeaker A's favorite cities from the trip were Rome, Berlin, Madrid, and Helsinki.\nSpeaker A took someone named Wylie with them on the trip.\nSpeaker B is interested in going to Finland but has not been able to visit yet.\nSpeaker B goes on a summer holiday every year with their family of five.\nSpeaker A enjoys traveling but prefers not to do it alone.\nSpeaker A booked a plane ticket to Rome on a whim and is leaving in two weeks.\nSpeaker B is planning to leave for a trip later in the summer, likely a month before school starts.\nSpeaker B and their kids are excited about their upcoming trip to Greece.\nSpeaker A hasn't planned their trip out yet but is open to suggestions.\nSpeaker B recommends visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece.\nSpeaker B's favorite Greek god/goddess is Athena.\nSpeaker B asks Speaker A if their trip is more for relaxation or sightseeing."
    },
    {
        "dataID": "e44",
        "summary": "Speaker A is a runner who dislikes traveling but has visited 20 countries.\nSpeaker A is from Venice Beach originally.\nSpeaker B travels frequently for work and misses their wife and kids.\nSpeaker A enjoys singing and picked up a yodel in their travels.\nSpeaker A's parents met in high school choir.\nSpeaker B is from San Francisco and enjoys fishing and the outdoors.\nSan Francisco has beautiful turquoise oceans and great restaurants.\nSpeaker A is a runner who is working on improving their mile time and training for a marathon.\nSpeaker B has run a marathon before and found it tough but rewarding.\nSpeaker A is going to be away from their wife and kids for work for a week, indicating that they have a family.\nSpeaker A dislikes traveling away from their family for work.\nSpeaker A sprained their ankle while training for marathons.\nSpeaker B has also experienced ankle sprains in the past.\nSpeaker A is training for marathons and seeking advice on how to recover.\nSpeaker B is a motivational speaker who travels to schools and conferences to give pep talks.\nSpeaker B's job involves motivating people to be successful and follow their dreams.\nSpeaker B got into motivational speaking because they needed it themselves to battle depression and anxiety.\nSpeaker A had an ankle injury that is healing up.\nSpeaker B is considering running a marathon and mentioned fishing and feeling depressed.\nSpeaker A combines yodeling with running for lung preparation.\nSpeaker A is an attraction on the beach and has videos of themselves yodeling while running.\nSpeaker B joked about combining fishing with feeling depressed, and mentioned taking young boys to the pond during school hours.\nSpeaker A suggested that Speaker B should combine something more active with feeling depressed to avoid dwelling on negative thoughts.\nSpeaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600."
    },
    {
        "dataID": "e45",
        "summary": "Speaker A is a recent high school graduate, shy, and on a cross-country journey looking for jobs.\nSpeaker B enjoys camping, hiking, and is kind, caring, and hopeful for group equality.\nSpeaker A does not care about voting and plans to send their parents a postcard.\nSpeaker B does not vote and wants their neighbor John to know about their stance on group equality.\nSpeaker A enjoys camping and hiking, mentioning setting up a hammock at their campsite.\nSpeaker B has a hammock in their backyard but their dog frequently uses it.\nSpeaker B has children, a dog, and enjoys hiking, mentioning the Columbia Trail and Ken Lockwood Gorge near High Bridge.\nSpeaker B's neighbor, John, is getting divorced and selling top-of-the-line camping gear.\nSpeaker A is looking for a job and new camping gear, specifically a hammock.\nSpeaker A plans to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip.\nSpeaker A applied to work at a grocery store near a hiking trail.\nSpeaker B's friend worked at the same store and enjoyed the people there.\nSpeaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail.\nSpeaker A will use the money earned from the store to buy the hammock online.\nSpeaker A and Speaker B have gone hiking together before and plan to meet up for another hike.\nSpeaker A and Speaker B are planning to go hiking together this weekend.\nSpeaker A suggests bringing water for the hike and mentions having a picnic at the top of the mountain.\nSpeaker B is not in the best hiking shape and jokes about needing to recharge their energy.\nSpeaker A plans to bring sandwiches and fruit for the hike, specifically asking about veggie sandwiches for Speaker B.\nSpeaker A has a portable hammock for the hike and asks if Speaker B will bring theirs.\nSpeaker A decides not to bring the hammock due to extra weight in their bag.\nThere is a lake at the hiking trail, and Speaker A suggests swimming in it, warning that the water may be cold.\nSpeaker B is excited about the idea of swimming in the lake, mentioning they have swum in cold water before."
    },
    {
        "dataID": "e46",
        "summary": "Speaker A was born and raised as a preacher's kid in the country, working on a produce farm.\nSpeaker B is not a fan of country music and comes from a family that focuses on their real estate company.\nSpeaker B prefers winter as their favorite time of year.\nSpeaker A has never been to college and values the peaceful life of working on the farm.\nSpeaker B believes that luxurious items distract from the value of their family.\nSpeaker A and Speaker B have a friendly interaction and part ways on a positive note.\nSpeaker A lives on a farm and is inviting Speaker B and their kids to attend a Quaker City Night Hawks concert.\nSpeaker B leads a hectic life but is interested in attending the concert with their kids during winter break.\nSpeaker A suggests that Speaker B and their family could stay over at the farm after the concert.\nSpeaker B expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm.\nSpeaker A mentions that Speaker B's kids could try milking cows on the farm, which Speaker B finds amusing.\nSpeaker B agrees that it would be a great experience for their kids to learn about food sources and is excited to plan the visit.\nSpeaker A works on a family farm and will be using the new truck for farm work.\nSpeaker A used to live in a suburb of DC and misses the convenience of city life.\nSpeaker B prefers almond milk for their kids due to stomach issues with cow's milk.\nSpeaker B appreciates the convenience of city living but also values what the country has to offer.\nSpeaker A enjoys the peace and quiet of country life, the fresh produce, and fresh air.\nSpeaker B is open to moving to the country to be further away from neighbors.\nBoth speakers dream of having a city and country house or a summer and winter home.\nBoth speakers acknowledge the pros and cons of city and country living.\nSpeaker A and Speaker B both bought lotto tickets for a big jackpot.\nSpeaker B bought 20 lotto tickets with the same numbers, aiming to get a bigger share of the jackpot if they win.\nSpeaker A bought 50 lotto tickets with different numbers to increase their chances of winning.\nSpeaker B's children have been sick, and Speaker B also had a fever, possibly influencing their decision to buy 20 lotto tickets.\nSpeaker A and Speaker B discuss different strategies for playing the lotto and the potential outcomes if they win."
    },
    {
        "dataID": "e47",
        "summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker B is a female who enjoys going places and trying new things.\nSpeaker A and Speaker B both have two sons.\nSpeaker A is a lifelong fan of Tupac Shakur.\nSpeaker B enjoys music from a variety of genres, including Maroon 5, The Rolling Stones, Brad Paisley, and Luke Bryan.\nSpeaker A enjoys different cuisines like Mexican, Italian, and Chinese.\nSpeaker A and Speaker B both enjoy Chinese and Italian food, but Mexican food upsets Speaker B's stomach.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker B has two sons, one who loves Chinese food like Speaker A, and the other who prefers Italian food.\nSpeaker A's boys have been out of town for a while and are leaving again in a few months.\nSpeaker A found a new Chinese restaurant called China Dragon and took their boys there.\nSpeaker A enjoys spending time with their sons despite worrying about them traveling far away.\nSpeaker A's boys are leaving again in a few months for another trip after studying abroad.\nSpeaker B's younger son would be jealous of Speaker A's sons' European tour.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker B has sons who are turning thirteen soon, and they are planning a surprise birthday party.\nSpeaker A's son and his girlfriend are studying to be chefs in college.\nSpeaker A's youngest son is addicted to social media and video games.\nSpeaker B is trying to encourage one of their sons to get into programming or writing, but the son is more interested in gaming with friends.\nSpeaker A has two sons, one of whom has a girlfriend and the other is secretive and possibly gay.\nSpeaker B has two sons, one of whom has had a girlfriend for several years and the other is secretive.\nSpeaker A's sons play video games and listen to music in their rooms.\nSpeaker A's sons will be coming for winter break from Europe.\nSpeaker B's sons would possibly get along well with Speaker A's sons.\nSpeaker B is good at ice skating and suggests going to an ice skating rink during winter break."
    },
    {
        "dataID": "e48",
        "summary": "Speaker A lives in a big city and enjoys being around people.\nSpeaker B has 2 older and 1 younger brother, and their father used to be a farmer.\nSpeaker A has two daughters and only their mother is alive.\nSpeaker A loves Disney music.\nSpeaker B drove over 1000 miles to see their favorite band, Three Dog Night.\nSpeaker A is unfamiliar with Three Dog Night but recognizes the song \"Jeremiah was a bullfrog.\"\nSpeaker B mentions that Three Dog Night sings that song and other popular songs.\nSpeaker A used to live in Los Angeles.\nSpeaker A's favorite street food is lengua (cow's tongue) tacos.\nSpeaker B was born in Brazil, specifically in San Paulo.\nSpeaker B enjoys living in the city for the accessibility to food and live music.\nSpeaker B's favorite street food is a hot dog with sauerkraut, mustard, onions, and cheese.\nSpeaker A is interested in music concerts and planning a trip to Sao Paulo.\nSpeaker B is a fan of rock and metal music, particularly Three Dog Night.\nSpeaker B has seen Three Dog Night in concert and enjoys their live shows.\nSpeaker B's favorite Three Dog Night song is 'Mama Told Me'.\nSpeaker B recommends visiting the Museum of Art of São Paulo in the city.\nSpeaker A enjoys going to museums and trying different foods.\nSpeaker B is waiting for bands to announce their summer tour schedule to plan which shows to attend.\nSpeaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend.\nSpeaker A plans to do lots of shopping during their trip.\nSpeaker A's boyfriend enjoys drinking, so they are looking for good bars or clubs to enjoy the night.\nSpeaker A and their boyfriend also look forward to having some refreshing beers by the beach.\nSpeaker B mentions that there are all kinds of beaches in São Paulo, including busy, calm, and trendy ones."
    },
    {
        "dataID": "e49",
        "summary": "Speaker A is an inventor who enjoys teleporting around the world and is currently working on a time machine.\nSpeaker B is a 26-year-old workaholic who is unsure about their career and doesn't have strong opinions on puppies.\nSpeaker A is more interested in science than music, while Speaker B enjoys listening to Black Sabbath and grilling meat.\nSpeaker A is busy with work and used to foster puppies but no longer does.\nSpeaker B is interested in trying different careers and is considering becoming a chef for Speaker A who loves Mexican food and seafood.\nSpeaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.\nSpeaker A loves animals, especially puppies, and visits shelters in every city they go to.\nSpeaker A dreams of meeting all the puppies from history when they can move through space and time.\nSpeaker A has experience working night shifts and sees it as a drawback.\nSpeaker B is interested in becoming a chef but hasn't had the time to apply for jobs.\nSpeaker B's current job keeps them busy with little free time, affecting their social life.\nSpeaker A suggests that working as a line cook or chef involves a big time commitment and building a working family.\nSpeaker A enjoys grilling indoors and suggests grilled asparagus with lemon on it.\nSpeaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters.\nSpeaker B is working on a project to build their resume and is unsure about the type of work they want to do.\nSpeaker B is interested in volunteering and prefers cats over dogs, especially kittens.\nSpeaker A mainly cares for dogs at the animal shelter, but also cats, and loves when new puppies are brought in."
    }
]