[
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations, which caused them to now live in a little house in the suburbs that they love.\n2. The child's supportive and caring nature towards the parent makes the parent want to provide a safe and stable environment, as they value independence and self-sufficiency.\n3. Both the parent and child express love and support for each other, with the child finding the parent's story inspiring as the parent mentions making mistakes in the past and trying to turn their life around.",
        "speaker": "Parent",
        "raw_prediction": "I'm glad you feel that way. It's important to truly listen and understand others.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.",
        "memory_text": "1. [The Parent's experience in juvenile detention led to a newfound appreciation for small moments, such as watching the sunrise after leaving detention.] - (SameTopic) - [The child reminisces about a special morning watching the sunrise with the parent.]\n   \n2. [The child's supportive and caring attitude towards the parent inspired the Parent to find hope and value small moments even in tough situations.] - (Causes) - [The parent reflects on past mistakes and efforts to make positive changes in life.]\n   \n3. [The child's comforting reassurance towards the parent resulted in the Parent getting to see the sunrise after leaving detention.] - (Changed) - [The parent faced challenges during arrest and had to seek help from a lawyer and the justice system.]",
        "speaker": "Parent",
        "raw_prediction": "That morning was truly special. It's moments like those that remind me of the beauty in life.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.",
        "memory_text": "1. The Mentor has been guiding and supporting the Mentee in their work for years, which causes the Mentee to be offered a job and decide to take the job in the city.\n2. The Mentee hopes to inspire others to join the cause of gender equality and fighting discrimination, so the Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process, even though the Mentee is feeling overwhelmed with the college application process.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way, Mentee. Building new friendships takes time, but I believe you'll find your place soon. Just keep being yourself and open to new experiences.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t3",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.",
        "memory_text": "Neighbors A and B started spending more time together, eventually becoming good friends who have known each other for years. They catch up frequently, reminiscing about past events and planning to hang out once a week. Neighbors A enjoys the support and comfort Neighbor B provides, while Neighbor B suggests cooking together and shows consideration by offering extra water for lawn mowing.",
        "speaker": "Neighbors B",
        "raw_prediction": "I know you meant well, but I wasn't quite ready for a cold plunge. Let's stick to warmer activities next time.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t10",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.",
        "memory_text": "Neighbors A and B initially wanted to spend more time together as they didn't know each other well. Now, they are on friendly terms and enjoy spending time together. Additionally, both neighbors enjoy spending time outside, even if it involves doing chores like mowing the lawn. As a result, Neighbor B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides. Furthermore, they plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. This indicates that Neighbors A and B have not seen each other in a while and are catching up. Moreover, Neighbor A mentioned mowing the lawn with an old push mower, suggesting they are responsible for the yard work. This is related to Neighbor A feeling pressured to look perfect all the time by their mom, who scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's fair, everyone has their own preferences when it comes to working out. Do you have a favorite indoor workout routine?",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t6",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.",
        "memory_text": "Co-worker B supports and encourages Co-worker A to prioritize their health. This leads to Co-worker B feeling glad that Co-worker A is okay. Additionally, Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership. \nCo-worker B offers help and support to Co-worker A, resulting in Co-worker A being grateful for the assistance. Subsequently, Co-worker B is pleased with the outcome of their trade and acknowledges that their skills complement each other well.",
        "speaker": "Co-workers A",
        "raw_prediction": "We make a great team, always looking out for each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.",
        "memory_text": "Classmates A, who is passionate about science and interested in becoming a doctor or researcher to help people, has developed a crush on Classmates B, finding their interest in taking biology classes in college flattering. Classmates A is considering taking biology classes in college to learn more about how the body works. \nClassmates A finds it refreshing to talk to someone genuinely interested in science and learning, expressing admiration for Classmates B's intelligence and sense of humor. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.",
        "speaker": "Classmates A",
        "raw_prediction": "I just can't believe you would betray me like this. It's really disappointing.",
        "previous_summary": "Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\nClassmates A has developed a crush on Classmates B, which Classmates B finds flattering.\nBoth Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\nBoth Classmates A and B enjoy talking to each other and consider themselves great study partners."
    },
    {
        "utter_id": "e6-s5-t3",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.",
        "memory_text": "Neighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbors A and B are discussing the idea of having telekinetic abilities. Neighbors B is excited and supportive of Neighbors A's new ability. Neighbors B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\nNeighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A. Neighbors A and B joke about the fun aspects of using telekinesis to surprise people, causing Neighbors A to feel overwhelmed but also excited about their new ability. Neighbor A is thinking about exploring new skills or hobbies outside of work, such as taking online courses or learning a new language. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbors A and B are discussing the idea of having telekinetic abilities, with Neighbors B being excited and supportive of Neighbors A's new ability, which makes Neighbor A feel there is no room for growth or new projects at their current job.",
        "speaker": "Neighbors B",
        "raw_prediction": "Oh no, what did you do this time?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t1",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?",
        "memory_text": "Neighbors A and B appreciate the resourcefulness of using fallen trees for firewood or other purposes. Neighbor A values their friendship with Neighbor B and wants to ensure it remains strong. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too. Neighbors A did not bring any notes or textbooks to school, causing them to leave their backpack at home once and had to borrow notes from a classmate. Neighbor A feels like they should have been more prepared for the test, which leads to them valuing double-checking before leaving the house.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yeah, I've definitely noticed! You must have been putting in a lot of hard work.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.",
        "memory_text": "Classmate A grew up around carpentry as their dad was a carpenter, and started helping him out at a young age, eventually developing a passion for it. \nClassmate A is attending a seminar on starting a business and is excited about applying that knowledge to future plans, leading them to research local open mic nights and talent showcases to start building a following. \nClassmate B hopes the President will consider their concerns and make improvements for the country's betterment, while Classmate A appreciates the support and encouragement from Classmate B and wants to get to know them better to potentially become friends.",
        "speaker": "Classmates B",
        "raw_prediction": "It's wonderful that you found your passion at such a young age. Your dad must be proud to see you following in his footsteps.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t8",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.",
        "memory_text": "- Co-worker A and Co-worker B share a talent for collaborating well with others and resolving issues, which leads to Co-worker A giving Co-worker B a massage to help them relax.\n- Co-worker A's strong work ethic and positive influence on the workplace are recognized by Co-worker B, emphasizing the importance of communication and understanding in their relationship. This mutual appreciation allows both co-workers to enjoy connecting with each other, making work more enjoyable.\n- Co-worker B's belief that they had permanently lost their watch is overturned when Co-worker A returns it to them, resulting in the repair and rekindling of their friendship.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate your perspective. Let's work together to find the best solutions for our team.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t14",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.\nCo-workers A: Of course I remember! I'm happy we're friends again.\nCo-workers B: Me too. And do you still have that baby doll and rattle you bought a couple of years ago?\nCo-workers A: Yes, actually! I gave them to my niece and she loves them.\nCo-workers B: That's awesome. And I still remember when you scratched my neck and helped me relax. Sometimes I still need that kind of release.",
        "memory_text": "Co-worker A's competence is recognized and appreciated in the workplace, contributing positively to the team dynamic. Both Co-worker A and Co-worker B emphasize the importance of effective communication and mutual understanding in their relationship. Co-worker A and Co-worker B cherish moments of connection, finding them essential for a more enjoyable work environment.   \nCo-worker A's gesture of returning Co-worker B's watch repaired their friendship, highlighting the significance of small acts of kindness. Co-worker A's thoughtful gift of a baby doll and rattle to their friend expecting a child showcases their caring nature. Co-worker A's decision to buy a baby doll and rattle for a friend's child despite not planning to have kids soon reflects their generous spirit.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad I could help you relax. It's important to take care of each other's well-being in the office.",
        "previous_summary": "Co-worker A is giving Co-worker B a massage to help them relax.\nCo-worker B finds the massage from Co-worker A relaxing and helps them feel at peace."
    },
    {
        "utter_id": "e11-s5-t7",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.",
        "memory_text": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. This has led to Neighbors A valuing the relationship with Neighbors B and considering them like family. As a result, Neighbors A is excited to explore the neighborhood and make new friends. \n\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This has caused Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. The value of the relationship with Neighbors B is highlighted, and Neighbors A appreciates having friendly faces around and hopes to make new friends soon. \n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. However, Neighbors A just moved to a new neighborhood and is getting to know the area.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that you've found a place here that you can call home. It's always nice to have a sense of belonging in a community.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t1",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.",
        "memory_text": "1. Classmate B working on finishing a history project caused Classmates A's grades to look good according to their teacher. This led to Classmates A showing up to school in pajamas due to oversleeping after studying late, which Classmate B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n\n2. Classmate A working on an essay about the Industrial Revolution made Classmates B notice Classmates A's improvement and acknowledge their hard work. This made Classmates B supportive of Classmates A's new relationship and believe they found someone who makes them happy.\n\n3. Classmate B being interested in attending a new technology conference next month made Classmates B notice Classmates A's improvement and acknowledge their hard work. This also made Classmates B supportive of Classmates A's new relationship and believe they found someone who makes them happy.",
        "speaker": "Classmates A",
        "raw_prediction": "It was all about the impact of social media on mental health.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t12",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.\nClassmates B: Aww, that's fantastic. How has everything been going with her?",
        "memory_text": "1. [Classmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.] - (React) - [Classmates A is willing to work hard to achieve their dreams.]\n2. [Classmates A is also working on an essay about the Industrial Revolution.] - (React) - [Classmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.] - (SameTopic) - [Classmates A feels like everything is falling into place and is excited to see where the new relationship goes.]\n3. [Classmate B is working on finishing a history project.] - (Causes) - [Classmates A's grades are looking good according to their teacher.] - (SameTopic) - [Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.]",
        "speaker": "Classmates A",
        "raw_prediction": "Things have been going really well with her. I feel like everything is falling into place, and I'm excited to see where this new relationship goes.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.",
        "memory_text": "1. Mentee used to feel overwhelmed, but now feels more fulfilled by living in the moment. Mentee credits Mentor for their help in achieving sobriety and expresses gratitude for the support. Mentee admires Mentor's success and wants to learn from them.\n\n2. Mentor is supportive of the Mentee's approach and encourages them to continue. Mentee found getting sober to be a challenging process but is now proud of their progress. The Mentee is dedicated to their sobriety and believes incorporating yoga into their routine will benefit their mental and physical health.\n\n3. Both the Mentor and Mentee believe that living in the moment can bring joy and strength in facing challenges. Mentor has been supportive of Mentee's journey to sobriety. Mentee has a history of substance abuse but has been sober for a year.",
        "speaker": "Mentor",
        "raw_prediction": "It's wonderful to hear how much sobriety has positively impacted your life. You've come a long way, Mentee.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.\nMentor: That's fantastic, Mentee. Being present and mindful can do wonders for your mental health and overall satisfaction with life. Keep it up!\nMentee: I definitely will, Mentor. And thanks again for finding my glasses. Your help means a lot to me. ",
        "memory_text": "1. Mentee acknowledges Mentor's achievements and ongoing support, expressing gratitude for their help with achieving sobriety.\n   \n2. Mentee used to feel overwhelmed but now finds fulfillment in living in the moment, crediting Mentor for their sobriety and expressing admiration for their success.",
        "speaker": "Mentor",
        "raw_prediction": "Of course, Mentee. I'm always here to help you out whenever you need it. Just remember, progress is a journey, not a destination.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t1",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.",
        "memory_text": "1. The Child feels it is unfair that they have to do certain chores because the Parent is too tired. The Parent expresses a desire to be a better role model for the Child and their siblings. The Child is caring and offers help to the Parent.\n   \n2. The Parent is working and feels tired after a long day. The Parent emphasizes the importance of being aware of surroundings and being careful while driving or walking. This is because the Parent mentions a terrible accident they witnessed on the way to the Child's school.",
        "speaker": "Parent",
        "raw_prediction": "It's a big project that will require a lot of my time and focus.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t3",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.",
        "memory_text": "- Classmates A ended up taking Classmates B's advice and found success with it, which led to them valuing living life on their own terms and being content with their choices.\n- Classmate A values independence and focuses on their own happiness, as they have been pursuing their passions and enjoying life.\n- Classmates B is supportive and willing to offer help in the future, supporting Classmates A's perspective on living authentically and free from others' opinions.\n- Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth, which resonates with Classmate A's values of independence and happiness.",
        "speaker": "Classmates B",
        "raw_prediction": "That's amazing! It's great to see you following your passion and sharing it with the world. I'll make sure to check out your blog soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t10",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?",
        "memory_text": "Co-worker A has aspirations of being a great leader and emphasizes the importance of communication. This aligns with Co-worker B believing that Co-worker A has the potential to be a great leader if they use their power for good. Additionally, Co-worker A used to fantasize about being a great leader and being respected and admired, showing a consistent desire for leadership roles.\n\nCo-worker A has grown and become more confident over the years, as seen in their shift from feeling embarrassed for losing control of their emotions to now feeling ready for the challenge of a leadership position. This growth is further supported by Co-worker B encouraging Co-worker A to consider pursuing a leadership position and highlighting the qualities of a good leader.\n\nBoth Co-workers agree that a good working relationship is important, reflecting their shared values of improvement and pushing themselves to be better.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm grateful for your support during that time. It's been a journey, but I'm glad we've grown and learned from those challenges.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t12",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.",
        "memory_text": "Co-worker B believes that Co-worker A has the potential to be a great leader if they use their power for good. This aligns with Co-worker A's aspirations of being a great leader and emphasizing the importance of communication.\n\nCo-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader. In response, Co-worker B acknowledges the importance of communication and resolving conflicts, which prompts Co-worker A to calm down and have a conversation with Co-worker B.\n\nCo-worker A has fantasies of being a great leader, which is related to their feeling stressed about their relationship with Co-worker B. This stress is a result of Co-worker A feeling embarrassed for losing control of their emotions in the past.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, I've always believed in the power of growth and learning from past experiences. I'm ready to tackle this new challenge head-on and continue to develop my leadership skills.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t1",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.",
        "memory_text": "Neighbors A felt their relationship with Neighbors B was improving after trying a breathing exercise. Neighbor B reassured Neighbor A about past embarrassing incidents, strengthening their friendship. Neighbor A surprised Neighbor B with a pizza, leading to both neighbors looking forward to new adventures and discoveries together.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's great to hear! Breathing exercises can be so beneficial for relaxation.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. ",
        "memory_text": "Neighbor A surprised Neighbor B with a pizza as a gesture of appreciation for Neighbor B's actions in the neighborhood. This surprised Neighbor B and both neighbors appreciated their friendship and are open to going back to being friends if the romantic relationship doesn't work out. Additionally, Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship. \nNeighbor A went to the park with their son, who had a great time, caused by their gesture of appreciation for Neighbor B's actions in the neighborhood. It's similar to when Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.",
        "speaker": "Neighbors A",
        "raw_prediction": "Absolutely, having simple techniques like that can really make a difference in our daily lives. It's all about finding what works best for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t12",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.\nNeighbors B: It's always nice to find a good outdoor space like that. Have you been back recently?",
        "memory_text": "Neighbor A ordered a large cheese pizza with extra sauce for Neighbor B as a gesture of appreciation. This act caused Neighbor A to recently discover a park on Main Street with a playground and water park area. In the past, Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic. This gesture of appreciation also led Neighbor B to value their friendship with Neighbor A. Additionally, Neighbor A reminisces about simpler times and expresses missing them.",
        "speaker": "Neighbors A",
        "raw_prediction": "I haven't been back recently, but I definitely miss those times we spent at the park. It was such a relaxing and enjoyable place to be.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t13",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.\nNeighbors B: It's always nice to find a good outdoor space like that. Have you been back recently?\nNeighbors A: Not in a little while, but maybe we should plan a visit soon. ",
        "memory_text": "Neighbor A recently discovered a park on Main Street with a playground and water park area, which reminded Neighbor A and Neighbor B of the park they found together a couple of years ago and enjoyed playing frisbee and having a picnic. \nNeighbor A surprised Neighbor B with a pizza, showing Neighbor B the value of their friendship. In return, Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship. \nNeighbor A surprised Neighbor B with a pizza, which made Neighbor B appreciate their friendship even more. As a result, Neighbor A reminisces about simpler times and expresses missing them.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds like a great idea. It would be nice to revisit that park and enjoy some outdoor time together.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "- Co-worker A and Co-worker B reminisced about happy memories from their time working together, sparking joy in their conversation.\n- Co-worker A, described as having \"Sherlock Holmes-like skills,\" expressed a desire to celebrate their detective work with drinks after work, hinting at their enjoyment of solving mysteries.\n- Co-worker A's talent for solving puzzles and mysteries was highlighted, leading to discussions about potentially pursuing a career as a detective.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, I guess I do have a knack for uncovering things. Maybe I missed my calling as a detective!",
        "previous_summary": "Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.\nCo-worker A discovered that an employee was hiding clothes to sell on the side.\nCo-worker A enjoys solving puzzles and mysteries, even considering becoming a detective.\nCo-worker A has a talent for solving puzzles and mysteries."
    },
    {
        "utter_id": "e20-s5-t13",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.\nCo-workers B: Oh gosh, yes. I forget sometimes that not everyone knows. But yeah, I've been married for a few years now.\nCo-workers A: Crazy how time flies. Like when we found out Ms. Singh was leaving our school. I still can't believe that was two years ago.",
        "memory_text": "Co-worker A and Co-worker B are both excited about payday and being able to pay off bills. This reminds them of the time they shared happy memories from their time working together. \nCo-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries. This changed when Co-worker A found out that Co-worker B is married by doing some research on social media. Co-worker B was surprised by this discovery.\nCo-worker A and Co-worker B both plan to treat themselves to a nice dinner with their paychecks. Co-worker A suggests celebrating their detective work with drinks after work. Co-worker B, who is married, had a weekend where they went hiking and had dinner with friends.",
        "speaker": "Co-workers B",
        "raw_prediction": "It feels like just yesterday she was organizing all those school events. Time really does fly.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t1",
        "current_dialogue": "Husband: I hung up some more lights and candles today.",
        "memory_text": "1. The husband enjoys hanging out with his friend, finding happiness and contentment in their company, and appreciates being outdoors in the nice weather.\n2. The husband feels supported by his wife in pursuing activities that bring him joy outside of work and family life, and he believes in cherishing meaningful connections like the one he has with his friend.\n3. The husband's strong faith, influenced by his Christian upbringing, drives his involvement in various church ministries, and he is grateful for it.\n4. The husband values trustworthy companionship and looks forward to collaborating on the podcast project, finding happiness and contentment in being with his friend and enjoying the beautiful weather.",
        "speaker": "Wife",
        "raw_prediction": "That sounds lovely! It's great that you're making our home even cozier with those lights and candles.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "The husband enjoys spending quality time with his friend and cherishes their bond, feeling uplifted and at ease in their presence. He also treasures the supportive community of believers at church and is actively engaged in various ministries, finding strength in his faith. \nBoth the husband and wife prioritize the small, meaningful moments in life that contribute to their overall happiness and well-being. \nThe husband values reliability in his relationships and eagerly anticipates collaborating on a podcast project. Additionally, he finds joy in the simple pleasures of life, like making it to the bus on time.",
        "speaker": "Husband",
        "raw_prediction": "Yes, being part of the church community has been truly fulfilling. I find so much joy in giving back and connecting with others through our shared faith.",
        "previous_summary": "Husband is grateful for his Christian upbringing and is passionate about his faith.\nHusband was baptized at eight years old and is involved in different ministries at church.\nWife is supportive of her husband's faith journey and values having a close relationship with him.\nHusband values the supportive community of believers at church and appreciates having his wife by his side.\nThe husband's faith has been strong lately, and he is involved in various church ministries."
    },
    {
        "utter_id": "e23-s5-t5",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.",
        "memory_text": "1. The teacher's support and emphasis on safety led the student to appreciate their relationship and apologize for the incident. The teacher and student now share a positive and understanding bond.\n2. The teacher's advice on safety prompted the student to open up about feeling stressed, possibly contributing to the outburst. Excited about retiring, the student is already planning fun activities to spend time with their grandkids.\n3. Understanding the student's needs, the teacher now encourages retirement plans, stressing the importance of family during that time.",
        "speaker": "Teacher",
        "raw_prediction": "It's worth a shot! Just remember to take it slow and enjoy the journey of building up your tolerance.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t1",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.",
        "memory_text": "Neighbor A enjoys reading and sharing books with Neighbor B, which recently led to Neighbors A getting a new job as a secretary at a small marketing agency. This new job eventually caused Neighbors A to be promoted to manager and take on more responsibilities, leading to them feeling overwhelmed and stressed with a lot on their plate.",
        "speaker": "Neighbors A",
        "raw_prediction": "I hope this helps prevent any misunderstandings in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t10",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.",
        "memory_text": "Neighbor A enjoys reading and sharing books with Neighbor B. This leads to Neighbor A believing in setting goals, developing a positive attitude, and taking action for personal development and career advancement. As a result, Neighbor A offers to help Neighbors B with getting into a workout routine, and Neighbor B suggests working out together to make it more enjoyable for both of them.",
        "speaker": "Neighbors A",
        "raw_prediction": "Setting boundaries is crucial in both personal and professional relationships. It helps maintain clarity and respect.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t1",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.",
        "memory_text": "1. Classmate A confesses their love to Classmate B, who does not feel the same way. This leads to Classmate B appreciating Classmate A's honesty but not returning the romantic feelings.\n2. Classmate B plans to check their schedule to go to the mall with Classmate A. This results in Classmate B feeling relieved that they can still be friends with Classmate A despite the romantic confession.",
        "speaker": "Classmates B",
        "raw_prediction": "I completely agree, it's such a great group of people we have in our class.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t7",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.",
        "memory_text": "Co-worker B is concerned about Co-worker A's punctuality and drinking habits, but Co-worker B is supportive of Co-worker A's efforts to improve their life by being more responsible and reliable. In return, Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides. Both co-workers show a supportive and caring attitude towards each other, which helps in their personal growth and mutual understanding.",
        "speaker": "Co-workers B",
        "raw_prediction": "Well, at least you're making progress in being more responsible. It's all about taking small steps towards improvement.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t12",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?\nNeighbors A: Not really, it was just a fun hobby back then. Plus, I don't think I have the same energy as I did when I was younger.\nNeighbors B: That's understandable. Do you still play any instruments?\nNeighbors A: I have a guitar but I haven't played it in a while. Maybe I should start practicing again.\nNeighbors B: Yeah, that sounds like a good idea. Maybe you could even teach me a thing or two.",
        "memory_text": "- Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go, which led to a discussion about playing together with toys and ended with Neighbor A appreciating the support and friendship of Neighbor B.\n- Neighbor A has been dealing with back pain for a few months but sought help from a chiropractor, avoiding surgery. Neighbor A looks forward to playing with Neighbor B again when feeling better, and Neighbor B is familiar with Neighbor A's dog and looking forward to playing with it again. The interaction also ended with Neighbor A appreciating the support and friendship of Neighbor B.\n- Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go, leading to a discussion about playing together with toys and ended with Neighbor A appreciating the support and friendship of Neighbor B.",
        "speaker": "Neighbors A",
        "raw_prediction": "That could be fun! I'll have to dust off my guitar and start strumming again.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?",
        "memory_text": "1. Co-worker A's experience of presenting evidence in front of a judge has shaped their determination to present evidence clearly and persuasively in court.\n2. Co-worker A's confidence in the strength of their argument stems from collecting evidence for a case.\n3. Co-worker B admires Co-worker A for standing up and defending their beliefs.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thankfully, I've never been in a physical altercation. I prefer to use words to resolve conflicts whenever possible.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t8",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?",
        "memory_text": "Co-worker A has been collecting evidence for a case and is confident in the strength of their argument, which Co-worker B commends them for, recognizing their courage to stand up and defend their beliefs. This leads Co-worker A to offer to take on the project of building a deck for Co-worker B.\n\nCo-worker A plans to present the evidence clearly and persuasively in court, having presented evidence in front of a judge before to support their position, which causes Co-worker A to deny that their reputation influenced Karen's decision to give them money.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, I recall that. It took some convincing, but she eventually saw the value in supporting the cause.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.",
        "memory_text": "Classmates B's responsible handling of a previous class schedule mix-up led to them being supportive and helpful to Classmates A. Classmates B's advice to drive safely was well-received by Classmates A. \nClassmates B's thorough double-checking to prevent future issues made Classmates A concerned about their drinking habits and health. Despite initial worries, Classmates B values Classmates A's opinions. \nThe mutual appreciation between Classmates A and B has sparked plans to hang out outside of school.",
        "speaker": "Classmates B",
        "raw_prediction": "It's really admirable that you took the time to help your neighbor. Small acts of kindness can make a big impact.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t8",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.",
        "memory_text": "1. The wife's support and pride in her husband working towards his goals inspires him to take action on his dreams.\n2. The husband's drive to achieve his dreams and effort in making them a reality makes him excited about his progress and committed to a future with his wife.",
        "speaker": "Husband",
        "raw_prediction": "I appreciate your faith in me, wife. I can't wait to make this weekend getaway a reality for us.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.",
        "memory_text": "The husband's long-awaited plans prompt him to apologize and promise to involve his wife in future plans, emphasizing the importance of keeping promises.\nThe wife reassures the husband of her support, leading him to acknowledge his mistake, apologize, and promise to make it up to her.",
        "speaker": "Wife",
        "raw_prediction": "I appreciate your thoughtfulness, husband. I know you're making an effort to include me in your plans, and I'm really looking forward to our getaway together.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t1",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?",
        "memory_text": "1. Classmate A showed determination in fixing their spaceship after it was damaged in a meteor shower, causing Classmates B to suggest redirecting the ship towards a nearby planet or moon for help. This led to Classmates B praising Classmates A for their resilience and quick thinking during a scary experience in space. \n2. Classmate A, stranded in space and running out of oxygen, started feeling lightheaded. This situation made Classmate A's perseverance in repairing the spaceship reflect their determination to not give up in challenging situations. Consequently, Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space. \n3. Classmate A expresses gratitude for Classmates B's support during the difficult situation, reflecting their belief in doing their best at everything to avoid regrets later. This aligns with Classmate A's philosophy of giving 110% effort in everything they do.",
        "speaker": "Classmates A",
        "raw_prediction": "Are you feeling alright? You look a bit flushed.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.\nNeighbors B: Speaking of hard work, have you made any progress at your current job? I remember you were having some trouble with your boss.",
        "memory_text": "1. Neighbors A is taking responsibility for their actions and working on self-improvement, advised by Neighbors B to be more responsible at work.\n2. Neighbors B points out that Neighbors A's work attitude and behavior might be causing issues with their boss, leading Neighbors A to change and strive to be a better colleague.\n3. Neighbors B wishes for Neighbors A's success and stresses the significance of respect and effort at work, showcasing their supportive and friendly relationship.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, things have been going much better at work lately. I've been putting in more effort and my boss has noticed the positive changes. I'm hoping to continue improving and show that I'm a valuable member of the team.",
        "previous_summary": "Neighbors A is at risk of losing their job due to conflicts with colleagues.\nNeighbors B suggests that Neighbors A's attitude and behavior at work may be the reason for their boss wanting to fire them.\nNeighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.\nNeighbors B points out that it might be too late to change their boss's decision and emphasizes the importance of learning from mistakes.\nNeighbors A agrees to take responsibility for their actions and work on improving themselves.\nNeighbors A is having issues at work, such as not pulling their weight and being rude to colleagues.\nNeighbors B advised Neighbors A to change their behavior at work and be a responsible adult.\nNeighbors A is trying to improve their behavior at work and be a better colleague."
    },
    {
        "utter_id": "e35-s5-t5",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.",
        "memory_text": "1. [Co-worker A and Co-worker B met on a movie set where Co-worker A was focused on acting.] - (SameTopic) - [Co-worker A felt remorse for what they did and appreciated Co-worker B's understanding.] - (React) - [Co-worker A is grateful for life experiences and is open to new possibilities in the future.] \n   \n2. [Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.] - [Co-worker B expressed disapproval of Co-worker A's actions and suggested talking to the director to address the stressful situation.] - [Co-worker B encourages Co-worker A to try relaxation techniques or find a hobby to de-stress and overcome fears.] - [Co-worker A has grown as a person and as an artist, learning about empathy and compassion.]",
        "speaker": "Co-workers B",
        "raw_prediction": "I'm glad I could help you navigate through that tough situation. It's important to have someone to talk to and support you during challenging times.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.",
        "memory_text": "1. Classmates A and B are supportive friends who look out for each other during stressful times, which contributes to their close relationship built on trust.\n2. Classmates A and B, working on a group project together, share a moment where Classmate A admired Classmate B's courage in sharing a secret, highlighting their supportive nature.\n3. Classmates A values setting high standards and is reluctant to compromise on them, a trait appreciated by Classmates B in their interactions.",
        "speaker": "Classmates B",
        "raw_prediction": "I appreciate your honesty, and I value our friendship a lot. Let's take some time to think about this before making any decisions.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?",
        "memory_text": "1. Classmates A faced tough competition in middle school from a fast girl, motivating them to improve. Classmates B offers support and suggests taking a step back to find a balance. Classmates A expresses gratitude for the support and friendship of Classmates B. Classmate A and Classmate B are classmates. \n   \n2. Classmates A is always looking to challenge themselves and improve their skills. This attitude leads to Classmates A struggling with feeling competitive and the need to be the best at everything. As a result, Classmates A has not experienced similar pains in the past and is feeling worried about the situation. \n   \n3. Classmates B acknowledges Classmates A's determination and competitiveness. This leads to Classmates A struggling with feeling competitive and the need to be the best at everything. As a result, Classmates A has not experienced similar pains in the past and is feeling worried about the situation.",
        "speaker": "Classmates A",
        "raw_prediction": "I want to make sure I'm fully prepared for the upcoming test.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.",
        "memory_text": "Classmates A is facing sudden pain in their left arm and is considering going to the hospital. Classmate B reminds Classmate A to trust their instincts and know when to seek medical attention.\n\nClassmates B acknowledges Classmates A's determination and competitiveness. They offer support and suggest taking a step back to find a balance. Both classmates value taking moments to relax and appreciate the small things. \n\nClassmates A faced tough competition in middle school from a fast girl, motivating them to improve. They acknowledge the need to find a balance and accept the advice given. Classmates B is supportive and emphasizes the importance of having someone to talk to about personal matters. Classmate A emphasizes the importance of self-care and relaxation.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad to hear that your hard work is paying off. Keep it up!",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t6",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.\nClassmates B: That's true. You always seem to find the best spots. Like that time we went camping near the lake and had the whole place to ourselves.",
        "memory_text": "Classmates A's proactive and curious nature leads them to research topics of interest, sparking a realization that their current allergic reaction might be related to previous discussions on allergies. \nClassmates A's involvement in the community inspires Classmate B to emphasize the importance of being cautious with allergies and taking necessary precautions to prevent severe reactions.",
        "speaker": "Classmates A",
        "raw_prediction": "That was such a memorable trip! I love finding hidden gems like this spot. It really makes the adventure more exciting.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t7",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?",
        "memory_text": "Classmates A and B are both keeping up with the homework in their math class, which leads them to enjoy jamming together and plan to collaborate on music in the future. They also have a friendly and supportive relationship, evident from their conversation about their respective experiences. \nClassmates A finds pursuing music rewarding and is passionate about it, sparking the desire to jam together with Classmates B and plan future collaborations. They also share a love for reminiscing about childhood memories, such as playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a good point. I'll try to start with small steps to build my independence. Thanks for the support.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t11",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?",
        "memory_text": "- Classmates A and B are both keeping up with the homework in their math class, and Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n- Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "I've been practicing regularly, and it's been really fulfilling. It's great to have a creative outlet like music.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.",
        "memory_text": "The husband is open to learning more about movies, showing a willingness to try again. The wife remembers the husband being nervous before the presentation.\nThe wife is knowledgeable about movies and is willing to share her passion with the husband. Both the husband and wife express a desire for happiness and understanding in the situation. The husband gave a fifth-grade presentation in the past.\nThe husband and wife plan to have a movie night together in the future. Both the husband and wife express a desire for happiness and understanding in the situation. Husband agrees to try adapting to modern language for better communication with his wife. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.",
        "speaker": "Wife",
        "raw_prediction": "You're not bothering me at all. I enjoy helping you with your writing. Let's brainstorm together and see if we can come up with something new.",
        "previous_summary": null
    }
]