[
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The Child finds the Parent's story inspiring.\n3. The Parent eventually got to see the sunrise after leaving detention.\n4. The child offers help and reassurance to the parent.\n5. The Parent and Child plan to watch the sunrise together in the future.\n6. The parent had a tough time when they got arrested and had to rely on a lawyer and the justice system for help.",
        "speaker": "Parent",
        "raw_prediction": "I'm glad you remember that moment, it meant a lot to me too. And I'm looking forward to watching the sunrise together again in the future. It's those small moments that really make a difference, don't you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t7",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.\nParent: It was. I love being able to appreciate the beauty of nature. And you know, having my own place to live in the suburbs makes it even easier to do things like that.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The Child finds the Parent's story inspiring.\n3. The Parent eventually got to see the sunrise after leaving detention.\n4. Both the parent and child enjoy spending time together in their new home.\n5. The Parent and Child plan to watch the sunrise together in the future.\n6. The parent now lives in a little house in the suburbs that they love.",
        "speaker": "Child",
        "raw_prediction": "I love that we can enjoy those moments together. I can't wait for our next sunrise-watching adventure in our new home.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.",
        "memory_text": "1. Mentee is feeling overwhelmed with the college application process.\n2. The Mentee has been offered a job and has decided to take the job in the city.\n3. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n4. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n5. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n6. Mentee feels like they are running out of time and is worried about the upcoming SAT.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely understandable to feel that way, especially when you're in a new environment. Making new friends takes time, but I'm sure you'll find your place soon. In the meantime, remember that I'm here for you whenever you need to talk.",
        "previous_summary": "The Mentor has been guiding and supporting the Mentee in their work for years.\nThe Mentee has been offered a job and has decided to take the job in the city.\nThe Mentor is supportive and praises the Mentee for their mature decision-making process.\nMentor emphasizes the importance of self-care for dealing with challenges."
    },
    {
        "utter_id": "e1-s5-t2",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n3. The Mentee has been offered a job and has decided to take the job in the city.\n4. Mentee is feeling overwhelmed with the college application process.\n5. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n6. Mentor emphasizes the importance of self-care for dealing with challenges.",
        "speaker": "Mentee",
        "raw_prediction": "You're right, Mentor. I'll try to see this as a chance to build new friendships and connections. Thank you for reminding me of that.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee is feeling overwhelmed with the college application process.\n3. The Mentee has been offered a job and has decided to take the job in the city.\n4. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n5. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n6. Mentor emphasizes the importance of self-care for dealing with challenges.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way, Mentee. Building new relationships takes time, so be patient with yourself. Maybe try joining some local clubs or organizations to meet people who share your interests.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t6",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.\nMentor: That's just a fear, Mentee. You can join clubs or organizations that interest you to meet like-minded people. You could also start volunteering around the city to meet new people.\nMentee: Those are good suggestions, Mentor. I'll consider joining a club or volunteering.\nMentor: And remember, it's also important to keep in touch with your old friends. You can schedule video calls or even plan a visit back home.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee is feeling overwhelmed with the college application process.\n3. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n4. The Mentee has been offered a job and has decided to take the job in the city.\n5. Mentor advises Mentee to break down studying into manageable chunks, schedule study sessions and breaks, and use resources like practice exams and review books.\n6. Mentor emphasizes the importance of self-care for dealing with challenges.",
        "speaker": "Mentee",
        "raw_prediction": "I guess you're right, Mentor. I shouldn't lose touch with my old friends either. I'll make sure to schedule some video calls with them soon. Thanks for the advice.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t2",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.",
        "memory_text": "1. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n2. Neighbor B is comforting and supportive towards Neighbor A.\n3. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n4. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n5. Neighbor A's mom scolds them for ripping off the tag from their new shirt.\n6. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.",
        "speaker": "Neighbors A",
        "raw_prediction": "Hey, come on, it was all in good fun! Remember that time we tried to make that giant sandcastle at the beach and failed miserably?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t12",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.",
        "memory_text": "1. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n2. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n3. Neighbors B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides.\n4. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n5. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n6. Neighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks for always being so welcoming. Your house is like a second home to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t4",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B appreciates Co-worker A's positivity and friendship.\n3. Co-worker B is supportive and willing to help in any way.\n4. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n5. Co-worker A is alive but will need time to adjust to their new way of life.\n6. Co-worker A intervened to help two women who were fighting, showing bravery and a desire to make a positive impact.",
        "speaker": "Co-workers A",
        "raw_prediction": "I know you're struggling with your feelings, but kidnapping is not the answer. It's important to respect her autonomy and choices. Let's find a healthier way to express your love and support for her.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t6",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n3. Co-worker A expressed gratitude for the horse that Co-worker B gave them, mentioning it brings joy and happiness.\n4. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n5. Co-worker B agrees that their skill sets complement each other well.\n6. Co-worker A values their health to continue working at their best.",
        "speaker": "Co-workers A",
        "raw_prediction": "We make a great team, and supporting each other is what it's all about. Remember, we work best when we look out for each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t10",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.\nCo-workers A: Me too! I think we would make a great business partnership.\nCo-workers B: Definitely. It's great to have someone I can trust and rely on in both work and personal matters.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\n3. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n4. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n5. Co-worker B agrees that their skill sets complement each other well.\n6. Co-workers A and B have a positive and optimistic attitude towards their future collaboration.",
        "speaker": "Co-workers A",
        "raw_prediction": "I feel the same way. It's important to have that level of trust and support in a partnership. And hey, don't forget to prioritize your health too. We need you at your best to make this collaboration a success.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.",
        "memory_text": "1. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\n2. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\n3. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.\n4. Both Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\n5. Classmates A and B are interested in biology and studying cells.\n6. Classmates A finds it refreshing to talk to someone genuinely interested in science and learning.",
        "speaker": "Classmates A",
        "raw_prediction": "I must have misunderstood the situation then. I'm glad we could clear that up. I value our honesty and communication with each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t9",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.",
        "memory_text": "1. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n2. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n3. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.\n4. Neighbors B is excited and supportive of Neighbors A's new ability.\n5. Neighbors A enjoys trying new things, like new recipes.\n6. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.",
        "speaker": "Neighbors B",
        "raw_prediction": "You're welcome! It's important to find a balance between taking care of yourself and keeping the peace with your mom. Just remember that your well-being matters too.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t14",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is excited and supportive of Neighbors A's new ability.\n4. Neighbors A enjoys trying new things, like new recipes.\n5. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.\n6. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm actually feeling pretty good about it. I've been trying out new projects and taking on new challenges, which has been really exciting. It's been great to push myself and learn new things.",
        "previous_summary": "Neighbor A is feeling unfulfilled with their job and wants to make a bigger impact.\nNeighbor A is considering looking for a new job but is unsure of what they want to do.\nNeighbor A feels there is no room for growth or new projects at their current job.\nNeighbor B suggests that new skills could lead to new opportunities in Neighbor A's current job or future career."
    },
    {
        "utter_id": "e6-s5-t16",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.\nNeighbors B: That's a good plan. It's important to pursue what makes you happy and fulfilled.",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors A enjoys trying new things, like new recipes.\n4. Neighbors B is excited and supportive of Neighbors A's new ability.\n5. Neighbor A is feeling unfulfilled with their job and wants to make a bigger impact.\n6. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.",
        "speaker": "Neighbors A",
        "raw_prediction": "I totally agree. I think it's time for me to make a change and pursue something that aligns better with my passions and values. Thanks for always being so supportive and encouraging, it means a lot to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t5",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.",
        "memory_text": "1. Neighbors A apologized to Neighbors B for their behavior and admitted to being wrong.\n2. Neighbors B appreciates Neighbors A's handy skills.\n3. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.\n4. Neighbors A is good at fixing things, particularly electronics.\n5. Neighbors A values double-checking before leaving the house.\n6. Neighbors A and B emphasize the importance of taking care of trees and the environment for future generations.",
        "speaker": "Neighbors B",
        "raw_prediction": "I appreciate your honesty and willingness to admit when you're wrong. It shows a lot of maturity and growth on your part.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t9",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.\nNeighbors B: It's always important to own up to our mistakes. It's like when you forgot your backpack in high school and had to deal with the consequences.\nNeighbors A: Definitely. It taught me to always be prepared and double-check everything. It's like how I make sure to tighten screws and wires when working on my computer.\nNeighbors B: It's all about being responsible and taking care of ourselves, just like how you take care of your physical health by working out.\nNeighbors A: Exactly! I believe that taking care of our physical and mental health is crucial for living a happy and fulfilling life.",
        "memory_text": "1. Neighbors A apologized to Neighbors B for their behavior and admitted to being wrong.\n2. Neighbors B appreciates Neighbors A's handy skills.\n3. Neighbors A and B emphasize the importance of taking care of trees and the environment for future generations.\n4. Neighbors A values double-checking before leaving the house.\n5. Neighbors A is good at fixing things, particularly electronics.\n6. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.",
        "speaker": "Neighbors B",
        "raw_prediction": "And just like you value taking care of your physical health, you also emphasize the importance of taking care of the environment and our surroundings for future generations. It's great to see your dedication to both personal well-being and environmental stewardship.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t7",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?\nClassmates A: Yeah, I just finished building a custom bookshelf for a client. It was a challenging project, but I'm really happy with how it turned out.\nClassmates B: That's impressive! You must have a lot of skill to be able to build something like that.\nClassmates A: Thanks! It definitely takes a lot of practice and attention to detail. But I find it really rewarding to see a finished product that I created with my own two hands.",
        "memory_text": "1. Classmates B is supportive and encourages Classmates A in their business venture.\n2. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n3. Classmates A has had a business idea for a while and is now taking steps to make it a reality.\n4. Classmate B offers to support and potentially collaborate with Classmate A in the future.\n5. Classmates A is willing to work hard and learn the necessary strategies for business success.\n6. Classmates B mentions the importance of seeking advice from mentors and staying motivated and passionate about the business idea.",
        "speaker": "Classmates B",
        "raw_prediction": "It's clear that you have a real passion for carpentry, and that dedication shines through in your work. I'm glad to see you pursuing something you love. Keep honing your skills and taking on challenging projects - you're on the right track to success!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t4",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.",
        "memory_text": "1. Co-worker A and Co-worker B excel at working well with others and resolving issues.\n2. Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.\n3. Co-worker B appreciates Co-worker A's competence and effort in their work.\n4. Co-worker A strives to do their best in their work.\n5. Both Co-worker A and Co-worker B value communication and understanding in relationships.\n6. Co-worker A is seen as competent and reliable by Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate your input, and I agree that flexibility and collaboration are key to a successful team dynamic. Let's work together to find the best way to achieve our goals while considering different perspectives.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t3",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.",
        "memory_text": "1. Neighbors A is excited to explore the neighborhood and make new friends.\n2. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n3. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.\n4. Neighbors A just moved to a new neighborhood and is getting to know the area.\n5. Neighbors B acknowledges Neighbors A's friendly and outgoing nature.\n6. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.",
        "speaker": "Neighbors B",
        "raw_prediction": "Chicago is such a wonderful city to explore! I'm glad you enjoyed your visit. If you ever want some recommendations for places to check out there, feel free to ask.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t9",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n3. Neighbors A is excited to explore the neighborhood and make new friends.\n4. Neighbors A finds spending time with God brings them peace and happiness.\n5. Neighbors A and B live in the same place and find comfort in it.\n6. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that spending time with God brings you peace and happiness. It's wonderful to see how much you've grown to love our neighborhood and make it your home. It's always nice to have a place where you feel comfortable and safe, surrounded by good friends.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t9",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.",
        "memory_text": "1. Classmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.\n2. Classmates B noticed Classmates A's improvement and acknowledged their hard work.\n3. Classmates A had a moment of frustration in the past but has learned to channel that energy into studies.\n4. Classmates A is willing to work hard to achieve their dreams.\n5. Classmates A is determined to make the relationship work, similar to their determination to get into college.\n6. Classmates A's grades are looking good according to their teacher.",
        "speaker": "Classmates B",
        "raw_prediction": "I'm really proud of you for staying so dedicated and focused. Your determination truly paid off, and it's inspiring to see how far you've come. Keep up the great work!",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.\nMentor: That's fantastic, Mentee. Being present and mindful can do wonders for your mental health and overall satisfaction with life. Keep it up!\nMentee: I definitely will, Mentor. And thanks again for finding my glasses. Your help means a lot to me. ",
        "memory_text": "1. Mentor is proud of Mentee for making positive changes and taking control of their life.\n2. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n3. Mentee values living in the moment and staying focused on their sobriety and goals.\n4. Mentee has a history of substance abuse but has been sober for a year.\n5. The Mentor encourages the Mentee to prioritize self-care and explore new ways to stay healthy and happy.\n6. Mentor is willing to share their knowledge with Mentee and help them achieve their goals.",
        "speaker": "Mentor",
        "raw_prediction": "You're very welcome, Mentee. I'm always here to support you in any way I can. Just remember to keep taking care of yourself and focusing on your sobriety and goals. I'm proud of the progress you've made.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t9",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.",
        "memory_text": "1. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n2. The Child is caring and offers help to the Parent.\n3. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n4. The Parent is working and feels tired after a long day.\n5. The Parent expresses a desire to be a better role model for the Child and their siblings.\n6. The Parent expresses a desire to adopt more children in the future.",
        "speaker": "Child",
        "raw_prediction": "That's awesome, Parent! I'm sure your hard work will pay off. If you ever need help with anything related to your website or ads, I'm here to assist you.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t13",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?\nParent: Yes, I do remember that. That was a fun afternoon.",
        "memory_text": "1. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n2. The Child is caring and offers help to the Parent.\n3. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n4. The Parent is working and feels tired after a long day.\n5. The Parent expresses a desire to be a better role model for the Child and their siblings.\n6. The child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent.",
        "speaker": "Child",
        "raw_prediction": "I really enjoyed our crafting time together. It's moments like those that make me feel grateful to have such a creative and caring parent. You always find ways to make ordinary days special, and I think those qualities will shine through in your new project too.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t12",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.",
        "memory_text": "1. Co-worker A used to fantasize about being a great leader and being respected and admired.\n2. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n3. Co-worker A has fantasies of being a great leader.\n4. Co-worker A has grown and become more confident over the years.\n5. Co-worker B acknowledges and supports Co-worker A's growth and progress.\n6. Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, that dedication really paid off. It's all about continuous improvement and growth. I'm excited to see where this new leadership role takes me and how I can contribute to the team.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t17",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.\nCo-workers A: Oh yeah, I still try to keep up with it whenever I can. It's important to stay physically and mentally fit, especially with this new job.\nCo-workers B: Just don't let your anger get the better of you again. Remember when you exploded and started throwing things?\nCo-workers A: Ugh, let's not even go there. My parents gave me a good scolding for that.\nCo-workers B: Well, all that matters is that you learn from your mistakes and keep moving forward. And hey, you're doing just that with this promotion.\nCo-workers A: Absolutely. Thanks for always being a supportive colleague, it means a lot to me.",
        "memory_text": "1. Co-worker A has grown and become more confident over the years.\n2. Co-worker B acknowledges and supports Co-worker A's growth and progress.\n3. Co-worker A used to fantasize about being a great leader and being respected and admired.\n4. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n5. Co-worker A has fantasies of being a great leader.\n6. Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.",
        "speaker": "Co-workers B",
        "raw_prediction": "Of course, we're a team after all. I'll always be here to cheer you on and help you grow even more in your new role as a product manager. Your journey to becoming a great leader is just beginning, and I have no doubt you'll achieve all your aspirations.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t10",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbors B values their friendship with Neighbors A.\n3. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n4. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n5. Neighbor A is embarrassed about a past incident where they pushed Neighbor B's shoulder to gain acceptance.\n6. Neighbors A has developed romantic feelings for Neighbors B.",
        "speaker": "Neighbors A",
        "raw_prediction": "That was such a fun day! I still remember how we played frisbee and had a picnic there. It's nice to have those memories to look back on.",
        "previous_summary": "Neighbor A recently discovered a park on Main Street with a playground and water park area.\nNeighbor A went to the park with their son, who had a great time.\nNeighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic."
    },
    {
        "utter_id": "e17-s5-t11",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n3. Neighbors B values their friendship with Neighbors A.\n4. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n5. Neighbors A has developed romantic feelings for Neighbors B.\n6. Neighbor A is embarrassed about a past incident where they pushed Neighbor B's shoulder to gain acceptance.",
        "speaker": "Neighbors B",
        "raw_prediction": "I remember how much fun we had playing frisbee and having a picnic there. It's nice to have those memories to look back on.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors A took the leap to make a change and is glad they did.\n3. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n4. Neighbors A's husband thinks they are crazy for believing they saw a UFO.\n5. Neighbors A and B had a conversation a couple of years ago about needing a change.\n6. Neighbors A plans to start looking for new opportunities soon and needs to update their resume and start networking.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's incredible! I'm so happy for you. It must feel like a dream come true after all the hard work you've put in.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n3. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n4. Neighbors A took the leap to make a change and is glad they did.\n5. Neighbors A and B had a conversation a couple of years ago about needing a change.\n6. Neighbors A and B have a friendly and supportive relationship.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's a great idea! With your entrepreneurial spirit, starting your own business sounds like a fantastic opportunity. I'm excited to see where this new chapter takes you.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t1",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A values appreciation and expresses gratitude for help received.\n3. Neighbors A is detail-oriented and strives for perfection.\n4. Neighbors B values reciprocity and acknowledges the mutual help between them as neighbors.\n5. Neighbor A emphasized the importance of keeping outside spaces clean and maintained for the future.\n6. Neighbors B enjoys keeping things clean and tidy.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's okay, we all have our moments. I appreciate your apology. Remember, we're here to support each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t2",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A values appreciation and expresses gratitude for help received.\n3. Neighbors A is detail-oriented and strives for perfection.\n4. Neighbors B values reciprocity and acknowledges the mutual help between them as neighbors.\n5. Neighbors A and B have a positive and helpful relationship as neighbors.\n6. Neighbors A wants to rearrange their living room and Neighbors B has experience with rearranging furniture.",
        "speaker": "Neighbors A",
        "raw_prediction": "I just wanted everything to be perfect with the living room setup, but I got overwhelmed with all the details. Thank you for being so patient and helping me out.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t5",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?\nNeighbors A: Yeah, I have, but it doesn't seem to make a difference. I just feel like I'm stuck in a dead-end job.",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A and B have a positive and helpful relationship as neighbors.\n3. Neighbors A is detail-oriented and strives for perfection.\n4. Neighbors A wants to rearrange their living room and Neighbors B has experience with rearranging furniture.\n5. Neighbors A values appreciation and expresses gratitude for help received.\n6. Neighbors B values reciprocity and acknowledges the mutual help between them as neighbors.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sorry to hear that you're going through a tough time at work. Maybe it's time to consider looking for other opportunities that value your hard work and attention to detail. I'm here to help you in any way I can, whether it's with job hunting or just being a supportive neighbor.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n3. Co-worker A and Co-worker B shared happy memories from their time working together.\n4. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n5. Co-worker A and Co-worker B used to work together at a clothing store.\n6. Co-worker A has a talent for solving puzzles and mysteries.",
        "speaker": "Co-workers A",
        "raw_prediction": "That's awesome! I bet you sounded amazing. How did it feel to sing in front of everyone?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t3",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n3. The wife is glad to see the husband finding a sense of purpose and being happy.\n4. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n5. The husband feels happy and content being outside in the beautiful weather.\n6. The wife is supportive of her husband's hobbies and interests, such as playing the guitar.",
        "speaker": "Wife",
        "raw_prediction": "I appreciate all the effort you put into making our home feel so inviting. It really does make a difference in creating a cozy atmosphere for us to relax in.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t6",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. The wife is glad to see the husband finding a sense of purpose and being happy.\n3. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n4. The wife mentions that the husband had to run to catch the bus a couple of years ago.\n5. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n6. The wife is supportive of her husband's hobbies and interests, such as playing the guitar.",
        "speaker": "Husband",
        "raw_prediction": "Yes, I remember that! It was quite the rush, but I made it. It's those little victories that can really brighten up your day, you know?",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t2",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.",
        "memory_text": "1. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n2. Co-worker A had a positive experience with a commander who helped them feel safe.\n3. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n4. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\n5. Co-worker A values making money and is interested in opportunities to do so.\n6. Co-worker A is self-aware about being stubborn and needing to learn to compromise.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I appreciate that. It's important to me to create a safe and supportive environment for everyone around me.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.",
        "memory_text": "1. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n2. Co-worker A had a positive experience with a commander who helped them feel safe.\n3. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\n4. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n5. Co-worker A values making money and is interested in opportunities to do so.\n6. Co-worker A is self-aware about being stubborn and needing to learn to compromise.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's amazing to see how your experiences have shaped you into such a supportive and caring leader. Your natural ability to make people feel better is truly a gift.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t5",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.",
        "memory_text": "1. Co-worker A had a positive experience with a commander who helped them feel safe.\n2. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n3. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n4. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\n5. Co-worker A is self-aware about being stubborn and needing to learn to compromise.\n6. Co-worker A values making money and is interested in opportunities to do so.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's amazing how that experience shaped your leadership style. Your ability to empathize and guide others is truly inspiring. It's like you're creating a ripple effect of positivity and support in the workplace.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t10",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?",
        "memory_text": "1. The student is studying French at college and plans on learning Spanish and German as well.\n2. The teacher speaks Spanish and French fluently.\n3. The teacher encourages the student's retirement plans, highlighting the importance of focusing on family during retirement.\n4. The student has already made plans with their daughter and son-in-law to visit more often and take the grandkids on trips.\n5. The student is looking forward to retirement and spending time with their grandchildren.\n6. The teacher and student have a positive and understanding relationship.",
        "speaker": "Student",
        "raw_prediction": "I've actually made some plans with my daughter and son-in-law to visit more often and take the grandkids on trips. I'm looking forward to retirement and spending more quality time with them.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t12",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?\nStudent: It's going well. I'm really looking forward to spending more time with them and taking them on fun trips.\nTeacher: That sounds like a great plan. Speaking of fun, remember when you scared me in the hallway a few days ago?",
        "memory_text": "1. The student is studying French at college and plans on learning Spanish and German as well.\n2. The teacher speaks Spanish and French fluently.\n3. The teacher encourages the student's retirement plans, highlighting the importance of focusing on family during retirement.\n4. The student has already made plans with their daughter and son-in-law to visit more often and take the grandkids on trips.\n5. The teacher and student have a positive and understanding relationship.\n6. The student is looking forward to retirement and spending time with their grandchildren.",
        "speaker": "Student",
        "raw_prediction": "Haha, I remember that! Sorry about that, I didn't mean to startle you. It was all in good fun.",
        "previous_summary": "The student apologized to the teacher for yelling at them and scaring them in the hallway.\nThe student mentioned feeling stressed lately, which may have led to the outburst.\nThe teacher expressed understanding and encouraged the student to seek help when needed.\nThe student admitted to not talking to anyone about their stress and trying to deal with it alone.\nThe teacher offered support and reassured the student that they are there to talk to.\nThe student appreciated the teacher's support and apologized again for the incident.\nThe student apologizes to the teacher for yelling in the hallway, acknowledging it was out of character and seeking to move past it.\nThe teacher advises the student on effective communication and problem-solving, emphasizing the importance of talking calmly and finding solutions together."
    },
    {
        "utter_id": "e24-s5-t1",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.",
        "memory_text": "1. Both neighbors emphasize the importance of taking care of each other as neighbors.\n2. Neighbor A enjoys reading and sharing books with Neighbor B.\n3. Neighbors A offers to help Neighbors B with getting into a workout routine.\n4. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\n5. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n6. Neighbor A and Neighbor B went to a concert together in the past and had a great time.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's a great idea! It helps avoid any confusion in the future. By the way, I picked up a new book that I think you'll enjoy. Would you like to borrow it after you're done working out?",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t3",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.",
        "memory_text": "1. Both neighbors emphasize the importance of taking care of each other as neighbors.\n2. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n3. Neighbor A and Neighbor B went to a concert together in the past and had a great time.\n4. Neighbor A enjoys reading and sharing books with Neighbor B.\n5. Neighbors A offers to help Neighbors B with getting into a workout routine.\n6. Neighbors A is feeling overwhelmed and stressed, mentioning having a lot on their plate.",
        "speaker": "Neighbors B",
        "raw_prediction": "I appreciate you being proactive about it. It's important to clarify things like this to avoid any potential issues down the line. Thank you for taking the initiative.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t7",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.",
        "memory_text": "1. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n2. Both neighbors emphasize the importance of taking care of each other as neighbors.\n3. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\n4. Neighbor A and Neighbor B went to a concert together in the past and had a great time.\n5. Neighbors A offers to help Neighbors B with getting into a workout routine.\n6. Neighbors B was read to from a book about personal development by Neighbors A, which had a positive impact on Neighbors A's career growth.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's fantastic to hear! Setting clear boundaries is crucial for effective leadership. How did it go with establishing those expectations with your team?",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t1",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.",
        "memory_text": "1. Classmate B feels relieved that they can still be friends with Classmate A.\n2. Classmates B complimented Classmates A on their suit and brought up a past conversation about feelings.\n3. Classmate A has been hiding their feelings for Classmate B and finally confesses to being in love with them.\n4. Classmates A values their friendship with Classmates B and looks forward to wearing a black suit to a wedding reception.\n5. Classmates A confessed their love for Classmates B, who does not feel the same way.\n6. Classmates A has been busy with work and hanging out with friends, looking forward to the wedding as a fun night out.",
        "speaker": "Classmates B",
        "raw_prediction": "I couldn't agree more. It's amazing to see how we've all grown together over the years. And by the way, that black suit you mentioned wearing to the wedding reception? I'm sure you'll look stunning in it.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t1",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?",
        "memory_text": "1. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n2. Co-worker A has been successful in not being late to work for weeks.\n3. Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\n4. Co-worker A is trying to improve their punctuality and cut back on drinking.\n5. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n6. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear! It sounds like you're being proactive and getting things done early. Keep it up!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.",
        "memory_text": "1. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n2. Co-worker A is trying to improve their punctuality and cut back on drinking.\n3. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n4. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n5. Both co-workers show a supportive and caring attitude towards each other.\n6. Co-worker B is supportive and encourages Co-worker A to give people a chance.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you for the kind words. I really appreciate your support and encouragement. It means a lot coming from you. I'll keep working on being more responsible and reliable.",
        "previous_summary": "Co-worker A was a leader in their country, making it prosperous and safe.\nCo-worker A believes their success as a leader was due to determination and strength of character."
    },
    {
        "utter_id": "e27-s5-t14",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?\nNeighbors A: Not really, it was just a fun hobby back then. Plus, I don't think I have the same energy as I did when I was younger.\nNeighbors B: That's understandable. Do you still play any instruments?\nNeighbors A: I have a guitar but I haven't played it in a while. Maybe I should start practicing again.\nNeighbors B: Yeah, that sounds like a good idea. Maybe you could even teach me a thing or two.\nNeighbors A: Sure, I'd be happy to. Maybe we could even play some music together.\nNeighbors B: That would be great! I've always wanted to learn how to play an instrument.",
        "memory_text": "1. Neighbors B is familiar with Neighbors A's dog and looking forward to playing with it again.\n2. Neighbors A appreciated the support and friendship of Neighbors B.\n3. Neighbors B expresses concern for Neighbors A's back pain.\n4. Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience.\n5. Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.\n6. Neighbors A mentions having back pain and needing a break.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a plan! It would be fun to jam together sometime. Let me know when you're ready to start learning, and we can make some music together.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t2",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?",
        "memory_text": "1. Co-worker B finished a project and sent it to the manager for review.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n4. Co-worker B acknowledges the importance of finding a balance between work and relaxation.\n5. Co-worker A gave Co-worker B a pen that they still use.\n6. Co-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, I double-checked everything before sending it. I wanted to make sure it was thorough and accurate.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t4",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.",
        "memory_text": "1. Co-worker B finished a project and sent it to the manager for review.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n4. Co-worker B acknowledges the importance of finding a balance between work and relaxation.\n5. Both Co-worker A and Co-worker B value trust in their personal and professional relationships.\n6. Co-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I always strive to go above and beyond. It's crucial to me that our work reflects our dedication and commitment to the team.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t7",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.\nCo-workers A: It's been a journey, but I'm glad to see the business flourishing. It gives me a sense of pride and accomplishment.",
        "memory_text": "1. Co-worker A took over their family's business a few years ago and it has improved since then.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n4. Both Co-worker A and Co-worker B value trust in their personal and professional relationships.\n5. Co-worker B finished a project and sent it to the manager for review.\n6. Co-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's truly inspiring to see how far you've come and the positive impact you've had on the business. Your dedication and hard work are definitely paying off.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t1",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.",
        "memory_text": "1. The Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches.\n2. The Athlete is focused on improving their performance and energy levels.\n3. The Athlete usually likes the flavor of the gum but is finding it distracting in this instance.\n4. The Athlete seeks approval and praise from the Coach.\n5. The Athlete has been taking on more responsibilities and has gained respect from other players.\n6. The Coach encourages the Athlete to keep up the good work and acknowledges their achievements.",
        "speaker": "Coach",
        "raw_prediction": "That's great, Ted! Your attention to detail and leadership in planning our route is really impressive. It shows that you're not only focused on your own performance but also on the team's success. Keep up the good work!",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t2",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?",
        "memory_text": "1. The Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches.\n2. The Athlete seeks approval and praise from the Coach.\n3. The coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\n4. The Coach has noticed the Athlete's improvement and dedication to improving skills.\n5. The Coach reminds the Athlete that little distractions can add up and impact performance.\n6. The Coach encourages the Athlete to keep up the good work and acknowledges their achievements.",
        "speaker": "Athlete",
        "raw_prediction": "I'm thinking of taking Highway 1 for a scenic drive through the coast. It's a beautiful route with some great views along the way.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t7",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.\nCoach: Definitely. Speaking of energy levels, how's your nutrition plan been going? Have you been keeping up with eating healthy foods like those bean sprouts we talked about?\nAthlete: Yes, Coach. I've been incorporating more nutrient-dense foods like bean sprouts into my diet. And I've noticed a significant improvement in my overall energy levels and performance on the field.",
        "memory_text": "1. The coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\n2. The coach encourages the athlete to continue their good work with nutrition and training.\n3. The coach provides information about the benefits of bean sprouts and the importance of a balanced diet for athletes.\n4. The Athlete is focused on improving their performance and energy levels.\n5. The athlete is concerned about nutrition and improving their diet.\n6. The Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches.",
        "speaker": "Coach",
        "raw_prediction": "That's great to hear, Ted. Keep up the good work with your nutrition and training. Your dedication to improving your diet and performance is really paying off. Your leadership both on and off the field is truly commendable.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n2. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n3. Co-worker A's evidence includes statistics and personal accounts from clients.\n4. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n5. Co-worker A believes their evidence is more compelling than the opposing side's evidence.\n6. Co-worker A agrees to be more conscious of how they come across to others in the future.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you for the compliment. I haven't been in a physical altercation before, but I believe in resolving conflicts through communication and understanding. It's crucial to handle challenging situations with care and empathy.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t10",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?\nCo-workers A: Yeah, I remember. But she eventually gave me the cash, and I was able to take care of what I needed to.\nCo-workers B: That's good. And speaking of taking care of things, your carpentry skills are amazing. I loved the house you built for me last year.",
        "memory_text": "1. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n2. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n3. Co-worker A is a skilled builder who recently completed building a house for Co-worker B.\n4. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n5. Co-worker A's evidence includes statistics and personal accounts from clients.\n6. Co-worker A appreciates the support and hard work put into the case.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad you're enjoying the house! Building it was a labor of love, and I'm just happy to see it being appreciated. It's all about communication and setting clear expectations, just like in any project.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t4",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates A appreciates the support and friendship of Classmates B.\n3. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n4. Classmates A and B started as acquaintances and have developed a strong friendship.\n5. Classmates A and B are making plans to spend time together outside of school.\n6. Classmates A and B value their friendship and feel comfortable talking to each other about anything.",
        "speaker": "Classmates A",
        "raw_prediction": "Thanks, I just felt like it was the right thing to do. Plus, it was great to see the smile on her face when everything was sorted out.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates A appreciates the support and friendship of Classmates B.\n3. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n4. Classmates A and B value their friendship and feel comfortable talking to each other about anything.\n5. Classmates A and B started as acquaintances and have developed a strong friendship.\n6. Classmates B was initially worried about Classmates A going out with friends but they value each other's opinions.",
        "speaker": "Classmates B",
        "raw_prediction": "It's wonderful to see how caring and thoughtful you are towards others. Your kindness truly shines through in moments like these.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.\nClassmates B: Definitely. It's the small acts of kindness that can make the biggest impact. Remembers when we talked about how I made sure the mix-up won't happen again? That was because I wanted to make a small impact, like you did for your neighbor.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates A appreciates the support and friendship of Classmates B.\n3. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n4. Classmates A and B started as acquaintances and have developed a strong friendship.\n5. Classmates B was initially worried about Classmates A going out with friends but they value each other's opinions.\n6. Classmates A and B value their friendship and feel comfortable talking to each other about anything.",
        "speaker": "Classmates A",
        "raw_prediction": "I remember that. Your responsibility and reliability really shine through in moments like that. It's great to see how we both strive to make a positive impact, whether big or small, in our own ways.",
        "previous_summary": "Classmates B had to apologize for a mix-up due to two people having the same name.\nClassmates B made sure to double-check everything to resolve the issue and prevent it from happening again.\nClassmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability."
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.\n3. The wife brings up past disappointment when the husband left without her, breaking a promise to wait for her.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband is inspired by his wife to take action on his dreams and goals.\n6. The husband values the wife's encouragement and positivity in his pursuit of his goals.",
        "speaker": "Wife",
        "raw_prediction": "I appreciate your thoughtfulness, husband. Your effort to involve me in your plans and consider my feelings means a lot to me. Let's focus on making new memories together on our weekend getaway.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t12",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.\nClassmates A: Exactly! That's what you should do too. Own up to it and move on. Don't let it bother you.\nClassmates B: You're right. Thanks, Classmates A. You always know how to make me feel better.",
        "memory_text": "1. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n2. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n3. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n4. Classmate B struggles with parallel parking but is grateful for Classmate A's patience.\n5. Classmate A believes in doing their best at everything to avoid regrets later.\n6. Classmates B also mentioned that Classmates A helped them prepare for a driving test, showing patience and dedication.",
        "speaker": "Classmates A",
        "raw_prediction": "No problem, Classmates B. We all have our embarrassing moments, but it's how we handle them that counts. Just remember, we're all in this together and here to support each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t5",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.",
        "memory_text": "1. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n2. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n3. Neighbors A is trying to improve their behavior at work and be a better colleague.\n4. Neighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\n5. Neighbors A noticed that Neighbors B's dog has been missing for a few days.\n6. Neighbors B appreciated Neighbors A's support during this difficult situation.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's fantastic to hear! Your dedication and hard work are really paying off. I believe in your product and your ability to make it a success. Keep up the great work, and I'm here to support you every step of the way.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t6",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.",
        "memory_text": "1. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n2. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n3. Neighbors A is trying to improve their behavior at work and be a better colleague.\n4. Neighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\n5. Neighbors B appreciated Neighbors A's support during this difficult situation.\n6. Neighbors A noticed that Neighbors B's dog has been missing for a few days.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks for believing in me, it means a lot. I'm just hoping to make a positive impact in the fitness industry with this product.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t2",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.",
        "memory_text": "1. Co-worker A is grateful for life experiences and is open to new possibilities in the future.\n2. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n3. Co-worker B emphasized the importance of learning from mistakes and working together as a team.\n4. Co-worker A has grown as a person and as an artist, learning about empathy and compassion.\n5. Co-worker B encourages Co-worker A to try relaxation techniques or find a hobby to de-stress and overcome fears.\n6. Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.",
        "speaker": "Co-workers A",
        "raw_prediction": "It really does. It's like having a mentor who believes in your potential and helps you grow both personally and professionally.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t4",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?",
        "memory_text": "1. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n2. Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.\n3. Co-worker A and Co-worker B met on a movie set and are now good friends.\n4. Co-worker B emphasized the importance of learning from mistakes and working together as a team.\n5. Co-worker A is grateful for life experiences and is open to new possibilities in the future.\n6. Co-worker B and Co-worker A met on a movie set where Co-worker A was focused on acting.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, I remember that. It was a challenging time, but your encouragement and support really helped me push through it. That experience taught me a lot about resilience and the value of teamwork.",
        "previous_summary": "Co-worker A and Co-worker B met on a movie set and are now good friends.\nCo-worker A was initially intimidated by Co-worker B due to their talent as a director.\nCo-worker B was nervous about working with Co-worker A because of their talent as an actor.\nBoth Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\nThey both believe that their teamwork made the movie a success.\nCo-worker A had a tough week on set, feeling overwhelmed and chaotic.\nCo-worker B expressed disapproval of Co-worker A's actions and suggested talking to the director to address the stressful situation.\nCo-worker A felt remorse for what they did and appreciated Co-worker B's understanding."
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.",
        "memory_text": "1. Mentor became a mentor to help others going through similar situations.\n2. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n3. Mentee agrees to try the advice and express gratitude towards Mentor.\n4. Mentee has been thinking about helping others who may be in abusive cults.\n5. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentor",
        "raw_prediction": "That's wonderful to hear, Mentee. Putting yourself in someone else's shoes can truly deepen your empathy and connection with them. It's a valuable skill that will serve you well in your journey to make a positive impact on people's lives.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t6",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.",
        "memory_text": "1. Mentor became a mentor to help others going through similar situations.\n2. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n3. Mentee agrees to try the advice and express gratitude towards Mentor.\n4. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n5. Mentee has been thinking about helping others who may be in abusive cults.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentee",
        "raw_prediction": "I couldn't agree more, Mentor. Being able to show compassion and understanding in difficult times can make a huge difference in someone's life. It's something I really want to embody in my efforts to help others.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t8",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.",
        "memory_text": "1. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n2. Mentor became a mentor to help others going through similar situations.\n3. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n4. Mentee agrees to try the advice and express gratitude towards Mentor.\n5. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.\n6. Mentee agrees to teach in a way that allows people to make their own decisions about their beliefs.",
        "speaker": "Mentee",
        "raw_prediction": "I couldn't agree more. Being open-minded and willing to learn from others is key to personal growth and understanding. It's amazing how much we can gain by simply listening and trying to see things from different perspectives.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.",
        "memory_text": "1. Mentor became a mentor to help others going through similar situations.\n2. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n3. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n4. Mentee agrees to try the advice and express gratitude towards Mentor.\n5. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.\n6. Mentee has been thinking about helping others who may be in abusive cults.",
        "speaker": "Mentee",
        "raw_prediction": "I completely agree, Mentor. Learning about different cultures can really open our minds and help us appreciate diversity. It's inspiring to see how people from different backgrounds live and think.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t2",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.",
        "memory_text": "1. Neighbors A thanked Neighbors B for the suggestion.\n2. Neighbors B emphasized the importance of apologizing to show care for the relationship.\n3. Neighbors A bought a necklace from Neighbors B's shop and loves it.\n4. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\n5. Neighbors B offered to help Neighbors A with the apology process.\n6. Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.",
        "speaker": "Neighbors A",
        "raw_prediction": "Definitely! I really appreciate your offer to help me with the apology process. It means a lot to have friends like you who are willing to support and guide me through tough situations.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t3",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.",
        "memory_text": "1. Neighbors A thanked Neighbors B for the suggestion.\n2. Neighbors B offered to help Neighbors A with the apology process.\n3. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\n4. Neighbors B emphasized the importance of apologizing to show care for the relationship.\n5. Neighbors A bought a necklace from Neighbors B's shop and loves it.\n6. Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, that's what good neighbors are for - supporting each other in times of need. It's all about building a strong community where we can rely on each other.",
        "previous_summary": "Neighbors B suggested using rug grippers and a rug pad to keep the rug in place.\nNeighbors B offered to help Neighbors A with the apology process."
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.\nNeighbors B: Yes, and I appreciate it so much. It's always nice to have someone you can count on.\nNeighbors A: That's true. And speaking of which, I'm helping another friend move next weekend. It'll be a big job, but I know they'd do the same for me.\nNeighbors B: That's great. And if you need any help, just let me know.",
        "memory_text": "1. Neighbors A thanked Neighbors B for the suggestion.\n2. Neighbors B offered to help Neighbors A with the apology process.\n3. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\n4. Neighbors A bought a necklace from Neighbors B's shop and loves it.\n5. Neighbors B emphasized the importance of apologizing to show care for the relationship.\n6. Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I really appreciate that. It's nice to know I have such supportive friends like you.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?",
        "memory_text": "1. Classmates A discovered a secret that Classmates B has been keeping.\n2. Classmates A and B are students in the same class.\n3. Classmates A was worried about a situation but it turned out to be not a big deal.\n4. Classmates A and B are close and have a level of trust between them.\n5. Classmates A offered help and support to Classmates B.\n6. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, it's nothing bad, don't worry. I just wanted to let you know that I'm here for you no matter what.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t9",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmates B feels relieved to have someone to confide in about the secret.\n3. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n4. Classmates A discovered a secret that Classmates B has been keeping.\n5. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\n6. Classmates A offered help and support to Classmates B.",
        "speaker": "Classmates B",
        "raw_prediction": "No, you're not crossing any lines at all. I appreciate your honesty and openness about your feelings. It means a lot to me that you shared this with me. Let's see where this takes us.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t13",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. \nClassmates A: Yeah, I guess it does. It’s just that I’ve been hurt before, and I don’t want to lose you as a friend too.\nClassmates B: I understand your concerns,. but I think we can make this work. We've already built a strong foundation of friendship, which is important for any relationship.\nClassmates A: That’s true. I feel like we can take this in any direction that we want.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n3. Classmates B feels relieved to have someone to confide in about the secret.\n4. Classmates A offered help and support to Classmates B.\n5. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\n6. Classmates A was worried about a situation but it turned out to be not a big deal.",
        "speaker": "Classmates B",
        "raw_prediction": "I completely agree,. We have a solid base to build something special on. I'm excited to see where this goes with you.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t1",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmate A and Classmate B are classmates.\n3. Classmates A has not experienced similar pains in the past and is feeling worried about the situation.\n4. Classmates A is competitive and recently beat their brother in a race.\n5. Classmate A emphasizes the importance of self-care and relaxation.\n6. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.",
        "speaker": "Classmates A",
        "raw_prediction": "That's great to hear! Your determination and competitiveness will surely pay off.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t5",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmate A and Classmate B are classmates.\n3. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n4. Classmates A expresses gratitude for the support and friendship of Classmates B.\n5. Classmates B offers support and suggests taking a step back to find a balance.\n6. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! It sounds like all your hard work is paying off. Just remember to enjoy the learning process and not put too much pressure on yourself to be perfect. It's important to find a balance and appreciate the journey of growth and improvement.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t11",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.\nClassmates B: It's important to listen to your body and take care of yourself.\nClassmates A: Exactly. And sometimes, it's nice to just take a break and enjoy a quiet moment to yourself.",
        "memory_text": "1. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n2. Classmates B acknowledges Classmates A's determination and competitiveness.\n3. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.\n4. Classmates A expresses gratitude for the support and friendship of Classmates B.\n5. Classmate A emphasizes the importance of self-care and relaxation.\n6. Classmates B offers support and suggests taking a step back to find a balance.",
        "speaker": "Classmates B",
        "raw_prediction": "Absolutely, finding that balance between hard work and self-care is crucial. Taking a moment to relax and recharge can make a big difference in how you approach challenges. It's all about finding that harmony between pushing yourself and giving yourself the rest you need.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t4",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmates B and Classmates A used to dance a lot in middle school.\n3. Classmate B is a supportive friend who listens and offers to help.\n4. Classmates B supported Classmates A through a tough time by listening to them.\n5. Classmates A has matured since then and learned from past mistakes.\n6. Classmate A appreciates having friends who are there for them during difficult times.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad you're interested in learning more about computer programs! Based on what I've learned, I recommend trying out Microsoft Office for general tasks like word processing and presentations. It's user-friendly and versatile, which might make it easier for you to navigate through different programs.",
        "previous_summary": "Classmates B emphasizes the consequences of Classmates A's actions and the need for responsibility.\nClassmates B mentions a past incident where they had to clean up spilled paint, highlighting the importance of learning from mistakes.\nBoth classmates have experienced making mistakes and learning from them.\nClassmates A and Classmates B are friends who help each other with schoolwork."
    },
    {
        "utter_id": "e41-s5-t8",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?\nClassmates A: Yeah, I also learned some basic coding languages like HTML and CSS. It was challenging but really interesting.\nClassmates B: Wow, that sounds cool. Do you think you'll pursue coding further?",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmates A is considering taking a dance class for fun.\n3. Classmates B and Classmates A used to dance a lot in middle school.\n4. Classmate B is a supportive friend who listens and offers to help.\n5. Classmates A has matured since then and learned from past mistakes.\n6. Classmate A appreciates having friends who are there for them during difficult times.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm not sure yet. I might explore it more in the future, but for now, I'm just happy to have a better understanding of computer basics. It's always good to have a diverse skill set, right?",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t6",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?",
        "memory_text": "1. Co-workers A and B have worked together on a big story in the past.\n2. Co-worker B points out that Co-worker A doesn't always consider how their actions can affect others.\n3. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n4. Co-worker B is supportive and encouraging towards Co-worker A.\n5. Both Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes.\n6. Co-worker B has been arrested in the past partly because of Co-worker A's actions.",
        "speaker": "Co-workers A",
        "raw_prediction": "I've been reflecting on that lately, and I appreciate your honesty back then. It really helped me see things from a different perspective.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t7",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.",
        "memory_text": "1. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n2. Co-workers A and B have worked together on a big story in the past.\n3. Co-worker B is supportive and encouraging towards Co-worker A.\n4. Co-worker A is managing the night shift by getting enough rest during the day and staying focused.\n5. Both Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes.\n6. Co-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic news! I'm really proud of you for stepping up and excelling in your new role. It's clear that you've taken responsibility for your actions and learned from past experiences. Keep up the great work on the night shift!",
        "previous_summary": "Co-worker A has made mistakes in the past but is trying to be more aware of their actions.\nCo-worker A feels remorseful about the situation that led to Co-worker B's arrest.\nCo-worker B points out that Co-worker A doesn't always consider how their actions can affect others.\nCo-worker A is adjusting to the night shift schedule and excited for a promotion.\nCo-worker A is nervous about making mistakes in their new position.\nCo-worker A is a journalist who was recently promoted for being reliable.\nCo-worker A feels guilty about a past mistake involving Co-worker B's arrest.\nBoth Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes."
    },
    {
        "utter_id": "e42-s5-t8",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.\nCo-workers B: That's awesome, congratulations! I'm proud of you and all the hard work you've put in. You've definitely grown and matured in the workplace.",
        "memory_text": "1. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n2. Co-worker B is supportive and encouraging towards Co-worker A.\n3. Co-workers A and B have worked together on a big story in the past.\n4. Both Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes.\n5. Co-worker A expresses nervousness and self-doubt despite their achievements.\n6. Co-worker A is managing the night shift by getting enough rest during the day and staying focused.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I really appreciate your support and encouragement. It means a lot coming from someone I've worked closely with. Your belief in me has definitely helped boost my confidence.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t9",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.\nCo-workers B: That's awesome, congratulations! I'm proud of you and all the hard work you've put in. You've definitely grown and matured in the workplace.\nCo-workers A: Thank you, I appreciate that. But I have to admit, I'm still a bit nervous about being wrong. Remember when we talked about my constantly questioning myself and second-guessing my decisions?",
        "memory_text": "1. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n2. Co-worker A expresses nervousness and self-doubt despite their achievements.\n3. Co-worker B reassures Co-worker A that making mistakes is okay as long as they learn from them.\n4. Co-worker A is nervous about making mistakes in their new position.\n5. Both Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes.\n6. Co-worker B is supportive and encouraging towards Co-worker A.",
        "speaker": "Co-workers B",
        "raw_prediction": "I remember those conversations. It's completely normal to feel a bit nervous, especially in a new position. Just remember, making mistakes is all part of the learning process. You've shown great growth in taking responsibility for your actions and learning from them. Just keep believing in yourself, and you'll continue to excel in your new role.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t12",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.\nCo-workers B: That's awesome, congratulations! I'm proud of you and all the hard work you've put in. You've definitely grown and matured in the workplace.\nCo-workers A: Thank you, I appreciate that. But I have to admit, I'm still a bit nervous about being wrong. Remember when we talked about my constantly questioning myself and second-guessing my decisions?\nCo-workers B: Yeah, I remember that. Is there anything specific that's been bothering you?\nCo-workers A: Not really, it's just a general feeling of uncertainty at times. But hey, speaking of uncertainty, do you remember when we talked about my love for singing a while ago?\nCo-workers B: Yes, I do. How's that been going for you?",
        "memory_text": "1. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n2. Co-worker A expresses nervousness and self-doubt despite their achievements.\n3. Co-worker A has been working hard on their singing skills and has a passion for music.\n4. Co-worker B reassures Co-worker A that making mistakes is okay as long as they learn from them.\n5. Co-worker B is supportive and encouraging towards Co-worker A.\n6. Co-worker A is nervous about making mistakes in their new position.",
        "speaker": "Co-workers A",
        "raw_prediction": "I've been putting in a lot of effort into my singing skills and practicing regularly. It's been challenging, but I'm really passionate about it. I just worry about making mistakes and not improving fast enough.",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t1",
        "current_dialogue": "Classmates A: , I know you know something about my past. Can you tell me what it is?",
        "memory_text": "1. Classmates A is curious and open to exploring new things and taking risks.\n2. Classmates B warns Classmates A about the potential danger of dark alleys.\n3. Classmates A encountered a mysterious woman in a dark alley, finding her intriguing.\n4. Classmates B advises Classmates A to be careful and aware while on the bus.\n5. Classmates B appreciates the genuine friendship and positive attitude of Classmates A.\n6. Classmates A believes the mysterious woman might have a message to help make a positive change in the world.",
        "speaker": "Classmates B",
        "raw_prediction": "I'm sorry, but I really don't know anything about your past. If there's anything you want to share or talk about, I'm here to listen.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t5",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.",
        "memory_text": "1. Neighbor A is grieving the recent loss of their grandmother.\n2. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n3. Neighbor A recently moved to a new neighborhood and feels safer and happier there.\n4. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n5. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n6. Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.",
        "speaker": "Neighbors B",
        "raw_prediction": "I understand how overwhelming it must feel right now. Remember, it's okay to take your time to heal and process everything. I'm here for you whenever you need to talk or just want some company. You're not alone in this, Neighbor A.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed.\n2. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n3. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n4. Classmate B advises Classmate A to take deep breaths, stay confident, and focus on delivery.\n5. Classmate A has tried practicing in front of others but still feels nervous.\n6. Classmates A sometimes doubts if they are good enough to make it to the professional level.",
        "speaker": "Classmates A",
        "raw_prediction": "I understand that you were facing financial difficulties, but cheating is never the solution. It's important to address the issue in a legitimate way and seek help if needed.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t5",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates A and B are both keeping up with the homework in their math class.\n3. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n4. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n5. Classmates A finds pursuing music rewarding and is passionate about it.\n6. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.",
        "speaker": "Classmates B",
        "raw_prediction": "Thanks, that means a lot to me. I appreciate your support, and I'm grateful to have you by my side.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t6",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates A and B are both keeping up with the homework in their math class.\n3. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n4. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n5. Classmates A finds pursuing music rewarding and is passionate about it.\n6. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.",
        "speaker": "Classmates A",
        "raw_prediction": "I totally get where you're coming from. It's great that you want to be more independent. Just remember, it's okay to ask for help when you need it. We're in this together, and we'll figure things out as we go along.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t12",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A finds pursuing music rewarding and is passionate about it.\n4. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n5. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n6. Classmates B is interested in learning to play an instrument.",
        "speaker": "Classmates A",
        "raw_prediction": "That's fantastic to hear! I'm so proud of your progress with the guitar. It's amazing to see you dedicated to learning and improving. Maybe we can jam together soon and work on some music together.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t1",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.",
        "memory_text": "1. Neighbor B has not been up to anything interesting lately but is excited about the new house and looking forward to it.\n2. Neighbors A enjoys taking care of flowers and finds it calming.\n3. Neighbors B admires Neighbors A's gardening skills and wishes to have a green thumb.\n4. Neighbors A had help from friends in building the new house.\n5. Neighbor B is against Neighbor A's idea, emphasizing the ethical and legal implications.\n6. Neighbor A has skills in manipulation and getting what they want.",
        "speaker": "Neighbors B",
        "raw_prediction": "Have you tried taking a break and maybe spending some time in your garden? I find that tending to my flowers helps me relax and clear my mind.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t11",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. ",
        "memory_text": "1. Neighbors A had help from friends in building the new house.\n2. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n3. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n4. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.\n5. Neighbor B has not been up to anything interesting lately but is excited about the new house and looking forward to it.\n6. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's amazing to hear! I can't wait to see the finished result. Your hard work definitely paid off.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t13",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.",
        "memory_text": "1. Neighbors A had help from friends in building the new house.\n2. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n3. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.\n4. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n5. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n6. Neighbor B has not been up to anything interesting lately but is excited about the new house and looking forward to it.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, I remember that day. It was truly special. I can't wait to create more memories in our new home.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t14",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.",
        "memory_text": "1. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n2. Neighbors A had help from friends in building the new house.\n3. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.\n4. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n5. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n6. Neighbors A values their friendship with Neighbors B, describing them as a great neighbor.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm so glad we shared that moment together. It's memories like those that make all the hard work worth it.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t15",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.\nNeighbors A: Speaking of London, have you heard about those recent cases of identity theft? It's terrible that people like that exist.",
        "memory_text": "1. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n2. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n3. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n4. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.\n5. Neighbors A had help from friends in building the new house.\n6. Neighbor B has not been up to anything interesting lately but is excited about the new house and looking forward to it.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yes, it's truly upsetting that there are individuals who would take advantage of others like that. We must all stay vigilant and protect our personal information as best as we can. On a brighter note, I can't wait to host a little get-together in the new house to celebrate with everyone.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t16",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.\nNeighbors A: Speaking of London, have you heard about those recent cases of identity theft? It's terrible that people like that exist.\nNeighbors B: Yes, it's scary to think someone could steal your identity and ruin your life like that.",
        "memory_text": "1. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n2. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n3. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n4. Neighbors A values their friendship with Neighbors B, describing them as a great neighbor.\n5. Neighbors A had help from friends in building the new house.\n6. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's definitely a reminder to always be vigilant with our personal information and security measures. We have to look out for each other in times like these.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t4",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?",
        "memory_text": "1. Wife suggests that husband should try using more modern language to be better understood.\n2. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.\n3. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\n4. Husband agrees to try adapting to modern language for better communication with his wife.\n5. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.\n6. The wife remembers the husband being nervous before the presentation.",
        "speaker": "Husband",
        "raw_prediction": "I appreciate your support, and you're right, revisiting those writing prompts could spark some new ideas. I'll give it a try and let you know how it goes. Thank you for always being there for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t5",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.",
        "memory_text": "1. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.\n2. Wife suggests that husband should try using more modern language to be better understood.\n3. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\n4. Husband agrees to try adapting to modern language for better communication with his wife.\n5. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.\n6. The wife remembers the husband being nervous before the presentation.",
        "speaker": "Wife",
        "raw_prediction": "It's normal to feel that way sometimes. Maybe it's time to explore new genres or writing styles to spark some fresh ideas. Remember, it's all about embracing who you are as a writer and finding your unique voice. How about trying to write a short story from a completely different perspective?",
        "previous_summary": null
    }
]