[
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.",
        "memory_text": "Speaker B is going on a trip but has not started packing yet as Speaker B received a new car from their mom and plans to drive during spring break.\nSpeaker A, a retired librarian, recommends the book \"Beautiful Ruins\" by Jess Walter for a beach visit, contrasting with Speaker A's quiet spring breaks in the past.",
        "speaker": "Speaker A",
        "raw_prediction": "\"The Gettysburg Campaign\" is about the pivotal battle during the American Civil War. It's a fascinating look at the strategies and key figures involved.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "Speaker B enjoys watching swimming movies and wants to listen to punk music while swimming and learning programming. \nSpeaker A has known how to swim since the age of 5 and offers to teach Speaker B how to swim and programming. \nSpeaker B's favorite food is a pizzaburger and is looking forward to eating it in a pool with punk music playing.",
        "speaker": "Speaker B",
        "raw_prediction": "Thank you, I appreciate your willingness to teach me how to swim. I'm excited for our meetup this weekend!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t1",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!",
        "memory_text": "Speaker B, a high school student preparing for college, works at a diner at night but is considering giving up their job to focus on lab work and school. Additionally, Speaker B works on weekends at a research lab, displaying an interest in neuroscience. Speaker A offers to take Sparky for a walk to help out and spend time with the dog, as Speaker B's dog is deaf and needs to be kept on a lead due to recall difficulties.",
        "speaker": "Speaker B",
        "raw_prediction": "Definitely! I'm looking forward to seeing how the cloning process unfolds.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t8",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?",
        "memory_text": "Speaker A has hobbies of running and listening to music, and is interested in getting a dog. Speaker A had a hamster named Leonardo in the past and currently walks Speaker B's dog, Sparky. Speaker A is considering getting a dog and wants to try the chilli dog casserole invented by Speaker B. \nSpeaker B, a high school student preparing for college, works at a diner at night. Speaker A plans to try the famous hamburgers made by Speaker B at the diner, and had cheesy ham and potato soup for dinner. Speaker B had hamburgers for dinner with cheese, mustard, and lettuce, and has invented a chilli dog casserole that Speaker A wants to try.",
        "speaker": "Speaker A",
        "raw_prediction": "Rocky road is a classic choice! I'm a big fan of mint chocolate chip, but I also love trying unique flavors like lavender or honeycomb.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t1",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.",
        "memory_text": "Speaker B is from Sweden and mentioned playing tennis and going to church on Sunday. This reminds Speaker A that they have a cousin in Sweden but have not visited the country yet. Speaker A is considering visiting their cousin in Sweden and needs to save money for the trip. Speaker B recommends checking out the volcanoes in Sweden for a unique experience.",
        "speaker": "Speaker B",
        "raw_prediction": "That's exciting! How's the planning going so far?",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t4",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. ",
        "memory_text": "Speaker A has a cousin in Sweden but has not visited the country, while Speaker B is from Sweden and mentioned playing tennis and going to church on Sunday. Speaker A is considering visiting their cousin in Sweden and needs to save money for the trip, causing Speaker B to recommend checking out the volcanoes in Sweden for a unique experience.",
        "speaker": "Speaker A",
        "raw_prediction": "Visby sounds lovely, I'll definitely add it to my list of places to visit in Sweden!",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t10",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. \nSpeaker A: Okay, I will see if there are any castles near where we will be. Do you have any plans to go back to sweden?\nSpeaker B: Not in the near future, but I'm hoping to get back next summer. I love hitting up all the local beach spots with my old friends.\nSpeaker A: That sounds nice! So how is your job going?\nSpeaker B: Always interesting, that's for sure! I have been training to nurse on a new floor, so that'll give me a change of scenery.\nSpeaker A: Does that add a lot of extra work to your plate?\nSpeaker B: At the moment, yes. I'll be in Pediatrics, which has always been my passion. It's a completely different environment than the ER.",
        "memory_text": "Speaker A has a cousin in Sweden and has not visited the country, but wants to travel there with Speaker B. \nSpeaker A is considering visiting their cousin in Sweden and needs to save money for the trip, so they are thinking about taking a second part-time job. \nSpeaker B has not visited Sweden for a long time due to high expenses, but plans to travel there with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": "That's great that you'll be working in Pediatrics, I'm sure it will be a rewarding experience for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t1",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?",
        "memory_text": "Speaker A is involved in horse breeding and taking care of horses, which has caused Speaker B to work in their own therapy practice for about six years. \nSpeaker B, a therapist and football fan supporting the Chiefs, mentions the ups and downs of the profession, and wants to live in the city and have a horse in the future.",
        "speaker": "Speaker B",
        "raw_prediction": "I've always been interested in helping others and psychology, so becoming a therapist felt like a natural fit for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t7",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.",
        "memory_text": "Speaker B, as a therapist, discusses the challenges and rewards of the profession. They also express concerns about the costs associated with owning horses and explore the psychological aspects of horse ownership in relation to Freudian theories. \nSpeaker B's mother being a nurse led to their career as a therapist. They express a desire to have a horse in the future and contemplate the psychological aspects of horse ownership through Freudian theories. \nSpeaker A is experienced in horse breeding and care, working at a stable and enjoying being around horses. They transition from their expertise in horses to their lack of knowledge in psychology.",
        "speaker": "Speaker B",
        "raw_prediction": "Therapy can definitely have a beginning, middle, and end, and it's great to hear about your positive experiences with your horses. Let me know if you ever decide to give therapy a try, I'd be more than happy to help.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t9",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?",
        "memory_text": "Speaker A enjoys being around horses, involved in horse breeding and taking care of them. Speaker B is concerned about the cost of owning horses, including medical fees and expenses like horse shoes, and also considers the psychological aspects of owning a horse, relating it to Freudian theories. \nSpeaker B's mom being a nurse and busy with work caused Speaker B to become a therapist, mentioning the ups and downs of the profession, and be a professional in a practice where it is illegal for them to have relationships with clients. \nSpeaker B, a therapist and a football fan supporting the Chiefs, talks about the profession's challenges and the legal restrictions on relationships with clients.",
        "speaker": "Speaker B",
        "raw_prediction": "I appreciate your concern, but as a professional, I always maintain strict boundaries with my clients. I believe I could provide you with the support you need without any conflicts.",
        "previous_summary": "Speaker B is a professional in a practice, where it is illegal for them to have relationships with clients.\nSpeaker B has been working in their own practice for about six years."
    },
    {
        "utter_id": "e4-s5-t10",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?\nSpeaker B: No not at all but if you didn't feel comfortable talking to me I can recommend a couple of my colleagues who are just as brilliant",
        "memory_text": "Speaker A has a passion for horse breeding and taking care of horses, working at a stable and enjoying being around them.\nSpeaker B, living in the city, is interested in having a horse in the future and considers the psychological aspects of owning one, relating it to Freudian theories.\nSpeaker B's profession as a therapist is influenced by their mom being a busy nurse, causing them to discuss the challenges and rewards of being a therapist and the restrictions on relationships with clients.\nSpeaker B, a therapist and a football fan supporting the Chiefs, reflects on the profession's ups and downs, while Speaker A mentions the potential medical costs of horses hurting themselves during exercise.",
        "speaker": "Speaker A",
        "raw_prediction": "I appreciate the offer, and I'll definitely think about it. It's good to know that therapy can have an endpoint for some people.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t1",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.",
        "memory_text": "Speaker A enjoys reading fantasy books and recommends \"A Game of Thrones\" by George R because Speaker A also enjoyed reading 'Redwall' growing up and keeps an eye out for similar books. \nSpeaker B is an artist who walks through nature for work and finds inspiration for their artwork during nature walks. Speaker B lives in the country, loves nature, and works with animals. Speaker B is interested in Pilates but dislikes the idea of having to follow specific steps in exercise.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds wonderful! I always find so much inspiration in nature.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t5",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?",
        "memory_text": "Speaker B is an artist who walks through nature for work. This helps Speaker B find inspiration for their artwork. Speaker A is a city dweller who walks to work instead of driving. This also helps Speaker A stay active and healthy.",
        "speaker": "Speaker B",
        "raw_prediction": "I have a Golden Retriever named Luna. She absolutely loves being out in nature with me.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "Speaker B and Speaker A both enjoy reading books and finding inspiration in nature for their hobbies.\nSpeaker A values the importance of proper form in exercise to prevent injuries, especially since they walk to work.\nSpeaker B, being an artist, finds inspiration for their artwork during nature walks, which Speaker A acknowledges and asks about.",
        "speaker": "Speaker A",
        "raw_prediction": "Kyrie sounds like a wonderful companion! It's great that she's well-behaved off-leash. I can imagine how much energy and space a Kelpie needs. Do you have any favorite spots you like to take her for walks?",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t11",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. \nSpeaker A: Oh wow! So Kyrie is a working dog? She helps your dad out on the farm?\nSpeaker B: She herds them for fun, haha. Goats mostly graze wherever they like in the fields, but she likes to group them up and walk them into a pen. My grandpa says it's from her cattle herding heritage.\nSpeaker A: I like the idea of having so much space out in the country, but I think at heart I'm still a city girl. There is a part of me that likes being surrounded by people and I love to people watch on my walks through the city just as much as I love to nature watch on my walks through the country.",
        "memory_text": "Speaker B, who lives in the country, loves nature, and works with animals, is currently re-reading 'Redwall' by Brian Jacques, which was a favorite book growing up. Despite being busy with a new painting and not having time to read, Speaker B is asked about their new artwork by Speaker A, who acknowledges their need for inspiration.\n\nSpeaker A, a city dweller who walks to work instead of driving, expresses interest in Pilates but dislikes the idea of having to follow specific steps in exercise.\n\nSpeaker B, an artist who walks through nature for work, finds inspiration for their artwork during nature walks and enjoys reading the Odd Thomas and Dark Tower series.",
        "speaker": "Speaker B",
        "raw_prediction": "It's nice to enjoy the hustle and bustle of the city as well as the peace of the countryside. Both have their unique charms.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t4",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?",
        "memory_text": "Speaker B enjoys listening to Sublime a lot while relaxing on the beach and is looking forward to taking a break from work to go fishing. Speaker B also finds fishing easier than surfing but is interested in trying surfing, and is willing to teach Speaker A how to fish and cook.\n\nSpeaker A wants to see Sublime live one day but doesn't attend many concerts other than the ones their band plays in. Speaker A is in a band where they play the drums, write music, and have 4 members including the singer who is their best friend. Additionally, Speaker A is a musician.",
        "speaker": "Speaker A",
        "raw_prediction": "I learned music when I was young. My best friend, who is also the singer in my band, taught me how to play the drums.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t5",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself",
        "memory_text": "Speaker B enjoys listening to Sublime a lot while relaxing on the beach and is looking forward to taking a break from work to go fishing. Speaker B also finds fishing easier than surfing but is interested in trying surfing. Additionally, Speaker B is willing to teach Speaker A how to fish and cook.\n\nSpeaker A was good at writing in school, while Speaker B was bad at math and preferred fishing. This caused Speaker A to be in a band and play music, possibly as a musician. Speaker B, on the other hand, is a passionate cook who enjoys making Italian dishes like pasta, risotto, and pizza.\n\nSpeaker A is in a band where they play the drums and write music, with 4 members including the singer who is their best friend. Their band visited Italy, Uzbekistan, and smaller countries in Central and South America.",
        "speaker": "Speaker B",
        "raw_prediction": "That's awesome that your father taught you how to play drums! Have you ever performed live with your band?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "Speaker A is a librarian and loves kids, mentioning having 3 children. This leads to Speaker B mentioning having grandkids, implying they are older and have a family of their own. Speaker A has kids and is busy with work, unable to spend as much time with them as they would like. Speaker B has grandkids and enjoys spending time with them at the park. Speaker A's other children are addicted to tablets and phones, unlike the youngest one who is interested in music. Speaker B has grandkids who are more interested in phones and tablets than musical instruments. Speaker A has children and grandchildren, with at least one child interested in learning the flute.",
        "speaker": "Speaker B",
        "raw_prediction": "I can see how that would be challenging with your schedule. It's important to adapt to stay connected with your loved ones.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t8",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?",
        "memory_text": "Speaker B prefers painting regular people over professionals, discovered love for portraits through a self-portrait with pets.\nSpeaker B thinks pit bulls are lovely and has one that is kind and sweet.\nSpeaker B is considering getting kittens and thinks rats can be smart.",
        "speaker": "Speaker A",
        "raw_prediction": "You can definitely start at home with YouTube videos, but going to a Pilates class can provide more guidance and motivation. Either way, it's worth trying out!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t11",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?\nSpeaker A: You can probably start with Youtube just to see if you like it.  Much better to go to a class I think though.  Of course, I'm biased. I'm in love with my instructor! haha\nSpeaker B: Lol, okay I will definitely try it at home first. If I can get the hang of it, I will sign up for a class. Hopefully I can get an instructor as good as yours lol! \nSpeaker A: Well, getting some individual responses to questions and individual attention at times, I think makes a difference. But there is nothing wrong with going to youtube first!  I did!",
        "memory_text": "Speaker B has 5 dogs of different breeds, has rats as pets, and thinks pit bulls are lovely.\nSpeaker B discovered love for portraits through a self-portrait with pets and prefers painting regular people over professionals.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll give it a shot and see how it goes. Who knows, maybe I'll end up loving Pilates just like you!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t2",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.",
        "memory_text": "Speaker B is considering doing sledding with dogs while in Alaska, but needs to find out if it is daylight or darkness there. Speaker B's friend mentioned Alaska doesn't have 24-hour days like where they are. \nSpeaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker B is unsure about other activities besides hiking in Alaska. \nSpeaker B is going to Alaska for a vacation in two weeks and has flying experience. Speaker A mentions outdoor activities planned for Alaska, such as hiking. \nSpeaker A has the impression that Alaska is cold and snowy, wondering if there are ski slopes there.",
        "speaker": "Speaker A",
        "raw_prediction": "You should check the daylight hours in Alaska, especially if you're planning on doing activities like sledding with dogs.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t5",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!",
        "memory_text": "Speaker A and Speaker B are both planning an Alaskan vacation but have not planned much yet. \nSpeaker A mentions the outdoor activities they plan to do in Alaska, such as hiking, causing Speaker B to have the impression that Alaska is cold and snowy, wondering if there are ski slopes there. \nSpeaker B is involved in programming work, and Speaker A and Speaker B share a sense of humor and make each other laugh during the conversation.",
        "speaker": "Speaker B",
        "raw_prediction": "I'll make sure to bring extra layers and gear to stay warm. I'll definitely share all about the ice cream when I get back!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t9",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?",
        "memory_text": "Speaker A and Speaker B share a sense of humor and make each other laugh during the conversation. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker A mentions the outdoor activities they plan to do in Alaska, such as hiking.\nSpeaker B is going to Alaska for a vacation in two weeks and has some experience with flying on airplanes. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker A and Speaker B are planning a trip to Alaska together.\nSpeaker A and Speaker B share a sense of humor and make each other laugh during the conversation. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking. Speaker A talks about the common perceptions of Alaska being cold, dark, and known for oil drilling.",
        "speaker": "Speaker B",
        "raw_prediction": "Haha, I can only hope my friend is a better guide than Rocky and Bullwinkle would be!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t10",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?",
        "memory_text": "Speaker B is planning an Alaskan vacation but has not planned much yet. Speaker A is familiar with Alaska and outdoor activities like fishing and hiking.\nSpeaker A is working on going back in time. Speaker B is planning an Alaskan vacation but has not planned much yet. Speaker A and Speaker B are planning a trip to Alaska together.\nSpeaker B has programming experience but has not created their own invention. Speaker B is planning an Alaskan vacation but has not planned much yet. Speaker B is unsure about what else there is to do in Alaska besides hiking.",
        "speaker": "Speaker A",
        "raw_prediction": "It's probably a good idea to have a hiking guide, especially with the potential grizzly encounters. Your friend can still show you around, but having a professional guide could ensure your safety.",
        "previous_summary": "Speaker A is concerned about the safety of Speaker B and suggests getting a hiking tour guide.\nSpeaker B is not a fan of fishing but is interested in hiking and seeing a moose.\nSpeaker A is nervous about traveling alone and prefers having someone familiar around during new adventures.\nSpeaker B is comfortable traveling alone and enjoys the spontaneity it allows."
    },
    {
        "utter_id": "e10-s5-t2",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?",
        "memory_text": "1. Speaker A enjoys working at the restaurant despite the busy schedule, which causes Speaker A to enjoy the interaction with people at work and the variety of experiences that come with it.\n\n2. Speaker A owns a restaurant and recently experienced a fire incident but managed to put it out, leading to Speaker A finding it very busy working there. Additionally, Speaker A works at the restaurant and gets two free meals per week, along with taking home leftover baked goods.\n\n3. Speaker A's restaurant plays a mix of songs, mainly easy listening, to create a relaxing environment for diners, which is why Speaker A's schedule at the restaurant includes working doubles on Saturdays and 8-hour shifts on Mondays, Tuesdays, and Thursdays.",
        "speaker": "Speaker A",
        "raw_prediction": "It's called \"Mediterranean Stuffed Peppers.\" I think it's going to be a hit with our customers!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t6",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.",
        "memory_text": "Speaker A works at a restaurant and invited Speaker B to visit. Speaker A enjoys working at the restaurant despite the busy schedule. Speaker A gets two free meals per week, along with taking home leftover baked goods.",
        "speaker": "Speaker A",
        "raw_prediction": "I think I'll go with the tres leches then. It's always good to have a favorite dessert!",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t4",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?",
        "memory_text": "Speaker B is away from their child and glad that the pets are with them. Speaker B expresses concern about leaving a kitten alone during their family camping adventures. Speaker B is considering calling in sick to work to go to the zoo with their child. Speaker B is a parent, pushing for their daughter's school to take a field trip to the zoo. \n\nSpeaker A suggests taking the pets to the zoo and mentions that most major cities have good zoos. Speaker A enjoys visiting the zoo and grew up in big cities. Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys. Speaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua.",
        "speaker": "Speaker A",
        "raw_prediction": "I usually camp in a tent, but I've been thinking about trying out a camper trailer for more comfort. How about you?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?",
        "memory_text": "Speaker A enjoys visiting the zoo and grew up in big cities. This is why Speaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys. In contrast, Speaker B's daughter likes monkeys and is starting to assert her independence. On a similar note, Speaker B is interested in finding family discounts for the zoo as well as pushing for their daughter's school to take a field trip to the zoo.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, we've been to our local zoo a few times. It's always a fun outing, especially for our daughter.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t8",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?",
        "memory_text": "Speaker A, who enjoys visiting the zoo and grew up in big cities, suggests taking the pets to the zoo and mentions that most major cities have good zoos. Speaker B, interested in finding family discounts for the zoo, wants to take their daughter's school on a field trip to the zoo.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys, which is the same topic where Speaker A mentions taking the pets to the zoo. Speaker B's daughter likes monkeys and is starting to assert her independence.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I did get to see Joshua. He was quite active that day. Have you been to the zoo recently?",
        "previous_summary": "Speaker B just moved to America and is unfamiliar with the places.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\nSpeaker B's child wants to visit the zoo, particularly to see the monkeys.\nSpeaker B is interested in finding family discounts for the zoo.\nSpeaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua."
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?\nSpeaker A: I think the Bronx Zoo is one of the best in the country.   Yes, I did see Joshua.  Did you use a season pass for the zoo or just a one time ticket?",
        "memory_text": "Speaker A enjoys visiting the zoo and grew up in big cities. This has led Speaker B's child to want to visit the zoo, particularly to see the monkeys. In return, Speaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua.",
        "speaker": "Speaker B",
        "raw_prediction": "We used a season pass for the zoo. It's definitely worth it for frequent visits!",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t4",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?",
        "memory_text": "Speaker A has seen the Disney movie 'Luca' recently, which made them want to go visit Italy, but instead, they booked a Hawaii sunset tour for next month.\nSpeaker B's kids enjoy watching Disney movies, which Speaker B also finds good. They all enjoyed watching 'Luca', and her husband loved it too.",
        "speaker": "Speaker A",
        "raw_prediction": "I've never been to Italy before, but I'm really looking forward to exploring Hawaii next month. It should be a great experience!",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t7",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.",
        "memory_text": "Speaker B enjoys watching movies with her kids, which is why Speaker B's kids enjoy watching Disney movies and Speaker B also finds them good. This caused Speaker A to see the Disney movie 'Luca' recently.\nSpeaker B is a stay-at-home mom, leading her kids to enjoy watching Disney movies, which Speaker B also finds good. As a result, Speaker B's kids enjoyed watching 'Luca' and said it was good.\nSpeaker B enjoys watching movies with her kids, which made Speaker A enjoy watching sunsets and mention seeing a great sunset recently. This made Speaker A book a \"Hawaii Sunset\" tour for next month, being excited about it being their first time.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds lovely! I'm sure it will be a peaceful and beautiful experience for you. Make sure to take lots of pictures to remember it by.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t4",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through",
        "memory_text": "Speaker A plans to retire down south on a beach for warm weather. Speaker B is interested in visiting Alaska and mentions getting blackout curtains due to the midnight sun. Speaker B found flights that work for their schedule and price and will be visiting Speaker A in a couple of weeks. Speaker A has invited Speaker B to visit them and is excited about the trip. Speaker A plans to take Speaker B on tours and attend folk concerts during the visit.",
        "speaker": "Speaker A",
        "raw_prediction": "There's actually a folk concert happening next weekend that I was thinking of going to. It would be great if you could make it for that!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?",
        "memory_text": "Speaker A is familiar with the wildlife in Alaska, including elk and wolves, and mentions making poached eggs for breakfast and taking sleds pulled by dogs.",
        "speaker": "Speaker A",
        "raw_prediction": "I'm used to the wildlife around here, so I'm pretty cautious when I'm out and about with the dogs.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t11",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?\nSpeaker A: I think I'm more afraid of the wildlife than my dogs are. If I had to, I think I could muster the courage to face the animals out here, but I will happily avoid them when possible. With you around, I'd feel much better, as well. How do you feel about being that close to wildlife?\nSpeaker B: Well I don't have a lot of experience with that but I guess I'd be ok as long as I knew what to do. Most of the wildlife I see is squirrels, pigeons, and the occasional possum. \nSpeaker A: We have plenty of those out here, as well, and you'll see them far more often than you'll see wolves. We will just have to take extra precautions at night and make sure we don't leave any food outside that might attract them.",
        "memory_text": "Speaker B is interested in visiting Alaska and mentions getting blackout curtains due to the midnight sun.\nSpeaker B found flights that work for their schedule and price and will be visiting Speaker A in a couple of weeks.\nSpeaker B is planning to visit Speaker A and is interested in going to a concert and outdoor activities like petting a wolf and going on a glacier tour.\nSpeaker A suggests going on hikes in Alaska to see wildlife and mentions glaciers as a potential attraction.\nSpeaker A mentioned the wildlife, including elk and wolves.\nSpeaker B is interested in going whale watching and asks about a wolf petting zoo.\nSpeaker A mentions the \"midnight sun\" phenomenon in Alaska where the sun does not set during the summer.\nSpeaker A mentioned making poached eggs for breakfast and taking sleds pulled by dogs.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a plan. I'll make sure to keep that in mind to stay safe. I'm excited to experience the wildlife in Alaska, especially with your guidance.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t1",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. ",
        "memory_text": "- Speaker A frequents live band venues and plays music at home. Speaker B is feeling a bit jealous of Speaker A's ability to go out and enjoy live music while they are at home with the pregnancy. Speaker A and Speaker B discuss the logistics of attending a festival with a small baby. \n- Speaker A does not live in Mexico but likes Mexican food and women. Speaker B is not going out drinking much due to their wife's pregnancy. Speaker B's wife is pregnant, so they are considering attending a local festival for just a day. Speaker B's wife is pregnant and has three more months to go until the due date. \n- Speaker B is a mechanic who enjoys working on cars. Speaker A and Speaker B enjoy bluegrass music.",
        "speaker": "Speaker B",
        "raw_prediction": "Hey, that sounds like a great idea! I'll check with my wife and let you know. Thanks for the offer.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t6",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.",
        "memory_text": "1. Speaker B is a mechanic who enjoys working on cars, while Speaker A frequents live band venues, plays music at home, and both enjoy bluegrass music.\n2. Speaker A owns a Subaru Legacy and mentions having a baby on the way, causing Speaker B to not go out drinking much due to their wife's pregnancy. As a result, Speaker B's wife is pregnant, so they are considering attending a local festival for just a day, which is a topic where Speaker A is not sure if they will ever settle down with a partner and have kids.\n3. Speaker A does not live in Mexico but likes Mexican food and women, which changed to enjoying going to bars and loving the ladies. Speaker B, on the other hand, dislikes public transportation and enjoys going to festivals but misses doing so.",
        "speaker": "Speaker A",
        "raw_prediction": "Thanks, I'll keep that in mind. Who knows, maybe I'll find someone who loves bluegrass music as much as I do.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "Speaker A finds cooking helpful for stress relief, while Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe.\nSpeaker A wakes up early in the morning to catch waves, while Speaker B likes to eat huge steaks after snowboarding.",
        "speaker": "Speaker A",
        "raw_prediction": "I recently tried making some spicy shrimp tacos with homemade salsa. They turned out pretty good!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t5",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? ",
        "memory_text": "Speaker B enjoys cooking for loved ones and values their grandmother's garlic chicken recipe. This always reminds Speaker B of the good old days. Speaker B's grandmother was the matriarch of the family, known for cooking large meals for family gatherings.",
        "speaker": "Speaker B",
        "raw_prediction": "I love Mexican food, especially street tacos! Barbacoa, chicken, and steak all sound delicious. I'm glad you enjoyed the food truck, we should definitely try it out together sometime.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.",
        "memory_text": "Speaker B has two terrier dogs as pets. Speaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one.\nSpeaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker A mentions having dogs and Speaker B admires them for their peaceful nature. Speaker B asks Speaker A if they have had a pet raccoon before.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, leaving my part-time job has been a nice change. It's good to have this time with my dogs before starting something new.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t8",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!",
        "memory_text": "Speaker B is looking for a new job and is excited about the opportunity at the zoo. Speaker B has elderly terriers and is planning to leave their part-time job for a break before starting a new one. \nSpeaker A works at a zoo and has tried playing music for the white tigers and home concerts for their pets. Speaker A works at a zoo and is willing to help Speaker B get an entry-level position there. \nSpeaker A has penguins at the zoo and enjoys working with animals, offering Speaker B a chance to help out. Speaker B is grateful for the opportunity and is looking forward to playing music for the animals, starting with something safer than the white tiger.",
        "speaker": "Speaker A",
        "raw_prediction": "Taking time off to spend with your dogs sounds like a great idea. I hope you find a job that you'll enjoy more.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.",
        "memory_text": "1. Speaker A enjoys going on camping trips and hiking trails in parks, and has planned several camping trips for the summer. She will also be doing a part of the Appalachian Trail for 10 days.\n2. Speaker A has a pet parrot named Tasha and works as a personal trainer leading hikes. This led to Speaker A becoming a personal trainer who loves camping in remote areas. Recently, Speaker B went on a long hike and enjoyed it.",
        "speaker": "Speaker B",
        "raw_prediction": "It's great that you're getting others out on the trails with you, even if they tire out quickly!",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t11",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.\nSpeaker B: I will someday. just not in the summer when all the bugs are out! Where do you go hiking the most?\nSpeaker A: I like to go hiking in the local trails here. I am familiar with them and there's so many routes that I can take. Sadly, the bugs are as bad here as they are anywhere else.....\nSpeaker B: They can't be that bad in the fall right? I hope? Do you camp most every weekend?\nSpeaker A: A least a couple of times a month. Sometimes, yeah, I go every weekend to relax. Being in nature is so relaxing to me. And nah the bugs aren't too bad in the fall and winter. There's a beautiful river along one trail that I bet you'd love to see. \nSpeaker B: That sounds like it would be relaxing. I would probable be okay if we didn't run into any wolves, bears etc. Have you ever came across any predators when you were camping?\nSpeaker A: Oh I've seen bears and even a mountain lion. Luckily, it was a far away encounter and they didn't know that we were there. As soon as I saw them we changed directions fairly quickly but quietly. Don't worry, I've only seen it a handful of times in my time camping.",
        "memory_text": "Speaker A enjoys going on camping trips and hiking trails in parks. This passion for outdoor activities has led Speaker A to plan several camping trips for the summer, including a part of the Appalachian Trail. Speaker A also leads shorter hikes for their camping group, but their upcoming Appalachian Trail hike will last for 10 days. Speaker A may even try a cruise in the future, but for now, they prefer the freedom and adventure of camping and hiking. Additionally, Speaker A enjoys searching for wild animals during their outdoor excursions, engaging in activities like birdwatching and spotting rare animals.",
        "speaker": "Speaker B",
        "raw_prediction": "Wow, that must have been quite the experience seeing those predators up close! I admire your bravery. I'll definitely have to join you on a hike sometime, but I hope we don't run into any wild animals like that!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t9",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.",
        "memory_text": "Speaker B creates horror movies with their dad, coming up with plot ideas through creative conversations. Speaker B's father was involved in producing horror movies, which influenced Speaker B's favorite genre. Speaker A has a passion for producing horror movies and believes everyone loves them.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear about your progress with interview practice. Remember to stay confident and showcase your strengths!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t5",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. ",
        "memory_text": "1. Speaker B is studying sports medicine in college and has been consistently receiving A's in the class, feeling pressured to maintain good grades to avoid embarrassing their mother who is in charge of the school.\n   \n2. Speaker B, who is pursuing sports medicine in college, shares a common struggle with Speaker A who finds history class boring. Speaker B is overwhelmed by their mother's strictness and looks forward to completing school to escape the pressure.\n\n3. Speaker A believes that sports can demonstrate equality among all individuals, while Speaker B, who is training in sports medicine, is under pressure to excel academically to avoid upsetting their mother who is in charge of the school.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great that you only have one more final left to go. You must be looking forward to finishing up the semester.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t6",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?",
        "memory_text": "Speaker B is studying sports medicine in college, which causes Speaker A to wish for better grades and hope for a soccer scholarship. Speaker A struggles to maintain good grades and excels only in gym class.\n\nSpeaker B, who is studying sports medicine in college, finds history class boring just like Speaker A. Both of them are dealing with the challenges of school. Speaker B, feeling overwhelmed by their mother's strictness, is eager to finish school to escape it.\n\nSpeaker B's dedication to studying sports medicine in college has resulted in getting all A's in the class. This success puts pressure on Speaker B to maintain straight A's to avoid embarrassing their mother, who happens to run the school.",
        "speaker": "Speaker A",
        "raw_prediction": "My next final is in math. I'm trying to study extra hard for it.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t3",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?",
        "memory_text": "Speaker B has suggested California as a destination for Speaker A's trip, and also mentioned trying surfing before but not being very good at it. Additionally, Speaker B expressed interest in visiting Greece for the history and Greek mythology. Speaker A, on the other hand, is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them. Furthermore, Speaker B enjoys Greek mythology and even did a case study on Poseidon, the God of the Sea, Earthquakes, and Horses.",
        "speaker": "Speaker B",
        "raw_prediction": "I'd love to go back to Italy someday, especially to explore more of the historical sites and architecture. Greece is also on my list, so maybe we'll swap travel stories soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t5",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!",
        "memory_text": "Speaker A is excited for their upcoming trip to Italy next Spring and has been saving up for it. They have friends in Europe who they have been in contact with to make plans. Speaker B, on the other hand, is interested in visiting Greece this year due to their passion for Greek mythology.",
        "speaker": "Speaker B",
        "raw_prediction": "That would be amazing if we could coordinate our trips to Greece and Italy! It would be fun to explore together.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t7",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.",
        "memory_text": "Speaker B has been to Italy in the past and enjoyed the food there, while Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries. \nSpeaker A is planning for a spring break trip and recently bought a dress for Easter, and Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker B enjoys Greek mythology and did a case study on Poseidon, the God of the Sea, Earthquakes, and Horses. \nSpeaker A is planning for a spring break trip and recently bought a dress for Easter, and Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker B appreciates the idea of superhuman powers and is interested in historical events that involve such figures.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great to hear about your plans and your natural hair color! I'm sure you'll enjoy Greece with its rich history and mythology. Maybe we can exchange some Greek mythology stories before your trip.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t10",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.\nSpeaker A: That's good advice! Thank you! I saw on the news Cali has been getting a lot of rain. Have you still been able to run on the beach each day?\nSpeaker B: I've got very wet most days unfortunately but need to keep up with the exercise.  Been taking to the gym to keep dry.  When im not out in the surf of a morning first thing on the weekends, to avoid the crowds as you know im not too good at the surfing but its good fun. ",
        "memory_text": "Speaker A is planning for a spring break trip and recently bought a dress for Easter. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker A is fascinated by the architecture of Italy and enjoys studying history, especially through reading and watching documentaries.\n\nSpeaker A is planning for a spring break trip and recently bought a dress for Easter. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.\n\nSpeaker B suggests California as a destination for Speaker A's trip. Speaker B has tried surfing before but is not very good at it. Speaker B does not have any trips planned but expresses interest in visiting Greece for the history and Greek mythology. Speaker A is planning to travel to Italy alone for Spring Break and has friends from Europe meeting up with them.",
        "speaker": "Speaker A",
        "raw_prediction": "Running on the beach sounds like a great workout! I'm sure the gym is a good alternative on rainy days. Surfing must be quite the experience, even if you're not a pro at it.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.",
        "memory_text": "Speaker B lives in a rural area with a farm and can relate to cooking. This allows Speaker B to easily understand the cooking process and ingredients. Speaker A bakes muffins and bread but is conscious of their impact on their weight, showing a consideration for healthy eating habits. Speaker A is interested in running a business with their cooking skills, indicating a potential entrepreneurial spirit. Speaker B is not a cook but is interested in learning about cooking with a pressure cooker, showing a willingness to explore new culinary techniques. \n\nSpeaker A is from the south of India and prefers warm summer weather, influencing their cooking preferences towards Indian cuisine and rice dishes. Speaker A primarily cooks Indian food and bakes a lot of rice dishes, showcasing their culinary expertise in these specific areas. Speaker A is a cook and enjoys using a pressure cooker for recipes like dahl, pilaf rice, and tandoori chicken, highlighting their diverse cooking skills and preferences.\n\nSpeaker B does not cook, but enjoys listening to country music and drives trucks for a living. This contrasts with Speaker B's husband, who is a skilled cook specializing in Asian cuisine with extensive prep work.",
        "speaker": "Speaker A",
        "raw_prediction": "I would love to join you on your haul next Wednesday. It sounds like a fun adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t4",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?",
        "memory_text": "Speaker B enjoys spending time with their siblings and going out on their houseboat. Speaker A is looking forward to having dinner with their brother before going dancing. Speaker A's brother is a fan of Brazilian food, especially steak.",
        "speaker": "Speaker A",
        "raw_prediction": "We had Brazilian steak and some delicious sides. It was a great movie night!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t5",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? ",
        "memory_text": "Speaker B enjoys taking their houseboat out and works as a bartender, while Speaker A plans to grab dinner with their brother before dancing. Speaker B prefers to keep holidays local with their brother instead of having big family gatherings.",
        "speaker": "Speaker B",
        "raw_prediction": "I love seafood, especially fresh fish. Steak and vegetables sound delicious too!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t11",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!\nSpeaker A: Yes, in fact I consider almost all foods to either be healing, harmful or neutral. In my opinion people should choose foods based on how they want to feel. Sushi is fresh and healthy so I considerate it to be very healing.\nSpeaker B: That is very wise thinking. Which vegetables do you feel are the best for healing? Are there any that should be avoided?\nSpeaker A: I feel that most leafy green vegetables are healthy, but it depends on the specific person's needs. For example some people need to avoid nightshades, like potatoes, etc. while other people can eat them without any problems. Overall, a diet with a variety of colors is good when it comes to vegetables",
        "memory_text": "Speaker B is interested in trying healing methods mentioned by Speaker A. Speaker B's sister joins them on the water and takes a nap in a hammock. Speaker B enjoys sailing during the summer for the best \"scenery\" and has a houseboat where they spend time with their family.\n\nSpeaker A recommends self-massage, essential oils, reiki, meditation, and self-awareness for healing. Speaker A finds being on the water therapeutic and relaxing. Speaker B goes sailing during the summer for the best \"scenery\" and enjoys sailing, spending time with family on a houseboat.\n\nSpeaker A is involved in healing work and mentions hot latina salsa. Speaker A and their brother enjoy going to a Brazilian steakhouse for dinner. Speaker B has one sibling, a little brother, who enjoys Brazilian food, specifically steak.",
        "speaker": "Speaker B",
        "raw_prediction": "That makes a lot of sense. I'll definitely keep that in mind when choosing my vegetables. Do you have a favorite leafy green vegetable that you find particularly healing or beneficial?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.",
        "memory_text": "Speaker B is an inventor working on a teleportation machine and a time machine. This has led Speaker B to focus on developing renewable energy sources for their inventions. Speaker A, on the other hand, is interested in nuclear energy and space exploration, mentioning fusion experiments, which causes Speaker A to struggle with gardening but find the idea of space plants intriguing.\n\nSpeaker B is an inventor working on a teleportation machine and a time machine, but now Speaker B is working on a teleportation machine that is currently small and requires substantial energy sources. Speaker B is also interested in space exploration and plant science, expressing concerns about the fuels used for space travel. Additionally, Speaker B is knowledgeable about plants and gardening, with a thriving garden.\n\nSpeaker B is an inventor working on a teleportation machine and a time machine, leading Speaker B to focus on developing renewable energy sources for their inventions. Speaker B mentions weight gain from spending time at the computer and plans to work in the garden more, which causes Speaker A to struggle with gardening but find the idea of space plants intriguing.",
        "speaker": "Speaker A",
        "raw_prediction": "Thank you for the advice on fertilizers! I'll definitely look into that for my indoor garden project.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t7",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?",
        "memory_text": "Speaker B is focused on developing renewable energy sources for their inventions. Speaker B mentions weight gain from spending time at the computer and plans to work in the garden more. Speaker B is knowledgeable about plants and gardening, with a thriving garden.",
        "speaker": "Speaker B",
        "raw_prediction": "Plum trees can live up to 20-30 years, depending on the care and environment provided. It's a long-term commitment, but definitely worth it if you're up for the challenge!",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "Speaker B is knowledgeable about plants and gardening, with a thriving garden. Speaker B is working on a teleportation machine that is currently small and requires substantial energy sources. Speaker B mentions the Chinese advancements in thermal nuclear generators and the need for a Manhattan Project for alternative energy. Speaker B is also interested in space exploration and plant science, expressing concerns about the fuels used for space travel. ",
        "speaker": "Speaker A",
        "raw_prediction": "I'm managing school alright, but now with this garden project, it feels like I'll have a whole new responsibility on my hands!",
        "previous_summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker A's parents are teachers.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden."
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?",
        "memory_text": "Speaker A enjoys art and music, specifically painting. Speaker A is working on painting projects in their craft room. Speaker A is interested in trying to make a lotus origami next. Speaker A learned origami by themselves in their craft room.\n\nSpeaker B enjoys running and singing. Speaker B enjoys traveling and visiting gardens. Speaker A is interested in trying to make a lotus origami next. Speaker A enjoys origami and tried making a Lotus flower successfully.\n\nSpeaker A enjoys art and music, specifically painting. Speaker B enjoys traveling and visiting gardens. Speaker B was recommended volunteering by Speaker A and has traveled to Japan and Italy, enjoying the art and food. Speaker A offered to teach Speaker B origami in a few weeks.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, practice definitely helps improve your skills in origami. It's all about getting the folds just right!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t1",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!",
        "memory_text": "Speaker A has a strong connection to jello, particularly cherry flavor, due to their grandma making it at family dinners. Speaker A has a grandmother who teaches them various jello recipes. \nSpeaker A learned how to make jello from their grandma, turning it into a family tradition. Speaker A suggests that Speaker B can consider their grandmother as a surrogate grandma for learning jello recipes. \nSpeaker A has two moms who are not meat eaters. Speaker A learned how to make jello from their grandma, turning it into a family tradition. Speaker A suggests that Speaker B can consider their grandmother as a surrogate grandma for learning jello recipes.",
        "speaker": "Speaker B",
        "raw_prediction": "That's such a wonderful tradition to pass on to your kids! Family recipes are so special.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t7",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!",
        "memory_text": "Speaker A has a strong connection to jello, particularly cherry flavor, due to their grandma making it at family dinners. Speaker A suggests that Speaker B can consider their grandmother as a surrogate grandma for learning jello recipes.",
        "speaker": "Speaker B",
        "raw_prediction": "Water skiing sounds like a blast! I bet it was a great way to enjoy the weekend.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t3",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?",
        "memory_text": "- Speaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop. As a result, Speaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\n- Speaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. Consequently, Speaker A and Speaker B plan to play games together, with Speaker A trying out Resident Evil.\n- Speaker A prefers tamer video games and is not a fan of horror movies. This leads to Speaker A being hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World. In response, Speaker B mentions that Resident Evil can be scary and provides some tips for playing it.",
        "speaker": "Speaker B",
        "raw_prediction": "How about trying out a game like Stardew Valley or Minecraft? They're more relaxed and less intense compared to Resident Evil.",
        "previous_summary": "Speaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop.\nSpeaker A does not play video games often but may consider trying them.\nSpeaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\nSpeaker A prefers tamer video games and is not a fan of horror movies.\nSpeaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\nSpeaker A and Speaker B both enjoy playing video games in their free time.\nSpeaker B is interested in trying the Jurassic Park game.\nSpeaker A enjoys playing the Jurassic Park game but mentions its lack of multiplayer and outdated graphics.\nSpeaker A and Speaker B plan to meet next week Friday at 6 pm to play games and order pizza."
    },
    {
        "utter_id": "e34-s5-t7",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.",
        "memory_text": "Speaker A and Speaker B enjoy visiting the zoo, with Speaker A preferring exotic birds and enjoying seeing pandas and penguins, while Speaker B's girlfriend also enjoys pandas and penguins and they visit the zoo regularly. Speaker B is considering adopting a kitten from a friend, and Speaker A prefers cockatoos over kittens as pets.",
        "speaker": "Speaker B",
        "raw_prediction": "You should definitely plan a trip to the zoo soon. It's always a fun day out!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t10",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.\nSpeaker B: Oh, that's a good point. Maybe keep her away from the small rodent house and reptiles, eh?",
        "memory_text": "Speaker A enjoys gardening and reading, while Speaker B enjoys visiting the zoo, especially to see pandas and penguins. Speaker A decides to go to the zoo with their sister, who is a dog person with a yellow lab. Speaker B's girlfriend, who loves pandas and penguins, has a noisy cockatoo and they visit the zoo regularly. Speaker B is open to being a cool uncle to his sister's future children but does not want kids of his own.",
        "speaker": "Speaker A",
        "raw_prediction": "Yeah, that's probably a good idea. I'll suggest that to her. Thanks for the tip!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t6",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL",
        "memory_text": "Speaker A has a total of 5 tattoos and enjoys getting them, with one dedicated to their late father. They plan to get a portrait of their father's face next to a slogan already tattooed on their chest. Speaker A's favorite tattoo is the one dedicated to their late father, with the phrase \"for you I shall live\". They are working at a coffee shop to save up for their next tattoo.",
        "speaker": "Speaker A",
        "raw_prediction": "Upper arm or upper back are great choices for a first tattoo, not too painful. And getting permission from your wife is always a good idea!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t10",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?",
        "memory_text": "Speaker A works at a coffee shop that their mom owned, which is why they plan to get a portrait of their father's face next to a slogan they already have tattooed on their chest.\nSpeaker A enjoys getting tattoos and has 5 so far, with one dedicated to their late father, and is saving up for their next tattoo at the coffee shop.\nSpeaker A's favorite tattoo is the one dedicated to their late father, saying \"for you I shall live\", and they plan to get a portrait of their father's face next to a slogan they already have tattooed on their chest.",
        "speaker": "Speaker A",
        "raw_prediction": "I've been working on a mural project in the city, combining different art styles. It's been a great way to express myself creatively.",
        "previous_summary": "Speaker A loves the show Friends and enjoys visiting graffiti-filled places.\nSpeaker A and Speaker B have a conversation about their personal interests and trips they have taken for work."
    },
    {
        "utter_id": "e36-s5-t1",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. ",
        "memory_text": "Speaker A's interest in animals, specifically raccoons and bearded dragons, was sparked by their work in software solutions for tech companies, which they find less exciting than being a zoo keeper. They are currently dealing with a raccoon problem and plan to buy aluminum sheeting to cover up holes. Additionally, Speaker B has been taking care of a raccoon for over a month and is interested in training it.",
        "speaker": "Speaker B",
        "raw_prediction": "I'm curious to hear how the installation goes and if it helps with your raccoon problem. Good luck!",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. ",
        "memory_text": "Speaker A fosters dogs till they find a forever home. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B wants to train the raccoon and has been taking care of it for over a month. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.\n\nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker A admires raccoons but has not interacted closely with them. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather.\n\nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B owns a raccoon named Bandicoot and a bearded dragon named Bob.",
        "speaker": "Speaker B",
        "raw_prediction": "I completely understand your concern. It's important to keep a safe distance from wild animals, especially if they could potentially cause harm or carry diseases.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t6",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.",
        "memory_text": "Speaker A is interested in animals, specifically raccoons and bearded dragons. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.\nSpeaker B works as a zoo keeper and enjoys it. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather.\nSpeaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B has been taking care of the raccoon for over a month and is interested in training it.",
        "speaker": "Speaker A",
        "raw_prediction": "Wow, Bandicoot sounds like quite the troublemaker! I hope he doesn't unlock anything that he shouldn't.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t7",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.",
        "memory_text": "Speaker A is interested in animals, specifically raccoons and bearded dragons. Speaker B has been taking care of the raccoon for over a month and is interested in training it. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes. \nSpeaker B considers raccoons intelligent and funny. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather. \nSpeaker A fosters dogs till they find a forever home. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B has a dog named Bandicoot and is willing to bring him over for extra company.",
        "speaker": "Speaker B",
        "raw_prediction": "I do keep everything locked up for safety. Bandicoot usually stays in a secured carrier while we're driving to avoid any distractions. It's important to keep both of us safe on the road.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "Speaker A is interested in animals, specifically raccoons and bearded dragons. Speaker B believes raccoons can make good pets if cared for properly. Speaker B's garbage has a lock to prevent animals from getting into it, especially during windy weather. \nSpeaker A works in software solutions for tech companies and finds it less exciting than being a zoo keeper. Speaker B works at a Raccoon Cafe and takes care of Bandicoot, a raccoon. Speaker B has been taking care of the raccoon for over a month and is interested in training it. Speaker A is dealing with a raccoon problem and plans to buy aluminum sheeting to cover up holes.",
        "speaker": "Speaker A",
        "raw_prediction": "I've thought about adopting a dog, but my work keeps me pretty busy. Maybe someday when things calm down a bit.",
        "previous_summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker A fosters dogs and is used to them coming and going."
    },
    {
        "utter_id": "e37-s5-t2",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? ",
        "memory_text": "1. Speaker A feels exhausted after looking after their lively grandchildren, who are now capable of keeping themselves entertained with technology or TV. Speaker A also suggests taking naps during quiet moments and mentions spending time with her grandchildren.\n2. Speaker A feels worn out after spending time with their energetic grandchildren, who have watched Toy Story multiple times.\n3. Speaker A, who has 8 grandchildren and likes reading books and watching Netflix, now has grandchildren who are old enough to entertain themselves with technology or TV. Speaker A also enjoys watching movies with her grandchildren and mentions watching them.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, it was a thrilling mystery novel. It's nice to have some quiet time to myself for a change.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t5",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?",
        "memory_text": "Speaker A feels exhausted after looking after their energetic grandchildren. This leads Speaker A to suggest taking naps during quiet times and mentions the idea of watching her grandkids. Speaker B, who is a parent to a young son keeping them busy, considers volunteering at an animal shelter once her son begins school. Additionally, Speaker A, with 8 grandchildren, enjoys reading books and watching Netflix, while Speaker B's wife expresses a liking for Ken Jennings as a potential host for Jeopardy.",
        "speaker": "Speaker B",
        "raw_prediction": "I prefer books that are a bit more light-hearted and uplifting, like a good comedy or a heartwarming story.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?",
        "memory_text": "Speaker B's fascination with animals allows them to understand Speaker A's comparison of their grandchildren to animals. This is because Speaker A's grandchildren are old enough to entertain themselves with technology or watching TV. Additionally, Speaker A enjoys watching movies with their grandchildren. Speaker B, on the other hand, has a young son and finds solace in reading books, especially those about animals. This interest in animals is shared with Speaker A, who mentions watching movies with their grandchildren.",
        "speaker": "Speaker A",
        "raw_prediction": "Actually, yes! There's a movie adaptation of the book I'm reading. It's quite thrilling!",
        "previous_summary": "Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.\nSpeaker B has a son and enjoys reading books, particularly about animals.\nSpeaker A watches Netflix shows rated over 3.5 stars after running out of things to watch."
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.",
        "memory_text": "Speaker A enjoys reading books and watching Netflix, while Speaker B has a son and prefers reading books about animals. Speaker B is preparing to purchase school supplies for their son as he is about to start school soon.",
        "speaker": "Speaker B",
        "raw_prediction": "That's exciting! Maybe once it's on Netflix, I'll give it a watch too.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t9",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.\nSpeaker B: Well if it's any good I know you'll be watching the whole thing.\nSpeaker A: you know it.  And I know that you would just fall asleep during it whether it's any good or not.",
        "memory_text": "1. Speaker A's energetic grandchildren have grown old enough to entertain themselves with technology or TV, allowing Speaker A to suggest taking naps during quiet times and mentioning watching her grandkids.\n2. After running out of things to watch, Speaker A, tired from spending time with their energetic grandchildren, turns to Netflix shows rated over 3.5 stars.\n3. Speaker A, with 8 grandchildren, finds solace in reading books and watching Netflix, suggesting taking naps during quiet times and mentioning watching her grandkids.",
        "speaker": "Speaker B",
        "raw_prediction": "Fair point, I do tend to doze off during movies. But hey, at least I'm well-rested!",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?",
        "memory_text": "1. Speaker B loves dogs which is a reason Speaker A has a kitten from their cat and enjoys taking them on trips. Speaker A has a Subaru and a cat named Ginger, considering naming a new kitten Marmalade.\n2. Speaker A drives a Mini Cooper and recently visited a hair salon, leading to Speaker A having a kitten from their cat and enjoying taking them on trips. Speaker B is excited for the trip and looking forward to trying the best iced tea.\n3. Speaker A has a cat that recently had a kitten, prompting Speaker A to have a kitten from their cat and enjoy taking them on trips instead of leaving their cats with a friend while traveling. Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels.",
        "speaker": "Speaker A",
        "raw_prediction": "They're doing great! Pumpkin is full of energy and Ginger is adjusting well to being a new mom. It's been quite the adventure having them around.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?",
        "memory_text": "- Speaker A recently visited a hair salon and now has a kitten from their cat, enjoying taking them on trips. Speaker A used to leave their cats with a friend while traveling, but now they bring the kitten along.\n- Speaker B loves dogs, yet Speaker A and Speaker B have a light-hearted and humorous conversation about their pets and travels. Speaker A used to leave their cats with a friend while traveling, but now they bring the kitten along.\n- Speaker A has a cat that recently had a kitten and mentions having a Mini car, smaller compared to Speaker B's Subaru. Speaker A changed from having a Subaru and a cat named Ginger to considering naming a new kitten Marmalade.",
        "speaker": "Speaker A",
        "raw_prediction": "The weather is perfect for iced tea, not too hot or too cold. I might just enjoy a glass with Pumpkin lounging by my side.",
        "previous_summary": "Speaker A is from a city known for great iced teas and prefers unsweetened iced tea.\nSpeaker A enjoys drinking tea and water.\nSpeaker A lives on the Moon, where it is cold with very little traffic."
    },
    {
        "utter_id": "e39-s5-t7",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? \nSpeaker B: I'll be living off campus, so absolutely. How about you? Are you staying in the dorms?\nSpeaker A: I'm glad your taking them with you. My mum wants me to stay in dorms. But I think I just want my own place, less drama and more freedom that way.",
        "memory_text": "Speaker A is a student planning to go to college next year and wants to study neuroscience. Speaker B mentions studying Neuroscience classes next year, hinting at being a student. Speaker A plans to work with humans in neuroscience to help cure neurological diseases. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies. \nSpeaker A is working on becoming an Eagle Scout and volunteers at a research lab. Speaker B mentions studying Neuroscience classes next year, hinting at being a student. Speaker B is excited about taking neuroscience classes next year. Speaker B's classes related to neuroscience will start next year. \nSpeaker B recently divorced their wife and loves to scuba dive in Hawaii when not working. Speaker B has two pet snakes named Hansel and Gretel. Speaker A finds it amusing that Speaker B prefers animals to humans. Speaker A is currently volunteering at a lab and plans to compare humans and animals once Speaker B finishes their studies.",
        "speaker": "Speaker B",
        "raw_prediction": "Living off campus does sound like a great way to have your own space. Plus, you can have your snakes with you!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t3",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?",
        "memory_text": "Speaker B has been involved with Boy Scouts for 7-8 years, currently a Life Scout. This involvement has led Speaker A to appreciate Speaker B's dedication and invites them to a youth retreat. Speaker B wants to earn the Eagle Scout badge for college applications.\nSpeaker B is busy with scouts, school, work, and tennis, but is willing to take vacation days for the retreat. Additionally, Speaker B is considering attending a local community college for the first couple of years.",
        "speaker": "Speaker B",
        "raw_prediction": "My favorite part about camping is being able to disconnect from the busyness of everyday life and just enjoy nature.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t4",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.",
        "memory_text": "Speaker B's involvement with the scout troop and work at a fast food place causes Speaker A to appreciate it and invite them to a youth retreat. This leads Speaker B, who has been in Boy Scouts for 7-8 years and is currently a Life Scout, to consider attending the retreat. On the other hand, Speaker A's church activities and mention of a church retreat prompt Speaker B, who is busy with scouts, school, work, and tennis, to be willing to take vacation days for the retreat. This also leads Speaker B to contemplate attending a local community college for the first couple of years.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds so peaceful and grounding. I can see why you enjoy it so much. Do you have any memorable camping stories you could share?",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t5",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. ",
        "memory_text": "Speaker A is a college student who teaches jiu-jitsu and is lactose intolerant. They are enrolled in a class on the history of martial arts and are majoring in athletic training. Speaker A is taking a history of martial arts class and enjoys it. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts. \nSpeaker A is a college student who teaches jiu-jitsu and is lactose intolerant. They are taking a history of martial arts class and enjoy it. Both Speaker A and Speaker B are interested in martial arts and enjoy learning new things. \nSpeaker A is planning to take summer courses soon and is very active, enjoying martial arts. They are enrolled in a class on the history of martial arts and are majoring in athletic training. Speaker A is taking a history of martial arts class and enjoys it. Speaker B is involved in software work and recently signed up for an online class about the history of martial arts.",
        "speaker": "Speaker B",
        "raw_prediction": "That's great that you got to experience a different style of martial arts as a student today. How was the taekwondo class compared to your usual jiu-jitsu sessions?",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t2",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.",
        "memory_text": "Speaker B is looking for furniture shop to buy furniture, has two dogs, and works near a mall. Speaker A and Speaker B are discussing furniture and home decor choices. This causes Speaker A and Speaker B to plan to meet up to discuss the furniture exchange. Speaker A has devices to keep bugs away and offers to share the product names with Speaker B.\n\nSpeaker A's favorite season is winter and enjoys the country lifestyle. Speaker B plans to grill steaks this weekend and prefers using an old charcoal grill over a gas one. This makes Speaker A look forward to spending quiet evenings outside during the summer, possibly grilling most nights.\n\nSpeaker A and Speaker B both enjoy barbecuing and have a love for pets. They are discussing furniture and home decor choices, leading to a plan to meet up to discuss the furniture exchange. Speaker A invites Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.",
        "speaker": "Speaker A",
        "raw_prediction": "I'd be happy to help you choose a color scheme! And don't worry, I'll bring along that bug spray to keep those mosquitoes away during our outdoor barbecue.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t5",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? ",
        "memory_text": "Speaker B is in the process of renovating their house to meet their living standards with their pets. This includes recently purchasing purple sofas for their home and considering adding more colorful elements to the room to make the purple sofas work. Speaker A is looking to redecorate their house and likes purple furniture, having recently bought new furniture for their house, including a couch, recliner, and patio furniture. They both enjoy barbecuing and have a love for pets, leading to them discussing furniture and home decor choices. This has caused Speaker A and Speaker B to plan to meet up to discuss the furniture exchange, with Speaker A offering devices to keep bugs away and sharing the product names with Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": "I was thinking of getting a nice outdoor dining set with some comfortable chairs. Thanks for the tip about Ikea, I'll check out their patio furniture selection.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t11",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.\nSpeaker A: Of course! I love Miranda Lambert, any specific song requests? \nSpeaker B: Nothing specific I love all her songs, I think I'm going get off here so I can try to order that gazebo.\nSpeaker A: Good luck finding a gazebo!",
        "memory_text": "Speaker A and Speaker B are both discussing furniture and home decor choices, which leads to them planning to meet up to discuss the furniture exchange. This results in Speaker A inviting Speaker B over to enjoy the new furniture and suggests a night with music, food, and company.",
        "speaker": "Speaker B",
        "raw_prediction": "Thanks! I'll let you know how it goes with the gazebo. Looking forward to the barbecue and your guitar tunes!",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t4",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?",
        "memory_text": "Speaker A and Speaker B both enjoy reading and are librarians. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian. Speaker B is planning a trip to Greece in the next three months with a family of five. Speaker B recommends visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece.\n\nSpeaker B has three kids. Speaker A has kids and is familiar with Greek mythology. Speaker B is planning a trip to Greece in the next three months with a family of five. Speaker B and their kids are excited about their upcoming trip to Greece.\n\nSpeaker B enjoys being outside and reading Star Wars novels. Speaker B is excited about visiting Greece for the first time and loves Athena, considering her a perfect goddess for a librarian. Speaker B is planning a trip to Greece in the next three months with a family of five. Speaker B recommends visiting the Parthenon, Acropolis of Athens, and the beach on Corfu Island in Greece.",
        "speaker": "Speaker A",
        "raw_prediction": "No, I haven't taken a cruise before, but it sounds like a fantastic way to explore the Greek Islands. I'll have to consider it for a future trip.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t3",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol",
        "memory_text": "Speaker A wants to seek advice on how to recover from marathon training, so Speaker B, who has run a marathon before, offers guidance. Speaker A then invites Speaker B to train together for the Alps marathon. \nSpeaker B, a motivational speaker who travels to give pep talks, joked about combining fishing with feeling depressed. \nSpeaker A, who sprained their ankle while training for marathons, now has a healing ankle injury.",
        "speaker": "Speaker B",
        "raw_prediction": "Don't worry, I'll bring the heat and get you back on track!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t7",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol",
        "memory_text": "Speaker B enjoys fishing and the outdoors, while Speaker B has run a marathon before and found it tough but rewarding. Speaker A is training for marathons and seeking advice on how to recover, and Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600. \nSpeaker A dislikes traveling but has visited 20 countries, and Speaker A is working on improving their mile time and training for a marathon, which causes Speaker A to seek advice on recovery. Speaker A invited Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600. \nSpeaker A dislikes traveling but has visited 20 countries, and Speaker B has run a marathon before and found it tough but rewarding. Speaker A is training for marathons and seeking advice on how to recover, while Speaker B is considering running a marathon and mentioned fishing and feeling depressed.",
        "speaker": "Speaker B",
        "raw_prediction": "Nope, no turning back now! You're in this for the long run, pun intended. You won't regret it!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t10",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol\nSpeaker B: Yes. We have an iron-clad written agreement. Tell me how I'm doing so far. Is this the most motivated you've ever been in your entire life?\nSpeaker A: No, but that's why I have you.  You're going to push me to do the things I can't bring myself to do.  I'll have more motivation tomorrow.  Today was a long work day.lol\nSpeaker B: I'm going to try a new motivational technique with you. Would you be more frightened by a spider or a snake. I need to know before we meet up this weekend.",
        "memory_text": "1. Speaker A, a runner who has visited 20 countries, is now training for marathons and seeking advice on how to recover, which caused Speaker A to invite Speaker B to run together and train for the Alps marathon, offering motivation and meeting at the beach at 0600.\n\n2. Speaker A, a runner who has visited 20 countries, is now training for marathons and seeking advice on how to recover, which is a similar topic to Speaker B being a motivational speaker who travels to schools and conferences to give pep talks, and Speaker B joked about combining fishing with feeling depressed, and mentioned taking young boys to the pond during school hours.\n\n3. Speaker B, from San Francisco, who enjoys fishing and the outdoors, has run a marathon before and found it tough but rewarding, and wants Speaker A, who is training for marathons and seeking advice on how to recover, to combine something more active with feeling depressed to avoid dwelling on negative thoughts.",
        "speaker": "Speaker A",
        "raw_prediction": "Definitely a snake! Spiders don't bother me as much. Looking forward to our weekend training session!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t2",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?",
        "memory_text": "Speaker A, a recent high school graduate on a cross-country journey looking for jobs, wants to potentially visit the Columbia Trail and Ken Lockwood Gorge for a camping and hiking trip. In addition, Speaker A plans to leave a hammock by the river for anyone to use at a hidden spot off the main hiking trail. This plan changed as Speaker A now has a portable hammock for the hike and asks if Speaker B will bring theirs.\n\nSpeaker B, who does not vote, wants their neighbor John to know about their stance on group equality. This desire is caused by the fact that Speaker B's neighbor, John, is getting divorced and selling top-of-the-line camping gear. Additionally, Speaker B's friend worked at the same store and enjoyed the people there.",
        "speaker": "Speaker A",
        "raw_prediction": "I applied for a cashier position at the grocery store. It's a start, but I'm hoping to save up for more hiking and camping gear for future trips.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me",
        "memory_text": "Speaker A, who was born and raised as a preacher's kid in the country and worked on a produce farm, mentions that Speaker B's kids could try milking cows on the farm, which Speaker B finds amusing. They then discuss different strategies for playing the lotto and the potential outcomes if they win.\n\nSpeaker A and Speaker B have a friendly interaction and part ways on a positive note after both buying lotto tickets for a big jackpot.\n\nSpeaker A, who was born and raised as a preacher's kid in the country and worked on a produce farm, expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm. Speaker B is open to moving to the country to be further away from neighbors and buys 20 lotto tickets with the same numbers, aiming to get a bigger share of the jackpot if they win.",
        "speaker": "Speaker B",
        "raw_prediction": "I can understand that. I actually prefer the peace and quiet of the countryside myself.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t9",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though",
        "memory_text": "Speaker A, who was born and raised as a preacher's kid in the country and worked on a produce farm, suggests that Speaker B and their family could stay over at the farm after the concert. They discuss different strategies for playing the lotto and the potential outcomes if they win.\n\nAfter a friendly interaction, Speaker A and Speaker B part ways on a positive note, having both bought lotto tickets for a big jackpot.\n\nSpeaker A, who has never been to college and values the peaceful life of working on the farm, reacts as Speaker B expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm. Both speakers dream of having a city and country house or a summer and winter home.",
        "speaker": "Speaker B",
        "raw_prediction": "It sounds like the best of both worlds, being able to enjoy the city life and the peacefulness of the countryside.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t11",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though\nSpeaker B: Yeah I understand that. Have you listened to any new blues songs lately?\nSpeaker A: I've started a playlist but haven't had time yet. Any recommendations for female blues performers?",
        "memory_text": "Speaker A and Speaker B have a friendly interaction and part ways on a positive note. Speaker A suggests that Speaker B and their family could stay over at the farm after the concert, as they both dream of having a city and country house or a summer and winter home. Speaker A and Speaker B discuss different strategies for playing the lotto and the potential outcomes if they win, as they both bought lotto tickets for a big jackpot. \n\nSpeaker A has never been to college and values the peaceful life of working on the farm. Speaker B expresses interest in potentially moving out of the city and enjoying a more peaceful life on the farm, as they both dream of having a city and country house or a summer and winter home.",
        "speaker": "Speaker B",
        "raw_prediction": "How about checking out artists like Etta James or Koko Taylor? They have some amazing blues songs that you might enjoy.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t2",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?",
        "memory_text": "Speaker A loves spending time with his sons, who have been out of town for a while and are leaving again in a few months. His boys will be coming for winter break from Europe. Speaker A's younger son would be jealous of Speaker B's sons' European tour, as the youngest one is addicted to social media and video games. Speaker A's sons play video games and listen to music in their rooms. Additionally, Speaker A has two sons who have been studying abroad in Spain and are going to Italy next. At least one of Speaker A's sons is in a relationship with a Spanish girlfriend, while the other is secretive and possibly gay.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I can't wait to see them during winter break!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "Speaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend. Speaker A has two sons, one of whom has a girlfriend and the other is secretive and possibly gay. Speaker A has two sons who have been studying abroad in Spain and are going to Italy next. Speaker A's sons will be coming for winter break from Europe. Speaker B's younger son would be jealous of Speaker A's sons' European tour. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "Yes, I've heard a lot about her. I hope we'll get along well when I finally meet her.",
        "previous_summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker A's sons will be coming for winter break from Europe."
    },
    {
        "utter_id": "e47-s5-t10",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?\nSpeaker A: I'm planning to stay in Spain for three weeks.  Since you live in Portugal, I'd love to stop by for a visit if you're free this coming month.  I've always wanted to visit Lisbon.  It has the world's longest bridge!\nSpeaker B: That'a great idea. We have a holiday house just outside of Lisbon. You are welcome to lodge with us.\nSpeaker A: Sounds great!  I'm already very excited about my trip to Spain, and now I get to visit you in Lisbon!  I need to brush up on my Spanish and also start studying Portuguese.\nSpeaker B: Haha, you've got your hands full then. Portuguese would be easier I believe. Spanish is a bit harder because it is spoken quicker. Would you be travelling with any company?",
        "memory_text": "Speaker A has two sons who have been studying abroad in Spain and are going to Italy next. Speaker A's sons will be coming for winter break from Europe.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend. Speaker B has two sons, one of whom has had a girlfriend for several years and the other is secretive. \nSpeaker B's younger son would be jealous of Speaker A's sons' European tour. Speaker B's sons would possibly get along well with Speaker A's sons.",
        "speaker": "Speaker A",
        "raw_prediction": "I'll be traveling alone to Spain, but it would be nice to have some company when I visit you in Portugal.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t4",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?",
        "memory_text": "Speaker B drove over 1000 miles to see their favorite band, Three Dog Night. Speaker B enjoys living in the city for the accessibility to food and live music. Speaker A enjoys going to museums and trying different foods. Speaker A and their boyfriend also look forward to having some refreshing beers by the beach.\n\nSpeaker B drove over 1000 miles to see their favorite band, Three Dog Night. Speaker B enjoys living in the city for the accessibility to food and live music. Speaker A is interested in music concerts and planning a trip to Sao Paulo. Speaker A plans to do lots of shopping during their trip.\n\nSpeaker A loves Disney music. Speaker B enjoys living in the city for the accessibility to food and live music. Speaker B recommends visiting the Museum of Art of São Paulo in the city. Speaker A is planning to visit the Museum of Art of São Paulo next week with their boyfriend.",
        "speaker": "Speaker A",
        "raw_prediction": "No, I haven't seen the fireworks at the Disney castle, but it sounds magical. I hope to experience it someday.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t5",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?",
        "memory_text": "- Speaker A enjoys going to museums and trying different foods. This leads to Speaker A planning to do lots of shopping during their trip.\n- Speaker B has 2 older and 1 younger brother, and their father used to be a farmer. Speaker B was born in Brazil, specifically in San Paulo. Speaker A is interested in music concerts and planning a trip to Sao Paulo. Speaker A plans to do lots of shopping during their trip.",
        "speaker": "Speaker B",
        "raw_prediction": "Yes, I've been to Disneyland too. It's a magical place, especially with the fireworks show. Have you ever been on a hot air balloon ride?",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t6",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?",
        "memory_text": "Speaker B drove over 1000 miles to see their favorite band, Three Dog Night. This causes Speaker B to enjoy living in the city for the accessibility to food and live music, which is the same topic Speaker A enjoys, along with going to museums and trying different foods. This leads Speaker A to plan a visit to the Museum of Art of São Paulo next week with their boyfriend.\nSpeaker B has 2 older and 1 younger brother, and their father used to be a farmer, and was born in Brazil, specifically in San Paulo. This same topic is of interest to Speaker A, who is planning a trip to Sao Paulo and is interested in music concerts, leading to a visit to the Museum of Art of São Paulo next week with their boyfriend.\nSpeaker A loves Disney music, which is the same topic Speaker B enjoys, along with living in the city for the accessibility to food and live music. This makes Speaker A want to attend music concerts and plan a trip to Sao Paulo, eventually leading to a visit to the Museum of Art of São Paulo next week with their boyfriend.",
        "speaker": "Speaker A",
        "raw_prediction": "I did get to see some live Disney music performances at Disney World. It was so magical! Do you have a favorite Disney song?",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!",
        "memory_text": "Speaker A loves animals, especially puppies, and visits shelters in every city they go to. Speaker B is interested in volunteering and prefers cats over dogs, especially kittens.",
        "speaker": "Speaker B",
        "raw_prediction": "I guess that's true, puppies do have that adorable and energetic charm about them.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t9",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?\nSpeaker A: I prefer chicken to beef. I pair it with beef fajitas andI think it's great to have with a glass of merlot. Do you like wine?\nSpeaker B: You're making me hungry!  Yes, I do love wine.  As a matter of fact, I used to live in the Bordeaux region in France, so my favorite wine is Bordeaux wine.  But I also love champagne and cognac.\nSpeaker A: Haha, I know right? I lived in the Champagne region for a bit! Always wanted to go to Bordeaux. How was it there?",
        "memory_text": "Speaker A enjoys cooking, especially making fajitas, and also volunteers at animal shelters. Speaker B is interested in trying different careers and is considering becoming a chef for Speaker A who loves Mexican food and seafood. Speaker A and Speaker B are excited about the idea of traveling the world and trying different cuisines.",
        "speaker": "Speaker B",
        "raw_prediction": "Bordeaux was amazing, so many beautiful vineyards and the wine is just exquisite. It's definitely worth a visit!",
        "previous_summary": null
    }
]