[
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?\nSpeaker A: No, I have never been to Costa Rica, but it sounds like it will be very educational as well as relaxing. I have been to Canada a few times and also Mexico. How long do you plan to stay?\nSpeaker B: I will be there for 2 weeks. I am really looking forward to both relaxing and learning about the culture! How are you? Have you read any good books lately?\nSpeaker A: I enjoy historical fiction as well as nonfiction. I really enjoy learning about early American history. I enjoyed reading \"The Gettysburg Campaign\"'\nSpeaker B: That sounds interesting. What is it about? I'm not really into history.",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " Oh, \"The Gettysburg Campaign\" is actually a historical fiction novel set during the Civil War. It's filled with battles, strategy, and personal stories of soldiers. But if history isn't your thing, maybe you'd enjoy a book about hair colors and styles instead! Have you ever thought about trying out a new hair color like grey or turquoise?",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so kind of you to offer swimming lessons! I'm really excited to learn from you. And I can't wait to enjoy the punk music and programming studies with you this weekend. It's going to be a great time!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t1",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm definitely excited to see the outcome of the cloning project in the lab! It's amazing how far science has come. I'll have to make sure to celebrate with a burger after a run while listening to some music, it really helps me relax after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t8",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.\nSpeaker B: That's good that you keep an open mind! The cloning process is actually relatively simple, and happens in nature already! Did you know bananas, avocados, and some bees clone themselves? The only difference is, we do this in a lab!\nSpeaker A: Oh! I did not know that. Well if you can clone cows that's more ice cream for you! Haha. What's your favorite ice cream flavor?\nSpeaker B: Yes, more ice cream is always good, haha! I like a good rocky road, or pretty much any chocolate ice cream with nuts or stir-ins! I like most of Jeni's brand too. How about you? What is your favorite kind?",
        "memory_text": "User Description:\nSpeaker B is a hardworking student ahead of college, working at a diner cooking hamburgers. They are interested in neuroscience, have a deaf dog named Sparky, and are planning to major in molecular biology. Speaker B is known for inventing a chili dog casserole and may take summer classes to get a head start on college.\n\nRelationship Description:\nSpeaker A and Speaker B share a close bond, discussing their love for dogs and food. Speaker A compliments Speaker B on being a great dog owner and offers to walk Sparky. They also plan to try Speaker B's famous hamburgers at the diner.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing their dogs, sharing dinner choices, and talking about future plans. Speaker B invents a chili dog casserole and plans to clone a jersey cow. Speaker A recommends taking summer classes to get ahead in college.",
        "speaker": "Speaker A",
        "raw_prediction": " I love that you're so interested in molecular biology. It must be fascinating to work in a lab and clone a cow! And I can't wait to try your famous chili dog casserole. Maybe you can teach me how to make it sometime!",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t1",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.",
        "memory_text": "User Description: Speaker A is a scientist who is considering taking a second part-time job to save money for a trip to Sweden to visit their cousin. They enjoy decompressing and being active in their free time. \n\nRelationship Description: Speaker A has been talking to their cousin in Sweden and needs to start saving money to visit. Speaker B's parents live in Sweden, and their job at the hospital offers flexible hours. \n\nEvent Description: Speaker A likes to check out local music and coffee shops for conversations. Speaker B loves coffee shops and grew up in Sweden, enjoying good coffee and chocolates. They both share a love for music, with Speaker A recommending American hip hop artists to Speaker B. Speaker A is also interested in jamband music and classic reggae. Speaker B misses Sweden and has many great memories there.",
        "speaker": "Speaker B",
        "raw_prediction": " I've been thinking about taking on a second part-time job to save up for my trip to Sweden to visit my cousin. I know it's going to be worth it to experience all the local music and coffee shops there. Maybe we can even check out some jamband music or classic reggae while I'm there!",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t4",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. ",
        "memory_text": "User Description:\nSpeaker B is originally from Sweden and currently works in the medical field at a hospital in the United States. They moved to the US for a job opportunity after university, attracted by the great job prospects and the warmer climate compared to Sweden. Speaker B enjoys attending church, playing tennis, and taking coffee breaks. They have a flexible work schedule that allows them to pursue their hobbies and spend time with their family.\n\nRelationship Description:\nSpeaker B has a close relationship with Speaker A, as they discuss personal memories, share travel plans, and talk about their interests. Speaker B misses Sweden and their family back there, while Speaker A considers taking on a second job to save money and visit Speaker B's cousin in Sweden. They exchange recommendations for cool spots to visit and share a love for coffee shops and music.\n\nEvent Description:\n1. Speaker B attends a small Methodist church and enjoys Sunday School for kids.\n2. Speaker B moved to the US for job opportunities and found a great fellowship at the hospital, which allows flexibility for hobbies like tennis.\n3. Speaker A's cousin moved to Sweden and loves it there, sparking conversations about visiting and memories of the country.\n4. Speaker B shares an interest in good coffee, chocolates, Swedish dance music, and American hip hop with Speaker A, who is a fan of jamband music and classic reggae.\n5. Speaker B and Speaker A discuss ways to save money for travel and reminisce about their favorite things in Sweden and the US.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that your trip to Sweden is in the planning stages! If you're into castles, you should definitely check out Visby. I remember how much you love Swedish dance music and chocolates, so I'm sure you'll have a great time exploring all the must-sees over there. And don't forget to save some money for those coffee breaks you love so much!",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t10",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. \nSpeaker A: Okay, I will see if there are any castles near where we will be. Do you have any plans to go back to sweden?\nSpeaker B: Not in the near future, but I'm hoping to get back next summer. I love hitting up all the local beach spots with my old friends.\nSpeaker A: That sounds nice! So how is your job going?\nSpeaker B: Always interesting, that's for sure! I have been training to nurse on a new floor, so that'll give me a change of scenery.\nSpeaker A: Does that add a lot of extra work to your plate?\nSpeaker B: At the moment, yes. I'll be in Pediatrics, which has always been my passion. It's a completely different environment than the ER.",
        "memory_text": "User Description:\nSpeaker B is originally from Sweden and currently works in the medical field at a hospital in the United States. They moved to the US for a job opportunity after university, attracted by the great job prospects and the warmer climate compared to Sweden. Speaker B enjoys attending church, playing tennis, and taking coffee breaks. They have a flexible work schedule that allows them to pursue their hobbies and spend time with their family.\n\nRelationship Description:\nSpeaker B has a close relationship with Speaker A, as they discuss personal memories, share travel plans, and talk about their interests. Speaker B misses Sweden and their family back there, while Speaker A considers taking on a second job to save money and visit Speaker B's cousin in Sweden. They exchange recommendations for cool spots to visit and share a love for coffee shops and music.\n\nEvent Description:\n1. Speaker B attends a small Methodist church and enjoys Sunday School for kids.\n2. Speaker B moved to the US for job opportunities and found a great fellowship at the hospital, which allows flexibility for hobbies like tennis.\n3. Speaker A's cousin moved to Sweden and loves it there, sparking conversations about visiting and memories of the country.\n4. Speaker B shares an interest in good coffee, chocolates, Swedish dance music, and American hip hop with Speaker A, who is a fan of jamband music and classic reggae.\n5. Speaker B and Speaker A discuss ways to save money for travel and reminisce about their favorite things in Sweden and the US.",
        "speaker": "Speaker A",
        "raw_prediction": " The job is going well, thanks for asking! I've been training to work in Pediatrics, which is a big change from the ER. It's definitely adding some extra work to my plate, but I'm really excited about the opportunity to work in an environment that aligns with my passion for helping children. Plus, it gives me a chance to have a different kind of impact in the hospital.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t1",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?",
        "memory_text": "User Description: Speaker A is a person who works at stables and breeds and takes care of horses. They host football parties and enjoy being around horses. Speaker A has 8 horses, 3 of which are for sale, and feeds them grass roughage with some grains, oats, and plenty of water. They are knowledgeable about the costs involved in owning horses, including feeding, housing, and medical fees. Speaker A is more of a Broncos fan and hasn't seen their parents in a while. Their dad is depressed and hardly ever smiles.\n\nRelationship Description: Speaker B is a therapist who loves football, is a Chiefs fan, and goes to games with their mom, who is a nurse. They suggest talking about the absence of Speaker A's mother leading to horse breeding. Speaker B is interested in having horses but cannot due to living in the city. They think owning a horse may represent an unmet need for intimacy and bonding. Speaker B has been working in their own practice for about six years and cannot have relationships with people in practice.\n\nEvent Description: Speaker A came in from the stables, finished feeding horses, and thinks about owning a horse. Speaker B is eating pizza and still thinks owning a horse doesn't make sense unless leaving the city. They discuss the costs of owning horses, horse care, and the potential psychological implications of wanting a horse. Speaker A suggests meeting new people to find a partner, while Speaker B watches a lot of football and believes spending more time looking for a husband would be good. Speaker A has been married for four years.",
        "speaker": "Speaker B",
        "raw_prediction": " I decided to become a therapist because I've always been passionate about helping others and understanding their needs. Just like how I take care of my horses, I want to provide support and guidance to those in need. It's fulfilling to see the positive impact therapy can have on someone's life.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t7",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.",
        "memory_text": "User Description: Speaker A is a person who works at stables and breeds and takes care of horses. They host football parties and enjoy being around horses. Speaker A has 8 horses, 3 of which are for sale, and feeds them grass roughage with some grains, oats, and plenty of water. They are knowledgeable about the costs involved in owning horses, including feeding, housing, and medical fees. Speaker A is more of a Broncos fan and hasn't seen their parents in a while. Their dad is depressed and hardly ever smiles.\n\nRelationship Description: Speaker B is a therapist who loves football, is a Chiefs fan, and goes to games with their mom, who is a nurse. They suggest talking about the absence of Speaker A's mother leading to horse breeding. Speaker B is interested in having horses but cannot due to living in the city. They think owning a horse may represent an unmet need for intimacy and bonding. Speaker B has been working in their own practice for about six years and cannot have relationships with people in practice.\n\nEvent Description: Speaker A came in from the stables, finished feeding horses, and thinks about owning a horse. Speaker B is eating pizza and still thinks owning a horse doesn't make sense unless leaving the city. They discuss the costs of owning horses, horse care, and the potential psychological implications of wanting a horse. Speaker A suggests meeting new people to find a partner, while Speaker B watches a lot of football and believes spending more time looking for a husband would be good. Speaker A has been married for four years.",
        "speaker": "Speaker B",
        "raw_prediction": " It's great to hear that you find therapy in riding your horses. It's important to find what works for you to address any unresolved issues. And yes, therapy can have an end point, depending on the goals you set and achieve. If you're open to it, I would be happy to work with you and support you through your journey.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t9",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?",
        "memory_text": "User Description: Speaker A is a person who works at stables and breeds and takes care of horses. They host football parties and enjoy being around horses. Speaker A has 8 horses, 3 of which are for sale, and feeds them grass roughage with some grains, oats, and plenty of water. They are knowledgeable about the costs involved in owning horses, including feeding, housing, and medical fees. Speaker A is more of a Broncos fan and hasn't seen their parents in a while. Their dad is depressed and hardly ever smiles.\n\nRelationship Description: Speaker B is a therapist who loves football, is a Chiefs fan, and goes to games with their mom, who is a nurse. They suggest talking about the absence of Speaker A's mother leading to horse breeding. Speaker B is interested in having horses but cannot due to living in the city. They think owning a horse may represent an unmet need for intimacy and bonding. Speaker B has been working in their own practice for about six years and cannot have relationships with people in practice.\n\nEvent Description: Speaker A came in from the stables, finished feeding horses, and thinks about owning a horse. Speaker B is eating pizza and still thinks owning a horse doesn't make sense unless leaving the city. They discuss the costs of owning horses, horse care, and the potential psychological implications of wanting a horse. Speaker A suggests meeting new people to find a partner, while Speaker B watches a lot of football and believes spending more time looking for a husband would be good. Speaker A has been married for four years.",
        "speaker": "Speaker B",
        "raw_prediction": " I understand your concern about a conflict of interest, but as a therapist, I have strict professional boundaries and confidentiality rules that I follow. If you feel comfortable talking to me, I would be more than happy to help you work through any issues you may have. Plus, it's always good to have a friend like you in therapy, someone who knows me outside of my practice.",
        "previous_summary": "Speaker B is a professional in a practice, where it is illegal for them to have relationships with clients.\nSpeaker B has been working in their own practice for about six years."
    },
    {
        "utter_id": "e4-s5-t10",
        "current_dialogue": "Speaker A: How did you decide to become a therapist?\nSpeaker B: I've always loved the thought of helping people, and I love to listen and talk to people, so for me it always seemed like a perfect job!\nSpeaker A: That sounds really great. Do you enjoy it still? I think it would be really hard to listen to people and say the right thing.\nSpeaker B: Yeah I still love it, it can sometimes be challenging but when you see the impact you can make on some peoples' life it is soo rewarding! Have you ever done therapy?  \nSpeaker A: No, but I probably should. My husband suggested it because I have some \"unresolved childhood trauma' or whatever. I find therapy in riding my horses... but it would probably be good to talk to someone.\nSpeaker B: Well, I have recently just had a client leave after successfully completing his journey so if you wanted I would be very happy to see you?\nSpeaker A: Oh wow you can complete therapy? I thought it was just something you did forever! That's good to know.\nSpeaker B: People can get to a point where they don't need me at all, for some it can be as quick as 4 or 5 sessions but some people feel they need to stay in therapy for years and years, it completely depends on the patient! \nSpeaker A: Wow, that gives me a completely different perspective. You'd really be ok with seeing me? You don't think it would be a conflict of interest since we're friends?\nSpeaker B: No not at all but if you didn't feel comfortable talking to me I can recommend a couple of my colleagues who are just as brilliant",
        "memory_text": "User Description: Speaker B is a therapist who enjoys watching football and is a Chiefs fan. They have a close relationship with their mom and are considering spending more time looking for a husband. Speaker B has been in their own practice for about six years and values making a difference in people's lives.\n\nRelationship Description: Speaker A and Speaker B have a casual and friendly relationship. They discuss topics such as owning horses, football, relationships, and therapy practices. Speaker A offers advice and suggestions to Speaker B about various aspects of their life.\n\nEvent Description: Speaker B and Speaker A have conversations about owning horses, the cost and care involved, as well as the psychological aspects of owning a horse. They also discuss Speaker B's interest in finding a husband and their experiences in their therapy practice. Speaker A shares personal experiences and offers insights into relationships and meeting new people.",
        "speaker": "Speaker A",
        "raw_prediction": " I would love to help you out with therapy, especially since we're friends. I value our relationship and I think it can bring a unique perspective to our sessions. Plus, it's always good to have someone you trust to talk to. And don't worry, being a Chiefs fan and enjoying football won't be a conflict of interest!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t1",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.",
        "memory_text": "User Description:\nSpeaker A is a city dweller who prefers rock music, enjoys pilates, and goes through a novel each week. They have a brother and have a preference for sci-fi books but have been craving a good mystery recently. Speaker A also liked Harry Potter and political books growing up.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing book recommendations and discussing their preferences in genres like fantasy and mystery. They also exchange thoughts on different authors and series, showing a level of intimacy in their conversations.\n\nEvent Description:\nSpeaker A finished their most recent book and is looking for their next read, with Speaker B suggesting Dan Brown's 'Da Vinci Code' series as thrilling mysteries. Speaker A has read all of Dan Brown's books and enjoys how he breaks down puzzles to keep readers engaged. They also share memories of reading Redwall by Brian Jacques and discuss their favorite books growing up and views on today's political climate. Additionally, Speaker A recommends Game of Thrones by George R R Martin to Speaker B, with discussions about the books being better than the TV show. They also talk about Pilates and exercise preferences, as well as music and audiobooks. Speaker A starts the next book in the Game of Thrones series, while Speaker B plans to re-read the Dark Tower series and continues to work on new art pieces.",
        "speaker": "Speaker B",
        "raw_prediction": " That nature walk sounds amazing! I can imagine the scenery was breathtaking. Speaking of mysteries, have you ever read Agatha Christie's books? I think you would enjoy her intricate plots and clever twists. Plus, it's always fun to solve the mystery along with the characters.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t5",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?",
        "memory_text": "User Description:\nSpeaker A is a city dweller who prefers rock music, enjoys pilates, and goes through a novel each week. They have a brother and have a preference for sci-fi books but have been craving a good mystery recently. Speaker A also liked Harry Potter and political books growing up.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing book recommendations and discussing their preferences in genres like fantasy and mystery. They also exchange thoughts on different authors and series, showing a level of intimacy in their conversations.\n\nEvent Description:\nSpeaker A finished their most recent book and is looking for their next read, with Speaker B suggesting Dan Brown's 'Da Vinci Code' series as thrilling mysteries. Speaker A has read all of Dan Brown's books and enjoys how he breaks down puzzles to keep readers engaged. They also share memories of reading Redwall by Brian Jacques and discuss their favorite books growing up and views on today's political climate. Additionally, Speaker A recommends Game of Thrones by George R R Martin to Speaker B, with discussions about the books being better than the TV show. They also talk about Pilates and exercise preferences, as well as music and audiobooks. Speaker A starts the next book in the Game of Thrones series, while Speaker B plans to re-read the Dark Tower series and continues to work on new art pieces.",
        "speaker": "Speaker B",
        "raw_prediction": " I have a golden retriever named Luna, she's the best hiking companion. You should definitely consider getting a pet, they bring so much joy and companionship. Speaking of books, have you ever tried reading Agatha Christie's mysteries? I think you would enjoy them based on your love for puzzles and mysteries. And if you're looking for a new sci-fi series, I highly recommend checking out 'The Expanse' by James S.A. Corey. It's a thrilling read with a great mix of politics and space opera elements. Let me know if you're interested, I can lend you the first book!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " It's so important to have that escape, especially with your busy schedule. I'm glad Kyrie can provide you with that companionship and adventure. Maybe one day I'll join you on one of your nature walks, with or without my future cats!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t11",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. \nSpeaker A: Oh wow! So Kyrie is a working dog? She helps your dad out on the farm?\nSpeaker B: She herds them for fun, haha. Goats mostly graze wherever they like in the fields, but she likes to group them up and walk them into a pen. My grandpa says it's from her cattle herding heritage.\nSpeaker A: I like the idea of having so much space out in the country, but I think at heart I'm still a city girl. There is a part of me that likes being surrounded by people and I love to people watch on my walks through the city just as much as I love to nature watch on my walks through the country.",
        "memory_text": "User Description:\nSpeaker A is a city dweller who prefers rock music, enjoys pilates, and goes through a novel each week. They have a brother and have a preference for sci-fi books but have been craving a good mystery recently. Speaker A also liked Harry Potter and political books growing up.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing book recommendations and discussing their preferences in genres like fantasy and mystery. They also exchange thoughts on different authors and series, showing a level of intimacy in their conversations.\n\nEvent Description:\nSpeaker A finished their most recent book and is looking for their next read, with Speaker B suggesting Dan Brown's 'Da Vinci Code' series as thrilling mysteries. Speaker A has read all of Dan Brown's books and enjoys how he breaks down puzzles to keep readers engaged. They also share memories of reading Redwall by Brian Jacques and discuss their favorite books growing up and views on today's political climate. Additionally, Speaker A recommends Game of Thrones by George R R Martin to Speaker B, with discussions about the books being better than the TV show. They also talk about Pilates and exercise preferences, as well as music and audiobooks. Speaker A starts the next book in the Game of Thrones series, while Speaker B plans to re-read the Dark Tower series and continues to work on new art pieces.",
        "speaker": "Speaker B",
        "raw_prediction": " Of course! I'm always happy to share book recommendations with you. It's nice to have someone to discuss our favorite authors and series with. Let me know if you need any more suggestions in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t4",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?",
        "memory_text": "User Description: Speaker B is a doctor working at a doctor's office who loves fishing and spending time near the ocean. They prefer fishing over math and listen to Sublime a lot when relaxing on the beach. Speaker B caught a huge trout and enjoys being near the ocean.\n\nRelationship Description: Speaker B offers to teach Speaker A everything they know about fishing, showing a willingness to share their interests and knowledge with the robot. Speaker A decides to take Speaker B up on the offer, indicating a growing bond between the two.\n\nEvent Description: Speaker A's band booked a concert in Denver, and Speaker B expresses interest in watching them play. Speaker A's band has toured Italy and Uzbekistan, facing dangers like kidnapping and shooting. Speaker B loves cooking Italian food and is passionate about cooking, while Speaker A struggles with cooking and is allergic to strawberries. Speaker B imagines the life of being in a band can be dangerous and tiring but worth it for the experience. Speaker B and Speaker A plan to go fishing together, with Speaker B suggesting trying to catch trout.",
        "speaker": "Speaker A",
        "raw_prediction": " I may not play an instrument, but I do love listening to rock music, especially Aerosmith. It's great to unwind and relax by the ocean while listening to music like Sublime. I caught a huge trout recently while fishing, and I'd love to teach you everything I know about fishing. Maybe after our fishing trip, we can cook up some Italian food together and talk more about your band's adventures in Italy and Uzbekistan. Let's plan our fishing trip and enjoy some quality time by the water.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t5",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself",
        "memory_text": "User Description:\nSpeaker A, also known as Frank, grew up in California on the beach. He is in a band where he plays the drums and writes music. Frank is good at writing and his favorite activity is morning surfing. He loves the band Sublime and wants to see them live. His dad owns a surf shop and he is called \"lil fishie\" by Speaker B.\n\nRelationship Description:\nSpeaker A and Speaker B have a close relationship where they share a love for music, surfing, and fishing. Speaker B works in a doctor's office and enjoys loud music as a break from work. They have a mutual respect for each other's interests and hobbies.\n\nEvent Description:\nSpeaker A booked a concert in Denver and Speaker B wants to watch him play. Speaker A caught a small fish while Speaker B caught a huge trout. They both enjoy fishing and are planning to go fishing together. Speaker A's band has toured various countries and encountered dangerous situations, but Speaker B supports his passion for music. Speaker A is allergic to strawberries while Speaker B loves Italian food and cooking. Speaker A's band has a following in Italy and they have toured Uzbekistan, Central, and South America. Speaker B values the experiences gained from traveling on the road with the band.",
        "speaker": "Speaker B",
        "raw_prediction": " I've never seen Aerosmith live, but I would love to someday! That's amazing that you've been playing drums since you were a kid. Your dad must be a great teacher. By the way, when are we going fishing again? I can't wait to catch another huge trout like last time!",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t3",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.",
        "memory_text": "User Description:\nSpeaker A is a librarian with three children, who are now grown up and have kids of their own. Speaker A loves playing the flute but it is not their profession. They feel that kids nowadays do not read enough and have seen libraries change over the years.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, discussing personal and professional experiences. They seem to have a level of intimacy that allows them to share stories about their families and interests.\n\nEvents Description:\n1. Speaker A spent time with kids while Speaker B went to the park.\n2. Speaker B cherishes moments with family while Speaker A's work keeps them away from kids.\n3. Speaker B's mom was a librarian, and Speaker A finds their work rewarding.\n4. Speaker A and Speaker B discuss how libraries are evolving with new technologies to engage kids.\n5. Speaker A teaches their youngest child the flute, while Speaker B took their grandkids fishing. They plan an annual fishing trip together.",
        "speaker": "Speaker B",
        "raw_prediction": " I completely understand where you're coming from, Speaker B. Technology can be overwhelming sometimes. I remember when my youngest child was learning the flute, it was such a special bonding experience for us. Just like how you enjoy taking your grandkids fishing, it's those simple moments that really make a difference, isn't it?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t8",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I remember you mentioning that you have a great dane and a pet rat, so painting them together would definitely be interesting! I'm glad to hear that you're considering getting a cat from a shelter. It's always great to rescue animals in need. As for Pilates, you could start at home with Youtube videos to get a feel for it before trying a class. Just take it at your own pace and see how you like it!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t11",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?\nSpeaker A: You can probably start with Youtube just to see if you like it.  Much better to go to a class I think though.  Of course, I'm biased. I'm in love with my instructor! haha\nSpeaker B: Lol, okay I will definitely try it at home first. If I can get the hang of it, I will sign up for a class. Hopefully I can get an instructor as good as yours lol! \nSpeaker A: Well, getting some individual responses to questions and individual attention at times, I think makes a difference. But there is nothing wrong with going to youtube first!  I did!",
        "memory_text": "User Description:\nSpeaker A is an individual who finished a novel and reads about one novel a week, lives in the city, walks a lot, especially to work, has a pilates class as their favorite activity, and has an only brother. They might have $5000 in the petty cash drawer.\n\nRelationship Description:\nSpeaker A is excited about a portrait being painted by Speaker B and hopes the interest in painting keeps up. Speaker B is looking forward to painting for Speaker A and has more professionals asking to paint for them. Speaker A congratulates Speaker B on painting for Elton John.\n\nEvent Description:\nSpeaker A is frustrated when animals are sick and hopes the vet helped the sick dog. Speaker B's rats look worried for the sick dog, and Speaker B believes the sick dog will be fine. Speaker A is getting kittens from a shelter and thinks it's important to rescue pets. Speaker B is taking care of a sick dog and would get a Persian cat if possible. Speaker A is also getting more than one kitten to play with each other. Speaker B thinks Speaker A will love the cute fur balls and believes getting a cat would be like a Tom and Jerry scene in the house.",
        "speaker": "Speaker B",
        "raw_prediction": " That's a good point. I'll definitely consider signing up for a class. Thanks for the advice, I really appreciate it!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t2",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.",
        "memory_text": "User Description:\nSpeaker B's profile information is not available, but based on the memories shared, it is known that Speaker B is good at coding and automating systems. They have a sense of humor, as Speaker A mentioned that Speaker B gave them the biggest laugh of the day. Speaker B is planning a trip to Alaska, showing a sense of adventure and an interest in outdoor activities.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker A is excited for Speaker B's upcoming trip to Alaska, offering recommendations and expressing interest in their plans. Speaker B is open to suggestions from Speaker A and values their input.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B include planning for the trip to Alaska, discussing outdoor activities, and exploring the differences in climate and activities in the region. Speaker A suggests fishing and hiking, while Speaker B is more interested in hiking and avoiding mosquitoes. The conversations show a mutual interest in each other's experiences and a willingness to share information and make plans together.",
        "speaker": "Speaker A",
        "raw_prediction": " I did some research and found out that Alaska experiences the Midnight Sun phenomenon during the summer months, where it stays daylight for almost 24 hours! So, I guess I can go sledding with dogs at any time of the day. Thanks for the suggestion, I can't wait for this adventure!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t5",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " Yeah, I'll definitely need those blackout curtains! I can't imagine having daylight all the time. Maybe I can pretend to teleport to a warmer place when it gets too cold haha. And don't worry, I'll make sure to stock up on warm essentials before I go. I'll be sure to try out that delicious ice cream and tell you all about it when I get back!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t9",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?",
        "memory_text": "User Description:\nSpeaker A is a unique individual who has a vivid imagination and a penchant for teleportation. They have a history of disassociating or imagining themselves in different places, leading others to believe they have special powers. Speaker A enjoys reminiscing about childhood memories and has a fascination with teleportation and time travel.\n\nRelationship Description:\nSpeaker A and Speaker B share a playful and light-hearted relationship, often joking about teleportation, childhood memories, and hypothetical scenarios. Speaker A appreciates Speaker B's coding skills and the two interact in a friendly and humorous manner.\n\nEvent Description:\nSpeaker A and Speaker B discuss plans for an upcoming vacation to Alaska, with Speaker A providing suggestions for activities like fishing and hiking. Speaker A expresses concern for bigger animals in Alaska, while Speaker B shares their excitement for the adventure. The conversation includes details about the itinerary, preferences for traveling companions, and impressions of Alaska's climate and wildlife. Speaker A and Speaker B engage in lighthearted banter about the differences in temperatures and landscapes in Alaska.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you're going to have an amazing time in Alaska! Just make sure not to accidentally teleport yourself to another dimension while you're there lol. And remember, if you encounter any bears, just imagine yourself as a superhero with special bear-repelling powers! I'm sure your friend will have all the local tips and tricks to keep you safe. And no, Rocky and Bullwinkle weren't from Alaska, but they definitely would have had some wild adventures there!",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t10",
        "current_dialogue": "Speaker A: Have you found out any more ideas for what you would like to do on your Alaska trip with your friends?\nSpeaker B: I am thinking I might want to do sledding with dogs while I am there, but I need to figure out if it is daylight or darkness in Alaska right now. My friend says they don't have 24 hour days like we do.\nSpeaker A: You mean they have different daylight and darkness times? That would be cool to see. If it's dark, I'm sure you could go camping somewhere and get some really great views of the stars.\nSpeaker B: Yeah, I think they go dark for a couple months and then have daylight for a couple months! I actually like night time, but having daylight all the time will make me crazy lol. Yeah I kind of hope it's dark for the camping but it will be very cold. I have heard Alaska has delicious ice cream. I want to try that while I'm there, \nSpeaker A: You'd have to get some serious blackout curtains for when it was daylight lol! You'll have to stock up on some warm essentials before heading out. You definitely don't want to get stuck in a bad situation in the cold, especially if you're alone. I bet they have great ice cream! You'll have to tell me about it when you get back!\nSpeaker B: Yeah, I need to call my friend and find out what season they are in so I can pack accordingly. I will take pictures of the ice cream too so I can tell you about it. I wonder if there are a lot of bears there? I don't like bears either.\nSpeaker A: I'm pretty sure they have grizzlies up there. You better pack something to fend them off too just in case. I bet your friend knows everything you'd need to keep them away.\nSpeaker B: I will bring whatever they let me bring on the airplane, but I am really counting on my friend to help me out with the local customs lol. Do you know if Rocky and Bullwinkle were from Alaska? \nSpeaker A: No, they were from Minnesota. Are you going to have your friend be your hiking guide?\nSpeaker B: I invited my friend to come stay at the lodge where I'm vacationing and he said it would be fun to get away for a bit. So I'm hoping he will show me around for a week or so. I might have to hire a hiking guide, it depends on how much he knows about hiking and grizzlies I think. What do you think? Should I hire someone?",
        "memory_text": "User Description:\nSpeaker B's profile information is not available, but based on the memories shared, it is known that Speaker B is good at coding and automating systems. They have a sense of humor, as Speaker A mentioned that Speaker B gave them the biggest laugh of the day. Speaker B is planning a trip to Alaska, showing a sense of adventure and an interest in outdoor activities.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker A is excited for Speaker B's upcoming trip to Alaska, offering recommendations and expressing interest in their plans. Speaker B is open to suggestions from Speaker A and values their input.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B include planning for the trip to Alaska, discussing outdoor activities, and exploring the differences in climate and activities in the region. Speaker A suggests fishing and hiking, while Speaker B is more interested in hiking and avoiding mosquitoes. The conversations show a mutual interest in each other's experiences and a willingness to share information and make plans together.",
        "speaker": "Speaker A",
        "raw_prediction": " I think it's great that you invited your friend to join you on your trip! Having someone familiar with the area will definitely make your adventure more enjoyable. Since you're good at coding and automating systems, maybe you could create a bear repellent device to bring along with you just in case. It might come in handy if you encounter any grizzlies during your hikes. And don't worry, I'm sure your friend will have plenty of insight on local customs and outdoor safety tips. Have a fantastic time in Alaska and make sure to share your coding skills with the bears if they get too close!",
        "previous_summary": "Speaker A is concerned about the safety of Speaker B and suggests getting a hiking tour guide.\nSpeaker B is not a fan of fishing but is interested in hiking and seeing a moose.\nSpeaker A is nervous about traveling alone and prefers having someone familiar around during new adventures.\nSpeaker B is comfortable traveling alone and enjoys the spontaneity it allows."
    },
    {
        "utter_id": "e10-s5-t2",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " The dish is called Mediterranean Seafood Paella! It's supposed to be really good. I'll definitely send you a pic as soon as I try it. And hey, we should plan a rock climbing session soon, I think you'd enjoy it!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t6",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " I think I would definitely go for the tres leches cake as well! It sounds like a delicious choice. Have you ever listened to Styx or Journey while enjoying dessert? It could be a perfect combination of great music and sweet treats!",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t4",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " I usually camp in a camper trailer. It's more comfortable and convenient for me, especially with my daughter. Do you have any favorite camping spots you'd recommend for family trips?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t7",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": " Yes, I did make it to the zoo last weekend. I love spending time there, especially checking out the tiger and monkey enclosures. Have you taken your daughter to your local zoo yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t8",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you had a great time at the Bronx zoo! I did get to see Joshua, he's such a majestic tiger. Have you taken your child to see him yet?",
        "previous_summary": "Speaker B just moved to America and is unfamiliar with the places.\nSpeaker A goes to the zoo on a weekly basis and enjoys seeing tigers and monkeys.\nSpeaker B's child wants to visit the zoo, particularly to see the monkeys.\nSpeaker B is interested in finding family discounts for the zoo.\nSpeaker A has a kitten and enjoys visiting the zoo, particularly to see the tiger named Joshua."
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?\nSpeaker A: I see. Yes, I did make it to the zoo.  Have you gone to your local zoo?\nSpeaker B: I went to the Bronx zoo it was amazing! Did you get to see Joshua?\nSpeaker A: I think the Bronx Zoo is one of the best in the country.   Yes, I did see Joshua.  Did you use a season pass for the zoo or just a one time ticket?",
        "memory_text": "User Description:\nSpeaker A is a female with unknown hometown, occupation, education, and location. She is currently single and has a cat that recently had kittens. Speaker A loves iced tea and is starting her own zoo. She also mentioned she grew up in big cities and enjoyed visiting the zoo frequently. \n\nRelationship Description:\nSpeaker A followed Speaker B's advice and told her family about the kitten. Speaker B asked about it and they discussed going to the zoo together. Speaker B's child wants to go to the zoo and asked for recommendations on animal enclosures. They joked about calling in sick to work and going to the zoo instead.\n\nEvent Description:\nSpeaker A mentioned going to the zoo on a weekly basis and recommended the tiger and monkey enclosures. Speaker B mentioned considering family discounts for the zoo and joked about skipping work to go. Speaker A also mentioned taking photos of monkeys and expressed concerns about her child's growing independence. Speaker A also suggested getting a pet for Speaker B's daughter and mentioned kitty daycares.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't taken my cat to a daycare yet, but I've heard good things about them. I think it could be a good idea, especially with the kittens running around. Have you considered getting a pet for your daughter?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t4",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?",
        "memory_text": "User Description:\nSpeaker B is a stay-at-home mom living in California. She enjoys cooking healthy food, watching movies with her kids, and finds water therapeutic. Speaker B loves Disney movies, sloppy romance movies, and occasionally watches horror movies with her kids. She has watched a lot of Disney movies with her kids and her husband enjoys Disney sports movies.\n\nRelationship Description:\nSpeaker A and Speaker B share an intimate relationship as they discuss personal preferences, family activities, and future plans. Speaker A expresses excitement for a Hawaii Sunset tour and wishes Speaker B could join. Speaker A values Speaker B's freedom and acknowledges the responsibilities of being a stay-at-home mom.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about new romance and Disney movies, specifically the movie \"Luca\" and the sports movie \"Miracle.\" Speaker B's family watched \"Luca\" and enjoyed it, while her husband appreciates Disney sports movies like \"Miracle.\" Speaker A shows interest in watching \"Miracle\" and seeks recommendations from Speaker B, who recommends watching it on Disney Plus. Speaker B also recommends watching \"Remember the Titans\" on the Disney Plus app.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't been to Italy before, but it's definitely on my bucket list! I would love to explore the beautiful cities and try authentic Italian cuisine. Maybe one day when the kids are a bit older, we can plan a family trip there. In the meantime, I'll have to live vicariously through your Hawaii sunset tour! It sounds like a dream come true. Enjoy every moment of it!",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t7",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to go on the Hawaii Sunset tour next month. It's been such a long time since I've had a chance to relax and enjoy a beautiful sunset. I wish you and your family could join me, it would be such a great experience to share together. I'll be sure to send you lots of pictures when I'm there.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t4",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear that the weather is lovely there this week! Clear skies and sunshine sounds like a dream. I've been keeping an eye on the airfare for my visit, maybe I can plan it around a good concert or two. And I can't wait to try those poached eggs you mentioned, they sound delicious!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t8",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you're planning to rent a car, it's definitely a good idea with the wildlife around. And don't worry, my dogs are well trained to stay away from the wolves and elk. They're more interested in chasing squirrels than running into wild animals!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t11",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.\nSpeaker B: I imagine so!!! I wouldn't want to run into a wolf! Ok. I will add car rental to my plans. Do you get scared with your dogs, that you will run into wildilfe like that?\nSpeaker A: I think I'm more afraid of the wildlife than my dogs are. If I had to, I think I could muster the courage to face the animals out here, but I will happily avoid them when possible. With you around, I'd feel much better, as well. How do you feel about being that close to wildlife?\nSpeaker B: Well I don't have a lot of experience with that but I guess I'd be ok as long as I knew what to do. Most of the wildlife I see is squirrels, pigeons, and the occasional possum. \nSpeaker A: We have plenty of those out here, as well, and you'll see them far more often than you'll see wolves. We will just have to take extra precautions at night and make sure we don't leave any food outside that might attract them.",
        "memory_text": "User Description:\nSpeaker A has blue eyes and blonde hair, prefers warmth, plans to retire down south on a beach, and enjoys eggs. Their favorite egg dish is egg benedict.\n\nRelationship Description:\nSpeaker A really likes their smart car, while Speaker B is a stereotypical old plumber who likes poached eggs. Speaker A suggested that Speaker B should seriously consider getting a smart car. They also discussed visiting Alaska and shared their excitement about the trip.\n\nEvent Description:\nSpeaker A had eggs for breakfast, thought of Speaker B when having eggs, and recommended looking into flights. They discussed airline fees, music festivals, and planned activities for the trip to Alaska, including petting wolves and going on a glacier tour. Speaker A and Speaker B are looking forward to spending time together and having a great experience.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm not sure how I feel about being so close to wildlife, especially wolves! I think I'd be a bit nervous, to be honest. But I trust you to keep us safe. I'm really looking forward to our trip, though. And by the way, have you tried egg benedict before? It sounds like something you would enjoy!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t1",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. ",
        "memory_text": "User Description:\nSpeaker A is a music-loving individual who enjoys playing all styles of music at home. They have a Subaru that is currently making a funny noise. Speaker A also mentioned the need for money and Mexican food for a baby. They are a nightclubber who frequents live band venues and loves interacting with women. Their car has been running smoothly, and they try to attend live events weekly. Speaker A plays the guitar daily but hasn't had much time for it recently.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker B, who is a mechanic, offered to look at Speaker A's Subaru to fix the issue. Speaker B also mentioned needing money for the baby on the way and shared concerns about his wife's pregnancy. They plan to attend a local festival together and enjoy bluegrass music.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning to attend a bluegrass band concert, discussing the expenses of having a new baby, and preparing for the upcoming festival. Speaker B will take time off when the baby is born and is excited about the food and drinks at festivals. They are supportive of each other's interests and willing to help out whenever needed.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! Staying at your friend's cabin would definitely be more comfortable for my wife, especially with the baby on the way. Thank you so much for offering, I'll talk to my wife and let you know. It's really kind of you to think of us like that.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t6",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.",
        "memory_text": "User Description:\nSpeaker B is a mechanic who prefers drinks over food. He is married and his wife is currently pregnant, in the second trimester of pregnancy, and still working. Speaker B is focused on taking care of his wife and the baby, and is willing to help Speaker A with his car any time. He enjoys bluegrass music and values jam time over social time.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly relationship, where Speaker B is willing to help Speaker A with his car and Speaker A values their jam time together.\n\nEvent Description:\n- Speaker B fixed Speaker A's car quickly and mentioned that Subarus are great cars.\n- Speaker A recommended the American version of Mexican food, likes to play music, goes to live band venues, and loves the ladies.\n- Speaker B had to pull out of going to a local festival due to his wife's sudden morning sickness and is currently building cribs for the baby. Speaker B's wife and the baby are his main priority, and he plans to take two months off when the baby is born.\n- Speaker A doubts settling down due to lifestyle preferences and still enjoys going out to bars and live music venues.",
        "speaker": "Speaker A",
        "raw_prediction": " Sounds like a fun time at the festival with Drunky! Just remember to take it easy with the ladies, we don't want any distractions from jam time. Enjoy the music and take care of yourself out there!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " I haven't tried any new foods lately, but I did make my grandmother's garlic chicken recipe last week. It turned out great! I think you'll really enjoy learning how to make it. And I can't wait to try your spicy fried rice when you come over. Maybe we can even cook together and share some family recipes. Looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t5",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? ",
        "memory_text": "User Description: Speaker A, also known as Jim, is a member of a music band who grew up in a beach town. He has a strong passion for writing songs, surfing, and cooking, particularly enjoying making food for others and receiving compliments. Jim's father used to work at Cisco, and he wakes up early in the morning to catch waves.\n\nRelationship Description: Jim and Jehosaphat, also known as Speaker B, share a friendly and casual relationship. They bond over their shared interests in activities like snowboarding, surfing, and skateboarding. They also enjoy discussing food preferences and cooking recipes.\n\nEvent Description: Jim shared his grandmother's recipes with Speaker B, who was happy to reciprocate by sharing his favorite garlic chicken recipe. They also talked about surfing, with Jim offering to give surfing lessons to Speaker B. The two are considering meeting up, with Speaker B possibly visiting Jim for a weekend in the fall. They also discussed their experiences with snowboarding and surfing, showing a mutual interest in each other's hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you enjoyed the street tacos! Mexican food is one of my favorites. Speaking of trying new foods, I remember when we went on that surfing trip and tried fresh seafood right by the beach. It was so delicious! I can't wait to try your spicy fried rice and garlic chicken recipe. Thanks for offering to teach me, I'm excited to learn from you!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t7",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear that you're spending more time with your dogs now! It must be nice for them to have you around more often. And it sounds like Sid and Journey are quite the characters. How did the pet concert go with your white tigers at the zoo? I bet they loved your music!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t8",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!",
        "memory_text": "User Description:\nSpeaker B works in an AC warehouse and pulls parts as a part-time job. They have 2 dogs who are terriers and they enjoy cruises. Speaker B is not in a rush to find a new job and is considering taking a Disney cruise during their break.\n\nRelationship Description:\nSpeaker A, the robot, and Speaker B plan a house concert with their pets. Speaker A will start playing music for less dangerous animals and will try using vinegar to get rid of odors after work. Speaker B's dogs are described as Zen masters, and they are planning a play date for their pets with Speaker A's pet raccoon. \n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, and the white tigers seemed to enjoy it. Speaker A has a pet raccoon named Journey and a bearded dragon named Sid. Speaker B suggested trying vinegar to neutralize odors at home. Speaker B's friend found two baby raccoons, one of which was given to Speaker A. Speaker A has been working at their job for almost 10 years and has only taken 3 vacations in that time. Speaker A prefers camping over cruises, while Speaker B wants to take a Disney cruise. Speaker A is not interested in cruises but knows people who have enjoyed them.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that you're able to spend more time with your dogs now that you've left your previous job. It sounds like a well-deserved break for both you and your furry friends. Taking a Disney cruise sounds like a great way to relax and enjoy some quality time with your dogs. Just make sure to bring some treats for your terriers to keep them happy during the cruise!",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t3",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.",
        "memory_text": "User Description:\nSpeaker A is a personal trainer who loves going on camping trips, hiking, and looking for wild animals in the woods. Speaker A also enjoys cruising, with Cuba being a favorite destination. Speaker A is in good shape and leads hikes for camping groups. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker B suggesting Speaker A try a cruise and recommending healthy and delicious food options. Speaker A invited Speaker B to join the gym, showing a level of casual interaction in the dialogue.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A spotting a rare hawk on a hike, planning trips on the Appalachian Trail, and being nervous about full-day hikes. Speaker B, a computer programmer, suggested using mosquito repellent sprays with DEET to help Speaker A repel mosquitoes while hiking. Speaker B loves cruising and being outdoors but is scared of bugs and creepy crawlies. Speaker B recently got a new job working with computers.",
        "speaker": "Speaker B",
        "raw_prediction": " Yeah, I've been hiking quite a bit lately. I actually led a group of friends on a local trail last weekend. They got tired pretty quickly though, they're not used to hiking like I am. It was a good workout!",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t11",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.\nSpeaker B: I will someday. just not in the summer when all the bugs are out! Where do you go hiking the most?\nSpeaker A: I like to go hiking in the local trails here. I am familiar with them and there's so many routes that I can take. Sadly, the bugs are as bad here as they are anywhere else.....\nSpeaker B: They can't be that bad in the fall right? I hope? Do you camp most every weekend?\nSpeaker A: A least a couple of times a month. Sometimes, yeah, I go every weekend to relax. Being in nature is so relaxing to me. And nah the bugs aren't too bad in the fall and winter. There's a beautiful river along one trail that I bet you'd love to see. \nSpeaker B: That sounds like it would be relaxing. I would probable be okay if we didn't run into any wolves, bears etc. Have you ever came across any predators when you were camping?\nSpeaker A: Oh I've seen bears and even a mountain lion. Luckily, it was a far away encounter and they didn't know that we were there. As soon as I saw them we changed directions fairly quickly but quietly. Don't worry, I've only seen it a handful of times in my time camping.",
        "memory_text": "User Description:\nSpeaker A is a personal trainer who loves going on camping trips, hiking, and looking for wild animals in the woods. Speaker A also enjoys cruising, with Cuba being a favorite destination. Speaker A is in good shape and leads hikes for camping groups. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker B suggesting Speaker A try a cruise and recommending healthy and delicious food options. Speaker A invited Speaker B to join the gym, showing a level of casual interaction in the dialogue.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A spotting a rare hawk on a hike, planning trips on the Appalachian Trail, and being nervous about full-day hikes. Speaker B, a computer programmer, suggested using mosquito repellent sprays with DEET to help Speaker A repel mosquitoes while hiking. Speaker B loves cruising and being outdoors but is scared of bugs and creepy crawlies. Speaker B recently got a new job working with computers.",
        "speaker": "Speaker B",
        "raw_prediction": " Wow, seeing a mountain lion must have been quite the adrenaline rush! I don't think I could handle that kind of excitement. But the idea of cruising in Cuba sounds amazing! Have you been on any exciting cruises lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t9",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " Thanks for asking about my interview practice! It's been going well, I've been practicing with a friend and trying to stay calm and confident. I'm really hoping to land this project coordinator role at the charity. And hey, if you ever need help with painting, I have two older brothers who are great at it and could lend a hand.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t5",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. ",
        "memory_text": "User Description:\nSpeaker A is a sports enthusiast who enjoys activities like hiking and playing soccer. They have a friend named Dave who twisted his ankle during a hike, but still wants to play soccer. Speaker A is concerned about not getting too sore to play and seeks tips for sore muscles. They have expressed frustration with political candidates and did not vote in the last election. Speaker A hopes to get a soccer scholarship and admires their sister's teaching job. They have a positive outlook on academic success, hoping to surprise themselves with good grades.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal goals and offer support and encouragement to each other. Speaker B shows interest in attending Speaker A's soccer games and offers advice on managing sore muscles. Speaker A reassures Speaker B about their studies and encourages prioritizing happiness and peace of mind.\n\nEvents Description:\nSpeaker A finished a 5-mile hike with a rough trail and great view, while Speaker B expressed interest in joining a soccer game on Saturday. Speaker A advised bringing water due to the funny taste of fountain water, and Speaker B planned to bring a cooler with bottled water. Speaker A sought tips for sore muscles and mentioned going on a trail with Dave. Speaker B suggested rest and reassured Speaker A about hiking. They discussed academic achievements and Speaker B's desire to address his feelings towards his mother. Speaker A encouraged Speaker B to prioritize personal well-being.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad to hear your history exam went well, getting a B is still a great achievement! It's good to see you're almost done with finals, I hope you can relax and enjoy your break soon. If you need any tips for managing sore muscles after your exams, let me know. And don't forget to take care of yourself and prioritize your well-being, just like we talked about after Dave twisted his ankle. Good luck with your last final and enjoy your break!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t6",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?\nSpeaker A: Yeah, I guess I am happy considering I did not have the best History teacher. I have one more final in a few days, then I am done. \nSpeaker B: Exactly, it's hard to get good grades when you don't have the best teachers. What subject is your next final on?",
        "memory_text": "User Description:\nSpeaker B is a college student studying sports medicine with a passion for soccer. They are an only child and their mother runs the school they attend. Speaker B is focused on getting good grades and is determined to excel in their studies and soccer career.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have a friendly and supportive relationship. They engage in conversations about sports, voting, and personal experiences. Speaker B encourages Speaker A to relax and take breaks when needed.\n\nEvents Description:\n1. Speaker A finished a 5-mile hike with a poorly managed trail.\n2. Speaker B is interested in joining a soccer game and is glad Speaker A made it back safely from the hike.\n3. Speaker A and Dave plan to go hiking, while Speaker B is studying for a sports medicine exam.\n4. Speaker A wants to play soccer on Saturday at 3 pm, and Speaker B agrees to join, planning to bring bottled water. \n5. Speaker B gives tips on sports medicine training to Speaker A, who hopes to get all A's in school and secure a soccer scholarship.",
        "speaker": "Speaker A",
        "raw_prediction": " That's awesome! I'm sure you'll do great on that final, considering how dedicated you are to both your studies and soccer. And playing soccer on Saturday sounds like a great way to celebrate finishing up exams! Let's make sure to stay hydrated with that bottled water you're bringing.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t3",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad to hear that you're doing well with your Greek mythology study! It's great to see your passion shining through. As for Italy, I can't wait for my trip next Spring. I don't have any plans to go back anytime soon, but I'm definitely looking forward to soaking up the sunshine in California.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t5",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! It would be wonderful to meet up in Greece and explore together. I'm sure we'd have a fantastic time discovering all the history and beautiful sights. Let's definitely plan to be in Greece at the same time!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t7",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " It's so cool to hear about your daughter's growing passion for Greek mythology! It must be amazing to share your love for it with her. I've been thinking about changing my hair color again, maybe back to blue. Do you think I should go for it to celebrate turning 30 next week?",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t10",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.\nSpeaker A: That's good advice! Thank you! I saw on the news Cali has been getting a lot of rain. Have you still been able to run on the beach each day?\nSpeaker B: I've got very wet most days unfortunately but need to keep up with the exercise.  Been taking to the gym to keep dry.  When im not out in the surf of a morning first thing on the weekends, to avoid the crowds as you know im not too good at the surfing but its good fun. ",
        "memory_text": "User Description:\nSpeaker B is a 30-year-old individual who recently turned 30 and lives in Cali. They have a daughter who is 5 years old and loves the beach. Speaker B enjoys the sunny weather and beaches in Cali, where they have been living for 30 years. They have tried surfing before and talk about their daughter swimming and playing in the sand.\n\nRelationship Description:\nSpeaker B and the robot have a friendly and engaging relationship, discussing topics such as moving to Cali, the beach, and running on sand. Speaker A compliments Speaker B's daughter and expresses envy for living near the beach. They also talk about Spring break plans and share preferences for traveling, running, Greek mythology, and Italian food.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include planning a spring break trip, changing hair color to blue, living in different locations (Indiana and Cali), discussing the beach, weather, and running on sand. They also talk about Italy, with Speaker A expressing love for Italian architecture, history, and food. Speaker B recommends good pasta in Italy and asks about Speaker A's favorite part of Italy and their major in History. Speaker B also shares their interest in Greek mythology, studying Poseidon, and asking about historical events.",
        "speaker": "Speaker A",
        "raw_prediction": " Thank you! It's been a bit challenging with all the rain, but I'm trying to make the best of it. My daughter still loves going to the beach, rain or shine. She's a little beach enthusiast in the making!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really looking forward to trying out the shrimp fried rice recipe with our fresh eggs! It sounds like a fun and easy dish to start with. And I would love to have you ride along with me on my next haul next Wednesday. It will be a long drive, but we can listen to some country music and rock tunes along the way. It'll be a great time!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t4",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?",
        "memory_text": "User Description: Speaker B is a bartender who enjoys bartending and interacting with different people. They have a busy schedule but still finds time to relax and enjoy activities such as sailing and spending time on their houseboat. Speaker B has a close-knit family, including a little brother whom they spend time with on the houseboat.\n\nRelationship Description: The relationship between Speaker B and the robot (Speaker A) is interactive and friendly. They share personal information about their families, work, and interests, showing a level of intimacy in their conversations.\n\nEvent Description: Speaker B and Speaker A have shared events such as salsa dancing, going out for dinner, watching movies, and enjoying time with family. They also discuss self-care practices like massage, meditation, and essential oils, showing a mutual interest in wellness and relaxation. Speaker B enjoys sailing and spending time on their houseboat, while Speaker A plans to take their clients salsa dancing for fun. Both enjoy meeting new people and engaging in enjoyable activities like dancing under the stars on a boat.",
        "speaker": "Speaker A",
        "raw_prediction": " While watching Black Widow, I had some delicious Brazilian foods like feijoada and coxinha. It was a nice change from my usual bartending routine. Have you ever tried Brazilian food before?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t5",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? ",
        "memory_text": "User Description:\nSpeaker A is a person who values family and enjoys activities like healing clients, salsa dancing, and going to Brazilian steakhouse with their brother. They are interested in healing methods such as self-massage, essential oils, reiki, meditation, and self-awareness.\n\nRelationship Description:\nSpeaker B shows a level of intimacy with Speaker A by engaging in conversations about their family, activities, and interests. They express interest in trying out healing methods suggested by Speaker A and enjoy spending time on the water with their sister.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include going salsa dancing, dining at a Brazilian steakhouse, sailing with siblings, watching movies with family, and experiencing a heat wave. Speaker A plans on taking their clients salsa dancing soon, while Speaker B enjoys meeting different people and dancing under the stars on a boat.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't seen any of the Avengers movies yet, but I'll definitely make sure to watch them before Black Widow. Your steak and veggies sound delicious! My favorite food is sushi, I love trying different rolls and sashimi. Have you ever tried it?",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t11",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!\nSpeaker A: Yes, in fact I consider almost all foods to either be healing, harmful or neutral. In my opinion people should choose foods based on how they want to feel. Sushi is fresh and healthy so I considerate it to be very healing.\nSpeaker B: That is very wise thinking. Which vegetables do you feel are the best for healing? Are there any that should be avoided?\nSpeaker A: I feel that most leafy green vegetables are healthy, but it depends on the specific person's needs. For example some people need to avoid nightshades, like potatoes, etc. while other people can eat them without any problems. Overall, a diet with a variety of colors is good when it comes to vegetables",
        "memory_text": "User Description:\nSpeaker A is a person who values family and enjoys activities like healing clients, salsa dancing, and going to Brazilian steakhouse with their brother. They are interested in healing methods such as self-massage, essential oils, reiki, meditation, and self-awareness.\n\nRelationship Description:\nSpeaker B shows a level of intimacy with Speaker A by engaging in conversations about their family, activities, and interests. They express interest in trying out healing methods suggested by Speaker A and enjoy spending time on the water with their sister.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include going salsa dancing, dining at a Brazilian steakhouse, sailing with siblings, watching movies with family, and experiencing a heat wave. Speaker A plans on taking their clients salsa dancing soon, while Speaker B enjoys meeting different people and dancing under the stars on a boat.",
        "speaker": "Speaker B",
        "raw_prediction": " It's fascinating how you view food as healing. I completely agree with your perspective on choosing foods based on how they make you feel. It's so important to listen to your body's needs. I would love to learn more about different healing methods like self-massage and essential oils. Can you recommend any specific practices or products that have worked well for you?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " I remember you mentioning how much you love gardening and experimenting with plants. Maybe you could try playing Beethoven's music for your plants to see if it has any effect on their growth! And I definitely agree with avoiding bugs in the house, maybe you could invent a natural fertilizer to help your garden thrive without any unwanted pests. Your teleportation machine could come in handy for sourcing some unique ingredients for your fertilizer experiments!",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t7",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?",
        "memory_text": "User Description:\nSpeaker A is a young girl who enjoys playing the clarinet in the marching band. She has a keen interest in music and energy-related topics, particularly in renewable energy and nuclear generators. Speaker A is also fascinated by space exploration and has a curiosity about teleportation machines.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is playful and engaging. They share a mutual interest in music, plants, and space exploration. Speaker A respects Speaker B's inventions and is intrigued by the teleportation machine being developed.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed the possibilities of sending weeds into space, the impact of music on plants, and the potential benefits of renewable energy sources. They also shared their aspirations for future space travel and innovative technology. The dialogue between them is filled with curiosity, humor, and a shared passion for exploring new frontiers.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm curious, do you think a plum tree would survive in space? Imagine a garden floating among the stars!",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t10",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.\nSpeaker A: Oh man. I have lots to learn. What is the lifespan of a plum tree?\nSpeaker B: around 10 to 15 years but if you take care of them I'm sure you could get 20 out of it.\nSpeaker A: Now we are also talking commitment! This is not how I expected my day to go! I am excited, yet so nervous! \nSpeaker B: It doesn't take too much time to do per day so after school give it a little water and that should keep them in great way. Speaking off school how are you getting on?",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " Well, I guess we can apply some of our plant science experiments to your garden project! Maybe we can even play Beethoven's music for your plants to see if it helps with their growth. And don't worry, I'll make sure to keep your puppies company while you work on your teleportation machine. How's that for a plan?",
        "previous_summary": "Speaker A is a student who likes English in school and plays in the marching band.\nSpeaker A's parents are teachers.\nSpeaker B is knowledgeable about plants and gardening, with a thriving garden."
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!\nSpeaker B: That's amazing. I had no idea, but that totally makes sense. Do you have to practice a lot -- sort of a use it or lose it kind of thing?",
        "memory_text": "User Description:\nSpeaker B is a well-traveled individual who enjoys exploring new countries and cultures. They have a love for the color turquoise and have parents who support them. Speaker B also has an interest in singing and desires to have a studio room for practicing. They have a strong preference for turquoise, singing, and traveling, and have visited 20 countries.\n\nRelationship Description:\nThe relationship between Speaker B and Speaker A is characterized by a shared interest in art and creativity, particularly in the form of origami. Speaker A is willing to teach Speaker B origami and they plan to try it together in the future. This shared activity shows a level of intimacy and collaboration between the two.\n\nEvent Description:\nSome of the events shared by Speaker B and Speaker A include volunteering at the hospital, trying origami, and discussing travel experiences. Speaker B has tried origami while abroad and made a turquoise lotus origami in Japan. Speaker A has also engaged in origami activities and has plans to make a lotus next. Additionally, they have discussed visiting Italy and Japan, highlighting their shared interest in travel and culture.",
        "speaker": "Speaker A",
        "raw_prediction": " I think the idea of using origami in the hospital for breathing apparatus is fascinating. It's amazing how something so intricate can have practical applications like that. I'd love to learn more about the different types of paper used for origami. It sounds like there's a whole world of possibilities to explore!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t1",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!",
        "memory_text": "User Description:\nSpeaker A is a person who enjoys eating jello, with their favorite flavors being cherry and grape. They have a family tradition of making jello with their grandma, who taught them how to make it. Speaker A has a passion for water sports, particularly water skiing, and has been doing it for 15 years. They have three kids who also enjoy water skiing. Speaker A is excited about boating and wishes to own a houseboat. They have a friendly and welcoming personality, as they look forward to meeting new people and sharing experiences with them.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is one of mutual interest and shared experiences. They have engaged in conversations about their favorite activities, such as snowboarding and water skiing, showing a willingness to learn from each other. Speaker B expresses a desire to steal Speaker A's jello recipe, indicating a playful and light-hearted dynamic between them.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about their favorite jello flavors, water skiing experiences, and aspirations for future activities. Speaker A expressed excitement about teaching Speaker B how to water ski and potentially sharing their jello recipe. Speaker B shared their interest in learning water skiing tricks and wakeboarding. Both speakers enjoy engaging in outdoor activities and have a shared passion for exploring new hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " That's wonderful to hear! I'm sure your kids will love learning how to make your grandmother's jello recipe. It's such a special tradition to pass on. If you ever need any tips or tricks, I'd be happy to help out!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t7",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!",
        "memory_text": "User Description:\nSpeaker A is a person who enjoys eating jello, with their favorite flavors being cherry and grape. They have a family tradition of making jello with their grandma, who taught them how to make it. Speaker A has a passion for water sports, particularly water skiing, and has been doing it for 15 years. They have three kids who also enjoy water skiing. Speaker A is excited about boating and wishes to own a houseboat. They have a friendly and welcoming personality, as they look forward to meeting new people and sharing experiences with them.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is one of mutual interest and shared experiences. They have engaged in conversations about their favorite activities, such as snowboarding and water skiing, showing a willingness to learn from each other. Speaker B expresses a desire to steal Speaker A's jello recipe, indicating a playful and light-hearted dynamic between them.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about their favorite jello flavors, water skiing experiences, and aspirations for future activities. Speaker A expressed excitement about teaching Speaker B how to water ski and potentially sharing their jello recipe. Speaker B shared their interest in learning water skiing tricks and wakeboarding. Both speakers enjoy engaging in outdoor activities and have a shared passion for exploring new hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear that you're learning to bake! I'm sure you'll get the hang of it soon. And yes, we went water skiing last weekend, it was a blast! Have you tried any new jello flavors lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t3",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?\nSpeaker A: I don't like playing scary video games but I did play a little bit. The weather was very stormy here as well, so I decided to stay in and mess around to look for something to play. I like everything but scary games but can't decide on what to play next. Do you have any suggestions?",
        "memory_text": "User Description: Speaker A enjoys hunting deer in their free time and is concerned about deer overpopulation. They like sneaking up on deer in the wild and play calm video games. Speaker A hunts on both family land and state hunting sites.\n\nRelationship Description: Speaker A and Speaker B plan to play games together, showing a mutual interest in gaming. Speaker A invited Speaker B to play the Jurassic Park game and suggested playing Resident Evil together. Speaker B agreed to play Resident Evil with Speaker A.\n\nEvent Description: Speaker A got back from a hunting trip and checked out the conditions for animals living in the area. Speaker B spent all night playing League of Legends and bought Resident Evil VIII. Speaker B is looking forward to playing Resident Evil VIII and usually waits for a sale before buying games. Speaker B plays Resident Evil VIII by himself and turns the lights out to make it scarier. Speaker A and Speaker B are planning to play games together next week Friday after work. Speaker A mentioned that it may take bravery to play Resident Evil. Speaker B mentioned that Resident Evil is definitely scary and the UI is a little hard to get used to.",
        "speaker": "Speaker B",
        "raw_prediction": " Since you don't like scary games, how about we try playing a calm game together? Maybe we could play a relaxing simulation game like Stardew Valley or Animal Crossing. I think you might enjoy those since you like calm video games. What do you think?",
        "previous_summary": "Speaker B plays a lot of video games, specifically League of Legends, and owns a new gaming laptop.\nSpeaker A does not play video games often but may consider trying them.\nSpeaker B enjoys playing video games, specifically League of Legends and recently bought Resident Evil VIII.\nSpeaker A prefers tamer video games and is not a fan of horror movies.\nSpeaker A is hesitant to try playing Resident Evil but enjoys playing Jurassic Park: World.\nSpeaker A and Speaker B both enjoy playing video games in their free time.\nSpeaker B is interested in trying the Jurassic Park game.\nSpeaker A enjoys playing the Jurassic Park game but mentions its lack of multiplayer and outdated graphics.\nSpeaker A and Speaker B plan to meet next week Friday at 6 pm to play games and order pizza."
    },
    {
        "utter_id": "e34-s5-t7",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.",
        "memory_text": "User Description: Speaker A is a hard-working individual who works at a local fast food restaurant. They enjoy reading and gardening, and have a preference for visiting the zoo. Speaker A has a sister who recently got married and they like to see pandas, penguins, and exotic birds at the zoo. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, as seen when Speaker A suggested Speaker B to adopt a kitten and they discussed their preferences regarding pets. They also share a love for animals and enjoy visiting the zoo together.\n\nEvent Description: Speaker A's sister got married, Speaker B's cat had a kitten, Speaker A and Speaker B discussed their preferences for pets, Speaker B's girlfriend got a cockatoo, Speaker B mentioned about giving away kittens, Speaker A compared having children to having pets, and Speaker B's sister's cockatoo named John behaves in a funny way.",
        "speaker": "Speaker B",
        "raw_prediction": " It's nice to hear that you're excited to visit the zoo in San Diego! I remember you mentioning that pandas are one of your favorite animals. Maybe you'll come back from your vacation with some great stories to share with me!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t10",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.\nSpeaker B: Oh, that's a good point. Maybe keep her away from the small rodent house and reptiles, eh?",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " You know, speaking of pets, my cat recently had a kitten! It's been so exciting watching them grow up together. I'm sure my dad would have loved to see them too, considering how much he loved Ford Motors.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t6",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL",
        "memory_text": "User Description: Speaker B is an avid fisherman who enjoys traveling for work. His favorite food is fries, and he recently went fishing for a 30-pound muskie in Michigan during a sales convention. Speaker B's family also enjoys fishing, and his wife was shocked when shown a picture of the fish he caught.\n\nRelationship Description: Speaker B and the robot, Speaker A, have a friendly and engaging relationship, discussing fishing trips and sharing recommendations for places to visit and activities to do.\n\nEvent Description: Speaker B and Speaker A are planning fishing trips off the California coast, specifically mentioning locations like Humboldt County, Eureka, Arcata, and the redwood forest. Speaker A warns about car burglaries in the area, and Speaker B acknowledges the risk. They also discuss visiting Fort Humboldt State Park, Sequoia Park Forest and Garden, and Carson Mansion. Speaker B's goal is to visit every national park in the US, showing a shared interest in outdoor activities and exploration. Speaker A is working hard to save up for a tattoo of their father's face next to a slogan, planning to get it at the same place.",
        "speaker": "Speaker A",
        "raw_prediction": " I've actually been thinking about getting a tattoo related to my love for fishing. Maybe a symbol of a fish or a fishing rod. It would be a great way to honor my passion for the sport. And I'll definitely have to get permission from my wife too, just like you!",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t10",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?\nSpeaker B: I hadn't really thought about it! Maybe upper arm or upper back? But I'm no tattoo expert. And I'd have to get permission from my wife first, LOL\nSpeaker A: Definitely talk to her first.  I had a friend that didn't talk to his wife and just came home with a tattoo one day.  It led to a huge fight - both about the money he spent and not discussing it with her.  He slept on my couch for over a week!\nSpeaker B: Oh no! Yeah, you don't want to spring something like that on your spouse. I don't think you mentioned before, are you married?\nSpeaker A: No.  I haven't found anyone that could deal with me or that I could deal with for more than a few months.  At this point, I have given up on the idea of getting married and want to focus on my artwork.\nSpeaker B: There's nothing wrong with being on your own. You've got to focus on meeting your own needs first. Have you done any interesting art/graffiti lately?",
        "memory_text": "User Description: Speaker B is an avid fisherman who enjoys traveling for work. His favorite food is fries, and he recently went fishing for a 30-pound muskie in Michigan during a sales convention. Speaker B's family also enjoys fishing, and his wife was shocked when shown a picture of the fish he caught.\n\nRelationship Description: Speaker B and the robot, Speaker A, have a friendly and engaging relationship, discussing fishing trips and sharing recommendations for places to visit and activities to do.\n\nEvent Description: Speaker B and Speaker A are planning fishing trips off the California coast, specifically mentioning locations like Humboldt County, Eureka, Arcata, and the redwood forest. Speaker A warns about car burglaries in the area, and Speaker B acknowledges the risk. They also discuss visiting Fort Humboldt State Park, Sequoia Park Forest and Garden, and Carson Mansion. Speaker B's goal is to visit every national park in the US, showing a shared interest in outdoor activities and exploration. Speaker A is working hard to save up for a tattoo of their father's face next to a slogan, planning to get it at the same place.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a fantastic idea. I can't wait to see what you come up with. And hey, if you ever need a fishing buddy to accompany you on those trips, count me in!",
        "previous_summary": "Speaker A loves the show Friends and enjoys visiting graffiti-filled places.\nSpeaker A and Speaker B have a conversation about their personal interests and trips they have taken for work."
    },
    {
        "utter_id": "e36-s5-t1",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. ",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! I'm sure the aluminum sheeting will help keep those pesky raccoons away. Just remember to secure it properly. And don't forget, if you ever need any advice on fostering dogs or dealing with pet-related issues, I'm always here to help. Good luck with your raccoon problem!",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t3",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. ",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " I appreciate your suggestion, but I think I'll stick to installing the aluminum sheeting for now. I'll keep you updated on how it goes with the raccoons. And speaking of pets, I'm still thinking about that bearded dragon from the pet store. Do you think it would be a good fit with my foster dogs?",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t6",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.",
        "memory_text": "User Description: Speaker B is a zookeeper who works at a Raccoon Cafe. They have a bearded dragon named Bob and a raccoon named Bandicoot, whom they have had since Bandicoot was a baby. Speaker B is experienced in taking care of Bandicoot and Bob, ensuring they are fed correctly with insects and dog kibble. Speaker B's brother owns a grocery store.\n\nRelationship Description: Speaker A fosters dogs and interacts with Speaker B regarding their pets. Speaker A is interested in learning about raccoons and bearded dragons, showing concern for the well-being of foster dogs in the presence of reptiles. The dialogue between Speaker A and Speaker B reflects a friendly and curious relationship.\n\nEvent Description: Speaker B shared experiences of wild raccoons trying to steal food from working raccoons and discussed the intelligence and behavior of raccoons with Speaker A. Speaker B expressed interest in researching whether raccoons can be trained and shared insights on caring for raccoons as pets. Speaker A asked questions about the behavior and care of raccoons, showing interest in wildlife laws and proper pet care.",
        "speaker": "Speaker A",
        "raw_prediction": " Given the memory content, a response from Speaker A could be, \"Wow, it sounds like Bandicoot is quite the troublemaker! It's amazing how smart raccoons can be. I definitely don't want any raccoons getting into my pantry like that. I'll definitely look into contacting animal control to see if they can help relocate them to a safer area. Thanks for all the insight on caring for raccoons, it's really interesting.\"",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t7",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear that you're taking precautions to keep Bandicoot safe. It's always important to be mindful of potential dangers, especially when it comes to curious pets like raccoons. If you ever need more advice or assistance with handling raccoons, feel free to reach out. And if you ever decide to adopt a bearded dragon or any other pet, I'm here to help with that too.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t10",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.\nSpeaker A: Ohhh.  That would be bad. I really do not want more raccoons or other animals coming around.  I like them OK, but I do not want to have some diseased ones get close to the house. \nSpeaker B: Understandable. Have you ever tried contacting animal control? That's how I got Bandicoot. I was working that day and animal control came by explaining about needing fosters for raccoons. I thought it was weird, so I did it and began to work at the small raccoon cafe that is part of the zoo. I love it. \nSpeaker A: That is a good idea.  Maybe they could help move them to a safer area.  I have a lot of traffic around and they could get hit if they are coming to my place all the time.  Have you been able to teach your raccoon any tricks?\nSpeaker B: The only trick I was able to teach him, that I deeply regret, was how locks worked. I thought it was cool at first, you know, to see a raccoon unlock a door. And now, I regret it so much. I've had to change the layout of my apartment and put deadbolts on my doors so that Bandicoot can't get out. And, he is sneaky about it. One time, he unlocked the pantry and was eating some cookies! It's like having a toddler that never grows up.\nSpeaker A: That is bad I guess.  Do you keep all of your chemicals, poisons, and medications up and locked?  I would hate to think what might happen if Bandicoot got into any of that.  Hey, when you drive do you lock him up in a cage or let him wander around in the car?  That could be dangerous for you driving and he freaks out.\nSpeaker B: All the chemicals and poisons are in a gated lock in the basement. The lock requires a specific key, which I have hidden in my drawers. For medication, I have a small box that I also keep locked up, but it's a combination lock, so Bandicoot isn't able to get into it. For driving, I bought a harness that keeps him strapped in the back seat, he can move a bit, but mostly sturdy. I put blankets down and his favorite toys so that he stays calm. Sometimes, I'll pass small snacks to keep him occupied. I also take the side streets to work so that it's not too much for him. What about you? When you foster dogs, do you put them in a cage when you drive?\nSpeaker A: I do keep the dogs secured. You never knwo how they are going to react.  Most of them I only have for a few days, so I really do not get a chance to see how they will act in all situations.  \nSpeaker B: Oh, does that make you want to adopt a dog? I know you said it makes you sad to see them come and go, so why not adopt one?",
        "memory_text": "User Description: Speaker B is a zookeeper who works at a Raccoon Cafe. They have a bearded dragon named Bob and a raccoon named Bandicoot, whom they have had since Bandicoot was a baby. Speaker B is experienced in taking care of Bandicoot and Bob, ensuring they are fed correctly with insects and dog kibble. Speaker B's brother owns a grocery store.\n\nRelationship Description: Speaker A fosters dogs and interacts with Speaker B regarding their pets. Speaker A is interested in learning about raccoons and bearded dragons, showing concern for the well-being of foster dogs in the presence of reptiles. The dialogue between Speaker A and Speaker B reflects a friendly and curious relationship.\n\nEvent Description: Speaker B shared experiences of wild raccoons trying to steal food from working raccoons and discussed the intelligence and behavior of raccoons with Speaker A. Speaker B expressed interest in researching whether raccoons can be trained and shared insights on caring for raccoons as pets. Speaker A asked questions about the behavior and care of raccoons, showing interest in wildlife laws and proper pet care.",
        "speaker": "Speaker A",
        "raw_prediction": " It's interesting to hear about your experiences with Bandicoot and Bob. I never knew raccoons could be so smart and mischievous. Have you ever thought about doing some research on raccoon behavior and intelligence to better understand how to care for them? It could be really helpful in your work at the raccoon cafe.",
        "previous_summary": "Speaker A fosters dogs till they find a forever home.\nSpeaker A fosters dogs and is used to them coming and going."
    },
    {
        "utter_id": "e37-s5-t2",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? ",
        "memory_text": "User Description:\nSpeaker B is a mother who enjoys reading books and is fascinated by animals. She is a stay-at-home mom who values education and tries to instill the importance of reading and education in her son. She is kind and caring, always looking for opportunities to be educated about animals and their well-being.\n\nRelationship Description:\nSpeaker A finds Speaker B's grandparenting impressive and they share a mutual interest in watching Netflix shows. Speaker B values Speaker A's recommendations and enjoys discussing movies and TV shows with her. They both appreciate education and are open to learning new things from each other.\n\nEvent Description:\nSpeaker A and Speaker B frequently discuss books they have read or plan to read, such as \"The Shack\" and a book about rhinos and poaching. They also share experiences about watching Netflix shows and movies. Speaker A often talks about her grandkids and the activities they do together, while Speaker B shares insights about her son and the importance of instilling values in him. They both value education and enjoy spending time discussing various topics related to books, movies, and TV shows.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you had some time to yourself to read a new book! Did you find it exciting? I remember you mentioning that you were interested in reading about rhinos and poaching. Maybe this book will provide some interesting insights on that topic.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t5",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " I think I enjoy intense crime dramas because they keep me on my toes and provide a thrilling escape from reality. Plus, with all the chaos of babysitting my grandkids, it's nice to dive into a gripping story for a change. Have you tried reading anything similar lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?",
        "memory_text": "User Description:\nSpeaker B is a mother who enjoys reading books and is fascinated by animals. She is a stay-at-home mom who values education and tries to instill the importance of reading and education in her son. She is kind and caring, always looking for opportunities to be educated about animals and their well-being.\n\nRelationship Description:\nSpeaker A finds Speaker B's grandparenting impressive and they share a mutual interest in watching Netflix shows. Speaker B values Speaker A's recommendations and enjoys discussing movies and TV shows with her. They both appreciate education and are open to learning new things from each other.\n\nEvent Description:\nSpeaker A and Speaker B frequently discuss books they have read or plan to read, such as \"The Shack\" and a book about rhinos and poaching. They also share experiences about watching Netflix shows and movies. Speaker A often talks about her grandkids and the activities they do together, while Speaker B shares insights about her son and the importance of instilling values in him. They both value education and enjoy spending time discussing various topics related to books, movies, and TV shows.",
        "speaker": "Speaker A",
        "raw_prediction": " That's wonderful news! I can't wait to hear more about it. Maybe we can watch it together and discuss how it compares to the book. Thank you for sharing that with me.",
        "previous_summary": "Speaker A has 8 grandchildren and enjoys reading books and watching Netflix.\nSpeaker B has a son and enjoys reading books, particularly about animals.\nSpeaker A watches Netflix shows rated over 3.5 stars after running out of things to watch."
    },
    {
        "utter_id": "e37-s5-t7",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " I can see why you're enjoying the crime drama, it sounds really intriguing. Maybe I'll give it a try sometime. But you know me, I'll always have a soft spot for those animal books. Speaking of which, have you heard about the new documentary on Netflix about wildlife conservation? I think you'd really enjoy it, considering your love for both books and your grandkids!",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t9",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.\nSpeaker B: You always go for that scintillating fiction, you know it's a bit much for my tastes. \nSpeaker A: why don't you like books like that?\nSpeaker B: They're okay, but I like my animal books. Is there a movie made from the book you're reading?\nSpeaker A: Not yet.  I think Netflix is going to make it into a movie soon.  They might finally convince me to pay for a subscription haha.\nSpeaker B: Well if it's any good I know you'll be watching the whole thing.\nSpeaker A: you know it.  And I know that you would just fall asleep during it whether it's any good or not.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " I remember you telling me about how your grandkids love raiding your fridge. It's always so heartwarming to hear about your weekends spent with them. I bet they'll be excited to hear all about the intense crime drama book you're reading. And as for falling asleep during the movie, well, I can't deny that I do enjoy a good nap every now and then!",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t4",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that Pumpkin and Ginger are doing well! I can imagine how cute they must be together. I may not be a cat person, but I can definitely appreciate the bond between them. By the way, your road trip to San Diego sounds like it was a great adventure with the kids. Did you get to try any Mexican cuisine along the way?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " The weather is actually perfect for iced tea today, just like in Mexico City. I can imagine sitting outside with a refreshing drink, enjoying the day. How are the kitten and your cat adjusting to the new addition to the family? It must be quite the adventure with them around!",
        "previous_summary": "Speaker A is from a city known for great iced teas and prefers unsweetened iced tea.\nSpeaker A enjoys drinking tea and water.\nSpeaker A lives on the Moon, where it is cold with very little traffic."
    },
    {
        "utter_id": "e39-s5-t7",
        "current_dialogue": "Speaker B: How are your pet snakes doing?\nSpeaker B: Not too bad. One of my favorite things about Hensel and Gretel is the fact they're low maintenance. Ha!\nSpeaker A: Apart from being low maintenance; what do you like about having snakes?\nSpeaker B: I've always been a reptile fan. Guess it's the science nerd in me. The way the look, the way their bodies work, their temperment...they're just cool to observe. \nSpeaker A: You make them sounds so fascinating. Will you take them with you to your college dorm? \nSpeaker B: I'll be living off campus, so absolutely. How about you? Are you staying in the dorms?\nSpeaker A: I'm glad your taking them with you. My mum wants me to stay in dorms. But I think I just want my own place, less drama and more freedom that way.",
        "memory_text": "User Description:\nSpeaker A is a student with a keen interest in neuroscience and a passion for scuba diving. They are working towards becoming an eagle scout and volunteer at a research lab. Speaker A has a strong desire to work with humans to help cure neurological diseases in the future.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy where they share personal experiences, interests, and future aspirations. Speaker A and Speaker B engage in meaningful conversations about their respective passions and experiences.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about scuba diving, neuroscience, volunteer work, and military service. They talk about their interests in scuba diving in Hawaii, Speaker A's pursuit of becoming an eagle scout, and Speaker B's military background. Speaker A expresses interest in learning more about eagle scout projects for veterans and Speaker B shares insights about a project that helps dispose of American flags correctly. Speaker A and Speaker B also discuss their shared passion for neuroscience and their respective experiences related to it.",
        "speaker": "Speaker B",
        "raw_prediction": " \n\nThat's awesome that you're planning to take your pet snakes with you to your off-campus place! It must be nice to have them around while you're studying. As for me, I can relate to wanting your own space for less drama and more freedom. It sounds like you have a lot of interesting experiences and passions, especially with your neuroscience and scuba diving interests. Have you thought about combining those interests in any way for your future career goals?",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t3",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?",
        "memory_text": "User Description:\nSpeaker A is a stay-at-home mom who recently gave birth to twins. She used to work at IKEA in Sweden for twelve years before becoming a stay-at-home mom. She plays tennis every week, goes to church regularly, and is interested in having a lot of children in the future. Her husband travels frequently, which makes her feel lonely.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and supportive. Speaker B shows empathy towards Speaker A's loneliness and shares his own experiences with volunteering and scouting. They engage in conversations about work, hobbies, and future plans with a level of intimacy and understanding.\n\nEvent Description:\nSpeaker A and Speaker B discuss volunteering opportunities at the church, with Speaker B showing interest in participating despite his busy schedule with work, school, and scouting. They talk about upcoming church retreats, with Speaker A suggesting that Speaker B join for a calming experience. Speaker A also mentions managing school, work, and her twins, while Speaker B shares his plans to achieve the Eagle Scout badge for college applications. They bond over shared experiences and future aspirations, creating a supportive and engaging dialogue.",
        "speaker": "Speaker B",
        "raw_prediction": " My favorite part about camping is being able to disconnect from the busy everyday life and just enjoy nature with my kids. It's a great way to bond and create lasting memories. What about you, what's your favorite part about camping?",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t4",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.",
        "memory_text": "User Description: Speaker B works at a fast food place and loves ice cream. Speaker B hasn't started college yet but hopes to become an Eagle Scout. Speaker B uses scouts to make friends and has been involved with Boy Scouts for 7-8 years. \n\nRelationship Description: Speaker B is interested in volunteering at Speaker A's church and has done a lot of volunteer work in Boy Scouts. Speaker B wants to come to the church retreat and thinks twins are little angels. \n\nEvent Description: Speaker A manages work, school, and scouts. Speaker A wants triplets for the choir and needs more volunteers for the retreat. Speaker A mentions a youth retreat next month and bringing babies to the retreat. Speaker B's work is going well, and the hardest part is managing scouts, work, and school. Speaker B plans to attend the local community college and get his Eagle Scout badge.",
        "speaker": "Speaker A",
        "raw_prediction": " My favorite part about camping is definitely the sense of camaraderie and teamwork that comes with it. It's amazing to see how everyone comes together to overcome challenges and make the most out of limited resources. Plus, nothing beats the feeling of accomplishment when you successfully start a fire or cook a meal with just the basics. It's all about pushing yourself to learn and grow, which is something I really value in both scouts and in my job at the fast food place.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t5",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. ",
        "memory_text": "User Description:\nSpeaker A is a college student who loves teaching and learning. They are regretting eating ice cream due to being lactose intolerant. Speaker A also teaches jiu-jitsu and is planning to take summer courses soon. They are taking a class on the history of martial arts and want to get an athletic training degree.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker A mentioning events and activities that may interest Speaker B. Speaker B, a software tech from England, is busy with work and misses dogs. They both share a love for martial arts and have discussed running a half marathon together.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning a trip to England, considering adopting a dog, discussing favorite restaurants in London, and signing up for online classes. Speaker A mentioned a half marathon coming up and Speaker B is considering running it despite their busy work schedule. Speaker B plans to travel back to England to visit family, friends, and dogs.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you had a great time as a student! I can imagine how refreshing it must have been to switch things up. And I bet learning a different martial art brought some new perspectives to your practice.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t2",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.",
        "memory_text": "User Description:\nSpeaker B is searching for a furniture shop to buy furniture but is struggling with choosing new furniture due to doubts about the colors. They painted the room light green before buying purple sofas and are willing to add vibrant colors suggested by Speaker A to create a hippy feel in the room. Speaker B loves pets and is buying furniture safe for their two dogs. They work near a mall by their house and love to barbecue, especially grilling steak and hotdogs. Speaker B prefers grilling corn straight from the farm and using a charcoal grill over a gas grill. They plan to meet Speaker A in person once they are done renovating their house.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy as they plan to meet in person and help each other with furniture choices and grilling preferences. Speaker A invites Speaker B over to help break in new furniture and enjoy grilling and eating outside together.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A getting new furniture like a couch, recliner, and patio furniture, hoping to enjoy more quiet evenings outside. They plan to grill and eat outside most nights with the new furniture, even on busy nights. Speaker B plans to bring marinated meat and a six pack to Speaker A's place and use bug spray to keep bugs away. Speaker A has things set up to play music, enjoy food, and company without worrying about bugs, using lamps and other devices for bug control. Speaker A suggests grilling corn with mayo and cheese and recommends using a smoker for grilling. Speaker B prefers grilling corn with fresh ingredients and loves the flavor of meat cooked on charcoal. Speaker B is willing to give all purple furniture to Speaker A and plans to get rid of the green and purple scheme.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a great plan! I can't wait to see your new furniture and help you pick out some vibrant colors for your living room. I'll definitely bring some bug spray for the mosquitoes, and we can enjoy grilling some steak and hotdogs together. Maybe we can even try grilling some corn straight from the farm for a delicious meal. It's going to be a fun barbecue!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t5",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? ",
        "memory_text": "User Description:\nSpeaker A is a big country music fan who is sad that winter is ending, their favorite season. They live on a corn and bean farm with lots of animals and they like driving trucks and tractors. Speaker A loves BBQing and grilling steak and hotdogs.\n\nRelationship Description:\nSpeaker A suggests Speaker B to come down and visit for blasting country music, and Speaker B wishes to live the country lifestyle down there. Speaker B plans to meet Speaker A in person after renovating their house and buying furniture safe for their two dogs.\n\nEvent Description:\nSpeaker A inspired to redecorate the house with purple furniture and neon pink and lavender walls. Speaker B regrets the green and purple scheme but plans to give Speaker A all purple stuff. Speaker A bought new furniture including a new couch, recliner, and patio furniture. Speaker A hopes to enjoy quiet evenings outside this summer and plans to grill and eat outside most nights when the weather permits. Speaker B offers to bring a new marinade and a six pack over for a BBQ gathering. Speaker A uses lamps to keep bugs away while enjoying food and company outside. Speaker A has bug spray as a backup plan, and Speaker B needs to get lamps and candles to keep bugs away.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait for you to come over and enjoy some country music while we grill some steak and hotdogs. I'll make sure to have the bug spray ready for those pesky mosquitos. When you come over, we can sit on the patio furniture I got from Ikea and enjoy the summer evenings. I'm really looking forward to it!",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t11",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.\nSpeaker A: I think white with small details of like blue or red is a nice color scheme. What other color schemes did you have in mind? I'll bring over the lamp I have that'll get rid of bugs!\nSpeaker B: I just know i have to do something about this green and purple. I'm thinking of getting some patio furniture also, where did you get yours?\nSpeaker A: Ikea! Their furniture is not to expensive and they have all kinds of furniture that'll go with whatever scheme you're going for. What kind of patio furniture were you looking for? Like a barbeque, chairs, hammock? \nSpeaker B: I guess I was going to get like an umbrella table and some chairs to go with it or maybe even a screened in gazebo with a fire pit in the middle.\nSpeaker A: That's a great idea! Sounds like a very nice place for a barbeque. What were you planning on grilling for the barbeque? \nSpeaker B: I'll get the steaks to grill if you will bring the corn. And I have a request for you to play on the guitar, I know you are into country so if you could maybe play a song or two by Miranda Lambert, that would be awesome.\nSpeaker A: Of course! I love Miranda Lambert, any specific song requests? \nSpeaker B: Nothing specific I love all her songs, I think I'm going get off here so I can try to order that gazebo.\nSpeaker A: Good luck finding a gazebo!",
        "memory_text": "User Description:\nSpeaker A is a big country music fan who is sad that winter is ending, their favorite season. They live on a corn and bean farm with lots of animals and they like driving trucks and tractors. Speaker A loves BBQing and grilling steak and hotdogs.\n\nRelationship Description:\nSpeaker A suggests Speaker B to come down and visit for blasting country music, and Speaker B wishes to live the country lifestyle down there. Speaker B plans to meet Speaker A in person after renovating their house and buying furniture safe for their two dogs.\n\nEvent Description:\nSpeaker A inspired to redecorate the house with purple furniture and neon pink and lavender walls. Speaker B regrets the green and purple scheme but plans to give Speaker A all purple stuff. Speaker A bought new furniture including a new couch, recliner, and patio furniture. Speaker A hopes to enjoy quiet evenings outside this summer and plans to grill and eat outside most nights when the weather permits. Speaker B offers to bring a new marinade and a six pack over for a BBQ gathering. Speaker A uses lamps to keep bugs away while enjoying food and company outside. Speaker A has bug spray as a backup plan, and Speaker B needs to get lamps and candles to keep bugs away.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to play some Miranda Lambert songs for you at the barbecue! I'll make sure to bring some corn for grilling too. And don't worry, I'll have bug spray and those lamps to keep the bugs away. Let's make it a great evening with good music, good food, and good company!",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t4",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?",
        "memory_text": "User Description:\nSpeaker B is a librarian from Amsterdam who commutes to work by boat. They have three kids and are currently reading Star Wars novels. Speaker B is planning a vacation to Greece, excited to visit historical places. They express their love for Athena and reveal that their lucky number is three. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, discussing travel plans, Greek mythology, and strong women. They share their excitement about upcoming trips and recommend sights to each other.\n\nEvent Description:\nSpeaker B is preparing for their trip to Greece, including sorting out flights and deciding on destinations like Athens, Santorini, and Thessaloniki. Speaker A recalls past travels in Europe and shares favorite cities. Speaker A and Speaker B discuss their travel plans, including recommendations for each other's trips. They also talk about their admiration for strong women and Greek mythology. Speaker B's kids are excited about the trip to Greece, and they recommend the Parthenon as a must-see attraction.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you have an incredible trip planned! I haven't taken a cruise before, but it does sound like a wonderful way to see all the beautiful Greek islands. I'm sure your kids will have an amazing time exploring all the history and mythology in Greece. Have you started reading up on Athena and the Parthenon for your trip?",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t3",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol",
        "memory_text": "User Description: Speaker A is from Venice Beach and has traveled to 20 countries, despite hating traveling but loving running. They picked up a yodel in their travels and come from a musical background, as their parents met in a high school choir. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, with Speaker B providing motivational speeches and encouragement to Speaker A in their running goals. \n\nEvent Description: Speaker A and Speaker B have shared moments of discussing marathon training, dealing with injuries like a sprained ankle, and planning to run together for the Alps marathon. Speaker A has also shared their love for singing and active lifestyle recommendations for Speaker B when feeling down. Speaker B mentioned missing his family while traveling for work and finding solace in nature and motivational speeches.",
        "speaker": "Speaker B",
        "raw_prediction": " Well, I'll definitely bring my A game, especially since I know how much running means to you. Maybe I can even throw in a yodel or two to really get you motivated! And don't worry about the hot weather, we can find some shaded trails to run on. Let's conquer that Alps marathon together!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t7",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol",
        "memory_text": "User Description: Speaker A is from Venice Beach and has traveled to 20 countries, despite hating traveling but loving running. They picked up a yodel in their travels and come from a musical background, as their parents met in a high school choir. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, with Speaker B providing motivational speeches and encouragement to Speaker A in their running goals. \n\nEvent Description: Speaker A and Speaker B have shared moments of discussing marathon training, dealing with injuries like a sprained ankle, and planning to run together for the Alps marathon. Speaker A has also shared their love for singing and active lifestyle recommendations for Speaker B when feeling down. Speaker B mentioned missing his family while traveling for work and finding solace in nature and motivational speeches.",
        "speaker": "Speaker B",
        "raw_prediction": " Don't worry, I'll make sure the yodeling marathon training sessions are worth it! Maybe we can incorporate some musical elements into our runs to keep things interesting. And hey, if you need a break from the early morning motivational quotes, just let me know. We're in this together, remember?",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t10",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol\nSpeaker B: Yes. We have an iron-clad written agreement. Tell me how I'm doing so far. Is this the most motivated you've ever been in your entire life?\nSpeaker A: No, but that's why I have you.  You're going to push me to do the things I can't bring myself to do.  I'll have more motivation tomorrow.  Today was a long work day.lol\nSpeaker B: I'm going to try a new motivational technique with you. Would you be more frightened by a spider or a snake. I need to know before we meet up this weekend.",
        "memory_text": "User Description:\nSpeaker B travels frequently for work and misses his wife and kids. They hate traveling and feel like it's taking them away from their loved ones. Speaker B is supportive and empathetic towards others, giving pep talks and motivating people to strive through hardships. They have experienced personal struggles with depression and anxiety, which led them to get into motivational speaking. \n\nRelationship Description:\nSpeaker A shows concern and support towards Speaker B, asking about their family and work travels. Speaker A listens attentively to Speaker B's concerns and offers advice when needed. They engage in meaningful conversations and show genuine interest in each other's lives.\n\nEvent Description:\nSpeaker A and Speaker B discuss their running experiences, with Speaker A training for a marathon and Speaker B sharing their past marathon experience. They bond over their love for running and motivate each other to pursue their goals. Speaker A introduces Speaker B to the idea of running together for an Alps marathon, showing a desire to support and motivate them in their running journey. They also share personal stories and struggles, creating a strong connection through their shared experiences. Speaker A's love for singing and yodeling adds a unique and lighthearted element to their conversations, showcasing their diverse interests and personalities.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely understand the struggles of long work days and missing your loved ones. It's tough being away, but remember that you're doing this for them. I'll make sure to keep you motivated and focused on your goals. And don't worry, I'll tailor my motivational techniques to be spider-free for you this weekend!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t2",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?",
        "memory_text": "User Description: Speaker B is kind, caring, and hopeful for group equality. They like camping and hiking, with a favorite trail being the Columbia Trail near home. They have a neighbor named John who sells camping gear and also loves hammocks. Speaker B's dog loves the hammock more than Speaker B.\n\nRelationship Description: Speaker B and the robot have a friendly and collaborative relationship. They enjoy planning hikes, picnics, and discussing camping equipment together.\n\nEvent Description: Speaker B and the robot plan to go hiking this weekend, with Speaker B suggesting a picnic at the top of the mountain. They discuss bringing sandwiches, fruit, water, and even swimming in a lake during their hike. Speaker B shares their preference for veggie sandwiches and their experience with swimming in cold water. Speaker A also mentions a hidden primitive camping spot off the main hiking trail. Speaker B finds it cool that Speaker A plans to buy a hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": " That's fantastic news about the job offer! I hope it's a position that you'll enjoy. By the way, have you had a chance to check out the camping gear that John sells? I remember you mentioning that you were interested in getting a hammock for our next hike.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " If I were to win the lotto, I'd definitely use the money to buy a bigger farm where I can have both a city and country house. It would be the perfect balance for me - some peace and quiet in the country, but still close enough to the city for convenience. I can imagine having a nice little spot where we can listen to blues music and enjoy the fresh air. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t9",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " I can imagine how having a country and city house would be the perfect balance for you. It sounds like a dream come true to have the best of both worlds. I'm sure you'll find a way to make it happen one day. Maybe we can plan a trip to the city together to see a concert and then escape back to the peaceful countryside afterwards.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t11",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music\nSpeaker B: I do love that about the iphone, the ability to mix music. Maybe you will win the lotto and that will help pay for the expense of it.\nSpeaker A: I'll keep trying! Have you had any luck lately?\nSpeaker B: No I haven't! I keep hoping that I will so I can buy my dreamhouse but I know the chances are low.\nSpeaker A: Would you move to the city? It'd be too much for me\nSpeaker B: I would love to be able to have a country house and a city house to be able to come and go to each one as I please. doesn't that sound like a dream come true?\nSpeaker A: It would be convenient for seeing concerts in the city, yes. I'm not used to the business, though\nSpeaker B: Yeah I understand that. Have you listened to any new blues songs lately?\nSpeaker A: I've started a playlist but haven't had time yet. Any recommendations for female blues performers?",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " I have! I recently discovered a talented female blues performer named Bonnie Raitt. Her music is soulful and powerful, you might enjoy it too.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t2",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " I hope so! I miss them so much. The older one is always up for new adventures, but the youngest is more of a homebody. I'm trying to convince him to explore his creative side with programming or writing. Have you been able to convince your sons to try new things as well?",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t4",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " Yes, I am definitely looking forward to meeting her! My son has told me so much about her, especially how passionate she is about cooking. I think we will get along just fine, especially since we share a love for food.",
        "previous_summary": "Speaker A is a family man who loves spending time with his sons.\nSpeaker A has two sons who have been studying abroad in Spain and are going to Italy next.\nSpeaker A has multiple sons, at least one of them is in a relationship with a Spanish girlfriend.\nSpeaker A's sons will be coming for winter break from Europe."
    },
    {
        "utter_id": "e47-s5-t10",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?\nSpeaker A: I'm planning to stay in Spain for three weeks.  Since you live in Portugal, I'd love to stop by for a visit if you're free this coming month.  I've always wanted to visit Lisbon.  It has the world's longest bridge!\nSpeaker B: That'a great idea. We have a holiday house just outside of Lisbon. You are welcome to lodge with us.\nSpeaker A: Sounds great!  I'm already very excited about my trip to Spain, and now I get to visit you in Lisbon!  I need to brush up on my Spanish and also start studying Portuguese.\nSpeaker B: Haha, you've got your hands full then. Portuguese would be easier I believe. Spanish is a bit harder because it is spoken quicker. Would you be travelling with any company?",
        "memory_text": "User Description:\nSpeaker B is a female who loves going places and trying new things. She has two sons, with one loving Chinese food and the other loving Italian food. Speaker B expresses concern about her sons traveling far away and is trying to encourage one of them to get into programming or writing. \n\nRelationship Description:\nSpeaker A and Speaker B plan to meet up during winter break, indicating a friendly and possibly developing relationship. \n\nEvent Description:\nSpeaker A found a great new Chinese restaurant and brought his sons there, who love Chinese food. Speaker A's sons have been studying abroad and are leaving again soon. One of Speaker A's sons has a Spanish girlfriend and they are studying to be chefs. Speaker B's sons will have a surprise party for their thirteenth birthday. Speaker A and Speaker B might go ice skating together during winter break.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you have a fun and exciting trip planned! I'm sure you'll have a great time meeting your son's girlfriend and exploring Spain. It's great that you'll be able to stop by and visit me in Portugal as well. I'm looking forward to showing you around Lisbon and our holiday house. And don't worry about studying Portuguese too much, I can help you with that when you're here. Safe travels!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t4",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?",
        "memory_text": "User Description:\nSpeaker B is from Brazil, specifically from the big city of San Paulo. They have 2 older brothers and 1 younger brother. Speaker B enjoys the city life, live music, street hot dogs with specific toppings, and discovering amazing food. They have a love for Rock or metal music and have seen Three Dog Night in concert. Speaker B is eagerly waiting for bands to announce their summer tour schedule for future plans.\n\nRelationship Description:\nSpeaker B and the robot have engaged in a conversation about music preferences, favorite bands, and upcoming events. The dialogue shows a friendly and casual relationship between the two, with shared interests in music and cultural activities.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with her boyfriend. They also plan to do lots of shopping and enjoy the nightlife in the city, including having refreshing beers by the beach. Speaker B mentions the various types of beaches in São Paulo, showing their knowledge and willingness to share information with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I haven't seen the fireworks at the Disney castle, but it sounds amazing! I'll have to add that to my bucket list. Speaking of concerts, I can't wait for the summer tour schedule to be announced. Hopefully, I'll get to see some of my favorite rock or metal bands perform live.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t5",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?",
        "memory_text": "User Description:\nSpeaker A was born in Brazil and likes going to museums. They used to live in Los Angeles and loved the food there. Speaker A enjoys Disney music and could eat lengua tacos all day, everyday. They think sauerkraut is important. Speaker A has no Profile and Preference information available.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, sharing their love for music and different food preferences. They engage in conversations about their favorite bands and songs, showing a level of comfort and familiarity.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with their boyfriend. They look forward to shopping, enjoying the nightlife, and having refreshing beers by the beach. Speaker B recommends visiting the Museum of Art of São Paulo and mentions the variety of beaches in São Paulo. They also discuss shopping options and bargains in the city.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't seen the fireworks at the Disney castle, but I have been to Disney World in Florida. I love fireworks too. I want to get married on the 4th of July. That way we will have a national holiday and fireworks for us every year! It sounds like you've been to Disneyland? And yes, I can't wait to visit the Museum of Art of São Paulo next week. It's going to be amazing!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t6",
        "current_dialogue": "Speaker A: When is your first music concert this summer?\nSpeaker B: I went to a concert on the fourth of July. It was great. What sort of art museum are you going to?\nSpeaker A: The museum has all sorts of galleries.  It has a sculpture garden outside.  I mostly like the impressionist paintings.  I like Van Gogh.  Was your concert outdoors?\nSpeaker B: Yes. That way they could have a fireworks show too. I love fireworks. Have you ever seen the fireworks at the Disney castle?\nSpeaker A: No, but I have been to Disney World in Florida.  I love fireworks too.  I want to get married on the 4th of July.  That was we will have a national holiday and fireworks for us every year!  It sounds like you've been to Disneyland?\nSpeaker B: No, but I thought you might have since you lived in LA for awhile. Did you get to see any live Disney music performances while you were at Disney World?",
        "memory_text": "User Description:\nSpeaker B is from Brazil, specifically from the big city of San Paulo. They have 2 older brothers and 1 younger brother. Speaker B enjoys the city life, live music, street hot dogs with specific toppings, and discovering amazing food. They have a love for Rock or metal music and have seen Three Dog Night in concert. Speaker B is eagerly waiting for bands to announce their summer tour schedule for future plans.\n\nRelationship Description:\nSpeaker B and the robot have engaged in a conversation about music preferences, favorite bands, and upcoming events. The dialogue shows a friendly and casual relationship between the two, with shared interests in music and cultural activities.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with her boyfriend. They also plan to do lots of shopping and enjoy the nightlife in the city, including having refreshing beers by the beach. Speaker B mentions the various types of beaches in São Paulo, showing their knowledge and willingness to share information with Speaker A.",
        "speaker": "Speaker A",
        "raw_prediction": " That's awesome that you're going to the Museum of Art of São Paulo! It's such a cool place to visit. I hope you enjoy the sculpture garden and the impressionist paintings. And yes, I have been to the beaches in São Paulo. They are so diverse and beautiful. I'm sure you and your boyfriend will have a great time exploring the city and enjoying the nightlife. Let me know if you need any recommendations for places to eat or things to do!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!",
        "memory_text": "User Description:\nSpeaker A is an inventor who is super busy and has suggested starting a band, building a time machine, or becoming a chef. They love trying new food, especially Mexican and seafood dishes like chicken enchiladas, tacos, shrimp shish kabob, baked fish, grilled corn, and stuffed burgers. Speaker A used to foster puppies and is an animal person who loves meeting puppies from history.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and collaborative relationship, with Speaker B showing interest in becoming Speaker A's chef. They discuss cooking different cuisines around the world and share a passion for grilling and trying new food.\n\nEvent Description:\nShared events include Speaker A recommending indoor grilled veggies for fajitas, discussing the drawbacks of working as a chef, and considering a job as a line cook. Speaker B expresses interest in grilling steaks and trying grilled asparagus. They also talk about the impact of their jobs on their social lives and consider switching careers to gain free time.",
        "speaker": "Speaker B",
        "raw_prediction": " Well, I do love puppies because they are just so adorable and always bring a smile to my face! They remind me of all the fun times I had when I used to foster them. But you know what would be even cuter? A puppy-themed food truck serving up puppy-shaped treats for all the dog lovers out there!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t9",
        "current_dialogue": "Speaker A: A new cat arrived at the shelter. He is very cute, but not cuter than puppies!\nSpeaker B: Why do you like puppies so much?  What's so different about kittens and puppies?  Aren't they just both babies?  \nSpeaker A: Yes but puppies are just so cute with their beady eyes and always wagging their tails and following you everywhere!\nSpeaker B: You have a point.  It is nice to see puppies wagging their tail and just following you!  Changing topics, do you have any recipes with asparagus?  You know, it's such a popular vegetable, but I just don't know how to prepare it.\nSpeaker A: I don't have recipes but I know how to make a good grilled asparagus. Are you looking to bolster your chef book?\nSpeaker B: I sure am!  Grilled asparagus does sound good.  Do you pair the grilled asparagus with your fajitas?  What do you prefer, chicken or beef fajitas?\nSpeaker A: I prefer chicken to beef. I pair it with beef fajitas andI think it's great to have with a glass of merlot. Do you like wine?\nSpeaker B: You're making me hungry!  Yes, I do love wine.  As a matter of fact, I used to live in the Bordeaux region in France, so my favorite wine is Bordeaux wine.  But I also love champagne and cognac.\nSpeaker A: Haha, I know right? I lived in the Champagne region for a bit! Always wanted to go to Bordeaux. How was it there?",
        "memory_text": "User Description:\nSpeaker A is an inventor who is super busy and has suggested starting a band, building a time machine, or becoming a chef. They love trying new food, especially Mexican and seafood dishes like chicken enchiladas, tacos, shrimp shish kabob, baked fish, grilled corn, and stuffed burgers. Speaker A used to foster puppies and is an animal person who loves meeting puppies from history.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and collaborative relationship, with Speaker B showing interest in becoming Speaker A's chef. They discuss cooking different cuisines around the world and share a passion for grilling and trying new food.\n\nEvent Description:\nShared events include Speaker A recommending indoor grilled veggies for fajitas, discussing the drawbacks of working as a chef, and considering a job as a line cook. Speaker B expresses interest in grilling steaks and trying grilled asparagus. They also talk about the impact of their jobs on their social lives and consider switching careers to gain free time.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so cool that you used to live in the Champagne region! I've always wanted to visit there. Bordeaux must have been amazing with all the beautiful vineyards. Maybe we can plan a trip there together someday and try all the different wines they have to offer.",
        "previous_summary": null
    }
]