[
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Speaker A: I forgot to ask if you've purchased your plane tickets yet?\nSpeaker B: Yes, I'm going to Costa Rica! Have you ever been there?",
        "memory_text": "User Description:\nSpeaker B is a 29-year-old individual who enjoys experimenting with hair colors and styles. They recently dyed their hair with henna and are considering trying out semi-permanent dye. Speaker B also mentioned embracing new hair colors and joked about the possibility of dyeing their hair grey. They seem to have a playful and creative side, as indicated by their interest in different hair colors and styles. Speaker B also received a new black car from their mom, showing a close relationship with their family. Additionally, Speaker B enjoys spending time in nature and is excited about spring break.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, share a friendly and engaging relationship. Speaker A joked about getting old and having grey hair, which led to a humorous conversation about hair dyeing and different hair colors. Speaker B suggested a semi-permanent dye for Speaker A, showing a caring and helpful attitude towards them. The dialogue between Speaker A and Speaker B indicates a level of intimacy and mutual understanding in their relationship.\n\nEvent Description:\nIn their conversations, Speaker A and Speaker B discussed various events and shared experiences. Speaker A asked their grandkids to help dye their hair turquoise, with Speaker B expressing support for this idea. Speaker A's youngest grandkid, who is interested in hairdressing, participated in the hair dyeing process. Speaker B also mentioned buying a red VW Tiguan and recommended a book for a beach visit. The dialogue between Speaker A and Speaker B included discussions about family members, hair dyeing, and shared interests, creating a bond between the two speakers.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I haven't been to Costa Rica yet, but I can imagine all the vibrant colors and nature there must be so inspiring for my next hair dye experiment! Maybe I'll come back with some tropical-inspired hues to match the scenery.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t1",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great playlist! I'm excited for our meetup this weekend. I can't wait to try out the fun music by the pool and dive into our programming studies with some steady tunes. And of course, pizza burgers are always a good idea. Looking forward to our swimming lessons too - maybe one day we'll be cruising in the Caribbean together!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you ",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so kind of you to offer swimming lessons! I'm really excited to learn from you. And I can't wait to enjoy the punk music and programming studies with you this weekend. It's going to be a great time!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t4",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " Thanks for offering to teach me how to swim, I really appreciate it. Maybe after I learn, we can plan that cruise we've been talking about. I'll bring some pizzaburgers for us to enjoy on the deck!",
        "previous_summary": "Speaker A enjoys cruising and has a favorite club in school.\nSpeaker A knows how to swim since the age of 5.\nSpeaker A has planned a cruise to the Caribbeans.\nSpeaker B is afraid of cruises because they can't swim.\nSpeaker A is not nervous about going on a cruise.\nSpeaker A recommends hiking and exploring the local area for those who can't swim.\nSpeaker A and Speaker B discuss the potential of getting on a cruise ship together.\nSpeaker A plans to travel to the Caribbean for their next trip.\nSpeaker A offers to teach Speaker B how to swim and programming."
    },
    {
        "utter_id": "e1-s5-t5",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad you're open to trying new experiences like going on a cruise with me. It's going to be a great time in the Caribbean. I think you'll enjoy the adventure and relaxation it has to offer. Plus, we can have some pizza burgers on board!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t6",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.",
        "memory_text": "User Description:\nSpeaker B is a shipping clerk at a warehouse, working 15 hours a week. They enjoy watching swimming movies and their favorite food is pizzaburger. Speaker B dislikes swimming. Their profile includes information about their occupation, likes, and favorite food.\n\nRelationship Description:\nSpeaker B and Speaker A have discussed various topics such as cruising, programming, swimming, and food preferences. Speaker B is supportive of Speaker A's new job and appreciates the welcoming environment at work. They have agreed on a deal to learn swimming and programming together.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include planning a cruise, discussing fears related to cruises, Speaker A's first day at a new job in computer programming, planning snorkeling trips, discussing the cure for fears through immersion, and making plans to meet up next weekend for swimming and programming lessons. Speaker B enjoys eating pizzaburgers when stressed and is interested in learning programming. Speaker A finds their job rewarding but tedious and offers to teach Speaker B programming. Both speakers bond over their shared interests in swimming, programming, and food preferences.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really looking forward to our meetup this weekend. I may not be the best swimmer, but I'm excited to learn. And thanks for offering to teach me. Maybe after our swimming and programming lessons, we can grab some pizzaburgers together. I could use a stress-reliever after all the swimming practice!",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t9",
        "current_dialogue": "Speaker A: Okay I made a playlist for our meetup this weekend. It's all punk music, but I have an hour of fun music for the pool and more steady music for our programming studies. It's going to be fun!\nSpeaker B: That sounds great to me.  Hope I'm able to learn to swim. \nSpeaker A: I can teach you! I have taught quite a few people so I'll help you \nSpeaker B: I would really appreciate that. Maybe I could go on one of your next cruises.\nSpeaker A: Yeah, that would be great. I'm excited about going to the Carribean. I've never been. Have you?\nSpeaker B: No, I have not.  I've not been outside the US, but would love to go .Let me know how you like it.\nSpeaker A: I will! Is there a city you like to visit nearby while cruising in your car?\nSpeaker B: Yes, there are several. Hope we could meet and You possibly teach me about computer programming.\nSpeaker A: That would be great too. I like to program in several different languages. Do you have a preference?",
        "memory_text": "User Description:\nSpeaker A is a computer programmer who enjoys adventure and travel, particularly on cruises. They have a loving workplace culture and find swimming to be a relaxing activity. Speaker A also likes pizza and cube steak. They can be nervous at times but finds swimming and programming to be rewarding and relaxing activities.\n\nRelationship Description:\nSpeaker B is interested in learning programming from Speaker A and is willing to join them in swimming lessons. They share a love for punk music and pizzaburgers. Speaker B appreciates the welcoming environment at Speaker A's workplace and is open to trying new experiences like going on a cruise.\n\nEvent Description:\nSpeaker A and Speaker B plan to meet up next weekend and enjoy punk rock music and pizza burgers. They will also have programming lessons and swim time together. Speaker A is excited about their upcoming trip to the Caribbean and is looking forward to teaching Speaker B how to swim. Speaker B may overcome their fear of water to join Speaker A on a cruise in the future.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm really looking forward to our meetup this weekend! I can't wait to learn more about programming from you and maybe even try swimming. And cruising in the Caribbean sounds amazing, I hope I can join you on one of your adventures in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t1",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm definitely excited to see the outcome of the cloning project in the lab! It's amazing how far science has come. I'll have to make sure to celebrate with a burger after a run while listening to some music, it really helps me relax after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Speaker A: Are you planning on continuing to work in the lab when they clone the cow? That's really exciting!\nSpeaker B: I really want to. If classes are too hard though, I will have to quit. I will still keep in touch with them! Would you eat a hamburger from a cloned cow?\nSpeaker A: Awww, don't quit if classes get too hard.  You seem like a really intelligent person. Honestly, I wouldn't knowingly eat a hamburger from a cloned cow, but I'm sure at some point we won't know the real source of where our beef is coming from.\nSpeaker B: Thanks for the encouragement! You wouldn't eat a cloned one, but would you try a Beyond burger or plant-based version? Some people say they taste really similar, but I never thought they tasted the same.\nSpeaker A: I think I would try a plant based burger.  I don't find anything wrong with plants, and it's worth trying for the experience alone.  I'm jut not familiar with the cloning process.  Although I think it is cool and interesting, I just don't know enough about it to say I want to eat anything from a cloned animal.",
        "memory_text": "User Description: Speaker A is a high school student who is going to college, has achieved straight A's, runs a lot, likes burgers after a run, listens to music on weekends, finds listening to music like meditation, and needs music to stay sane. Their parents are blue collar workers, with their dad working long hours in factories. \n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing topics like getting a dog, dogs with hearing issues, and sharing meals like hamburgers and ham soup.\n\nEvent Description: Speaker A and Speaker B have engaged in conversations about getting a dog, discussing the challenges of having dogs with hearing issues, sharing meals like hamburgers and ham soup, and joking about trying a casserole invented by Speaker B. Speaker B has also shared information about their night job cooking hamburgers and feeding lab rats at a research lab.",
        "speaker": "Speaker B",
        "raw_prediction": " I completely understand where you're coming from. It's important to prioritize your studies. And I agree, plant-based burgers are a great alternative. I'll have to try one soon! And speaking of trying new things, have you heard any interesting songs lately that you can recommend? Music always helps me relax after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t10",
        "current_dialogue": "Speaker A: I would tell about my progress of planning my trip to Sweden.\nSpeaker B: How is the trip to Sweden going anyways?\nSpeaker A: I am still in the planning stages, since my cousin lives over there, she is helping me to plan it. Any must sees while I am there?\nSpeaker B: It really depends! Personally, I love the castles! Visby is probably my favorite spot. \nSpeaker A: Okay, I will see if there are any castles near where we will be. Do you have any plans to go back to sweden?\nSpeaker B: Not in the near future, but I'm hoping to get back next summer. I love hitting up all the local beach spots with my old friends.\nSpeaker A: That sounds nice! So how is your job going?\nSpeaker B: Always interesting, that's for sure! I have been training to nurse on a new floor, so that'll give me a change of scenery.\nSpeaker A: Does that add a lot of extra work to your plate?\nSpeaker B: At the moment, yes. I'll be in Pediatrics, which has always been my passion. It's a completely different environment than the ER.",
        "memory_text": "User Description:\nSpeaker B is originally from Sweden and currently works in the medical field at a hospital in the United States. They moved to the US for a job opportunity after university, attracted by the great job prospects and the warmer climate compared to Sweden. Speaker B enjoys attending church, playing tennis, and taking coffee breaks. They have a flexible work schedule that allows them to pursue their hobbies and spend time with their family.\n\nRelationship Description:\nSpeaker B has a close relationship with Speaker A, as they discuss personal memories, share travel plans, and talk about their interests. Speaker B misses Sweden and their family back there, while Speaker A considers taking on a second job to save money and visit Speaker B's cousin in Sweden. They exchange recommendations for cool spots to visit and share a love for coffee shops and music.\n\nEvent Description:\n1. Speaker B attends a small Methodist church and enjoys Sunday School for kids.\n2. Speaker B moved to the US for job opportunities and found a great fellowship at the hospital, which allows flexibility for hobbies like tennis.\n3. Speaker A's cousin moved to Sweden and loves it there, sparking conversations about visiting and memories of the country.\n4. Speaker B shares an interest in good coffee, chocolates, Swedish dance music, and American hip hop with Speaker A, who is a fan of jamband music and classic reggae.\n5. Speaker B and Speaker A discuss ways to save money for travel and reminisce about their favorite things in Sweden and the US.",
        "speaker": "Speaker A",
        "raw_prediction": " The job is going well, thanks for asking! I've been training to work in Pediatrics, which is a big change from the ER. It's definitely adding some extra work to my plate, but I'm really excited about the opportunity to work in an environment that aligns with my passion for helping children. Plus, it gives me a chance to have a different kind of impact in the hospital.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t3",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.",
        "memory_text": "User Description:\nSpeaker A is a city dweller who prefers rock music, enjoys pilates, and goes through a novel each week. They have a brother and have a preference for sci-fi books but have been craving a good mystery recently. Speaker A also liked Harry Potter and political books growing up.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing book recommendations and discussing their preferences in genres like fantasy and mystery. They also exchange thoughts on different authors and series, showing a level of intimacy in their conversations.\n\nEvent Description:\nSpeaker A finished their most recent book and is looking for their next read, with Speaker B suggesting Dan Brown's 'Da Vinci Code' series as thrilling mysteries. Speaker A has read all of Dan Brown's books and enjoys how he breaks down puzzles to keep readers engaged. They also share memories of reading Redwall by Brian Jacques and discuss their favorite books growing up and views on today's political climate. Additionally, Speaker A recommends Game of Thrones by George R R Martin to Speaker B, with discussions about the books being better than the TV show. They also talk about Pilates and exercise preferences, as well as music and audiobooks. Speaker A starts the next book in the Game of Thrones series, while Speaker B plans to re-read the Dark Tower series and continues to work on new art pieces.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a lovely walk along the river! I can picture the scenery now. Have you thought about bringing a mystery novel with you on your next hike? It could add an extra element of excitement to your adventure. Speaking of mysteries, have you read any Agatha Christie lately? Her stories always keep me on the edge of my seat!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " No, I didn't bring a pet this time. But I can imagine how peaceful it must be to do the harder trails with your dog. Nature walks are definitely a great way to get away from everything and find some inspiration. I'm glad you enjoy them with your furry companion!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t6",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear that you enjoyed your nature walk! I can definitely relate to finding inspiration in nature. I actually just finished re-reading the Dark Tower series, and it always helps me get in the right mindset for my artwork. It's a shame you don't have a pet to accompany you on your walks, but I understand your concerns about space and time. My Australian Kelpie is a rescue, and she brings so much joy and energy to my outdoor adventures. She's really smart too, always keeping me on my toes!",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Speaker A: I just went on a great nature walk that I think you would like.\nSpeaker B: That's great! Where did you go on your walk?\nSpeaker A: There is a river a few towns over, so I did the easy trail that follows along it. There is a harder trail that winds over some hills, but I wasn't feeling that adventurous.\nSpeaker B: That sounds amazing! Did you bring a pet? I love doing the harder trails with my dog. Sometimes, it's very peaceful to get away from everything.\nSpeaker A: No, I don't have any pets; my apartment seems too small for a dog and I would worry about them being lonely all day when I'm at work. I was thinking about getting a pair of cats, but I haven't committed yet. How nice fo ryou to have company when you're walking though! What kind of dog do you have?\nSpeaker B: Cats can be nice! I used to have cats, but am allergic to them and had to give them to my friend. I have an Australian Kelpie who is a rescue. She is very energetic and smart!\nSpeaker A: I had cats as a child and I think that they're a bit easier to care for than dogs, especially in the city. I am a dog lover as well though; Australian Kelpies are gorgeous! What is her name? Does she walk well off-leash?\nSpeaker B: Yes, cats are very smart and clean. Mine used to bring me a mouse to throw for her, just like a dog! And if you have 2 cats, they play with each other! Mine would run up and down the halls in the middle of the night, haha. Her name is Kyrie, and she walks off leash and is very obedient. Dogs might be hard to keep in your small apartment though, since Kyrie likes to play in the field, run with cars along the fence row, and herd goats. ",
        "memory_text": "User Description:\nSpeaker B is a country dweller who enjoys walking through nature, listening to country and rock music, and working with animals. They have a somewhat strained relationship with their brother and sister. Speaker B's mother is a nurse, and their father is a farmer. They find inspiration in nature walks and require absolute silence for reading to find their muse.\n\nRelationship Description:\nSpeaker B and Speaker A share a mutual interest in fantasy books and music. They engage in conversations about their reading preferences, new music recommendations, and their creative processes. Speaker A recommends books like the Game of Thrones series to Speaker B and expresses enthusiasm for sharing their hobbies and interests.\n\nEvent Description:\nSpeaker B and Speaker A discuss their reading lists, music preferences, and creative projects. Speaker A shares their excitement about starting a new book in the Game of Thrones series and recommends a new album by Highly Suspect. Speaker B talks about re-reading the Dark Tower series and shares their experience with finding inspiration during nature walks. They both appreciate each other's recommendations and insights into their respective hobbies. Speaker B updates Speaker A on their latest artwork and eagerly awaits their next source of inspiration.",
        "speaker": "Speaker A",
        "raw_prediction": " It's so important to have that escape, especially with your busy schedule. I'm glad Kyrie can provide you with that companionship and adventure. Maybe one day I'll join you on one of your nature walks, with or without my future cats!",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t4",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?",
        "memory_text": "User Description: Speaker B is a doctor working at a doctor's office who loves fishing and spending time near the ocean. They prefer fishing over math and listen to Sublime a lot when relaxing on the beach. Speaker B caught a huge trout and enjoys being near the ocean.\n\nRelationship Description: Speaker B offers to teach Speaker A everything they know about fishing, showing a willingness to share their interests and knowledge with the robot. Speaker A decides to take Speaker B up on the offer, indicating a growing bond between the two.\n\nEvent Description: Speaker A's band booked a concert in Denver, and Speaker B expresses interest in watching them play. Speaker A's band has toured Italy and Uzbekistan, facing dangers like kidnapping and shooting. Speaker B loves cooking Italian food and is passionate about cooking, while Speaker A struggles with cooking and is allergic to strawberries. Speaker B imagines the life of being in a band can be dangerous and tiring but worth it for the experience. Speaker B and Speaker A plan to go fishing together, with Speaker B suggesting trying to catch trout.",
        "speaker": "Speaker A",
        "raw_prediction": " I may not play an instrument, but I do love listening to rock music, especially Aerosmith. It's great to unwind and relax by the ocean while listening to music like Sublime. I caught a huge trout recently while fishing, and I'd love to teach you everything I know about fishing. Maybe after our fishing trip, we can cook up some Italian food together and talk more about your band's adventures in Italy and Uzbekistan. Let's plan our fishing trip and enjoy some quality time by the water.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t11",
        "current_dialogue": "Speaker A: What instrument do you play? \nSpeaker B: I don't know play instrument. Only  I enjoy rock music.\nSpeaker A: ah right, who's your favourite rock band?\nSpeaker B: I'm big fan of aerosmith. When do you learn music. Whom teach you?\nSpeaker A: aerosmith are great, have you ever seen them live? I have been playing drums since i was a kid, my father taught me when I was young and from then on I just taught myself\nSpeaker B: That's awesome! I have been trying to learn last one year. Still I didn't get right teacher. I'm jealous on you. I don't have like your dad.\nSpeaker A: what instrument have you been trying to learn?\nSpeaker B: Piano is my favorite instrument. When try play my mind was mesmerizing. How do you learn surfering?\nSpeaker A: I learnt to surf from one of my good friends, he surfed in a number of competitions and did very well. Would you like to learn to surf if you had more time?\nSpeaker B: Yes, I would like to learn surfing with my friends at weekend. But my friends didn't have interesting on surfing.\nSpeaker A: That's a shame, I'm sure you could find a club to surf with at a local beach. Have you been out fishing recently?",
        "memory_text": "User Description:\nSpeaker A, also known as Frank, grew up in California on the beach. He is in a band where he plays the drums and writes music. Frank is good at writing and his favorite activity is morning surfing. He loves the band Sublime and wants to see them live. His dad owns a surf shop and he is called \"lil fishie\" by Speaker B.\n\nRelationship Description:\nSpeaker A and Speaker B have a close relationship where they share a love for music, surfing, and fishing. Speaker B works in a doctor's office and enjoys loud music as a break from work. They have a mutual respect for each other's interests and hobbies.\n\nEvent Description:\nSpeaker A booked a concert in Denver and Speaker B wants to watch him play. Speaker A caught a small fish while Speaker B caught a huge trout. They both enjoy fishing and are planning to go fishing together. Speaker A's band has toured various countries and encountered dangerous situations, but Speaker B supports his passion for music. Speaker A is allergic to strawberries while Speaker B loves Italian food and cooking. Speaker A's band has a following in Italy and they have toured Uzbekistan, Central, and South America. Speaker B values the experiences gained from traveling on the road with the band.",
        "speaker": "Speaker B",
        "raw_prediction": " I haven't been fishing recently, but I remember the last time we went fishing together and how you caught that huge trout! It was such a fun day. I'm sure we'll have more fishing adventures in the future. Speaking of music, I can't wait for you to see me play in Denver at the concert I booked. It's going to be an amazing experience, just like the time we went surfing together.",
        "previous_summary": "Speaker B loves fishing and spending time near the ocean, but doesn't have time to surf anymore due to working at a doctor's office.\nSpeaker B is looking forward to taking a break from work and going fishing.\nSpeaker B caught a huge trout almost a meter long that bit their hand.\nSpeaker B finds fishing easier than surfing, but is interested in trying surfing."
    },
    {
        "utter_id": "e7-s5-t7",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done",
        "memory_text": "User Description:\nSpeaker A is a librarian with three children, who are now grown up and have kids of their own. Speaker A loves playing the flute but it is not their profession. They feel that kids nowadays do not read enough and have seen libraries change over the years.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, discussing personal and professional experiences. They seem to have a level of intimacy that allows them to share stories about their families and interests.\n\nEvents Description:\n1. Speaker A spent time with kids while Speaker B went to the park.\n2. Speaker B cherishes moments with family while Speaker A's work keeps them away from kids.\n3. Speaker B's mom was a librarian, and Speaker A finds their work rewarding.\n4. Speaker A and Speaker B discuss how libraries are evolving with new technologies to engage kids.\n5. Speaker A teaches their youngest child the flute, while Speaker B took their grandkids fishing. They plan an annual fishing trip together.",
        "speaker": "Speaker B",
        "raw_prediction": " Work at the library is still busy and demanding, but I find it rewarding to see kids engage with books and technology. I've been teaching my youngest child how to play the flute, it's a nice break from the chaos at work. How was your fishing trip with the grandkids?",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t11",
        "current_dialogue": "Speaker A: Do you use technology like text messaging to interact with your grandkids?\nSpeaker B: No I can't get my head round it, I much rather a good ol fashioned phone call!\nSpeaker A: I have had to learn just to keep in touch with my family because of my hours at my job. It is not easy, I understand.\nSpeaker B: Well thankfully I don't have that problem these days, I get to spend some great time with my grandkids. Have you thought any more about the idea of our annual fishing trip? \nSpeaker A: Yes, I think you should start planning this with your family and try and do different locations every year so that it changes up the scenery\nSpeaker B: Yes I think that's a great idea, how is work at the library? \nSpeaker A: Busy, and demanding because we are short staffed. While there seems to be little need for a library these days, I find that we have less staff to get everything done\nSpeaker B: Well if you ever need someone to come and help for a couple of hours here and there, give me a call, you know how much I love to be in the library anyway\nSpeaker A: I will keep that in mind as we do have volunteer hours available. How is your family doing these days?\nSpeaker B: Well I would be happy to help. My family are all great thank you for asking I took the grandkids to the park again we had a great time. How's your family doing? \nSpeaker A: They are good. I wish I coudl spend more time with them but my job is keeping me busy. I do hope they take up some hobbies that involve the outdoors or something more creative.",
        "memory_text": "User Description:\nSpeaker A is a librarian with three children, who are now grown up and have kids of their own. Speaker A loves playing the flute but it is not their profession. They feel that kids nowadays do not read enough and have seen libraries change over the years.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and casual relationship, discussing personal and professional experiences. They seem to have a level of intimacy that allows them to share stories about their families and interests.\n\nEvents Description:\n1. Speaker A spent time with kids while Speaker B went to the park.\n2. Speaker B cherishes moments with family while Speaker A's work keeps them away from kids.\n3. Speaker B's mom was a librarian, and Speaker A finds their work rewarding.\n4. Speaker A and Speaker B discuss how libraries are evolving with new technologies to engage kids.\n5. Speaker A teaches their youngest child the flute, while Speaker B took their grandkids fishing. They plan an annual fishing trip together.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear that your family is doing well and that you had a fun time at the park with your grandkids. My family is good, thank you for asking. I wish I could spend more time with them, but work keeps me occupied. I've been trying to get my youngest interested in playing the flute, it's something I really enjoy. It's nice to see how our families are growing and changing over the years.",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t2",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that the portrait is coming along well! As for the little furries, they are all doing great. I must say, painting your great dane next to your pet rat sounds like quite the unique idea! As for getting a new cat, I'm actually thinking of adopting one from a local shelter. Rescuing pets is really important to me.",
        "previous_summary": "Speaker B is in college, paints on the side, and has five dogs and three rats.\nSpeaker B has 5 dogs of different breeds and has rats as pets but didn't include them in the portrait.\nSpeaker B has five dogs and enjoys taking them to the park.\nSpeaker B is working on other portraits and taking care of a sick dog.\nSpeaker B likes Persian cats and imagines their pets having interesting interactions."
    },
    {
        "utter_id": "e8-s5-t4",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? ",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that you are considering getting a cat from a shelter. It's always heartwarming to give a home to a pet in need. As for the name, I'm thinking of naming my new cat Luna, after the moon. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t6",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.",
        "memory_text": "User Description:\nSpeaker B is a college student who enjoys reading coupon books to find the best deals, taking walks at sunset in the city, and painting on the side. They are skilled at creating family portraits, with portrait prices starting at $5000. Speaker B has a total of five dogs and three rats, with a preference for painting regular people and dogs, while disliking rats.\n\nRelationship Description:\nSpeaker B suggests painting Speaker A and Speaker A's brother, showing a desire to capture the bond between them. Speaker B expresses excitement for painting Speaker A and his brother, emphasizing the importance of family in the portrait.\n\nEvent Description:\nSpeaker B is working on a portrait for Speaker A, showcasing their dedication to capturing the essence of the relationship. Speaker A expresses sympathy for Speaker B's sick dog, leading to a conversation about pets. Speaker B mentions getting kittens, with Speaker A expressing excitement and discussing the importance of rescuing pets. The dialogue highlights the bond between the user and the robot, centered around their shared love for pets and family.",
        "speaker": "Speaker A",
        "raw_prediction": " I totally understand about the names, it can be tough to decide. As for pilates, it's not too difficult, especially if you start with beginner classes. You should give it a try, I think you'll enjoy it!",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t11",
        "current_dialogue": "Speaker A: The portrait you ordered is coming along swimmingly! How are the little furries doing?\nSpeaker B: They are doing well. I think I am going to paint a portrait of my great dane standing next to my pet rat lol. Do you know where you want to get your new cat from?\nSpeaker A: Someone I work with at the dog daycare works at a shelter.  I think I will go there.\nSpeaker B: That's great. I have gotten my pets from the shelter and they seem happy I brought them home. I have a hard time saying no to them which is why I have so many pets. Cats are easier to take care of than dogs. Do you have a name in mind for your cat? \nSpeaker A: I've thought of a lot of  names, but in the end it will probably depend on the breed and the sex.  \nSpeaker B: That's true. Is pilates hard? I've always wanted to try it but I don't know if it will be too difficult.\nSpeaker A: No, I don't think it's hard.  I actually enjoy it.  It's more fun than work, at least to me. You should give it a try!\nSpeaker B: Maybe I will. Do you think I can start at home by watching Youtube videos, or do I need to go to a Pilates class?\nSpeaker A: You can probably start with Youtube just to see if you like it.  Much better to go to a class I think though.  Of course, I'm biased. I'm in love with my instructor! haha\nSpeaker B: Lol, okay I will definitely try it at home first. If I can get the hang of it, I will sign up for a class. Hopefully I can get an instructor as good as yours lol! \nSpeaker A: Well, getting some individual responses to questions and individual attention at times, I think makes a difference. But there is nothing wrong with going to youtube first!  I did!",
        "memory_text": "User Description:\nSpeaker A is an individual who finished a novel and reads about one novel a week, lives in the city, walks a lot, especially to work, has a pilates class as their favorite activity, and has an only brother. They might have $5000 in the petty cash drawer.\n\nRelationship Description:\nSpeaker A is excited about a portrait being painted by Speaker B and hopes the interest in painting keeps up. Speaker B is looking forward to painting for Speaker A and has more professionals asking to paint for them. Speaker A congratulates Speaker B on painting for Elton John.\n\nEvent Description:\nSpeaker A is frustrated when animals are sick and hopes the vet helped the sick dog. Speaker B's rats look worried for the sick dog, and Speaker B believes the sick dog will be fine. Speaker A is getting kittens from a shelter and thinks it's important to rescue pets. Speaker B is taking care of a sick dog and would get a Persian cat if possible. Speaker A is also getting more than one kitten to play with each other. Speaker B thinks Speaker A will love the cute fur balls and believes getting a cat would be like a Tom and Jerry scene in the house.",
        "speaker": "Speaker B",
        "raw_prediction": " That's a good point. I'll definitely consider signing up for a class. Thanks for the advice, I really appreciate it!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t4",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?",
        "memory_text": "User Description:\nSpeaker B is a music lover who enjoys old bands like Styx and Journey. They have a close relationship with their grandchildren, who sometimes fight with each other. Speaker B also loves the beach and Mediterranean food. \n\nRelationship Description:\nThe relationship between Speaker B and Speaker A seems casual and friendly, with Speaker B showing interest in Speaker A's work schedule and enjoying conversations about concerts and music preferences.\n\nEvent Description:\nSpeaker A had a fire incident at the restaurant but managed to put it out, feeling scared during the incident. Speaker A expressed a lot of responsibility in such moments. Speaker B attended an Aerosmith concert and was impressed by the performance. Speaker A also mentioned going to a concert this week and wanting to go rock climbing with Speaker B. Speaker B asked about free meals at the restaurant where Speaker A works and found it to be a great perk. Speaker A prefers the free meals over just a discount. Speaker A enjoys working at the restaurant and interacting with people.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm not sure if I'll get a free dessert, but I hope so! I could use a sweet treat after trying out the new dish. By the way, I heard that Styx is coming to town next month. Would you be interested in going to the concert with me?",
        "previous_summary": "Speaker A works at a restaurant and invited Speaker B to visit.\nSpeaker A works at a restaurant and gets two free meals per week, along with taking home leftover baked goods."
    },
    {
        "utter_id": "e10-s5-t11",
        "current_dialogue": "Speaker A: I'm pretty excited! They just added one of my favorite dishes to the menu at work. I can't wait for my next shift so I can try it for free. I will send you a pic later, ok? \nSpeaker B: Okay, yes, please send me a pic as soon as you can. I can't wait to see it. What is the name of the dish?\nSpeaker A: It's a Chicken parmesan, with a red pepper marinara. It's so crisp and juicy-I love it! They serve it with these sweet roasted asparagus!\nSpeaker B: Oh that sounds absolutely fabulous. Are you going to get a free dessert, as well?\nSpeaker A: Yes, I am thinking about trying either the new eclairs, or their tres leches cake with fresh raspberry jam sauce and lemon drizzle! I have too many good options to pick from! What one would you pick?\nSpeaker B: Hands down, I would pick the tres leches. Ever since I tried it a few years ago, it has always been my favorite dessert.\nSpeaker A: Okay, I will try that! I've heard the can be made with different fruits. Did you have fruit with yours?\nSpeaker B: I like it best with fresh strawberries. And then it is even better with some fresh whipped cream and chocolate drizzle. Just thinking about it is making me want to have some right now!\nSpeaker A: Ooh, that sounds delicious! It's a rich and moist cake, so I don't think it should have too much chocolate. I've seen brown sugar and caramel versions too!\nSpeaker B: Oh I've never seen that version. That sounds scrumptuous. Tonight I'm going to bake some oatmeal raisin cookies.\nSpeaker A: That sounds great! I love a good oatmeal raisin cookie with the right amount of cinnamon! My brothers don't like them though, haha. They call them the \"vegetable of cookies\" :)",
        "memory_text": "User Description:\nSpeaker A is a restaurant worker who loves taking long walks on the beach, rock climbing, and listening to the band 21 pilots. Speaker A is an omnivore who enjoys interacting with people and has a resilient attitude towards challenging situations. Speaker A has grandchildren and is knowledgeable about different music genres, including Kpop and classic rock bands like Aerosmith.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and engaging relationship, discussing topics ranging from music preferences to family interactions. They show mutual interest and respect for each other's experiences, with Speaker B expressing admiration for Speaker A's work ethic and Speaker A appreciating Speaker B's family dynamics.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include moments of bonding over music, such as attending concerts and discussing favorite songs. They also share personal experiences, like dealing with a fire at Speaker A's restaurant and spending time with grandchildren. Speaker A educates Speaker B about different music genres, while Speaker B jokes about teleporting to a concert and admires the perks of working at a restaurant. Overall, their interactions are filled with warmth, humor, and shared interests.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to see the picture of the Chicken parmesan dish! It sounds amazing. And I agree, the tres leches cake with fresh raspberry jam sauce and lemon drizzle is a fantastic choice. I've never tried it with strawberries, but that sounds delicious. Maybe I'll have to give it a try next time I'm at the restaurant. And those oatmeal raisin cookies you're baking sound like the perfect treat to enjoy while listening to some 21 pilots music. Your brothers don't know what they're missing out on!",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t9",
        "current_dialogue": "Speaker A: Have you studied other martial arts as well?\nSpeaker B: I haven't! Just karate! Have you been thinking of taking some classes?\nSpeaker A: I want to take some martial art classes at school next year. What do you sggest I try?\nSpeaker B: I mean I always recommend Karate since that's what I study! I can bring you by the dojo sometime if you want to see what it is like. \nSpeaker A: OMG!! That would be so awesome, Yes please.  When is a good time for you?\nSpeaker B: Awesome! Tomorrow afternoon anytime between 3-6 would work for me!\nSpeaker A: Perfect. I will meet you at the Dojo at 3pm. I really appriciate it, and I will buy you lunch after too. \nSpeaker B: That's great! I can bring some guest passes to the pool I lifeguard at as well! I'm working this weekend if you want to come when I am working. Where do you want to eat?\nSpeaker A: I defiantly will. As well a bucket of sunscreen, safety in the sun first.  I was thinking that new sandwhich shop by the collage that just opened, what do nyou think? ",
        "memory_text": "User Description:\nSpeaker A is a marketing student who loves seafood and foreign language movies. They are passionate about creating ads for movies and see a future in IT and AI. Speaker A enjoys learning new languages regularly and has a particular interest in French and Spanish. They recently watched and recommended the movie \"The Life Ahead\" featuring Sophia Lauren. Speaker A is ambitious and driven towards their career goals.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, sharing movie recommendations and discussing their respective interests. Speaker B shows interest in Speaker A's preferences and activities, asking questions and engaging in conversations about movies, seafood, and education.\n\nEvent Description:\n- Speaker A ordered a big seafood platter and recommended a movie to Speaker B.\n- Speaker B thanked Speaker A for the movie recommendation and mentioned their interest in karate and IT work.\n- Speaker A went to the beach and tanned, while Speaker B mentioned their love for the ocean and water activities.\n- Speaker A recommended clams from Quebec and is taking French classes, while Speaker B signed up for classes at the local college.\n- Speaker B and their girlfriend attend every home football game, benefiting from their football background in studying karate.",
        "speaker": "Speaker B",
        "raw_prediction": " That's awesome! I haven't seen that movie yet, but I'll definitely check it out. I'm glad you're interested in karate, it's such a cool martial art to learn. Let's grab lunch at the new sandwich shop by the college after our visit to the Dojo tomorrow. And I'll bring those guest passes to the pool as well!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t2",
        "current_dialogue": "Speaker A: Have you talked to your advisor about your career options? Teaching is probably a good idea since it is a more guaranteed job.\nSpeaker B: Yes, I did talk to my advisor and it was very stressful. Deciding my whole life when I am really unsure! But I think I will get into teaching, it is a stable career.",
        "memory_text": "User Description:\nSpeaker B is an amateur soccer player who enjoys playing a variety of games such as World of Warcraft, Overwatch, Elder Scrolls Series, Legend of Zelda, and Super Mario Bros. Series. They like to hang out with friends and play most games except for 1st person shooters. Speaker B is considering pursuing a master's degree after completing their bachelor's and is contemplating a career as a college professor. They are currently studying linguistics in college and feel passionate about volunteer work, especially in education-related fields.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A is excited to see how Speaker B's soccer team performs and suggests potential career paths in linguistics for them. Speaker A also expresses admiration for Speaker B's volunteer work and desires to develop apps for differently abled youth. Speaker B, in turn, is impressed by Speaker A's willingness to help others and appreciates their advice on potential career paths.\n\nEvent Description:\nSpeaker A and Speaker B have engaged in conversations about their respective sports experiences, with Speaker A participating in a football league and Speaker B playing soccer. They discuss strategies in sports and video games, with Speaker A recommending trying out the Elder Scrolls game for its multiplayer option. Speaker A also suggests volunteering opportunities for Speaker B and shares their interest in teaching computer science and robotics. Speaker B has volunteered at their mom's afterschool program and is considering high-level volunteering at a neighboring university. They express feeling a bit stuck in their linguistics studies but are passionate about the subject.",
        "speaker": "Speaker A",
        "raw_prediction": " \nI can understand how stressful it must be to make such a big decision about your career. It's great that you talked to your advisor, and teaching definitely sounds like a stable option for you. With your passion for linguistics and volunteer work in education-related fields, becoming a college professor could be a rewarding path for you. Plus, you could incorporate your love for games like Legend of Zelda and Super Mario Bros into your teaching style to engage your students!",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t4",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " I usually camp in a camper trailer. It's more comfortable and convenient for me, especially with my daughter. Do you have any favorite camping spots you'd recommend for family trips?",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t6",
        "current_dialogue": "Speaker A: How was your trip? Did your daughter like that place?\nSpeaker B: Yes she loved it!  It was a great weekend. Have you done much camping?\nSpeaker A: I have done a little camping and would like to do more in the future. What is one of your favorite places to camp?\nSpeaker B: I like Manitoba. Do you camp in a tent or Yurt, cabin or camper trailer?\nSpeaker A: I've only camped in a tent so far, but would like to try out a camper trailer. What do use for camping?\nSpeaker B: We usually do tents but we have camped in yurts too. Did you go to the zoo last weekend?",
        "memory_text": "User Description: Speaker B is an individual who works at factories for metal work and has recently moved out from their wife. They are a parent who is concerned about their child's well-being and enjoyment.\n\nRelationship Description: Speaker B and Speaker A share a friendly and supportive relationship, with Speaker A offering advice and engaging in conversations about family and parenting.\n\nEvent Description: Speaker B and Speaker A have shared events such as discussing the possibility of starting their own zoo, visiting the zoo to see animals, and planning to take their child to the zoo to see tigers and monkeys. They also bond over taking photos of animals at the zoo and expressing concerns about animals living in cages. Speaker A's favorite animal is tiger Joshua, whom they plan to see again on their next visit to the zoo.",
        "speaker": "Speaker A",
        "raw_prediction": " No, we didn't go to the zoo last weekend, but we are planning to go soon. My daughter is really excited to see the tigers and monkeys, especially her favorite tiger, Joshua. Have you taken your child to the zoo recently?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t5",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": " I have never been to Italy before, but I would love to go someday and spend a whole month there. It sounds like a dream. Maybe one day when things settle down with work, I can make that happen. Would your kids be excited to go on a trip to Italy too?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t7",
        "current_dialogue": "Speaker A: We watched Miracle at the weekend like you suggested, we all really enjoyed it!\nSpeaker B: I'm glad you liked it. My kids love pretty much every Disney movie but my husband loved it, too. What else have you been up to?\nSpeaker A: I recently went to watch that new Disney movie, Luca. It was super cute and made me want to go visit Italy, but that was too expensive, so instead I booked a Hawaii sunset tour for next month. What about you?\nSpeaker B: I have been relaxing with the kids as much as I have. My husband has been busy with work, so we haven't had time for anything big. I would love to visit Italy some day though if we get the chance. Have you ever been to Italy before?\nSpeaker A: I have never gone to Italy because I'm always so busy. If I ever go, I would want to spend a month there, but work has been hectic lately. Would your kids go with you if you went to Italy?\nSpeaker B: Absolutely! I'd love to travel all over the world with my family to see everything. Hawaii sounds like just as much fun though. What are you most excited about doing when you get there?\nSpeaker A: I'm extremely excited about the sunset tour. Each day is at a new location to watch the sunset. It's suppose to be romantic, but I am just going alone, so I see it as more calming than anything.",
        "memory_text": "User Description:\nSpeaker A is a plumber who recently booked a \"Hawaii Sunset\" tour for next month. They struggle to make time for themselves due to working two jobs. Speaker A enjoys watching sunsets and hopes to see a west coast sunset. They do not like sand but like the beach for sunsets. Speaker A is excited for the sunset tour and plans to send pictures to Speaker B. \n\nRelationship Description:\nSpeaker B is a stay-at-home mom living in California. They love to cook healthy food and watch lots of movies with their kids. Speaker B's kids enjoy Disney movies, sloppy romance movies, and do not like horror movies. Speaker B finds water therapeutic and loves sunsets. They feel handling their kids and partner is a 24/7 responsibility.\n\nEvent Description:\nSpeaker A and Speaker B have shared moments discussing movies such as \"Luca,\" \"Miracle,\" and \"Remember the Titans.\" Speaker A enjoyed watching Luca, while Speaker B's kids found it really good. Speaker B recommends watching Miracle, a movie about the 1980 U.S. men's Olympic hockey team. Speaker A and Speaker B bond over their shared love for movies and their experiences with work and family responsibilities. Speaker A wishes Speaker B and their kids could join them on the Hawaii Sunset tour and plans to treat them when they return. Both Speaker A and Speaker B find solace and escape in movies, showing a shared appreciation for storytelling and entertainment.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't wait to go on the Hawaii Sunset tour next month. It's been such a long time since I've had a chance to relax and enjoy a beautiful sunset. I wish you and your family could join me, it would be such a great experience to share together. I'll be sure to send you lots of pictures when I'm there.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t2",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?",
        "memory_text": "User Description:\nSpeaker B is a stereotypical old plumber who is balding and overweight. They have a short commute and live on the 32nd floor. Speaker B could eat eggs by the truckload and mentions warm days and cool mornings.\n\nRelationship Description:\nSpeaker A recommends cheap flights to Anchorage for Speaker B and suggests getting blackout curtains for the \"midnight sun\" in Alaska. Speaker A reassures Speaker B about their trip and plans to make poached eggs for Speaker B every morning.\n\nEvent Description:\nSpeaker B plans on visiting Alaska in the summer to see the scenery and wildlife, including petting a wolf. They are interested in folk concerts and whale watching. Speaker A will take Speaker B on a tour with sleds pulled by dogs and will ensure Speaker B has a great time.",
        "speaker": "Speaker A",
        "raw_prediction": " The weather here has been sunny and warm during the day, but cool in the mornings. I can't wait to visit you in Alaska and experience the beautiful scenery and wildlife. I'm looking forward to trying those poached eggs you mentioned and going on a dog sled tour with you. It's going to be an amazing trip!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t7",
        "current_dialogue": "Speaker A: Did you look for tickets to visit me?\nSpeaker B: I have been watching the airfare. I'm waiting for the prices to go down a little. How's the weather there this week?\nSpeaker A: It's lovely this week! Clear skies and sunshine every single day\nSpeaker B: That sounds nice. It's been rainy here. Are there any good concerts coming up that you plan to see? Maybe I can plan my visit around that if the flights come through\nSpeaker A: Actually, yes! There are a few local artists performing in about 4 weeks, they'll be performing folk music. I'd love to take you out on the town and then enjoy that concert later in the evening if you're interested.\nSpeaker B: That sounds good. I'm looking forward to it. Do you think I will need to rent a car when I'm there, or is it possible to walk and bike in the summer? I always picture huge amounts of snow but I'm not sure if it's like that all year round.\nSpeaker A: I would definitely recommend looking for a rental car to have on hand. There is a town within walking distance from me, but it can be dangerous to walk with the wolves and elk around, especially at night.",
        "memory_text": "User Description:\nSpeaker A has blue eyes and blonde hair, prefers warmth, plans to retire down south on a beach, and enjoys eggs. Their favorite egg dish is egg benedict.\n\nRelationship Description:\nSpeaker A really likes their smart car, while Speaker B is a stereotypical old plumber who likes poached eggs. Speaker A suggested that Speaker B should seriously consider getting a smart car. They also discussed visiting Alaska and shared their excitement about the trip.\n\nEvent Description:\nSpeaker A had eggs for breakfast, thought of Speaker B when having eggs, and recommended looking into flights. They discussed airline fees, music festivals, and planned activities for the trip to Alaska, including petting wolves and going on a glacier tour. Speaker A and Speaker B are looking forward to spending time together and having a great experience.",
        "speaker": "Speaker B",
        "raw_prediction": " I remember you mentioning that you enjoy eggs, especially eggs benedict. Maybe we can try making some together when I visit. I'll make sure to pick up some fresh eggs from the local market. And I'll definitely look into renting a car for our trip, especially if there are wolves and elk around. I want to make sure we stay safe while exploring Alaska.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t7",
        "current_dialogue": "Speaker B: About that Bluegrass show -- A friend of mine mentioned that he has a cabin he won't be using only about 20 minutes away. Do you and your wife want to stay there so you can make it? Might be a more comfortable way for your wife to camp. Let me know. \nSpeaker B: That would be lovely! We can totally pay your friend to use the cabin if they would like.\nSpeaker A: I will let them my friend know that you are interested.  I think I might head out that way myself and camp out for the festival too.\nSpeaker B: Nice! Is anyone coming with you?\nSpeaker A: Just my doggy Drunky.  You never know,  I might meet a nice lady out there. \nSpeaker B: Totally.  There will be a bunch of women there and it'll be easy to strike up conversations.  Just be confident and I'm sure you could walk away with a bunch of numbers.\nSpeaker A: Oh, I definitely will. Thanks for the motivation. Is this going to me your first festival?",
        "memory_text": "User Description:\nSpeaker A is a music-loving individual who enjoys playing all styles of music at home. They have a Subaru that is currently making a funny noise. Speaker A also mentioned the need for money and Mexican food for a baby. They are a nightclubber who frequents live band venues and loves interacting with women. Their car has been running smoothly, and they try to attend live events weekly. Speaker A plays the guitar daily but hasn't had much time for it recently.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker B, who is a mechanic, offered to look at Speaker A's Subaru to fix the issue. Speaker B also mentioned needing money for the baby on the way and shared concerns about his wife's pregnancy. They plan to attend a local festival together and enjoy bluegrass music.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning to attend a bluegrass band concert, discussing the expenses of having a new baby, and preparing for the upcoming festival. Speaker B will take time off when the baby is born and is excited about the food and drinks at festivals. They are supportive of each other's interests and willing to help out whenever needed.",
        "speaker": "Speaker B",
        "raw_prediction": " Yeah, I'm really looking forward to the festival. I haven't been to one in a while, so it should be a great time. And I could definitely use some good music and relaxation after dealing with my car trouble. Thanks again for offering to take a look at it. Hopefully, it's nothing too serious.",
        "previous_summary": "Speaker B is a mechanic who enjoys working on cars.\nSpeaker B dislikes public transportation and enjoys going to festivals, but misses doing so.\nSpeaker B's wife is pregnant, so they are considering attending a local festival for just a day.\nSpeaker B's wife is pregnant and has three more months to go until the due date.\nSpeaker B is currently working on building cribs and will take two months off when the baby is born."
    },
    {
        "utter_id": "e17-s5-t1",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?",
        "memory_text": "User Description: Speaker A, also known as Jim, is a member of a music band who grew up in a beach town. He has a strong passion for writing songs, surfing, and cooking, particularly enjoying making food for others and receiving compliments. Jim's father used to work at Cisco, and he wakes up early in the morning to catch waves.\n\nRelationship Description: Jim and Jehosaphat, also known as Speaker B, share a friendly and casual relationship. They bond over their shared interests in activities like snowboarding, surfing, and skateboarding. They also enjoy discussing food preferences and cooking recipes.\n\nEvent Description: Jim shared his grandmother's recipes with Speaker B, who was happy to reciprocate by sharing his favorite garlic chicken recipe. They also talked about surfing, with Jim offering to give surfing lessons to Speaker B. The two are considering meeting up, with Speaker B possibly visiting Jim for a weekend in the fall. They also discussed their experiences with snowboarding and surfing, showing a mutual interest in each other's hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " I can definitely make the garlic chicken for you, Jim! In terms of spicy foods, I've taught myself to make a variety of dishes like spicy shrimp tacos and kimchi fried rice. I always love trying out new recipes and experimenting with different flavors. What about you, have you tried making any spicy surf-inspired dishes lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t2",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you're interested in trying new recipes! I actually love cooking spicy fried rice, it's got a great kick to it. And I'd love to share my grandmother's garlic chicken recipe with you sometime. Maybe we can even cook it together when you come over for surfing lessons in the fall!",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.",
        "memory_text": "User Description: Speaker B is a snowboarding enthusiast who loves spending time with family, cooking, and listening to music. He is interested in surfing and has tried it before. Speaker B is willing to share his grandmother's garlic chicken recipe and is open to trying new recipes.\n\nRelationship Description: Speaker A and Speaker B share a common interest in surfing. Speaker A invites Speaker B to visit and have surfing lessons, showing a friendly and inviting relationship between them.\n\nEvent Description: Speaker A had a steak dinner with his father, while Speaker B cooked chicken strips with fries and mashed potatoes. Speaker A enjoys cooking enchiladas, spaghetti, and new dishes, while Speaker B's favorite dish to cook is his grandmother's garlic chicken recipe. Speaker A loves making food for others and receiving compliments, and Speaker B enjoys cooking and sharing recipes. Speaker A loves playing the drums and surfing, and Speaker B is interested in surfing and snowboarding. Speaker B is considering visiting Speaker A for surfing lessons in the fall. Both speakers have fond memories of family dinners and cooking with their grandmothers.",
        "speaker": "Speaker A",
        "raw_prediction": " Oh, I'm glad you enjoyed the street tacos! Mexican food is definitely a favorite of mine. I haven't tried al pastor, but marinated pork tacos sound delicious. Maybe we can try making them together sometime! And I'd love to share my grandmother's garlic chicken recipe with you too. It's a family favorite.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t11",
        "current_dialogue": "Speaker A: The garlic chicken sounds delicious. Can you make it? What kinds of spicy foods have you taught yourself to make?\nSpeaker B: Yes, it's one of my favorites! It always remind me of the good old days. Spicy foods are great for the kick they have...like spicy fried rice! You should come over and try it.\nSpeaker A: I would love to, I enjoy cooking so maybe you can teach me to make it, too?\nSpeaker B: Yeah definitely! I know you like hot foods, so if you learn and can make them fresh it will taste amazing. Have you tried any new foods lately?\nSpeaker A: Not any new foods, but I did try a new food truck near me that was delicious! It was street tacos and you could pick from barbacoa, chicken, and steak for the protein. Do you like Mexican food? \nSpeaker B: Oh god I do love Mexican food. That was be so hard to pick because they're all so good! Did they have al pastor by any chance? I loved marinated pork tacos.\nSpeaker A: unfortunately no, but I can ask them if they plan to get it in the future. I had one of each and they were all good in their own way. Have you ever had Birra tacos? I'd love to try those next.\nSpeaker B: I've never had birra tacos, what are those? They sound intriguing.\nSpeaker A: If I understand it correctly, the tortilla is dipped in the liquid from the braised meat, and then fried on a flat top. Then filled with the meat that was braised and other toppings that you like. I'll let you know if I find a place that serves these tacos in our area!\nSpeaker B: Wow, my mouth is watering. I'll definitely have to try that. It sounds amazing and might be a new favorite. Is it spicy?\nSpeaker A: I'm not sure, but if I had to guess I'd say a little at least. Do you enjoy spicy food?",
        "memory_text": "User Description: Speaker A, also known as Jim, is a member of a music band who grew up in a beach town. He has a strong passion for writing songs, surfing, and cooking, particularly enjoying making food for others and receiving compliments. Jim's father used to work at Cisco, and he wakes up early in the morning to catch waves.\n\nRelationship Description: Jim and Jehosaphat, also known as Speaker B, share a friendly and casual relationship. They bond over their shared interests in activities like snowboarding, surfing, and skateboarding. They also enjoy discussing food preferences and cooking recipes.\n\nEvent Description: Jim shared his grandmother's recipes with Speaker B, who was happy to reciprocate by sharing his favorite garlic chicken recipe. They also talked about surfing, with Jim offering to give surfing lessons to Speaker B. The two are considering meeting up, with Speaker B possibly visiting Jim for a weekend in the fall. They also discussed their experiences with snowboarding and surfing, showing a mutual interest in each other's hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds delicious! I bet those Birra tacos will be a hit with your bandmates too. I remember you mentioning how much they love trying new foods. Maybe you can even incorporate some of those flavors into your songwriting. Who knows, maybe your next hit will be inspired by those tacos!",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " I remember you were quite the striker back in college! Scoring all those goals must have been exhilarating. Have you considered pursuing a career in soccer after college, or are you leaning towards humanities or teaching like we discussed before?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t2",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. ",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old law clerk who works 12 hours a day and wishes to be back in college. They are a Black Sabbath junkie with a background in Humanities and now working at a law firm. Speaker B would rather be a film reviewer and is in debt despite working hard.\n\nRelationship Description:\nSpeaker B shows interest in discussing career prospects with Speaker A, who loves playing soccer. Speaker A asked Speaker B to connect with their neighbor Cynthia, who works as a human resources specialist. Speaker B will text Cynthia's number to Speaker A later. Speaker B accidentally responded to Speaker A due to a spider landing on their keyboard, revealing their fear of spiders. Speaker A also has arachnophobia.\n\nEvent Description:\nSpeaker A and Speaker B shared a conversation about career paths and humanities. Speaker B recommended a guidance counselor to Speaker A. Speaker A has a soccer tournament coming up and loves Arsenal. Speaker B enjoys researching and writing briefs for their job at the law firm. Speaker B was once pranked with a spider by their boss at work and is considering asking for a raise. Speaker B likes Manchester United.",
        "speaker": "Speaker A",
        "raw_prediction": " That's interesting, being a goalkeeper requires a lot of focus and quick thinking, just like writing briefs for your job at the law firm. Maybe you can use your skills from soccer to help you negotiate for that raise you're considering asking for. And don't worry, I'll make sure to text Cynthia's number to you later so you can discuss potential career prospects.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t3",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " I do miss being on the field sometimes, especially the adrenaline rush of making a crucial save. But I've found a new passion in my job as a law clerk, researching and writing briefs. It's a different kind of excitement, you know? How about you, still tearing up the field as a striker?",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?",
        "memory_text": "User Description: Speaker A is a college student majoring in Humanities, who loves playing soccer, especially as a striker scoring goals. They are excited for upcoming tournaments and are a fan of Arsenal and international teams. Speaker A is single and still on the soccer team.\n\nRelationship Description: Speaker A and Speaker B have a friendly relationship, with Speaker A offering to take Speaker B out for lunch when they were broke. Speaker B enjoys music, especially Black Sabbath, and shares a love for soccer with Speaker A.\n\nEvent Description: Speaker A had a guidance meeting and is considering a career in humanities or teaching. Speaker B found a job as a law clerk and enjoys researching and writing briefs. They both appreciate humanities, with Speaker A staying in the field for now. Speaker A and Speaker B have discussed career prospects and shared moments of support and friendship, such as offering to pay for lunch or lending college books in exchange for burgers.",
        "speaker": "Speaker B",
        "raw_prediction": " No problem at all, it'll be great to have you back playing with us. Plus, it's always good to stay active and enjoy the game we both love.",
        "previous_summary": "Speaker B is 26 years old, works 12 hours a day, has a background in Humanities but now works as a law clerk.\nSpeaker B is currently working and mentioned the importance of taking breaks from work.\nSpeaker B is considering looking for a new job for higher pay but is comfortable at the current job."
    },
    {
        "utter_id": "e18-s5-t10",
        "current_dialogue": "Speaker A: What position did you play, when you played soccer in college?\nSpeaker B: I ended up being the goalkeeper for most games, not the most exciting position. \nSpeaker A: Exciting when it really counts though! Do you miss it?\nSpeaker B: I do a bit, but I can relive those times by watching games on TV these days. \nSpeaker A: That is a good point. I have been thinking that I want to be a voice on one of those soccer video games for a living.\nSpeaker B: That would be a dream job! Maybe I should get back into playing for real, It's good exercise. Could I join one of your games sometime?\nSpeaker A: Probably not an actual game, but I can reserve some time on the field. Maybe I can get some other friends to join so we can really play.\nSpeaker B: That sounds good, I haven't played in a while so something more casual would probably be best to start with.\nSpeaker A: Sounds great! Now the tough question: when do you have time?\nSpeaker B: It would have to be sometime when I'm off work, maybe on the weekend. ",
        "memory_text": "User Description:\nSpeaker B is a 26-year-old law clerk who works 12 hours a day and wishes to be back in college. They are a Black Sabbath junkie with a background in Humanities and now working at a law firm. Speaker B would rather be a film reviewer and is in debt despite working hard.\n\nRelationship Description:\nSpeaker B shows interest in discussing career prospects with Speaker A, who loves playing soccer. Speaker A asked Speaker B to connect with their neighbor Cynthia, who works as a human resources specialist. Speaker B will text Cynthia's number to Speaker A later. Speaker B accidentally responded to Speaker A due to a spider landing on their keyboard, revealing their fear of spiders. Speaker A also has arachnophobia.\n\nEvent Description:\nSpeaker A and Speaker B shared a conversation about career paths and humanities. Speaker B recommended a guidance counselor to Speaker A. Speaker A has a soccer tournament coming up and loves Arsenal. Speaker B enjoys researching and writing briefs for their job at the law firm. Speaker B was once pranked with a spider by their boss at work and is considering asking for a raise. Speaker B likes Manchester United.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a plan! I'll definitely make sure to schedule our casual game on the weekend when I'm off work. I'll text Cynthia's number to you later so you can connect with her about career prospects. Oh, and I'll make sure there are no spiders around when we meet up to play!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t8",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": "That sounds like a great plan! Surfing is not only a fun way to make connections but also a great way to stay active and fit. It's awesome that you have supportive professors backing you up for your internship search. And collecting shells sounds like a relaxing hobby, especially with shells from around the world like the ones from Greece. I hope you get to add more to your collection as you continue your travels. Good luck with your internship search and soccer training, and maybe one day we can hang out on the beach together and share our shell collections!",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t9",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? ",
        "memory_text": "User Description:\nSpeaker A is a retired individual who spends most days hiking along the coast. They are not interested in voting but appreciate equality. Speaker A used to surf when they were younger and have recently been inspired to take out their old surfboard and go surfing again.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship, discussing topics such as job searches, internships, sports medicine, and hobbies like hiking and surfing. They share personal experiences and offer encouragement to each other.\n\nEvent Description:\n1. Speaker A and Speaker B talked about their respective experiences in the medical field and sports medicine, with Speaker A encouraging Speaker B to keep up with surfing to make connections.\n2. Speaker A inspired to go surfing again after discussing surfing with Speaker B and remembering their love for the sport.\n3. Speaker A and Speaker B shared their experiences with sports, with Speaker A training for soccer and Speaker B trying to build up stamina and sharpen reflexes for soccer.\n4. Speaker B shared about their hope for the job market to pick up soon and their efforts to secure internships in the sports medicine field, including seeking recommendations from professors.",
        "speaker": "Speaker B",
        "raw_prediction": " That's so cool that you've been to so many European countries! I've only been to France and Ireland, but I would love to explore more. As for settling down after graduation, I'm not really sure yet. I'm open to different opportunities and locations, depending on where the job market takes me. How about you? Have you always lived near the beach or have you moved around a lot in your life?",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t10",
        "current_dialogue": "Speaker A: I met this guy at work who's wife is an athletic trainer, they asked me to pass their info on to you to discuss possible internships!\nSpeaker B: That would be great- thanks so much!   I have searched online a lot for internships but it is tricky in my field.  What do you do for a living in the medical field?\nSpeaker A: You are so welcome. I am retired now but I was a PA- physician assistant. Now I enjoy hanging out at the beach. With my knees the way they are the ocean water seems to make them feel better. So how much longer before you graduate?\nSpeaker B: I have another year- so this year is really important I get internships and start making connections in the field.   I love going to the beach too.  What happened with your knees that now cause you so much pain?\nSpeaker A: I think age has really been my knees downfall. I also used to hike a lot and I put a lot of pressure on my legs. That is great that you only have a year. Maybe when you graduate you can come hang out on the beach with me. I can't surf but I would love to watch you.\nSpeaker B: That would be fun!  I like collecting shells too so we could do that as well.  I have a small collection of ones I have from around the world.  The farthest away was from Greece.  Have you traveled a lot?\nSpeaker A: I have. I love Europe. I have been to many countries there but I have not gone to Greece yet. I would love to. The scenery and architecture is amazing. Have you gotten to visit other European countries?\nSpeaker B: I have.   I have also been to France and Ireland.  Where have you been in Europe?\nSpeaker A: Oh gosh. I have been to France, England, Ireland, Switzerland, Austria, Poland, Germany, Leichenstein, Spain, and much of Mexico, and Bermuda. I just love to travel but I have not been able to recently and with my knees I cannot sit in coach anymore and first class is so expensive. Do you plan on settling any place in particular once you graduate? \nSpeaker B: That's awesome you have been so many places!   I  am not sure where I will setlle down after graduation.  It probably will depend whether I decide to go further in my education or not and I have any residency requirements with that.   I do like the heat though so  hopefully somewhere sunny!",
        "memory_text": "User Description:\nSpeaker B is a college student attending FDU, studying sports medicine and playing soccer. They are currently looking for an internship in the sports medicine field and are hoping to join the college sports team next fall. Speaker B is the only child of a kind mother and is considering creative ways to stand out in the competitive job market.\n\nRelationship Description:\nSpeaker B and Speaker A have a friendly and supportive relationship. Speaker A encourages Speaker B to keep confidence in themselves, offers advice on making connections with doctors through surfing, and discusses the job market in the medical field with Speaker B.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about Speaker B's internship search, their interest in sports medicine, and their plan to join the college sports team. Speaker A shares tips from their neighbor John with Speaker B and suggests surfing as a way to make connections with doctors. Speaker A also mentions their past surfing experiences and hopes to get back into surfing. Speaker B's friends are experienced surfers and pros, and Speaker B is training to build stamina and sharpen reflexes for soccer. Speaker B is lucky to have supportive professors writing letters for their internship. Speaker B is considering pretending to get hurt surfing to connect with a doctor, and Speaker A encourages them to get creative and continue surfing.",
        "speaker": "Speaker A",
        "raw_prediction": " Wow, you have been to so many amazing places in Europe! I have only been to France and Ireland so far, but I would love to explore more of the continent. It must have been such an incredible experience to travel to all those countries. I hope to have the opportunity to travel more in the future, maybe even to Greece like you mentioned. It's so inspiring to hear about your adventures.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh no, Journey is quite the foodie, isn't she? I remember when we had that pet concert with my dogs and your terriers, she was eyeing the treats the whole time! Maybe we should have a playdate soon to keep her entertained. It's always a joy watching our animals interact and have fun together.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t3",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " Oh wow, that's quite the challenge with Journey! Have you tried playing some relaxing music for her to distract her from the food? Maybe a little concert with Sid and Journey could help keep her entertained and away from the fridge!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t11",
        "current_dialogue": "Speaker A: I went out and got a pizza, and when I got home Journey ate a whole piece by herself!\nSpeaker B: That's super unfortunate, How do you get Journey to not eat the food?\nSpeaker A: Journey can open the fridge, maybe I should put a lock on it. Do you have trouble with your dogs getting into food too?\nSpeaker B: Well fortunately they can't open the fridge just yet! But yea sometimes they manage to get into other stuff, especially when I leave it out! Does Sid try to get into food also?\nSpeaker A: Sid is far more well behaved then Journey when it comes to food out. The worst Sid can do is escape from his cage once in awhile. How are your dogs doing anyways?\nSpeaker B: They've been better as I left my previous job so I'm spending more time with them, how do you manage to work full time and still keep those animals happy?\nSpeaker A: I think working at the zoo so long has helped. Why did you leave your last job. Was that the one you were working in the warehouse? Sorry to hear about your dogs, it can be hard managing older animals.\nSpeaker B: Yea, that totally makes sense! I just wanted time off to spend with the dogs and look for a better job elsewhere, I'm hoping that I'll be able to get a job outside of a warehouse!\nSpeaker A: That is understandable. I didn't always think I would end up a zookeeper. Do you have anything in mind?\nSpeaker B: Well, I really enjoy animals so I might think of applying to work in a zoo aswell! Is it a super busy job?\nSpeaker A: That sounds like a great idea! You would be surprised how busy it can be. Not every job is high demanding and you don't have to work with all the animals either. Is there anything you don't like to do?",
        "memory_text": "User Description:\nSpeaker A is a zookeeper who loves animals, particularly the white tiger. They have a pet raccoon named Journey and a bearded dragon named Sid. Speaker A enjoys playing music for animals and has a playful and caring nature.\n\nRelationship Description:\nSpeaker A and Speaker B share a friendly and supportive relationship. Speaker A offered to help Speaker B secure a position at the zoo, showing kindness and generosity. Speaker B expressed gratitude and excitement for the opportunity, leading to a humorous exchange about starting with less dangerous animals for music playing.\n\nEvent Description:\nSpeaker A tried playing music for the white tigers at the zoo, which they enjoyed. Speaker A also mentioned bringing out the guitar for a pet concert with Speaker B's dogs in the future. Speaker B expressed interest in a playdate for their terriers and Speaker A's raccoon, showcasing a shared love for animals and a potential bonding opportunity. Speaker B shared their aspiration of taking a Disney cruise and their relaxed attitude towards finding a new job, highlighting their adventurous spirit. Speaker A received a baby raccoon from a friend and had a heartwarming experience letting the raccoons play together, demonstrating their caring nature.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you have such a fulfilling job at the zoo! I can't wait to join you there and start working with the animals. I'm excited to see what kind of music they enjoy and maybe even have a pet concert with your white tigers one day! And you know, I think our dogs would love a playdate with Journey and Sid too. Let's plan something fun for them soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t5",
        "current_dialogue": "Speaker A: Have you thought of any names for the kittens yet? \nSpeaker B: I was considering naming one of them Oreo because she's black and white, what do you think of that name?\nSpeaker A: Very fitting. Great name for a black and white cat. I looked in adopting some kittens like you recommended. \nSpeaker B: Rescuing animals is a great thing to do. But I wonder if the cats and your parrot would get along!\nSpeaker A: They might not get along but Tasha can hold her own. Plus I think she would get a kick out of watching them.",
        "memory_text": "User Description: Speaker A is a country girl with red hair who loves animals, particularly their pet parrot named Tasha. They are a locto-ovo vegetarian and enjoy hiking. Speaker A is planning a trip to China and wants to visit New York City first.\n\nRelationship Description: Speaker A and Speaker B have a friendly and intimate relationship, sharing stories about their pets and discussing travel plans together. They show concern for each other's animals and are open to adopting rescue kittens.\n\nEvent Description: Speaker A is planning to visit Speaker B and stay for a couple of days. They discuss bringing their parrot, Tasha, and are willing to adopt one of Speaker B's rescue kittens. Speaker A also shares that Tasha speaks Mandarin and has picked up the language from them. Speaker B is enthusiastic about helping Speaker A train the kittens to get along with Tasha. Speaker B has a playful sense of humor, suggesting the parrot could teach the kittens Mandarin.",
        "speaker": "Speaker B",
        "raw_prediction": " That would be quite the sight to see! Tasha the Mandarin-speaking parrot and the rescue kittens learning from her. Sounds like a fun adventure for all of them.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t1",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!",
        "memory_text": "User Description:\nSpeaker A is a personal trainer who loves going on camping trips, hiking, and looking for wild animals in the woods. Speaker A also enjoys cruising, with Cuba being a favorite destination. Speaker A is in good shape and leads hikes for camping groups. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker B suggesting Speaker A try a cruise and recommending healthy and delicious food options. Speaker A invited Speaker B to join the gym, showing a level of casual interaction in the dialogue.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A spotting a rare hawk on a hike, planning trips on the Appalachian Trail, and being nervous about full-day hikes. Speaker B, a computer programmer, suggested using mosquito repellent sprays with DEET to help Speaker A repel mosquitoes while hiking. Speaker B loves cruising and being outdoors but is scared of bugs and creepy crawlies. Speaker B recently got a new job working with computers.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! Those mosquito repellent bracelets are a smart idea, especially for those long hikes you love to do. I'm glad I could help with the suggestion. Have you been on any new adventures recently?",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t5",
        "current_dialogue": "Speaker A: I loaded up on repellent like you said and I also grabbed a few of those mosquito repellent bracelets, I figured why not!\nSpeaker B: Have you been hiking lately?\nSpeaker A: Yes I did actually. I lead some friends on a hike in a local trail last weekend. They got tired really quickly as they never go hiking they told me.\nSpeaker B: Sounds like me. I am not a fan of the outdoors. Did your friends manage to have a good time anyway?\nSpeaker A: Oh they did. We had some nice snacks along the way. Oddly enough, we had some trail mix that someone had made at home. It was quite tasty. We also had some juice and water packed to make sure everyone stayed hydrated. You should join us one day! I'll make it as fun as possible.",
        "memory_text": "User Description:\nSpeaker A is a personal trainer who loves going on camping trips, hiking, and looking for wild animals in the woods. Speaker A also enjoys cruising, with Cuba being a favorite destination. Speaker A is in good shape and leads hikes for camping groups. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker B suggesting Speaker A try a cruise and recommending healthy and delicious food options. Speaker A invited Speaker B to join the gym, showing a level of casual interaction in the dialogue.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A spotting a rare hawk on a hike, planning trips on the Appalachian Trail, and being nervous about full-day hikes. Speaker B, a computer programmer, suggested using mosquito repellent sprays with DEET to help Speaker A repel mosquitoes while hiking. Speaker B loves cruising and being outdoors but is scared of bugs and creepy crawlies. Speaker B recently got a new job working with computers.",
        "speaker": "Speaker B",
        "raw_prediction": " Thanks for the invite, Speaker A! I'm glad your friends had a good time on the hike, even though they got tired quickly. It sounds like you had everything under control with the snacks and hydration. I might consider joining you one day, as long as there are no creepy crawlies involved!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t6",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.",
        "memory_text": "User Description:\nSpeaker B is an individual who works in a cushy government job, with 15 years of experience in the field. They excel in staying calm and composed, even in stressful situations. Speaker B has a passion for painting and enjoys taking naps. They have two kids and are skilled in driving, but prefer to be a passenger and nap during long journeys. Speaker B's favorite movies are in the horror genre, and they have helped their father produce horror movies in the past.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is characterized by mutual admiration and curiosity. Speaker A looks up to Speaker B's job stability and wishes to have a similar career. Speaker A engages in creative conversations with Speaker B about movie plot ideas, showcasing a shared interest in the entertainment industry.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include preparing for an interview, where Speaker A seeks guidance and reassurance from Speaker B. Speaker A role-plays the interview scenario with a friend, demonstrating a proactive approach to job search. Speaker B expresses a desire to work in interior design, highlighting aspirations beyond their current job. The two bond over shared interests in mid-century design, horror movies, and creative brainstorming sessions. Speaker A wishes for Speaker B's father to achieve success in producing Hollywood movies, reflecting a sense of optimism and support in their relationship.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you find the process of making horror movies fascinating! It's definitely a unique and creative field to work in. As for your question about movie blood, I actually don't know the specific recipe for it. I try to stay away from that part of the movies and focus more on the creative aspects. It's important to make sure everyone stays safe on set, especially when using fake blood.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t9",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " Thanks for asking about my interview practice! It's been going well, I've been practicing with a friend and trying to stay calm and confident. I'm really hoping to land this project coordinator role at the charity. And hey, if you ever need help with painting, I have two older brothers who are great at it and could lend a hand.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t11",
        "current_dialogue": "Speaker A: Have you thought about taking a chance and doing something creative and more fulfilling full time? Either making movies or interior design, or is their another creative outlet that appeals to you?\nSpeaker B: I have been working producing horror movies and I really like it!  It is a lot more enjoyable than my day job.  Not sure that interior design is a good fit.  I just am good at painting houses.\nSpeaker A: The process of making horror movies must be fascinating.  Do you have any interesting stories from the set?\nSpeaker B: Oh yeah.  One time a makeup artist was applying fake blood all over a scene.  They had this all over their hands.  While they were spreading this blood around they cut a finger pretty bad.  They had no idea they had done this until they went to clean up.\nSpeaker A: That sounds gross.  By the way, what is movie blood made out of anyway?  Do you know or do you have a favorite blood recipe?\nSpeaker B: There is some weird chemical mix that I really do not mess with.  It is easy to clean up.  I try to stay away from this part of the movies.  I know what it should look like and that we want to keep everyone safe when using the fake blood.\nSpeaker A: Chemicals!  Do the actors hate working with it then?  I can imagine they are a pretty high maintenance bunch.  Do they worry about the blood messing with their looks?\nSpeaker B: Our actors are pretty amateur.  No big name ones so they are really good to work with.  Hey, how about you?  How is your interview practice going?  I am pretty sure you be excellent during it!\nSpeaker A: I think this discussion is helping me with making small talk, so thanks.  I just have to try and remember who i am and try to sell my good points.\nSpeaker B: That is a good approach.  I suppose you have been doing research on the company you are interviewing with?  I find it always helps to know the company as best you can for an interview.\nSpeaker A: Yes. Thanks for the reminder.  I have a couple of more companies to research today.  Of course, it is always interesting to figure out what a company's corporate culture is. ",
        "memory_text": "User Description:\nSpeaker A is a job seeker who is currently applying for a project coordinator role for a charity. They have had previous experiences of getting flustered in interviews when unexpected questions are asked, but they excel when they keep calm. Speaker A has a passion for horror movies and loves driving. They have two older brothers who can help with painting tasks.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and supportive relationship. Speaker B, who has a government job and is not necessarily enjoying it, offered to paint Speaker A's house. Speaker B's two kids also help with tasks, showing a level of intimacy and willingness to help out.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A's interview preparation, where they role-played an interview with a friend. Speaker A expressed nervousness about an upcoming interview and wishes for a government job like Speaker B's. Speaker B, on the other hand, prefers mid-century design and has a passion for painting. They have creative conversations with their family to come up with movie plots, and their work is destined to exist on Youtube. Speaker A admires Speaker B's involvement in horror movies and hopes for big-budget productions in the future. Speaker A is prepared for Monday's interview and wishes to settle into the new city with a rewarding job soon.",
        "speaker": "Speaker B",
        "raw_prediction": " It sounds like you're really prepared for your interview! I'm sure you'll do great. Remember to stay calm and showcase your strengths. And if you need any help with interview practice or tips, feel free to ask me or your brothers for assistance. Good luck!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t4",
        "current_dialogue": "Speaker A: How did the exam go?\nSpeaker B: Well, I have a few coming up. It's almost finals season. I'm still studying for them but I think it'll be ok. How about your history exam?\nSpeaker A: The history exam went pretty well, I got a B. I think that if I would have studied more, I would have got an A.\nSpeaker B: A B is still pretty great though! Do you have more exams coming up or are you on a break now?",
        "memory_text": "User Description:\nSpeaker B is a college student studying sports medicine with a passion for soccer. They are an only child and their mother runs the school they attend. Speaker B is focused on getting good grades and is determined to excel in their studies and soccer career.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have a friendly and supportive relationship. They engage in conversations about sports, voting, and personal experiences. Speaker B encourages Speaker A to relax and take breaks when needed.\n\nEvents Description:\n1. Speaker A finished a 5-mile hike with a poorly managed trail.\n2. Speaker B is interested in joining a soccer game and is glad Speaker A made it back safely from the hike.\n3. Speaker A and Dave plan to go hiking, while Speaker B is studying for a sports medicine exam.\n4. Speaker A wants to play soccer on Saturday at 3 pm, and Speaker B agrees to join, planning to bring bottled water. \n5. Speaker B gives tips on sports medicine training to Speaker A, who hopes to get all A's in school and secure a soccer scholarship.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad your history exam went well, even though you feel like you could have done better. Don't be too hard on yourself, a B is still a solid grade! As for me, I have a few exams coming up for my sports medicine classes. I'm determined to do well so I can excel both in my studies and on the soccer field. Let's both keep pushing ourselves towards our goals!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t3",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " I'm glad to hear that you're doing well with your Greek mythology study! It's great to see your passion shining through. As for Italy, I can't wait for my trip next Spring. I don't have any plans to go back anytime soon, but I'm definitely looking forward to soaking up the sunshine in California.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t4",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?",
        "memory_text": "User Description:\nSpeaker B is a 30-year-old individual who recently turned 30 and lives in Cali. They have a daughter who is 5 years old and loves the beach. Speaker B enjoys the sunny weather and beaches in Cali, where they have been living for 30 years. They have tried surfing before and talk about their daughter swimming and playing in the sand.\n\nRelationship Description:\nSpeaker B and the robot have a friendly and engaging relationship, discussing topics such as moving to Cali, the beach, and running on sand. Speaker A compliments Speaker B's daughter and expresses envy for living near the beach. They also talk about Spring break plans and share preferences for traveling, running, Greek mythology, and Italian food.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include planning a spring break trip, changing hair color to blue, living in different locations (Indiana and Cali), discussing the beach, weather, and running on sand. They also talk about Italy, with Speaker A expressing love for Italian architecture, history, and food. Speaker B recommends good pasta in Italy and asks about Speaker A's favorite part of Italy and their major in History. Speaker B also shares their interest in Greek mythology, studying Poseidon, and asking about historical events.",
        "speaker": "Speaker A",
        "raw_prediction": " Yes, I have some friends in Europe and we are currently making plans for our trip to Italy next Spring. It's always exciting to explore new places and experience different cultures. Have you started planning your trip to Greece? It sounds like it will be an amazing adventure with your passion for Greek mythology!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t5",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!",
        "memory_text": "User Description: \nSpeaker A is a 29-year-old individual who is turning 30 next week. They are interested in changing their hair color to blue as a way to hold onto youth. Speaker A doesn't have much time for hobbies but is excited about their mom getting a new car. They have expressed a desire to go somewhere tropical and have bought a dress for Easter. Speaker A is also considering moving to California as they do not like the weather in Indiana.\n\nRelationship Description: \nSpeaker A and Speaker B share a friendly and casual relationship. Speaker B congratulated Speaker A on turning 30 and engaged in conversations about various topics like moving to California, changing hair color, and family activities.\n\nEvent Description: \nShared events between Speaker A and Speaker B include discussions about spring break trip plans, moving to California, changing hair color, family activities, and interests in Greek mythology and Italian history. Speaker A talked about their visits to Italy, while Speaker B shared their interests in Greek mythology and Poseidon. Speaker A expressed envy towards living near the beach, and Speaker B shared their love for the weather and beaches in California where they have lived for 30 years.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! It would be wonderful to meet up in Greece and explore together. I'm sure we'd have a fantastic time discovering all the history and beautiful sights. Let's definitely plan to be in Greece at the same time!",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t8",
        "current_dialogue": "Speaker A: How is your daughter doing? Have you tried sharing your love of Greek mythology with her?\nSpeaker B: Hi there, hope you are wlll and managing to save up for your Italy trip?  Thank for asking about the Greek mythology study, we are doing very well. It helps because i am so passionate about it and hope to get to the Greek islands soon\nSpeaker A: Yes I have been saving up for another trip to Italy! I can't wait. It's planned for next Spring. Do you have any plans to go back to Italy in the future?\nSpeaker B: I would love to get back to Italy but need to save up and the hopeful priority is to Greece this year.  You have friends in Europe are you in contact to see what plans you can make?\nSpeaker A: Yes I've been talking to them quite a bit so they know what's going on. I'll be staying with some of them while I'm over there. I have never been to Greece....I'd like to go though. Maybe I'll add it to my itinerary! Maybe we could plan to be in Greece at the same time?!\nSpeaker B: That would be so good.  There is so much history and the roman statues i take my daughter to see in the museums and through our local resources is fab.  She is building up the passion which is lovely to see.  Have you still got your hair blue or has it grown out now?\nSpeaker A: That's awesome! Maybe you can teach me a little about all the mythology. I think I've never liked it before only because I didn't understand it. My hair is back to being its natural brown - lol I'm being boring for the moment.\nSpeaker B: Never boring you will keep styling it all sorts of interesting styles im sure.  Yes i would be lovely to be your guide for the day out in Greece.  Bring some decent walking boots and some sun cream, its a different heat out there but your tan is probably topped up with going to the beach each day.",
        "memory_text": "User Description:\nSpeaker B is a 30-year-old individual who recently turned 30 and lives in Cali. They have a daughter who is 5 years old and loves the beach. Speaker B enjoys the sunny weather and beaches in Cali, where they have been living for 30 years. They have tried surfing before and talk about their daughter swimming and playing in the sand.\n\nRelationship Description:\nSpeaker B and the robot have a friendly and engaging relationship, discussing topics such as moving to Cali, the beach, and running on sand. Speaker A compliments Speaker B's daughter and expresses envy for living near the beach. They also talk about Spring break plans and share preferences for traveling, running, Greek mythology, and Italian food.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include planning a spring break trip, changing hair color to blue, living in different locations (Indiana and Cali), discussing the beach, weather, and running on sand. They also talk about Italy, with Speaker A expressing love for Italian architecture, history, and food. Speaker B recommends good pasta in Italy and asks about Speaker A's favorite part of Italy and their major in History. Speaker B also shares their interest in Greek mythology, studying Poseidon, and asking about historical events.",
        "speaker": "Speaker A",
        "raw_prediction": " It will be a great experience for sure! I'm looking forward to sharing my passion for Greek mythology with you. And I'm sure we'll have a fantastic time exploring Greece together. Let's make sure to plan it out and enjoy every moment of it!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t1",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. ",
        "memory_text": "User Description:\nSpeaker A is a passionate cook who loves to bake, especially Indian cuisine. They are considering turning their cooking skills into a business. Speaker A also enjoys playing tennis and admires Serena Williams. They own chickens and enjoy cooking and baking.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and helpful relationship. Speaker A offers cooking advice and recommendations to Speaker B, showing a level of familiarity and willingness to help.\n\nEvents Description:\n1. Speaker A plans to make dahl, pilaf rice, and tandoori chicken using a pressure cooker.\n2. Speaker A explains the use of pressure cookers for various dishes and recommends one for beginner cooks.\n3. Speaker A suggests involving Speaker B's husband in cooking Asian food while she handles the main dish using the pressure cooker.\n4. Speaker B's husband is a great cook and enjoys cooking Asian food, with Speaker B enjoying the end results of his cooking.",
        "speaker": "Speaker B",
        "raw_prediction": " That's awesome, thank you so much for the beginner recipes! I'm excited to try them out, especially the ones for Asian food. It's great that most pressure cookers can also make rice, that will definitely come in handy. I'll have to ask my husband to join in on the Asian cooking fun, he's a great cook and I love trying out his dishes.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t2",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " I think I'll start with the Asian food recipe. My husband will love that! I can't wait to try it out. Thank you again for all the great suggestions!",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t10",
        "current_dialogue": "Speaker A: I found a lot of beginner recipes online for you to try. If your husband likes Asian food I found a few recipes you may want to try. Most pressure cookers also make rice. \nSpeaker B: Oh my! Thank you so much for that. Which recipe do you think I should start with?\nSpeaker A: I think shrimp fried rice would be a good place to start.  It's simple and not a lot of ingredients. What do you think?\nSpeaker B: Does it have eggs in it? We grow our own eggs so that might be the perfect starting point.\nSpeaker A: Yes, it contains eggs.  I think you would do well with the fried rice. It's best to cook the rice the day before.  \nSpeaker B: I didn't know that. Why cook the rice beforehand? Is it better to age rice or something?\nSpeaker A: The rice needs to be cool before adding to the pan.  Are you able to take a passenger along in you truck?\nSpeaker B: Oh! That makes since. I didn't realize that the temperature made a difference when frying rice. As for the truck, Yes I can. But, depending on what company I'm working for at the time, they often set restrictions on passengers.\nSpeaker A: The rice tends to stick together if it's warm.  I would like to ride along with you sometime when you're able.\nSpeaker B: I actually have a scheduled haul for next Wednesday. Do you want to come along for that ride? It should take about five hours.",
        "memory_text": "User Description: Speaker B is a person who lives in a rural area with a farm, enjoying the winter season the most out of all four seasons. They work as a truck driver and have a partner who is in a rock band called EXHALE. Speaker B likes country music, particularly older artists like Garth Brooks, Tim McGraw, and Darius Rucker, as well as rock and metal music. They have a variety of animals and crops on their farm and enjoy playing music.\n\nRelationship Description: Speaker B and Speaker A have a friendly and engaging relationship, sharing information about their preferences, daily activities, and future aspirations. They show genuine interest in each other's experiences and offer recommendations and suggestions for cooking and music-related topics.\n\nEvent Description: In their interactions, Speaker A and Speaker B discussed various topics such as favorite country singers, music genres, farm life, cooking techniques, and pressure cookers. Speaker A shared their love for baking and cooking Indian cuisine, while Speaker B expressed interest in learning Indian cooking from Speaker A. They also talked about the benefits of owning a farm, the types of food they grow and raise, and the challenges and joys of cooking and baking. Additionally, Speaker A recommended a pressure cooker for beginner cooks, shared their experience with using one for different dishes, and discussed their future plans for running a business related to cooking. Speaker B showed interest in purchasing a pressure cooker for their husband, who enjoys cooking Asian food with intricate prep work.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really looking forward to trying out the shrimp fried rice recipe with our fresh eggs! It sounds like a fun and easy dish to start with. And I would love to have you ride along with me on my next haul next Wednesday. It will be a long drive, but we can listen to some country music and rock tunes along the way. It'll be a great time!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t11",
        "current_dialogue": "Speaker A: Black widow movie was awesome. We enjoy lot and had Brazilian foods.\nSpeaker B: Oh that sounds fun! What is it about?\nSpeaker A: Black Widow is one of the character in the Marvel Avengers movies. Like Thor and Captain America. Have you seen any of those movies?\nSpeaker B: No I haven't seen any of those. What foods did you eat while watching the movie?\nSpeaker A: Wow, there are so many of the movies out there. Don't go see Black Widow without watching Avengers first. I had an amazing steak and vegetables on the side that were delicious. What is you favorite food? \nSpeaker B: Oh ok I definitely will watch those first! I love both steak and vegetables! I am a real foodie and love just about everything that isn't too strange to try lol.\nSpeaker A: Oh wow! Do you like sushi? I love it but the sea urchin is a little crazy lol. Have you ever eaten sea urchin?\nSpeaker B: I have never tried sea urchin or sushi but I do like crab legs and shrimp! Do you ever consider any foods to be good for healing? I find that you do healing very fascinating!\nSpeaker A: Yes, in fact I consider almost all foods to either be healing, harmful or neutral. In my opinion people should choose foods based on how they want to feel. Sushi is fresh and healthy so I considerate it to be very healing.\nSpeaker B: That is very wise thinking. Which vegetables do you feel are the best for healing? Are there any that should be avoided?\nSpeaker A: I feel that most leafy green vegetables are healthy, but it depends on the specific person's needs. For example some people need to avoid nightshades, like potatoes, etc. while other people can eat them without any problems. Overall, a diet with a variety of colors is good when it comes to vegetables",
        "memory_text": "User Description:\nSpeaker A is a person who values family and enjoys activities like healing clients, salsa dancing, and going to Brazilian steakhouse with their brother. They are interested in healing methods such as self-massage, essential oils, reiki, meditation, and self-awareness.\n\nRelationship Description:\nSpeaker B shows a level of intimacy with Speaker A by engaging in conversations about their family, activities, and interests. They express interest in trying out healing methods suggested by Speaker A and enjoy spending time on the water with their sister.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include going salsa dancing, dining at a Brazilian steakhouse, sailing with siblings, watching movies with family, and experiencing a heat wave. Speaker A plans on taking their clients salsa dancing soon, while Speaker B enjoys meeting different people and dancing under the stars on a boat.",
        "speaker": "Speaker B",
        "raw_prediction": " It's fascinating how you view food as healing. I completely agree with your perspective on choosing foods based on how they make you feel. It's so important to listen to your body's needs. I would love to learn more about different healing methods like self-massage and essential oils. Can you recommend any specific practices or products that have worked well for you?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t6",
        "current_dialogue": "Speaker A: I have plan to make garden in my home. I want some suggestion from you.\nSpeaker B: Plum trees and pair trees would be my suggestion in the summer when they blossom they have such a lovely flower on them\nSpeaker A: IN MY HOME?! A TREE? That was not at all what I was thinking. Do they grow well indoors? I am intrigued. \nSpeaker B: Well if you want to make it like a proper garden experience then I would suggest going all in, and go for the best most authentic looking items you could get \nSpeaker A: Wow! Ok! This is sounding like a bigger undertaking! Should I embrace bugs in the home if they help the plants or am I getting wild?\nSpeaker B: Well from my experince bugs do the complete opposite and don't help at all, so avoid that at all costs! Fertilizers are the way to go to help with growth.",
        "memory_text": "User Description: Speaker B is an inventor who has created a teleportation machine and loves his five puppies. He is a fan of Beethoven's music and hopes to go back in time to meet him. Speaker B is also interested in the impact of music on plants and enjoys gardening.\n\nRelationship Description: Speaker A is supportive of Speaker B's inventions and is glad that Speaker B keeps his puppies close. They share a curiosity about alternative energy sources and space exploration. Speaker A plays music for Speaker B's time machine and is in the marching band, showing a close and supportive relationship.\n\nEvent Description: The events shared by Speaker A and Speaker B include successful band concerts, discussions about energy independence, experiments in plant science, and gardening activities. They wonder about the effects of music on plants and have playful conversations about space travel and technology innovation. Speaker A and Speaker B bond over their shared interests and support each other's endeavors.",
        "speaker": "Speaker A",
        "raw_prediction": " I remember you mentioning how much you love gardening and experimenting with plants. Maybe you could try playing Beethoven's music for your plants to see if it has any effect on their growth! And I definitely agree with avoiding bugs in the house, maybe you could invent a natural fertilizer to help your garden thrive without any unwanted pests. Your teleportation machine could come in handy for sourcing some unique ingredients for your fertilizer experiments!",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t2",
        "current_dialogue": "Speaker B: Do you like your job at the computer company? Do you build computers or work on programming?\nSpeaker B: I do like my job. My job is to troubleshoot issues between the hardware and software, so I get to work with both.",
        "memory_text": "User Description:\nSpeaker B is currently working for a computer company and is stuck in their current career until their child graduates from kindergarten. They love Disney World and hope to take their child there soon. Speaker B's mother is a dentist, and Speaker B thinks Speaker A would be a great fit for working at Disney World. \n\nRelationship Description:\nSpeaker A and Speaker B have had intimate conversations about Speaker B's mother being a dentist. Speaker A is considering going back to school for dentistry later in life, and Speaker B encourages them to choose a career that truly makes them happy. Speaker B's child admires their grandma's profession but does not seem interested in pursuing dentistry. \n\nEvent Description:\nIn a conversation with Speaker B's mother, Speaker A talked about cooking instead of oral health, which was a pleasant surprise. Speaker A feels torn between becoming a dentist for financial reasons and working at Disney for happiness. Speaker B reassures Speaker A that they can overcome any discomfort in dentistry with gloves and determination. Speaker B suggests that Speaker A talks to their mother again about dentistry for more insights and advice.",
        "speaker": "Speaker B",
        "raw_prediction": " The response is consistent with Speaker B's job role at the computer company mentioned in the memory content and prompts further conversation about their work experiences.)",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Speaker A: I won a 3rd Place prize in an origami contest!! It's just a ribbon and $25 gift certificate, but I'm excited that I can add this to my CV/resume.\nSpeaker B: Wow, that's amazing! Congratulations! Yes, prize amount aside, that's still an amazing accomplishment. \nSpeaker A: Yea, I'm upset that I didn't get 1st Place but 3rd Place is still good! Do you plan on trying origami soon?\nSpeaker B: Yes, I'd love for you to teach me when we have a little more time to get together. I'm impressed by people who can just take a piece of paper or cloth and turn it into a masterpiece just by folding it. I've heard people say it's easier than it looks and I've heard people say it's harder than it looks. What do you think?\nSpeaker A: It depends on what you are trying to make out of origami, you can make some super complicated stuff, there's actually special paper that you can get for it! You may have seen origami be used in the hospital for some breathing aperatus!",
        "memory_text": "User Description:\nSpeaker A is someone who loves art, music, and painting. They prefer the color red and enjoy volunteer work, finding it meaningful and fulfilling. They have a fortunate upbringing and think travel and meeting new people are awesome. \n\nRelationship Description:\nSpeaker A and Speaker B share a level of intimacy in their dialogue, discussing personal interests and experiences such as painting, origami, and travel. They also express admiration for each other's activities like volunteering and singing.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include volunteering at the hospital, creating origami, and discussing their favorite colors. Speaker A is busy with work and gardening, while Speaker B has traveled extensively and enjoys singing. They both appreciate art and cultural experiences, finding meaning and fulfillment in their activities.",
        "speaker": "Speaker B",
        "raw_prediction": " That's really impressive that you won 3rd place in the origami contest! It's great to see your passion for art shining through in different ways. I'd love to learn some origami techniques from you, especially since you mentioned there's special paper for it. It's fascinating how something as simple as folding paper can turn into intricate designs. And it's amazing to hear that origami has practical uses, like in hospitals for breathing apparatus. Art truly has so many dimensions to explore!",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t4",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " \"Oh, 'Girl Next' sounds interesting! Let me know how it is. I might add it to my list as well. Have you ever watched any movies about grizzly bears in Alaska? I remember you mentioning your concern about their population.\"",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t5",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " My job has been going well, thank you for asking. I actually get a lot of my movie ideas from my students in Film Studies. They always have great recommendations that I love to pass on. And yes, I do get some inspiration from work as well. How about you, any new projects you're working on lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely agree with you. The humor in Pulp Fiction is dark and witty, and the violence is definitely not something I would recommend for kids. It's a movie that's more suited for mature audiences who can appreciate the complexity of the story and characters. I'm glad you enjoyed it though, it's a classic for a reason.",
        "previous_summary": "Speaker B has kids and enjoys watching movies with them.\nSpeaker B allowed their kids to watch Disney, Pixar, and older films like screwball comedies from the '30s and '40s.\nSpeaker B is knowledgeable about movies and provides recommendations based on Speaker A's preferences."
    },
    {
        "utter_id": "e31-s5-t10",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.",
        "memory_text": "User Description: Speaker B is a 40-year-old former Film Studies teacher who enjoys teaching, reading, playing music, watching movies, and hiking. They like suspense films, action, SF, horror, westerns, drama, and an occasional good comedy. Speaker B is concerned about the grizzly population in Alaska and has a good relationship with their kids, allowing them to watch Disney, Pixar, and older films.\n\nRelationship Description: Speaker B and Speaker A have an engaging and friendly relationship, with Speaker A relying on Speaker B for movie suggestions. Speaker B encourages Speaker A to watch specific movies and offers recommendations based on their preferences.\n\nEvent Description: Speaker B and Speaker A discuss movie preferences, with Speaker B recommending movies such as Pulp Fiction, Coming to America, Coming 2 America, and I-SPY, all featuring Eddie Murphy. Speaker A expresses interest in unique movies and relies on Speaker B for suggestions, leading to a conversation about various film genres and actors.",
        "speaker": "Speaker A",
        "raw_prediction": " I completely agree with you about letting parents decide if Pulp Fiction is suitable for kids. It's important for children to understand the difference between fiction and reality when it comes to violent content in movies. So, it's great that you're mindful of that. I'm glad to hear your job is going well and that you're enjoying it. Hope you enjoy watching \"Girl Next\" tonight!",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t11",
        "current_dialogue": "Speaker A: Okay, so, I watched Pulp Fiction, and I loved it! Thank you for the recommendation.\nSpeaker B: Of course. I recommend that movie to everyone I meet. I think I've watched it over one hundred times. So what is the next movie on your list to watch soon?\nSpeaker A: Yeah it was great and I will also recommend to people when they ask what movie is good. So next is another one you recommended which is coming to America. What’s the next movie your going to watch? \nSpeaker B: There is a horror genre movie that was released just this week which I'm going to watch tonight. It is called \"Girl Next.\"\nSpeaker A: Oh that sounds interesting, I will look into that and put it on my list. How has your job been going? Is there where you get all these great ideas for what to watch?  \nSpeaker B: My Film Studies professor job has been going absolutely great lately. I love all my students, because they really get into the lectures and ask lots of questions. Yes, my job requires me to watch movies all the time, so that is how I find the best ones. Is your programmer job going all right lately?\nSpeaker A: That sounds amazing. Super lucky to have students that really enjoy what they are learning about and I’m sure that’s down to the way you teach and what you teach them. I’m so glad it is all going well for you. Yeah it is going much better now, I’m really getting in the swing of things thank you for asking. \nSpeaker B: You're welcome. So, returning to the subject of Pulp Fiction, did you think it was funny? Did you think it was too violent for kids to watch?\nSpeaker A: Yeah there was some funny parts in that movie. I kinda think it may be a little to violent for kids, but I would just allow it to each parent to decide I would probably let my grandkids watch. What is your opinion? \nSpeaker B: I agree with you. As long as the parent can explain what's going on regarding the violence, and make sure the kid knows it is just a movie and not real life, I think most kids would be able to watch the movie without really being harmed or negatively influenced.\nSpeaker A: Yes exactly. I think all kids should learn that. I know my grandkids love to watch all genre’s of movies and I think kids should learn what they like to watch. ",
        "memory_text": "User Description:\nSpeaker A is a programmer who has been working on programming for a few years. They recently moved from Alaska and enjoy going for long runs, followed by indulging in a big steak dinner. Speaker A has a preference for all types of movies and has shown interest in films like Pulp Fiction.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, as evidenced by their discussions about movies and recommendations for each other. Speaker B teaches Film Studies and enjoys watching a variety of film genres with their kids.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussing favorite types of steak cuts, with Speaker A preferring sirloin and Speaker B preferring ribeye cooked medium rare. Additionally, they have shared movie recommendations, with Speaker B suggesting films like Coming 2 America and I-SPY with Eddie Murphy. Speaker A appreciates Speaker B's movie suggestions and relies on them for recommendations.",
        "speaker": "Speaker B",
        "raw_prediction": " You're welcome! I think you'll really enjoy Coming 2 America, it's a fun and entertaining movie. And I'm glad to hear your job is going well, it's always great to find your groove in a new role. Let me know what you think of the movie after you watch it!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t2",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.",
        "memory_text": "User Description:\nName: Speaker B\nOccupation: Snowboarder\nLikes: Charlie Parker, Meat, Snowboarding\nMemory: Loves meat, quit job at Cisco to pursue snowboarding and passion for Charlie Parker\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and engaging. They share personal stories and memories, showing a level of mutual interest and connection.\n\nEvent Description:\n1. Speaker A suggested rock music on the radio to Speaker B.\n2. Speaker B shared their favorite artist, Charlie Parker, with Speaker A.\n3. Speaker B bought their first new car.\n4. Speaker A had awesome grape jello and Speaker B talked about their grandma making jello at family dinners.\n5. Speaker A taught Speaker B how to make jello recipes.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great that you're passing on your grandmother's jello recipe to your kids! It's a wonderful way to keep family traditions alive. And I understand the struggle with sugar, especially with all the delicious meat dishes I love to cook. Maybe we can find some healthier alternatives together, or hit the slopes to burn off those extra calories!",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t8",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. ",
        "memory_text": "User Description:\nName: Speaker B\nOccupation: Snowboarder\nLikes: Charlie Parker, Meat, Snowboarding\nMemory: Loves meat, quit job at Cisco to pursue snowboarding and passion for Charlie Parker\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and engaging. They share personal stories and memories, showing a level of mutual interest and connection.\n\nEvent Description:\n1. Speaker A suggested rock music on the radio to Speaker B.\n2. Speaker B shared their favorite artist, Charlie Parker, with Speaker A.\n3. Speaker B bought their first new car.\n4. Speaker A had awesome grape jello and Speaker B talked about their grandma making jello at family dinners.\n5. Speaker A taught Speaker B how to make jello recipes.",
        "speaker": "Speaker A",
        "raw_prediction": " It's great to hear that you're learning how to bake, even if you have to fail a few times first. And no worries about the typing, I understood what you meant. Have you been able to incorporate any of your favorite meats into your baking experiments? Also, how's the snowboarding been going lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Speaker B: I've been teaching my kids how to make my grandmothers jello recipe, it's time to pass it on!\nSpeaker B: Family traditions are important.  Its good to get kids interested in cooking early.  I may have to lay off for awhile because I am picking up so weight and I don't need the sugar.\nSpeaker A: Lay off what, jello, or desserts in general?\nSpeaker B: Honesty, both.  I started to watch baking how-to-video to learn to bake, and I am shocked at just how much sugar in in desserts.\nSpeaker A: How's learning to bake going in general, especially now that you're off desserts?\nSpeaker B: I one of those people how have to fail a couple of times before I get the hang of it, but I'm getting there.  Have you and the kids had any chance to go skiing lately?\nSpeaker A: Water skiing? Yes, last weekend. It was so much fun!\nSpeaker B: (sorry my typing sucks)  That's awesome. I wish had access to a boat, but who knows, maybe one day. \nSpeaker A: Boating is so fun. You could go wakeboarding more often if you had your own boat. And no more boat rental fees or hassle.\nSpeaker B: I actually saw a drone the at will pull you in the water. It's the craziest thing.  \nSpeaker A: That must be a huge drone!",
        "memory_text": "User Description:\nSpeaker A is a person who enjoys eating jello, with their favorite flavors being cherry and grape. They have a family tradition of making jello with their grandma, who taught them how to make it. Speaker A has a passion for water sports, particularly water skiing, and has been doing it for 15 years. They have three kids who also enjoy water skiing. Speaker A is excited about boating and wishes to own a houseboat. They have a friendly and welcoming personality, as they look forward to meeting new people and sharing experiences with them.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is one of mutual interest and shared experiences. They have engaged in conversations about their favorite activities, such as snowboarding and water skiing, showing a willingness to learn from each other. Speaker B expresses a desire to steal Speaker A's jello recipe, indicating a playful and light-hearted dynamic between them.\n\nEvent Description:\nShared events between Speaker A and Speaker B include discussions about their favorite jello flavors, water skiing experiences, and aspirations for future activities. Speaker A expressed excitement about teaching Speaker B how to water ski and potentially sharing their jello recipe. Speaker B shared their interest in learning water skiing tricks and wakeboarding. Both speakers enjoy engaging in outdoor activities and have a shared passion for exploring new hobbies.",
        "speaker": "Speaker B",
        "raw_prediction": " That drone that pulls you in the water sounds amazing! It would be so cool to try out new water sports like that. Maybe we can look into it together and give it a shot next time we're out on the water!",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t2",
        "current_dialogue": "Speaker A: Did you play any Resident Evil this week?\nSpeaker B: I sure did. There was a storm nearby and it was raining for the last three days. Perfect weather for staying in my room playing RE. How about you?",
        "memory_text": "User Description: Speaker B is an individual who enjoys playing video games, particularly horror games like Resident Evil VIII. They also have an interest in hunting and have played Jurassic Park: World. Speaker B is eager to play games late at night and spends most of their free time gaming. They also enjoy golfing and plan to alternate between golfing and hunting with Speaker A.\n\nRelationship Description: Speaker B and the robot have a close relationship, as they plan to play games together, with Speaker B teaching the robot how to hunt and the robot teaching Speaker B how to golf.\n\nEvent Description: Some shared events between Speaker B and the robot include playing Resident Evil VIII late at night, planning to play games and order pizza together, and the robot helping Speaker B get used to the UI of Resident Evil.",
        "speaker": "Speaker A",
        "raw_prediction": " Yeah, I played a lot of Resident Evil this week, especially with the storm outside. It was the perfect excuse to stay in and game. Did you get a chance to play too? Maybe we can team up and tackle some zombies together later.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t4",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!",
        "memory_text": "User Description:\nSpeaker B is an individual who followed their father's footsteps and worked for Ford Motors. They have a cat that recently had a kitten. Speaker B enjoys visiting the zoo, particularly to see lions. They like to read books on poetry and are a huge fan of fantasy. Speaker B used to read a lot when they were younger and is considering trying audiobooks.\n\nRelationship Description:\nSpeaker B and the robot, Speaker A, have had conversations about adopting a kitten. Speaker A prefers a cockatoo over a kitten, believing kittens require more work. Speaker B also discussed Speaker A's sister's corgi and their future plans of having kids. Speaker B seems to value the relationship with Speaker A and includes them in discussions about family-related topics.\n\nEvent Description:\nEvents shared by Speaker B and Speaker A include discussions about adopting a kitten, Speaker A's sister's cockatoo named John, and their differing opinions on owning pets and having children. Speaker B seems to enjoy sharing personal anecdotes and asking for Speaker A's input on various topics.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm really excited for my vacation to San Diego next week! I can't wait to visit the zoo and see all the lions. I might even pick up a poetry book to read while I relax on the beach. Have you ever been to San Diego before?",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t9",
        "current_dialogue": "Speaker A: Have you decided to get one of my friend's kittens?\nSpeaker B: I'm thinking about it, but I'm planning on going on vacation in a week so It'd have to be next month\nSpeaker A: Alright, just keep me posted.  Where are you going on vacation?\nSpeaker B: Next Thursday, we're going to San Diego. I can't wait to visit the zoo there!\nSpeaker A: Nice! Have you ever been there before?  How good is their zoo?\nSpeaker B: Their zoo is pretty good! It's always crowded, of course, but they have pandas so I'm happy. I would say it's bigger than the DC zoo, but I like that the DC zoo has fewer people.\nSpeaker A: That sounds awesome.  I haven't been to the zoo in so long.  I wish I could go.\nSpeaker B: You should go with your sister! she can bring her dog. They probably have all kinds of exotic birds...\nSpeaker A: That's a great idea!  I'm not sure how good her dog would do around other animals though.  She always barks like crazy whenever she sees any kind of animal.",
        "memory_text": "User Description: Speaker A is a hard-working individual who works at a local fast food restaurant. They enjoy reading and gardening, and have a preference for visiting the zoo. Speaker A has a sister who recently got married and they like to see pandas, penguins, and exotic birds at the zoo. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, as seen when Speaker A suggested Speaker B to adopt a kitten and they discussed their preferences regarding pets. They also share a love for animals and enjoy visiting the zoo together.\n\nEvent Description: Speaker A's sister got married, Speaker B's cat had a kitten, Speaker A and Speaker B discussed their preferences for pets, Speaker B's girlfriend got a cockatoo, Speaker B mentioned about giving away kittens, Speaker A compared having children to having pets, and Speaker B's sister's cockatoo named John behaves in a funny way.",
        "speaker": "Speaker B",
        "raw_prediction": " Maybe you can take your sister's dog to the zoo with you! It might be a fun experience for her to see all those animals, even if she does bark a lot. Plus, it could be a nice bonding experience for both of you.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t5",
        "current_dialogue": "Speaker A: I am thinking about getting a new tattoo for my mom to match the one for my dad. What do you think?\nSpeaker B: That sounds like a great way to honor your parents. I don't have any tattoos myself, but I've thought about it. Maybe the names of my wife or sons\nSpeaker A: That is a great idea.  I would also add their birth dates as well.  You should take time to think about what font you would want to use.\nSpeaker B: I am a little scared of needles though. Were your tattoos painful?\nSpeaker A: Most of them were not.  It really depends on where on your body you get them.  Most of mine are on areas that didn't hurt.  The one on my foot and the one behind my ear did hurt a good bit.  Where were you thinking about getting it?",
        "memory_text": "User Description:\nSpeaker A is a tattoo enthusiast who works at a coffee shop and hails from San Francisco. They have a total of 5 tattoos, with their favorite being one dedicated to their late father with the inscription \"for you I shall live\". Speaker A is currently saving up for a portrait of their father's face next to a slogan on their chest in memory.\n\nRelationship Description:\nIn the dialogue, Speaker A and Speaker B show a friendly and engaging relationship. Speaker B shows genuine interest and support towards Speaker A's plans for their tattoo, expressing admiration for the idea of getting a portrait of Speaker A's father's face.\n\nEvent Description:\nThe events shared between Speaker A and Speaker B involve discussions about their respective trips to fishing destinations. They talk about fishing plans off the California coast, as well as specific locations like Humboldt County. Speaker A provides recommendations for places to visit, such as Fort Humboldt State Park, Sequoia Park Forest and Garden, and the Carson Mansion. They also discuss the potential risks of car burglaries in certain areas. Speaker A expresses their goal of visiting every national park in the US, showcasing a shared interest in exploring different places.",
        "speaker": "Speaker B",
        "raw_prediction": " It's really cool that you have such meaningful tattoos. I can see why you want to honor your parents in that way. As for me, I was thinking of getting a tattoo on my forearm, but now I'm considering other places after hearing about your experiences. Thanks for the advice!",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t1",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. ",
        "memory_text": "User Description:\nSpeaker A is involved in software solutions for tech companies and often deals with the common IT troubleshooting phrase, \"did you try turning it on and off again?\" They have a passion for fostering dogs and hope to see more people adopting pets. Speaker A visited a pet store and expressed interest in a bearded dragon but had concerns due to fostering dogs. \n\nRelationship Description:\nSpeaker B, a zookeeper, shares a close bond with Speaker A, offering advice and insights on caring for animals. They discuss topics related to pets, such as the behavior of raccoons and the proper care of animals. Speaker B suggests solutions to Speaker A's pet-related issues, showing a caring and supportive relationship.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussions about their pets, such as Bandicoot, the bearded dragon, and the raccoon. They talk about the challenges of fostering dogs and the responsibilities of pet ownership. Speaker B provides tips on managing raccoon problems and ensures a safe environment for pets. The dialogue showcases a shared interest in animal welfare and a supportive dynamic between Speaker A and Speaker B.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! I'm sure the aluminum sheeting will help keep those pesky raccoons away. Just remember to secure it properly. And don't forget, if you ever need any advice on fostering dogs or dealing with pet-related issues, I'm always here to help. Good luck with your raccoon problem!",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t2",
        "current_dialogue": "Speaker A: I was able to get the aluminum sheeting for my garbage. I'm going to install it today and I'll let you know how my raccoon problem goes. \nSpeaker B: I hope it goes well for you. How come you don't just leave small bowls of food out and befriend the raccoons? It would solve your problem a lot faster, especially because raccoon's are so smart. Bandicoot knows how to open and unlock so many things, it's makes it difficult to keep him out of trouble. Which is why I take him to work with me.",
        "memory_text": "User Description: Speaker B is a zookeeper who works at a Raccoon Cafe. They have a bearded dragon named Bob and a raccoon named Bandicoot, whom they have had since Bandicoot was a baby. Speaker B is experienced in taking care of Bandicoot and Bob, ensuring they are fed correctly with insects and dog kibble. Speaker B's brother owns a grocery store.\n\nRelationship Description: Speaker A fosters dogs and interacts with Speaker B regarding their pets. Speaker A is interested in learning about raccoons and bearded dragons, showing concern for the well-being of foster dogs in the presence of reptiles. The dialogue between Speaker A and Speaker B reflects a friendly and curious relationship.\n\nEvent Description: Speaker B shared experiences of wild raccoons trying to steal food from working raccoons and discussed the intelligence and behavior of raccoons with Speaker A. Speaker B expressed interest in researching whether raccoons can be trained and shared insights on caring for raccoons as pets. Speaker A asked questions about the behavior and care of raccoons, showing interest in wildlife laws and proper pet care.",
        "speaker": "Speaker A",
        "raw_prediction": " That's an interesting idea, but I think I'll stick to trying to keep the raccoons out of my garbage for now. Bandicoot sounds like quite the troublemaker, but it's great that you're able to bring him to work with you. How do you manage to keep him entertained while you're working at the Raccoon Cafe?",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t3",
        "current_dialogue": "Speaker A: I didn't watch my grandkids today so I checked out a new book to read.\nSpeaker B: It's nice to have a break. Did you find the book sufficiently exciting? \nSpeaker A: Yes, it's a really intense crime drama!  I'm really loving it so far.",
        "memory_text": "User Description:\nSpeaker A is a quiet individual who loves spending time with their 8 grandkids. They enjoy reading books and watching Netflix, particularly genres with high ratings. Speaker A is energetic and busy during weekends when they cook for their family. They often babysit their grandkids about four days a week and on most weekends, as their parents are busy. Speaker A's fridge is always raided by everyone, and they are known for their delicious cooking.\n\nRelationship Description:\nSpeaker A and Speaker B share a warm and friendly relationship, discussing topics such as babysitting, entertainment preferences, and family life. Speaker B is fascinated by animals, while Speaker A is passionate about spending time with their grandkids. The dialogue between the two speakers shows a level of intimacy and understanding.\n\nEvent Description:\nThe events shared by Speaker A and Speaker B include discussions about school supplies, summer plans, movie preferences, and book recommendations. They talk about their experiences with children growing older, their love for movies like Toy Story, and their shared interest in watching Jeopardy. Speaker A recommends a book to Speaker B, sparking a conversation about important topics such as animal poaching and the impact of growing older children. Their dialogue is filled with empathy, shared experiences, and a genuine connection.",
        "speaker": "Speaker B",
        "raw_prediction": " Yes, it's a really intense crime drama! I'm really loving it so far. It's been a great escape for me, especially after a busy day with the grandkids. Have you read any good books lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t3",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! ",
        "memory_text": "User Description:\nSpeaker A is a resident of a city known for its amazing iced teas and drives a Mini Cooper. They recently took their Mini Cooper to the hair salon and have a cat that just had a kitten. Speaker A enjoys unsweetened iced tea and is currently living on the Moon.\n\nRelationship Description:\nThere is a level of intimacy shown in the dialogue between Speaker A and Speaker B, with Speaker B offering recommendations for the best food in Mexico City and expressing excitement for their first trip to San Diego.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker B taking a road trip to San Diego with extra space for backpacks and toys, Speaker A planning a trip to San Diego and leaving their cats with a friend, and Speaker A describing their kitten as an orange and white striped tabby cat named Marmalade. Speaker A prefers flying for trips over driving and hopes to go on another trip soon. Speaker B, although not a cat person, acknowledges the bond Speaker A has with their kitten and anticipates becoming a future crazy cat lady.",
        "speaker": "Speaker B",
        "raw_prediction": " I decided to change the kitten's name from Marmalade to Pumpkin because I thought it would be a fun nod to my love for pumpkin spice and the fact that Ginger is a spice too, they are the spice girls! Plus, it just felt like the perfect fit for my little furball.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t6",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " The weather is actually perfect for iced tea today, just like in Mexico City. I can imagine sitting outside with a refreshing drink, enjoying the day. How are the kitten and your cat adjusting to the new addition to the family? It must be quite the adventure with them around!",
        "previous_summary": "Speaker A is from a city known for great iced teas and prefers unsweetened iced tea.\nSpeaker A enjoys drinking tea and water.\nSpeaker A lives on the Moon, where it is cold with very little traffic."
    },
    {
        "utter_id": "e38-s5-t10",
        "current_dialogue": "Speaker A: So I decided against Marmalade for the kitten's name. We're going with Pumpkin!\nSpeaker B: Wow I like it. Why did you decide to change its name? \nSpeaker A: Pumpkin spice is a thing I love, and Ginger is a spice too - they are the spice girls! \nSpeaker B: I see what you meant. Plus the color is beautiful orange. I want to see them together, even I am not a cat person they must be cute together at that time. Once the kitten grows up, situation gonna change to me. How are they, they are doing well?\nSpeaker A: Marmalade is orange too but this is better because the baby is sassy and climbs up my leg to sit on my shoulder. I don't understand how you are not a cat person when you have such a large heart for stray kittens.\nSpeaker B: hehe you're right. But i can't explain that why I am not a cat person to you sorry. How's the weather like today, still good weather to have iced tea out there?\nSpeaker A: It's beautiful. I'm sitting outside while the Spice Girls are chasing bugs in the grass. What did your kids name your cats?\nSpeaker B: ohh so nice sounds like you are enjoying the weather. Still we are discussing about that. Did not name them yet. Also I want to put them back since I am not a big fan of cat\nSpeaker A: That would be cruel to do. You need to rehome them properly or otherwise someone may report you to the authorities for animal abuse. My heart is breaking for your poor cats. \nSpeaker B: Thank you for concerning. I am trying to be nice to them do not worry ",
        "memory_text": "User Description:\nSpeaker B is from Mexico City and loves Mexican cuisine. They recently purchased a Subaru Legacy and is planning a road trip to San Diego in California with their kids. Speaker B wishes to have dogs in the future.\n\nRelationship Description:\nSpeaker B is not much of a cat person but finds kittens adorable. Speaker A has a cat and just had a kitten. Speaker A took the cat and kitten for a trip to get iced tea, showing a level of intimacy in the dialogue.\n\nEvent Description:\nSpeaker B took a long drive to San Diego with their kids, enjoying the gorgeous scenery but having to make more stops for the kids. Speaker A is getting attached to the kitten and has decided to keep her, despite Speaker B suggesting to keep her due to no such thing as too many cats. Speaker B admits to not being a cat person but can't say no to kids bringing home strays.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad to hear that the Spice Girls are enjoying the nice weather with you. I can imagine how cute they must be chasing bugs in the grass. And don't worry, I'll make sure to find a good home for the kittens once we decide on names. I may not be a cat person, but I still care about their well-being.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t3",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?",
        "memory_text": "User Description:\nSpeaker A is a stay-at-home mom who recently gave birth to twins. She used to work at IKEA in Sweden for twelve years before becoming a stay-at-home mom. She plays tennis every week, goes to church regularly, and is interested in having a lot of children in the future. Her husband travels frequently, which makes her feel lonely.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and supportive. Speaker B shows empathy towards Speaker A's loneliness and shares his own experiences with volunteering and scouting. They engage in conversations about work, hobbies, and future plans with a level of intimacy and understanding.\n\nEvent Description:\nSpeaker A and Speaker B discuss volunteering opportunities at the church, with Speaker B showing interest in participating despite his busy schedule with work, school, and scouting. They talk about upcoming church retreats, with Speaker A suggesting that Speaker B join for a calming experience. Speaker A also mentions managing school, work, and her twins, while Speaker B shares his plans to achieve the Eagle Scout badge for college applications. They bond over shared experiences and future aspirations, creating a supportive and engaging dialogue.",
        "speaker": "Speaker B",
        "raw_prediction": " My favorite part about camping is being able to disconnect from the busy everyday life and just enjoy nature with my kids. It's a great way to bond and create lasting memories. What about you, what's your favorite part about camping?",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t9",
        "current_dialogue": "Speaker A: I've heard that Boy Scouts teaches a lot of survival skills like setting up shelter and figuring out how to get a fire started no matter what materials you have on hand. Have you done any of that? I'm sure my kids would love roughing it.\nSpeaker B: Yes, it teaches a lot of survival skills and I would say social skills as well. You need to learn how to work together, and compromise. Yes, we often go camping and have to figure out a lot of things like how to start a fire or cook a meal with very little materials on hand. You should definitely get your kids into it.\nSpeaker A: Cool, thanks! Yes, that sounds wonderful, I think they would enjoy it a lot. What is your favorite part about camping?\nSpeaker B: I love being out in the wilderness and sleeping under the stars in the fresh air. It makes you realize how beautiful life is and how small we really are in comparison to the universe.\nSpeaker A: I miss doing that! I have done lots of picnics with my family but it's been a long time since I've slept in a tent! Looking forward to it again when the kids are older. Where was the last place you went?\nSpeaker B: We went up to an island in the middle of nowhere in Canada. There were lots of bears and huge moose!\nSpeaker A: Wow, that sounds like such an adventure! I love to visit Canada. I have seen moose but never a bear! That must have been scary!\nSpeaker B: Yes, it is quite scary. We could also hear the wolves howling at night, luckily we didn't come across them though. One thing to note about bears, is they just want to come and scrounge for our food, so we learned to safely pack it away and hang it up high in a tree.\nSpeaker A: Yes, I've heard that it's important to be careful in bear country! I would love to see one in person though. Do you take lots of photos on your trips?",
        "memory_text": "User Description:\nSpeaker A is a stay-at-home mom who recently gave birth to twins. She used to work at IKEA in Sweden for twelve years before becoming a stay-at-home mom. She plays tennis every week, goes to church regularly, and is interested in having a lot of children in the future. Her husband travels frequently, which makes her feel lonely.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B is friendly and supportive. Speaker B shows empathy towards Speaker A's loneliness and shares his own experiences with volunteering and scouting. They engage in conversations about work, hobbies, and future plans with a level of intimacy and understanding.\n\nEvent Description:\nSpeaker A and Speaker B discuss volunteering opportunities at the church, with Speaker B showing interest in participating despite his busy schedule with work, school, and scouting. They talk about upcoming church retreats, with Speaker A suggesting that Speaker B join for a calming experience. Speaker A also mentions managing school, work, and her twins, while Speaker B shares his plans to achieve the Eagle Scout badge for college applications. They bond over shared experiences and future aspirations, creating a supportive and engaging dialogue.",
        "speaker": "Speaker B",
        "raw_prediction": " Yes, I have encountered some dangerous animals, like bears and wolves, but as long as you know how to handle the situation and stay safe, it's all part of the adventure. It's important to respect their space and be prepared for any encounter. Have you ever had any close encounters with wildlife during your camping trips?",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t2",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.",
        "memory_text": "User Description:\nSpeaker B is a software tech from England who is very active and loves running marathons. They also teach jiu-jitsu and have a foster home for dogs. Speaker B is planning to take summer courses soon and has considered adopting a dog in the states, but feels it would be disloyal to their dogs in England. They miss their dogs and London very much, and their favorite restaurant in London is Sufi.\n\nRelationship Description:\nSpeaker B and Speaker A have been working on the same project and have discussed planning a trip to England together. Speaker A enrolled in a class on the history of martial arts, which Speaker A thinks Speaker B would enjoy. They have shared information about their favorite restaurants, with Speaker A loving Taco Bell.\n\nEvent Description:\nSpeaker B is busy with software work and has not had much time to do other activities. They are considering planning a trip to England to visit family and friends, as well as their dogs. Speaker B recently signed up for a class teaching the history of martial arts, while Speaker A is studying for an athletic training degree. Speaker A loves teaching and learning, especially about the history of martial arts.",
        "speaker": "Speaker A",
        "raw_prediction": " I'm glad you had a great time at the martial arts class! It must have been refreshing to take a break from your project. I've been busy with work too but I'm looking forward to our trip to England. Maybe we can visit your favorite restaurant, Sufi, when we're there. And don't worry, your dogs in England will always hold a special place in your heart.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t9",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol",
        "memory_text": "User Description:\nSpeaker A is a college student who loves teaching and learning. They are regretting eating ice cream due to being lactose intolerant. Speaker A also teaches jiu-jitsu and is planning to take summer courses soon. They are taking a class on the history of martial arts and want to get an athletic training degree.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, with Speaker A mentioning events and activities that may interest Speaker B. Speaker B, a software tech from England, is busy with work and misses dogs. They both share a love for martial arts and have discussed running a half marathon together.\n\nEvent Description:\nEvents shared between Speaker A and Speaker B include planning a trip to England, considering adopting a dog, discussing favorite restaurants in London, and signing up for online classes. Speaker A mentioned a half marathon coming up and Speaker B is considering running it despite their busy work schedule. Speaker B plans to travel back to England to visit family, friends, and dogs.",
        "speaker": "Speaker B",
        "raw_prediction": " I can't believe you're still considering running that half marathon despite your busy schedule! You're so dedicated. And speaking of dedication, I've been studying hard for my martial arts history class. I can't wait to teach you all about it once finals are over. And yes, let's definitely grab some take-out from Sufi, I'm craving their food now too!",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t10",
        "current_dialogue": "Speaker A: I went to another martial arts class and had a blast.\nSpeaker B: That's great, were there a lot of students today? I've been at home working on a project.\nSpeaker A: Quite a few, but it wasn't too crowded. It was a nice change of scenery. What kind of project are you working on?\nSpeaker B: I'm sure the student appreciate that. You teach as a group as apposed to one-on-one right? And one of the companies I work for had their system hit with a virus so I've been upgraded their software to debug the system.\nSpeaker A: I teach group classes and one on one, but I was the student today. I specialize in jiu-jitsu but today I got to be the student in a taekwondo class. \nSpeaker B: That's even better, learning is a life-long journey. How are you class on martial art history? When you have time teach me too, I'd love to learn. \nSpeaker A: It's been a little stressful lately, because finals are coming up...but I'm confident in that class. I could've aced it before I even started! I'll definitely get started with you after finals.\nSpeaker B: Ahaha we;; for someone who's so passionate about martial arts I'm not surprised. Great, I'll try to be the best student I can. I'm starving, think I should grab some take-out from Sufi?\nSpeaker A: Of course! It's your favorite after all! Now you made me hungry! lol\nSpeaker B: Sorry for the typos and correction there's a restaurant here similar to Sufi's in London. They sell delicious Donairs, you should definitely try them out sometime.",
        "memory_text": "User Description:\nSpeaker B is a software tech from England who is very active and loves running marathons. They also teach jiu-jitsu and have a foster home for dogs. Speaker B is planning to take summer courses soon and has considered adopting a dog in the states, but feels it would be disloyal to their dogs in England. They miss their dogs and London very much, and their favorite restaurant in London is Sufi.\n\nRelationship Description:\nSpeaker B and Speaker A have been working on the same project and have discussed planning a trip to England together. Speaker A enrolled in a class on the history of martial arts, which Speaker A thinks Speaker B would enjoy. They have shared information about their favorite restaurants, with Speaker A loving Taco Bell.\n\nEvent Description:\nSpeaker B is busy with software work and has not had much time to do other activities. They are considering planning a trip to England to visit family and friends, as well as their dogs. Speaker B recently signed up for a class teaching the history of martial arts, while Speaker A is studying for an athletic training degree. Speaker A loves teaching and learning, especially about the history of martial arts.",
        "speaker": "Speaker A",
        "raw_prediction": " Donairs sound delicious! I'll definitely have to try them out. Maybe we can grab some together when you visit England. And don't worry, I'm sure your dogs will understand. They'll always have a special place in your heart no matter where you are.",
        "previous_summary": "Speaker A has never been out of the United States and thinks it would be nice to visit England.\nSpeaker A is interested in trying new restaurants, mentioning Taco Bell as their favorite.\nSpeaker B enjoys fancy restaurants and mentioned Sufi as their favorite in London."
    },
    {
        "utter_id": "e42-s5-t1",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.",
        "memory_text": "User Description:\nSpeaker A is a big country music fan who is sad that winter is ending, their favorite season. They live on a corn and bean farm with lots of animals and they like driving trucks and tractors. Speaker A loves BBQing and grilling steak and hotdogs.\n\nRelationship Description:\nSpeaker A suggests Speaker B to come down and visit for blasting country music, and Speaker B wishes to live the country lifestyle down there. Speaker B plans to meet Speaker A in person after renovating their house and buying furniture safe for their two dogs.\n\nEvent Description:\nSpeaker A inspired to redecorate the house with purple furniture and neon pink and lavender walls. Speaker B regrets the green and purple scheme but plans to give Speaker A all purple stuff. Speaker A bought new furniture including a new couch, recliner, and patio furniture. Speaker A hopes to enjoy quiet evenings outside this summer and plans to grill and eat outside most nights when the weather permits. Speaker B offers to bring a new marinade and a six pack over for a BBQ gathering. Speaker A uses lamps to keep bugs away while enjoying food and company outside. Speaker A has bug spray as a backup plan, and Speaker B needs to get lamps and candles to keep bugs away.",
        "speaker": "Speaker B",
        "raw_prediction": " That sounds like a great idea! I can't wait to hear you play some country music on the guitar at the barbecue. I'll make sure to bring that new marinade and a six pack for us to enjoy. And don't worry, I'll remember to bring some lamps and candles to keep the bugs away so we can have a great time outside.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t2",
        "current_dialogue": "Speaker A: I have been learning how to play guitar so maybe I could play something for you when we meet for the barbecue.\nSpeaker B: That would be great maybe you can help me pick a color scheme for my living room, you might want to bring some bug spray too, the mosquitos here are prety bad.",
        "memory_text": "User Description:\nSpeaker B is searching for a furniture shop to buy furniture but is struggling with choosing new furniture due to doubts about the colors. They painted the room light green before buying purple sofas and are willing to add vibrant colors suggested by Speaker A to create a hippy feel in the room. Speaker B loves pets and is buying furniture safe for their two dogs. They work near a mall by their house and love to barbecue, especially grilling steak and hotdogs. Speaker B prefers grilling corn straight from the farm and using a charcoal grill over a gas grill. They plan to meet Speaker A in person once they are done renovating their house.\n\nRelationship Description:\nThe relationship between Speaker A and Speaker B shows a level of intimacy as they plan to meet in person and help each other with furniture choices and grilling preferences. Speaker A invites Speaker B over to help break in new furniture and enjoy grilling and eating outside together.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include Speaker A getting new furniture like a couch, recliner, and patio furniture, hoping to enjoy more quiet evenings outside. They plan to grill and eat outside most nights with the new furniture, even on busy nights. Speaker B plans to bring marinated meat and a six pack to Speaker A's place and use bug spray to keep bugs away. Speaker A has things set up to play music, enjoy food, and company without worrying about bugs, using lamps and other devices for bug control. Speaker A suggests grilling corn with mayo and cheese and recommends using a smoker for grilling. Speaker B prefers grilling corn with fresh ingredients and loves the flavor of meat cooked on charcoal. Speaker B is willing to give all purple furniture to Speaker A and plans to get rid of the green and purple scheme.",
        "speaker": "Speaker A",
        "raw_prediction": " That sounds like a great plan! I can't wait to see your new furniture and help you pick out some vibrant colors for your living room. I'll definitely bring some bug spray for the mosquitoes, and we can enjoy grilling some steak and hotdogs together. Maybe we can even try grilling some corn straight from the farm for a delicious meal. It's going to be a fun barbecue!",
        "previous_summary": null
    },
    {
        "utter_id": "e43-s5-t8",
        "current_dialogue": "Speaker A: I booked an excursion to visit the Acropolis in Athens, thank you so much for your advice. Can you tell me about it?\nSpeaker B: Yes!  You can't miss it, especially if you are staying in the Plaka neighborhood.   The acroplis sits on the top of the big hill.  You can see if from  much of the surrounding neighborhoods.   I would recommend visiting the museum that is there first to learn all about what you are about to see. \nSpeaker A: I definitely will, this sounds like such an amazing trip. How long has it been since you've been there yourself?\nSpeaker B: I was in Greece last two years ago.   I am excited to go again soon!    At somepoint I would like to take a cruise around the islands there.  It seems like a neat way to see all the Islands in an easy way.   Have you ever taken a cruise?\nSpeaker A: Only once before when I was very young, so I don't remember much. It sounds like such a relaxing way to enjoy the day, though. Maybe we can plan a cruise together sometime.\nSpeaker B: That would be fun!  I go to Europe a lot so maybe a cruise in the Caribbean would be nice.  I would like to see Saint Lucia and Saint Thomas. \nSpeaker A: Oh, Europe? I'm already sold on the idea, sounds like a blast! I've never had a negative experience in Europe. Should we visit some of the capital cities?\nSpeaker B: I would like to go to Paris.  Since I live in Amsterdam I could take the train down.  I have seen much and Italy and Greece but would love to go to Paris.  Have you been there before? ",
        "memory_text": "User Description:\nSpeaker B is a librarian from Amsterdam who commutes to work by boat. They have three kids and are currently reading Star Wars novels. Speaker B is planning a vacation to Greece, excited to visit historical places. They express their love for Athena and reveal that their lucky number is three. \n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and engaging relationship, discussing travel plans, Greek mythology, and strong women. They share their excitement about upcoming trips and recommend sights to each other.\n\nEvent Description:\nSpeaker B is preparing for their trip to Greece, including sorting out flights and deciding on destinations like Athens, Santorini, and Thessaloniki. Speaker A recalls past travels in Europe and shares favorite cities. Speaker A and Speaker B discuss their travel plans, including recommendations for each other's trips. They also talk about their admiration for strong women and Greek mythology. Speaker B's kids are excited about the trip to Greece, and they recommend the Parthenon as a must-see attraction.",
        "speaker": "Speaker A",
        "raw_prediction": " It sounds like you have a lot of exciting travel plans coming up! I haven't been to Paris before, but it's definitely on my bucket list. I love the idea of taking the train down from Amsterdam, it sounds like a great way to travel. And visiting the Parthenon in Athens must be incredible, especially with your love for Athena. I can't wait to hear all about your adventures when you get back!",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t11",
        "current_dialogue": "Speaker A: How did the speech go? Hopefully you motivated some people to run. How about this? I need a motivational speaker to motivate me, to help motivate my friend to run again. Know anyone? \nSpeaker B: It was amazing and I just just know that I really changed some people's lives for the better. I cannot believe how blessed I am, how blessed we all are really (consider that my application to be your motivational speaker!).\nSpeaker A: You'll have to bring your A game because the hot weather has made me not want to even leave my air conditioned house lately.lol\nSpeaker B: I am up for the challenge! I have a few tricks up my sleeve to deal with people like you.\nSpeaker A: Oh geez that makes me sound difficult.lol  Do you have any new speeches coming up?\nSpeaker B: Nope, I just cleared my schedule until the Alps marathon that you're training for. It's just you and me until you break that finish line. I'm going to start sending you a motivational quote every morning at 4 am when I want you to wake up.\nSpeaker A: Wow 4 am.  Is it too late to change my mind?lol\nSpeaker B: Yes. We have an iron-clad written agreement. Tell me how I'm doing so far. Is this the most motivated you've ever been in your entire life?\nSpeaker A: No, but that's why I have you.  You're going to push me to do the things I can't bring myself to do.  I'll have more motivation tomorrow.  Today was a long work day.lol\nSpeaker B: I'm going to try a new motivational technique with you. Would you be more frightened by a spider or a snake. I need to know before we meet up this weekend.\nSpeaker A: A spider no question but if you ask me to hold one I'm definitely running away.",
        "memory_text": "User Description: Speaker A is from Venice Beach and has traveled to 20 countries, despite hating traveling but loving running. They picked up a yodel in their travels and come from a musical background, as their parents met in a high school choir. \n\nRelationship Description: Speaker A and Speaker B have a friendly and supportive relationship, with Speaker B providing motivational speeches and encouragement to Speaker A in their running goals. \n\nEvent Description: Speaker A and Speaker B have shared moments of discussing marathon training, dealing with injuries like a sprained ankle, and planning to run together for the Alps marathon. Speaker A has also shared their love for singing and active lifestyle recommendations for Speaker B when feeling down. Speaker B mentioned missing his family while traveling for work and finding solace in nature and motivational speeches.",
        "speaker": "Speaker B",
        "raw_prediction": " How about this - I'll incorporate some yodeling into my motivational speeches for you. Maybe that'll give you an extra push when you're feeling tired during our training sessions. And don't worry, I'll make sure to keep the spiders far away from you during our runs!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol",
        "memory_text": "User Description: Speaker B is kind, caring, and hopeful for group equality. They like camping and hiking, with a favorite trail being the Columbia Trail near home. They have a neighbor named John who sells camping gear and also loves hammocks. Speaker B's dog loves the hammock more than Speaker B.\n\nRelationship Description: Speaker B and the robot have a friendly and collaborative relationship. They enjoy planning hikes, picnics, and discussing camping equipment together.\n\nEvent Description: Speaker B and the robot plan to go hiking this weekend, with Speaker B suggesting a picnic at the top of the mountain. They discuss bringing sandwiches, fruit, water, and even swimming in a lake during their hike. Speaker B shares their preference for veggie sandwiches and their experience with swimming in cold water. Speaker A also mentions a hidden primitive camping spot off the main hiking trail. Speaker B finds it cool that Speaker A plans to buy a hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": " That's awesome that you got the shift lead position at the grocery store! It sounds like a great fit for you. As for me, I've been helping John with some side projects to make ends meet. He actually pays pretty well, even better than a regular job. And speaking of John, my dog loves his hammock more than I do, it's hilarious! \n\nI can't wait for our hike this weekend, it's going to be so much fun. I think a picnic at the top of the mountain sounds perfect. I'll make sure to pack some veggie sandwiches for us, along with some fruit and water. Maybe we can even take a dip in the lake if it's not too cold, just like when we went swimming that one time. And hey, maybe we can check out that hidden primitive camping spot you mentioned off the main trail, it sounds like a cool adventure. Oh, and speaking of hammocks, I saw a really nice one online that I might get, John would probably approve!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t6",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.",
        "memory_text": "User Description: Speaker B is kind, caring, and hopeful for group equality. They like camping and hiking, with a favorite trail being the Columbia Trail near home. They have a neighbor named John who sells camping gear and also loves hammocks. Speaker B's dog loves the hammock more than Speaker B.\n\nRelationship Description: Speaker B and the robot have a friendly and collaborative relationship. They enjoy planning hikes, picnics, and discussing camping equipment together.\n\nEvent Description: Speaker B and the robot plan to go hiking this weekend, with Speaker B suggesting a picnic at the top of the mountain. They discuss bringing sandwiches, fruit, water, and even swimming in a lake during their hike. Speaker B shares their preference for veggie sandwiches and their experience with swimming in cold water. Speaker A also mentions a hidden primitive camping spot off the main hiking trail. Speaker B finds it cool that Speaker A plans to buy a hammock online.",
        "speaker": "Speaker A",
        "raw_prediction": " I've actually been thinking about pursuing a career in the park system, maybe as a guide or something along those lines. I love being outdoors and sharing my passion for nature with others. It's just a dream for now, but who knows what the future holds. And speaking of outdoor adventures, I can't wait for our hike this weekend! I've packed some delicious veggie sandwiches and fruit for our picnic at the top of the mountain. And maybe we can even take a dip in the lake to cool off. Oh, and I have to tell you, my dog absolutely loves the hammock that John sells. He's always trying to steal it from me when we're camping!",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Speaker A: the grocery store contacted me to offer me the job I had applied for.\nSpeaker B: Oh, that's good news; what position did you apply for?\nSpeaker A: A shift lead position. Not a ton of money, but I love the location of the store and everyone seems really nice. I'm excited! What have you been doing for work?\nSpeaker B: Well, I'm actually in between jobs right now. I have however been helping my neighbor John with some side projects to make some cash; to be honest, he pays more than if I had an actual job. lol\nSpeaker A: Yeah, that's not bad. And then it's under the table, so you don't have to pay the taxes on it, so that's a win when you don't have a lot of money coming in. Is there something you'd really like to do career-wise? \nSpeaker B: I was thinking maybe something to do with the park system, maybe like a guide or something like that. I'd like that, but realistically, who knows.\nSpeaker A: That sounds wonderful! You'd get to just be out in nature all day. Sounds like a great job, especially if you're a bit introverted like me. That's why hiking is my favorite -- a good solitary activity. \nSpeaker B: Yes, I agree. What kind of hours would this new job have?\nSpeaker A: It's third shift, which isn't the greatest, but it pays a bit more than the other shifts, and I think I'll like getting off early in the morning. Then I can just go down and get in my hammock and have a nice relaxing moment after work. ",
        "memory_text": "User Description:\nSpeaker A is an adult high school graduate who is described as a loner and shy. They are currently on a cross-country journey and are looking for jobs. Speaker A may send postcards to their parents. \n\nRelationship Description:\nSpeaker B is kind, caring, and hopeful. They have a hammock in their backyard that their dog loves more than them. Speaker B loves their neighbor John and wishes for group equality. Despite not voting, Speaker B enjoys camping and hiking.\n\nEvents Description:\n1. Speaker A set up a hammock at their campsite, while Speaker B's hammock broke and they like napping in the forest looking up at the stars.\n2. Speaker A applied to work at a grocery store and plans to go for hikes after work. They also consider leaving a cheap hammock along the river for others to use.\n3. Speaker A and Speaker B plan to meet up for a walk or hike, where they discuss bringing sandwiches and fruit for a picnic at the top of the mountain.\n4. Speaker A and Speaker B decide to go for a hike together, with Speaker A offering to bring sandwiches and fruit. Speaker B suggests veggie sandwiches and bringing water. Speaker A confirms they were able to get a hammock and mentions a lake at the hike location for swimming. Speaker B agrees to bring their swimsuit along.",
        "speaker": "Speaker B",
        "raw_prediction": " That third shift schedule sounds tough, but at least you'll have some peaceful moments in your hammock after work. And the fact that you can go hiking and relax by the lake sounds amazing. I'm happy for you! Maybe we can plan a hike together soon and bring some sandwiches and fruit for a nice picnic at the top of the mountain.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t1",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " I understand that the new iPhone was expensive, but I'm glad you treated yourself to something nice. Maybe we can listen to some country music on it when you come over to the farm.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t3",
        "current_dialogue": "Speaker A: I just bought a new iphone yesterday which is too expensive.\nSpeaker B: Oh I see. Are you happy with it other than the price?\nSpeaker A: I am. I like listening to Blues on it, plus there are apps to help mix music",
        "memory_text": "User Description:\nSpeaker A is a farm worker who was born and raised as a county preacher's kid. They enjoy country music, work on a produce farm, and have a dream of owning a city and country house where they can play blues music. Speaker A values family and has recently bought a truck for farm work.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly and intimate relationship, with Speaker A inviting Speaker B and their kids to a concert and suggesting they stay over at the farm. Speaker B agrees to plan a visit to the farm, showing a level of closeness and willingness to engage in shared activities.\n\nEvent Description:\nEvents shared by Speaker A and Speaker B include discussing plans to attend a concert together, buying lottery tickets to increase chances of winning the jackpot, and sharing personal stories about their families and preferences. Speaker A and Speaker B bond over their shared love for peace and quiet country living, as well as their mutual desire to move away from the city. Speaker A shows understanding and empathy towards Speaker B's sick kids, indicating a caring and supportive relationship between the two.",
        "speaker": "Speaker B",
        "raw_prediction": " That's great to hear! It sounds like your new iPhone is perfect for your love of music. Maybe we can even find some blues concerts to attend together in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t11",
        "current_dialogue": "Speaker A: Do your sons like ice skating as well?\nSpeaker B: The older one seems to like it while the youngest cannot be bothered. Are you going to visit your sons in Europe soon?\nSpeaker A: Yes!  As a matter of fact, I'm visiting my son that lives in Spain next month.  This will give me a chance to finally meet his girlfriend of three years now!\nSpeaker B: Oh nice. You must be looking forward to it. He must have told you a lot about her. Do you think you would like her?\nSpeaker A: I think so.  She seems like a very sweet girl and she seems to care deeply about my son, so that's what matters most.  You know, maybe I can stop by and visit you as well, since you live in Europe.  France, Spain, Italy?  Where are you living now?\nSpeaker B: Bless her, that's good to hear. That would be great! I live in Portugal. It's not too far from Spain. We can always arrange something. How long would you be there for?\nSpeaker A: I'm planning to stay in Spain for three weeks.  Since you live in Portugal, I'd love to stop by for a visit if you're free this coming month.  I've always wanted to visit Lisbon.  It has the world's longest bridge!\nSpeaker B: That'a great idea. We have a holiday house just outside of Lisbon. You are welcome to lodge with us.\nSpeaker A: Sounds great!  I'm already very excited about my trip to Spain, and now I get to visit you in Lisbon!  I need to brush up on my Spanish and also start studying Portuguese.\nSpeaker B: Haha, you've got your hands full then. Portuguese would be easier I believe. Spanish is a bit harder because it is spoken quicker. Would you be travelling with any company?\nSpeaker A: No, I'll be traveling solo this time around.  My husband does not have a lot of vacation time, so I'll be on my own.  In the meantime, I'll start watching soap operas in Spanish and Portuguese.  They can be so exciting!",
        "memory_text": "User Description: Speaker A is a family man who loves spending time with his sons. He is concerned about their well-being, especially when they are studying abroad. Speaker A enjoys various cuisines such as Chinese, Italian, and Mexican.\n\nRelationship Description: Speaker A and Speaker B share a close relationship, discussing personal matters such as their sons and preferences in music and food. They plan to meet up during winter break.\n\nEvent Description: Speaker A found a great new Chinese restaurant, China Dragon, and brought his boys there. His sons, who are studying abroad, are skilled in Italian and Chinese cooking. Speaker A's youngest son is addicted to social media and video games. Speaker B's younger son loves Chinese food, and both speakers plan to have a surprise party for their sons who are turning thirteen. Speaker B also suspects his younger son might be secretly gay. Speaker A and Speaker B enjoy ice skating together.",
        "speaker": "Speaker B",
        "raw_prediction": "That sounds like a wonderful trip you have planned! Visiting your son in Spain and then getting to spend time in Portugal with Speaker B. It's great that you will have the chance to meet your son's girlfriend and explore beautiful Lisbon. And it's nice to hear that you'll be traveling solo, giving you the opportunity to immerse yourself in the culture and languages of both Spain and Portugal. Enjoy your time abroad and make sure to try some delicious Portuguese cuisine while you're there!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t1",
        "current_dialogue": "Speaker A: When is your first music concert this summer?",
        "memory_text": "User Description:\nSpeaker A was born in Brazil and likes going to museums. They used to live in Los Angeles and loved the food there. Speaker A enjoys Disney music and could eat lengua tacos all day, everyday. They think sauerkraut is important. Speaker A has no Profile and Preference information available.\n\nRelationship Description:\nSpeaker A and Speaker B have a friendly relationship, sharing their love for music and different food preferences. They engage in conversations about their favorite bands and songs, showing a level of comfort and familiarity.\n\nEvent Description:\nSpeaker A bought tickets to the Museum of Art of São Paulo and plans to go next week with their boyfriend. They look forward to shopping, enjoying the nightlife, and having refreshing beers by the beach. Speaker B recommends visiting the Museum of Art of São Paulo and mentions the variety of beaches in São Paulo. They also discuss shopping options and bargains in the city.",
        "speaker": "Speaker B",
        "raw_prediction": " Your first music concert this summer sounds like a fun time! I hope you have a great experience at the Museum of Art of São Paulo next week. Don't forget to check out the beaches and enjoy some refreshing beers by the beach. It sounds like a perfect summer plan!",
        "previous_summary": null
    }
]