[
    {
        "utter_id": "e1-s5-t2",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.",
        "memory_text": "1. The Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace, understanding that starting over can be tough. \n2. The Mentee has been offered a job and has decided to take the job in the city, hoping to inspire others to join the cause of gender equality and fighting discrimination.\n3. The Mentor is supportive and praises the Mentee for their mature decision-making process, believing their work has been influential and that they will continue to make an impact in the world. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.",
        "speaker": "Mentee",
        "raw_prediction": "You're right, Mentor. I'll try to stay positive and open to new experiences. Hopefully, I'll make some new friends soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t1",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?",
        "memory_text": "Neighbor A and Neighbor B have known each other for years, becoming good friends. They both agree to start this weekend and are looking forward to it. Neighbor B enjoys cooking and suggests making something together. Neighbor B suggests having extra water on hand for the next time Neighbor A mows the lawn, showing consideration for each other.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm definitely feeling refreshed now! Thanks for the spontaneous dip!",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.",
        "memory_text": "Neighbors A and B, who have known each other for years, plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. They are on friendly terms and enjoy spending time together. Neighbor B is comforting and supportive towards Neighbor A. They reminisce about past events and cherish their friendship.",
        "speaker": "Neighbors B",
        "raw_prediction": "I appreciate the apology. Let's move on and enjoy the rest of our time together.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t10",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.",
        "memory_text": "Neighbors A and B initially wanted to spend more time together as they didn't know each other well. Now, they are on friendly terms and enjoy spending time together. Additionally, both neighbors enjoy spending time outside, even if it involves doing chores like mowing the lawn. As a result, Neighbor B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides. Furthermore, they plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. This indicates that Neighbors A and B have not seen each other in a while and are catching up. Moreover, Neighbor A mentioned mowing the lawn with an old push mower, suggesting they are responsible for the yard work. This is related to Neighbor A feeling pressured to look perfect all the time by their mom, who scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's fair, everyone has their own preferences when it comes to working out. Do you have a favorite indoor workout routine?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t12",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.",
        "memory_text": "Neighbors A and B are on friendly terms and enjoy spending time together. They have known each other for years and have become good friends. They have not seen each other in a while and are catching up. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's always nice to relax indoors when it's scorching outside. Speaking of which, do you have any plans for the weekend?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t14",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.\nNeighbors B: I feel the same way. We should plan something fun to do together.",
        "memory_text": "Neighbors A and B want to spend more time together as they haven't seen each other in a while and are catching up. They both enjoy spending time outside, even if it involves doing chores like mowing the lawn. Neighbor A enjoys spending time in Neighbor B's cozy home and wants to hang out more often. They both agree to start this weekend and are looking forward to it. They plan to hang out once a week, possibly watching a movie, getting coffee, or just talking. Both Neighbors A and B, who are on friendly terms, enjoy spending time together. They have known each other for years and have become good friends, reminiscing about past events.",
        "speaker": "Neighbors A",
        "raw_prediction": "How about we go for a walk in the park this weekend? It'll be nice to enjoy the outdoors together.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t3",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.",
        "memory_text": "1. Co-worker B mentioned helping a customer resolve an issue last week, showing a willingness to assist others. This reminds Co-worker A of the time when Co-worker B was supportive and willing to help in any way. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it. \n2. Co-worker A spoke with the police about the incident and the women involved were thankful. In reaction, Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time. \n3. Co-worker B mentioned helping a customer resolve an issue last week, showing a willingness to assist others. This made Co-worker A remember how brave and strong Co-worker A has been in past situations. This further led to Co-worker B admiring Co-worker A's resilience and positivity, and eventually appreciating Co-worker A's positivity and friendship.",
        "speaker": "Co-workers B",
        "raw_prediction": "You can't force someone to be with you, Co-worker A. It's important to respect her choices and feelings.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t5",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.",
        "memory_text": "Co-worker B showed a willingness to assist others by helping a customer resolve an issue last week. This demonstrates Co-worker B's supportive nature and readiness to help in any way. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it, similar to when they spoke with the police about an incident where the women involved were thankful. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time. \nCo-worker B commended Co-worker A for their bravery and willingness to help, leading Co-worker A to try to stay positive and focus on their recovery despite it being a daunting task. Co-worker B admires Co-worker A's resilience and positivity, describing them as someone who can stay optimistic even in challenging situations, such as the accident where they lost their hands and feet.",
        "speaker": "Co-workers B",
        "raw_prediction": "I understand that you were struggling with your feelings, but it's important to always consider how your actions might impact others. It's essential to respect boundaries and choices, even when it's difficult.",
        "previous_summary": "Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\nCo-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\nCo-worker A is described as positive and able to stay optimistic even in challenging situations, like the accident where they lost their hands and feet.\nCo-worker B appreciates Co-worker A's positivity and friendship."
    },
    {
        "utter_id": "e4-s5-t3",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.",
        "memory_text": "- Co-worker A is considering seeing a doctor to ensure everything is okay and Co-worker B is supportive and glad that Co-worker A is okay. Co-worker B was surprised to learn about Co-worker A's past struggles.\n- Co-worker B offers help and support to Co-worker A, and Co-worker A is grateful to Co-worker B for letting them borrow the horse and is having a great time riding her. This act changed Co-worker B to be glad to have been able to help Co-worker A and feel the trade worked out well for both of them. Co-worker B is also impressed with Co-worker A's well-thought-out plans for their partnership.",
        "speaker": "Co-workers B",
        "raw_prediction": "Thanks for offering, I appreciate it. I think I can handle it for now, but I'll let you know if I need some assistance.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t5",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.",
        "memory_text": "1. Co-worker B is glad to have been able to help Co-worker A and feels the trade worked out well for both of them. Helping out makes Co-worker B feel good too.\n2. Co-worker A is grateful to Co-worker B for letting them borrow the horse and is having a great time riding her. Co-worker B is glad to have been able to help Co-worker A and feels the trade worked out well for both of them. They are looking forward to starting their partnership and are open to seeking extra help if needed.\n3. Co-worker B is supportive and glad that Co-worker A is okay. Co-worker A now has a good job and is doing well, despite their difficult upbringing.",
        "speaker": "Co-workers B",
        "raw_prediction": "I appreciate the offer, but I think I can handle it for now. Thanks for looking out for me though.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t2",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?",
        "memory_text": "Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B. This indicates a desire to strengthen their bond and enjoy each other's company. As a result, both Classmates A and B enjoy talking to each other and consider themselves great study partners. This positive interaction is further emphasized when Classmate B admires Classmate A's dedication and believes they have a knack for science. The conversation flows smoothly as they share a common interest in science, with Classmate A mentioning their favorite Lady Gaga song, \"Born This Way.\" Additionally, Classmates B is considering taking biology classes in college to deepen their understanding of how the body functions, while Classmate A is driven by a passion for science and dreams of becoming a doctor or researcher to make a difference in people's lives. Their good relationship is evident through expressions of admiration for each other's intelligence and sense of humor, fostering a supportive environment for their academic pursuits.",
        "speaker": "Classmates A",
        "raw_prediction": "I've been thinking about our upcoming science project. Do you have any ideas on what topic we should choose?",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t3",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.",
        "memory_text": "Classmates A finds it refreshing to talk to someone genuinely interested in science and learning, which makes Classmates A passionate about science and interested in becoming a doctor or researcher to help people and make a difference. Both Classmates A and B enjoy talking to each other and consider themselves great study partners, as Classmate A is balancing high school and college classes to be successful and help their family. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B, who is considering taking biology classes in college to learn more about how the body works, while Classmate A is considering majoring in biology or the medical field.",
        "speaker": "Classmates B",
        "raw_prediction": "I think there might be a misunderstanding. Can we please talk about this?",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t4",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.",
        "memory_text": "1. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor. This admiration has led to both Classmates A and B enjoying talking to each other and considering themselves great study partners. As a result, they are excited about seeing Lady Gaga in concert and are looking forward to singing and dancing along to her hits.\n\n2. Classmates A has developed a crush on Classmates B, which Classmates B finds flattering. In response, Classmates B is considering taking biology classes in college to learn more about how the body works. Meanwhile, Classmate A is balancing high school and college classes to be successful and help their family.",
        "speaker": "Classmates A",
        "raw_prediction": "I must have misunderstood the situation, I apologize for jumping to conclusions.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t13",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.",
        "memory_text": "Neighbors A and B joke about the fun aspects of using telekinesis to surprise people. Neighbor B is excited and supportive of Neighbor A's new ability. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning. \nNeighbors A enjoys cooking and made roasted vegetables and quinoa for dinner. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning. \nNeighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation. Neighbor A is thinking about exploring new skills or hobbies outside of work, such as taking online courses or learning a new language.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'll start looking for some new restaurants for us to try out. It'll be a nice way to unwind after a long day.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t1",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.",
        "memory_text": "1. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends. This causes Classmates B to appreciate Classmates A's gesture of buying coffee. In reaction, Classmates A agreed to try the suggestion and thanked Classmates B for it. As a result, Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n\n2. Classmate A encourages Classmate B to initiate conversations and be friendly to make new friends. In reaction, Classmates A is social and enjoys meeting new people. This makes Classmates A consider talking to a therapist or counselor to address past issues.\n\n3. Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings. This makes Classmates A want to enjoy treating their friends to coffee, which causes Classmates A and B to have shared memories of buying coffee from Starbucks and enjoying it together.",
        "speaker": "Classmates A",
        "raw_prediction": "That's great to hear! I can't wait to hear about your exciting plans.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t8",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.",
        "memory_text": "Classmate A and Classmate B have a strong bond from enjoying social activities together, leading to shared memories of buying coffee and planning to meet for coffee again in the future. \nClassmate B looks up to Classmate A's outgoing nature and appreciates their gesture of buying coffee, which sparks a chain of supportive interactions where they encourage each other to take steps towards a better future.",
        "speaker": "Classmates A",
        "raw_prediction": "And together, we could really make a strong team. I'm excited to see where this project takes us.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t10",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.",
        "memory_text": "Classmates A and B enjoy singing karaoke together and look forward to future outings. They are open to meeting for coffee again in the future. Classmates A agreed to try the suggestion and thanked Classmates B for it. Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n\nClassmates A and B both enjoy socializing and going out to parties together. They are open to meeting for coffee again in the future. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep. However, Classmates A expresses regret about their past academic performance.\n\nClassmates A and B enjoy singing karaoke together and look forward to future outings. They both plan to relax at home later in the day. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep. Classmates B suggests going back to school or taking courses to improve.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm really excited about this opportunity. I think we can achieve great things together.",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t12",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?",
        "memory_text": "- Classmates B admires Classmates A's outgoing nature and appreciates their gesture of buying coffee.\n- Classmates A agrees to try the suggestion and thanks Classmates B for it, encouraging them to work through their feelings for a better future.\n- Classmates A encourages Classmates B to initiate conversations and be friendly to make new friends, and they are open to meeting for coffee again in the future.\n- Classmates B suggests going back to school or taking courses to improve, and Classmates A is looking forward to meeting up with them again after getting better sleep.",
        "speaker": "Classmates A",
        "raw_prediction": "I've actually been trying some new techniques to improve my sleep, and it seems to be helping. Thanks for asking!",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t15",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?\nClassmates A: I was thinking about starting a marketing agency specialized in social media.\nClassmates B: That's a great idea! I'd love to work with you on that. We could really make a difference in the industry.\nClassmates A: Yes, exactly! And I think our skills complement each other's so well.\nClassmates B: I totally agree. You're so creative and outgoing, while I'm more analytical and detail-oriented.\nClassmates A: It's like we were meant to work together, right?\nClassmates B: Absolutely! I can't wait to see what the future holds for us.\nClassmates A: Me too. And honestly, it's a bit of a relief to finally have a solid plan for the future.\nClassmates B: Yeah, I get that. Speaking of the future, how have you been doing with your sleeping problems?\nClassmates A: It's been a slow process, but I've been making progress with it. I started doing yoga and meditation before bed, and that's been helping a lot.\nClassmates B: That's great to hear. And what about your past struggles with school and friendships? Do you feel like you've moved on from that?\nClassmates A: Definitely. It's been a journey, but I've worked hard to overcome those obstacles. And now I feel like I'm finally on the right path.",
        "memory_text": "Classmates A encourages Classmates B to initiate conversations and be friendly to make new friends, causing Classmates B to appreciate Classmates A's gesture of buying coffee. In reaction, Classmates A agreed to try the suggestion and thanked Classmates B for it, wanting Classmates B to encourage them to work through their feelings and take steps towards a better future.\n\nClassmate A suggests planning a picnic in the park or a hike for the next outing with friends, and both Classmates A and B plan to relax at home later in the day. They both want to meet up again after getting better sleep, with Classmates B suggesting going back to school or taking courses to improve.",
        "speaker": "Classmates B",
        "raw_prediction": "I'm really proud of you for all the progress you've made. It's inspiring to see how far you've come.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.",
        "memory_text": "Classmate A grew up around carpentry as their dad was a carpenter, and started helping him out at a young age, eventually developing a passion for it. \nClassmate A is attending a seminar on starting a business and is excited about applying that knowledge to future plans, leading them to research local open mic nights and talent showcases to start building a following. \nClassmate B hopes the President will consider their concerns and make improvements for the country's betterment, while Classmate A appreciates the support and encouragement from Classmate B and wants to get to know them better to potentially become friends.",
        "speaker": "Classmates B",
        "raw_prediction": "It's wonderful that you found your passion at such a young age. Your dad must be proud to see you following in his footsteps.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t4",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?",
        "memory_text": "- Classmate A has a background in carpentry from helping their dad and now enjoys it as a career.\n- Classmate B acknowledges and supports Classmate A's journey into carpentry.\n- Classmate B hopes for improvements from the President for the country's betterment.\n- Classmate A is eager to learn business strategies and attends a seminar on starting a business.\n- Classmate A plans to apply the knowledge gained from the seminar to future business endeavors.\n- Classmate A is researching local opportunities like open mic nights to build a following for their talent.",
        "speaker": "Classmates A",
        "raw_prediction": "I recently finished a custom-built bookshelf for a client, and they were thrilled with the result. It's always satisfying to see the impact of my work on someone's home.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t8",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?\nClassmates A: Yeah, I just finished building a custom bookshelf for a client. It was a challenging project, but I'm really happy with how it turned out.\nClassmates B: That's impressive! You must have a lot of skill to be able to build something like that.\nClassmates A: Thanks! It definitely takes a lot of practice and attention to detail. But I find it really rewarding to see a finished product that I created with my own two hands.\nClassmates B: I can imagine. It must also be nice to have a steady income from your work.",
        "memory_text": "1. Classmate A supports the President and believes he is doing a good job. This aligns with Classmates A appreciating the support and encouragement from Classmates B, who in turn is supportive and encourages Classmate A to pursue their dream.\n2. Classmate A mentions the President's policies to boost job growth as progress in the economy, leading to Classmates A being interested in entrepreneurship and signing up for a seminar on starting a business. This causes Classmates A to attend the seminar, excited about applying that knowledge to future plans, and wanting to explore singing, a passion that they never thought possible until now.\n3. Classmate A supports the President and believes he is doing a good job, which is the same topic when Classmates A appreciates the support and encouragement from Classmates B. This leads to Classmates A wanting to get to know Classmates B better and become friends, and also considering reaching out to vocal coaches to improve singing skills.",
        "speaker": "Classmates A",
        "raw_prediction": "It definitely provides a sense of stability, which is important. Plus, I get to be creative and work with my hands, which I love.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t2",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?",
        "memory_text": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. Despite this, Neighbors A values the relationship with Neighbors B and considers them like family. As a result, Neighbors A is excited to explore the neighborhood and make new friends. \n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. This leads to Neighbors A valuing the relationship with Neighbors B and considering them like family. Consequently, Neighbors B acknowledges Neighbors A's friendly and outgoing nature. \n\nNeighbor B has moved around a lot over the years but is considering settling down in the current neighborhood. This prompts Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. Neighbors A values the relationship with Neighbors B and considers them like family, which in turn leads to Neighbors A appreciating having friendly faces around and hoping to make new friends soon.",
        "speaker": "Neighbors A",
        "raw_prediction": "I visited Paris, it was truly unforgettable! The Eiffel Tower was breathtaking, and the pastries were delicious.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t4",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.",
        "memory_text": "Neighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This has caused Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. Neighbors A values the relationship with Neighbors B and considers them like family. As a result, Neighbors A is excited to explore the neighborhood and make new friends.\n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. In response, Neighbors B acknowledges Neighbors A's friendly and outgoing nature.\n\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This has caused Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. Neighbors A finds spending time with God brings them peace and happiness, which led to Neighbors A finding a park and a coffee shop nearby that they want to visit.",
        "speaker": "Neighbors A",
        "raw_prediction": "It was definitely a nice change of pace, but there's still no place like home.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t7",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.",
        "memory_text": "Neighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. This has led to Neighbors A valuing the relationship with Neighbors B and considering them like family. As a result, Neighbors A is excited to explore the neighborhood and make new friends. \n\nNeighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This has caused Neighbors A to enjoy living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B. The value of the relationship with Neighbors B is highlighted, and Neighbors A appreciates having friendly faces around and hopes to make new friends soon. \n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. However, Neighbors A just moved to a new neighborhood and is getting to know the area.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that you've found a place here that you can call home. It's always nice to have a sense of belonging in a community.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t9",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.",
        "memory_text": "Neighbor A and Neighbor B appreciate each other as good neighbors and have organized a block party together in the past. This routine has brought positive changes, helping them stay focused, calm, and grateful. Spending time with God brings Neighbor A peace and happiness. Now, Neighbor A found a park and a coffee shop nearby that they want to visit.\n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. They feel comfortable and safe, have made good friends, including Neighbors B. Neighbor A values the relationship with Neighbors B and considers them like family. This makes Neighbor A excited to explore the neighborhood and make new friends. \n\nNeighbor A has been living in the same place for a long time and enjoys the neighborhood and people there. They feel comfortable and safe, have made good friends, including Neighbors B. Neighbor A values the relationship with Neighbors B and considers them like family. Neighbor B acknowledges Neighbor A's friendly and outgoing nature.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's wonderful how much your neighborhood has become a special place for you. Your positive outlook and sense of community have really made a difference.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t2",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?",
        "memory_text": "1. Classmates B noticed Classmates A's improvement and acknowledged their hard work, which made Classmates B interested in attending a new technology conference next month.\n2. Classmates A's grades are looking good according to their teacher, so Classmates A is working on an essay about the Industrial Revolution and wants to consider how others perceive them, especially in situations like applying to college.\n3. Classmates A's grades are looking good according to their teacher, and Classmates A values being true to themselves and expressing their own style, which is the same topic as Classmate B being interested in attending a new technology conference next month.",
        "speaker": "Classmates A",
        "raw_prediction": "It was about the future of renewable energy and sustainability. Very eye-opening!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t3",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.",
        "memory_text": "Classmates A is also working on an essay about the Industrial Revolution. This dedication to studying hard and taking extra classes to get into a good college caused Classmates A to show up to school in pajamas due to oversleeping after studying late. This incident reminded Classmates B of a funny moment from high school involving Classmates A wearing pajamas to school.\n\nClassmates A is also working on an essay about the Industrial Revolution, which made Classmates B notice Classmates A's improvement and acknowledge their hard work. In response, Classmates B advised Classmates A to consider how others perceive them, especially in situations like applying to college.\n\nClassmates B working on finishing a history project was hindered by Classmates A's past frustration, but Classmates A has learned to channel that energy into studies. This change led Classmates A to be willing to work hard to achieve their dreams and not be afraid to be themselves, embracing their quirks, which their girlfriend appreciates.",
        "speaker": "Classmates B",
        "raw_prediction": "That's fascinating! The history of the pyramids is always so intriguing. Did they mention anything about the theories surrounding how they were built?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t2",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?",
        "memory_text": "1. The Parent has made an effort to start pulling their weight around the house and follow the chore schedule, leading the Child to offer help and show care.\n2. The Child feeling it is unfair to do certain chores because the Parent is tired causes the Parent to acknowledge laziness with dishes and promise to contribute more to cleaning. They also have open communication about various topics, including past accidents and the Parent's commitment to household chores after seeing a doctor and taking medicine.\n3. The Parent feeling tired after working all day prompts the Child to offer assistance by bringing water or making soup while the Parent rests.",
        "speaker": "Parent",
        "raw_prediction": "It's a DIY home improvement project in the backyard. I could use a hand with it.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t8",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?",
        "memory_text": "The child feels it is unfair that they have to do certain chores because the Parent is too tired. The Parent acknowledges being lazy about washing dishes and promises to contribute more to keeping the home clean. The child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n\nThe Child suggests creating a schedule for chores to ensure everyone contributes equally. The Parent expresses a desire to be a better role model for the Child and their siblings. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores. The Parent has seen a doctor and is taking medicine for their illness.",
        "speaker": "Parent",
        "raw_prediction": "I want to save up for a family vacation so we can all have some fun together.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t11",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.",
        "memory_text": "The Parent and Child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores. This has changed as the Parent has seen a doctor and is taking medicine for their illness.",
        "speaker": "Child",
        "raw_prediction": "That could be fun! I'd be happy to help you out with the ads, Parent.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t1",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.",
        "memory_text": "1. Classmates A and B both value trying new things and taking risks for personal development. Classmates B supports Classmates A's perspective on living authentically and free from others' opinions, as Classmate A values independence and focuses on their own happiness. This has led Classmates A to pursue their passions and enjoy life.\n\n2. Classmates A and B, who are in the same class, have discussed study tips in the past. Classmates B gave advice to Classmates A that paid off, leading to a beneficial outcome for Classmate A.\n\n3. Classmates B encouraged Classmates A to step out of their comfort zone and try new things for personal growth. Both speakers highlight the importance of focusing on personal happiness and not being swayed by external judgments.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, I saw it! Your blog is awesome, and I love how you're supporting emerging artists. Keep up the great work!",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t6",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?",
        "memory_text": "Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader.\nCo-worker A acknowledges the importance of communication and resolving conflicts.\nCo-worker A advises Co-worker A to take small steps and have one conversation at a time.\nCo-worker A has fantasies of being a great leader.\nCo-worker A is focused on getting along and working smoothly with Co-worker B.\nCo-worker B acknowledges and supports Co-worker A's growth and progress.\nCo-worker B advises Co-worker A to take small steps and have one conversation at a time.\nCo-worker A considers taking on more responsibility at work as a start towards being a leader.\nCo-worker B acknowledges the importance of communication and resolving conflicts.\nCo-worker A is willing to calm down and have a conversation with Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "I do remember that. It's funny how things have a way of falling into place sometimes.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t7",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.",
        "memory_text": "Co-worker B believes that Co-worker A has the potential to be a great leader if they use their power for good, and Co-worker A has aspirations of being a great leader and emphasizes the importance of communication. This aligns with Co-worker A's past fantasy of being a great leader and being respected and admired.\n\nCo-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader, which resonates with Co-worker A's aspirations and emphasis on communication. This connects with Co-worker A's past fantasy of being a great leader and being respected and admired.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's amazing to see how far you've come since then. Your leadership skills have definitely shone through, and I'm sure you'll excel in this new role as a product manager.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t10",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?",
        "memory_text": "Co-worker A has aspirations of being a great leader and emphasizes the importance of communication. This aligns with Co-worker B believing that Co-worker A has the potential to be a great leader if they use their power for good. Additionally, Co-worker A used to fantasize about being a great leader and being respected and admired, showing a consistent desire for leadership roles.\n\nCo-worker A has grown and become more confident over the years, as seen in their shift from feeling embarrassed for losing control of their emotions to now feeling ready for the challenge of a leadership position. This growth is further supported by Co-worker B encouraging Co-worker A to consider pursuing a leadership position and highlighting the qualities of a good leader.\n\nBoth Co-workers agree that a good working relationship is important, reflecting their shared values of improvement and pushing themselves to be better.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm grateful for your support during that time. It's been a journey, but I'm glad we've grown and learned from those challenges.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t12",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.",
        "memory_text": "Co-worker B believes that Co-worker A has the potential to be a great leader if they use their power for good. This aligns with Co-worker A's aspirations of being a great leader and emphasizing the importance of communication.\n\nCo-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader. In response, Co-worker B acknowledges the importance of communication and resolving conflicts, which prompts Co-worker A to calm down and have a conversation with Co-worker B.\n\nCo-worker A has fantasies of being a great leader, which is related to their feeling stressed about their relationship with Co-worker B. This stress is a result of Co-worker A feeling embarrassed for losing control of their emotions in the past.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, I've always believed in the power of growth and learning from past experiences. I'm ready to tackle this new challenge head-on and continue to develop my leadership skills.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t15",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.\nCo-workers A: Oh yeah, I still try to keep up with it whenever I can. It's important to stay physically and mentally fit, especially with this new job.\nCo-workers B: Just don't let your anger get the better of you again. Remember when you exploded and started throwing things?\nCo-workers A: Ugh, let's not even go there. My parents gave me a good scolding for that.",
        "memory_text": "Co-worker A fantasizing about being a great leader led to them emphasizing the importance of communication and aspiring to be respected and admired.\n\nCo-worker B encouraging Co-worker A to pursue a leadership position resulted in them stressing the significance of communication, conflict resolution, and taking small steps in conversations.\n\nCo-worker A's fantasies of being a great leader influenced them to prioritize getting along and working smoothly with Co-worker B, despite feeling stressed about their past relationship. This stress caused Co-worker B to advise Co-worker A on managing emotions and addressing the issue openly.",
        "speaker": "Co-workers B",
        "raw_prediction": "Well, it sounds like you've learned a lot from that experience. Remember to keep your cool and handle any challenges that come your way with grace and composure in your new role as a product manager.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t16",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.\nCo-workers A: Oh yeah, I still try to keep up with it whenever I can. It's important to stay physically and mentally fit, especially with this new job.\nCo-workers B: Just don't let your anger get the better of you again. Remember when you exploded and started throwing things?\nCo-workers A: Ugh, let's not even go there. My parents gave me a good scolding for that.\nCo-workers B: Well, all that matters is that you learn from your mistakes and keep moving forward. And hey, you're doing just that with this promotion.",
        "memory_text": "Co-worker B encourages Co-worker A to consider pursuing a leadership position and highlights the qualities of a good leader, which resonates with Co-worker A's aspirations of being a great leader and emphasizing the importance of communication. This growth in confidence over the years has led to Co-worker A feeling embarrassed for losing control of their emotions in the past.",
        "speaker": "Co-workers A",
        "raw_prediction": "Absolutely, I've come a long way since then. I'm focused on staying composed and leading by example in my new role as a product manager.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t17",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.\nCo-workers A: Oh yeah, I still try to keep up with it whenever I can. It's important to stay physically and mentally fit, especially with this new job.\nCo-workers B: Just don't let your anger get the better of you again. Remember when you exploded and started throwing things?\nCo-workers A: Ugh, let's not even go there. My parents gave me a good scolding for that.\nCo-workers B: Well, all that matters is that you learn from your mistakes and keep moving forward. And hey, you're doing just that with this promotion.\nCo-workers A: Absolutely. Thanks for always being a supportive colleague, it means a lot to me.",
        "memory_text": "Co-worker B believes in Co-worker A's leadership potential and emphasizes the importance of mutual support in the workplace. Co-worker B shows support for Co-worker A's growth and advises taking small steps in conversations. \n\nCo-worker A dreams of becoming a great leader and stresses the importance of effective communication. Over the years, Co-worker A has gained confidence and maturity. However, Co-worker A regrets losing control of their emotions.\n\nCo-worker B motivates Co-worker A to pursue a leadership role and discusses the traits of a good leader. Co-worker A feels anxious about the relationship with Co-worker B, assuming they wouldn't understand or care about their worries.",
        "speaker": "Co-workers B",
        "raw_prediction": "You've worked hard for this promotion, and I have no doubt you'll excel in your new role. Just remember to stay true to yourself and your leadership style.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t1",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.",
        "memory_text": "Neighbors A felt their relationship with Neighbors B was improving after trying a breathing exercise. Neighbor B reassured Neighbor A about past embarrassing incidents, strengthening their friendship. Neighbor A surprised Neighbor B with a pizza, leading to both neighbors looking forward to new adventures and discoveries together.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's great to hear! Breathing exercises can be so beneficial for relaxation.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t2",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?",
        "memory_text": "Neighbors A surprised Neighbors B with a pizza, which led to Neighbors A being willing to take things slow in their relationship with Neighbors B. This was followed by Neighbor B sharing that their son also started high school, creating a bond over the challenges and excitement of this milestone. \nNeighbors A did a gesture of appreciation for Neighbors B's actions in the neighborhood, resulting in Neighbors A being willing to take things slow in their relationship with Neighbors B. Neighbor B then reassured Neighbor A about past embarrassing incidents, highlighting their strong friendship. \nNeighbors A surprised Neighbors B with a pizza, showing their value for friendship, leading to a discussion about Neighbor A's daughter starting high school and the adjustments the family is going through.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's called box breathing. You inhale for four seconds, hold for four seconds, exhale for four seconds, and hold for four seconds again. It's quite calming.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t4",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.",
        "memory_text": "Neighbors A showed appreciation for Neighbors B's actions in the neighborhood, prompting them to take things slow in their relationship. In response, Neighbor B reassured Neighbor A about past embarrassing incidents and emphasized their current friendship.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, they definitely can. I find it so grounding and calming. Have you tried any other relaxation techniques before?",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t7",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?",
        "memory_text": "Neighbors A surprised Neighbors B with a pizza, leading to Neighbors A developing romantic feelings for Neighbors B. This triggered Neighbor A to feel embarrassed about a past incident where they pushed Neighbor B's shoulder to gain acceptance.",
        "speaker": "Neighbors B",
        "raw_prediction": "Oh, yeah, I remember that. It's all good, no need to worry about it. We all have our moments.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t10",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?",
        "memory_text": "Neighbors A showed appreciation for Neighbors B's actions in the neighborhood, leading to Neighbors A being willing to take things slow in their relationship with Neighbors B. This resulted in Neighbors B reassuring Neighbor A about past embarrassing incidents and emphasizing their current friendship. \nNeighbors A ordered a large cheese pizza with extra sauce for Neighbors B, highlighting the value of their friendship. This conversation transitioned to Neighbor A's daughter starting high school, which has been a significant adjustment for the family.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, that park has been such a peaceful place to unwind. I still go there sometimes to clear my mind.",
        "previous_summary": "Neighbor A recently discovered a park on Main Street with a playground and water park area.\nNeighbor A went to the park with their son, who had a great time.\nNeighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic."
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!",
        "memory_text": "- Neighbors B is supportive and believes Neighbors A's story, suggesting looking up UFO sightings in the area. This leads to Neighbors A feeling tired from work and needing to catch up on sleep. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries, which caused Neighbors A to make a big career change recently and be much happier now.\n\n- Neighbors A plans to do some research and possibly report the sighting of the UFO, then suggests planning something else to do together over the weekend. This makes Neighbors A want to start looking for new opportunities soon, updating their resume and starting networking, after they took the leap to make a change and are glad they did.\n\n- Neighbors B is supportive and believes Neighbors A's story, suggesting looking up UFO sightings in the area, and this is in the same topic where Neighbors B is supportive of Neighbors A's decision and admires the courage it took.",
        "speaker": "Neighbors A",
        "raw_prediction": "I know, it's unbelievable! I still can't wrap my head around it.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t2",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?",
        "memory_text": "Neighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience. This leads to Neighbor A suggesting planning something else to do together over the weekend. The conversation reveals that Neighbors A is feeling stagnant in their current job and is looking for more growth and challenge, which caused Neighbors A to make a big career change recently and feel much happier now.\n\nNeighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience. This leads to Neighbor A suggesting planning something else to do together over the weekend. The discussion reflects that Neighbors A is feeling stagnant in their current job and is looking for more growth and challenge, which originates from a conversation Neighbors A and B had a couple of years ago about needing a change.\n\nNeighbors B is supportive and believes Neighbors A's story, suggesting looking up UFO sightings in the area. This prompts Neighbor A to suggest planning something else to do together over the weekend. Neighbor A expresses the desire to start looking for new opportunities soon, needing to update their resume and start networking, which resulted in Neighbors A taking the leap to make a change and feeling glad they did.",
        "speaker": "Neighbors A",
        "raw_prediction": "I won the lottery! It still feels surreal.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t3",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.",
        "memory_text": "Neighbors A is feeling stagnant in their current job and is looking for more growth and challenge, which caused Neighbors A to make a big career change recently and become much happier now. \nNeighbors A appreciates Neighbors B's understanding and willingness to listen and talk about the experience, leading Neighbors B to be supportive of Neighbors A's job search and offer to connect them with people in different industries, admiring the courage it took. \nNeighbors B is supportive and believes Neighbors A's story, which made Neighbors A take the leap to make a change and is glad they did.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's amazing news! I'm happy for you. What are your plans now that you have this unexpected fortune?",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t3",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.",
        "memory_text": "Neighbor A mentioned cleaning up a tree house to prevent insects and spiders from living in it, and Neighbor B agrees, mentioning the sense of community built through helping each other. Neighbor B recalls a past experience where their tree house was destroyed due to lack of proper care, and Neighbor A helped with their lawn, showing mutual support between them. As a result, Neighbor A and B are planning to work together to rearrange the living room over the weekend.",
        "speaker": "Neighbors B",
        "raw_prediction": "I get it, work can be really stressful. If you need to talk about it or vent, I'm here for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t4",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.\nNeighbors B: That's understandable. Have you tried talking to your boss about it?",
        "memory_text": "Neighbors A and B share a sense of community by helping each other with tasks like cleaning up a tree house and maintaining outside spaces. This mutual support and reciprocity strengthen their bond as neighbors.",
        "speaker": "Neighbors A",
        "raw_prediction": "I did try talking to my boss, but unfortunately, it didn't go well. I'm just hoping things will improve soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "- Co-worker A and Co-worker B reminisced about happy memories from their time working together, sparking joy in their conversation.\n- Co-worker A, described as having \"Sherlock Holmes-like skills,\" expressed a desire to celebrate their detective work with drinks after work, hinting at their enjoyment of solving mysteries.\n- Co-worker A's talent for solving puzzles and mysteries was highlighted, leading to discussions about potentially pursuing a career as a detective.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, I guess I do have a knack for uncovering things. Maybe I missed my calling as a detective!",
        "previous_summary": "Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.\nCo-worker A discovered that an employee was hiding clothes to sell on the side.\nCo-worker A enjoys solving puzzles and mysteries, even considering becoming a detective.\nCo-worker A has a talent for solving puzzles and mysteries."
    },
    {
        "utter_id": "e21-s5-t9",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.",
        "memory_text": "The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life. This makes the husband value spending time with his friend, feeling happy and content with their company. Similarly, the husband values the supportive community of believers at church and appreciates having his wife by his side, which makes the wife glad to see the husband finding a sense of purpose and being happy.\n\nThe husband values having someone trustworthy to spend time with and looks forward to working on the podcast project. Both the husband and wife agree that it's the little things that add up and make life meaningful. Additionally, the husband appreciates the little things in life, such as making it to the bus on time, which reminds the wife of the time the husband had to run to catch the bus a couple of years ago.",
        "speaker": "Wife",
        "raw_prediction": "I'm grateful for all those small moments we share together, they truly make a difference in our lives.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t6",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?",
        "memory_text": "The teacher praised the student for their bravery and quick action in the emergency situation, which led to the teacher offering support and reassurance that they are there to talk to. This positive and understanding relationship between the teacher and student is evident.\n\nThe student had a heroic experience at the beach where they saved a young kid from drowning, sparking a desire to spend time with their grandchildren in retirement. Additionally, the student is studying French at college and aims to learn Spanish and German as well.\n\nThe teacher praised the student for their bravery and quick action in the emergency situation, which made the student feel stressed lately, possibly leading to an outburst. As a result, the student wants to visit more often and take the grandkids on trips with their daughter and son-in-law.",
        "speaker": "Student",
        "raw_prediction": "I've been practicing French regularly, and I'm starting to pick up some Spanish too. German is next on my list!",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t10",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.\nTeacher: It could be worth a try. Speaking of trying new things, how's your language studying going?\nStudent: It's going pretty well. I started with French, but now I'm considering taking up Spanish and German too. I want to become more well-rounded.\nTeacher: That's a great goal. Have you thought about any specific ways you could use your language skills?\nStudent: I would love to be able to travel more and speak with the locals in their native language. Maybe I could even teach my grandchildren some basic phrases.\nTeacher: Speaking of your grandchildren, how's your retirement planning going?",
        "memory_text": "The student had a heroic experience at the beach where they helped save a young kid from drowning. This event made the student realize the importance of being aware of surroundings and acting quickly in emergencies. As a result, the student is looking forward to retirement and spending time with their grandchildren, expressing excitement about planning fun activities with them.\n\nThe teacher praised the student for their bravery and quick action in the emergency situation, offering support and reassurance for the student to talk about it. Additionally, the teacher encourages the student's retirement plans, emphasizing the importance of focusing on family during retirement.",
        "speaker": "Student",
        "raw_prediction": "I've been looking into different activities I can do with my grandchildren during retirement. It's exciting to think about all the fun we'll have together.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t5",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.",
        "memory_text": "Neighbor A enjoys reading and sharing books with Neighbor B. This shared interest causes Neighbor A to believe in setting goals, developing a positive attitude, and taking action for personal development and career advancement. As a result, Neighbor A offers to help Neighbor B with getting into a workout routine. In response, Neighbor B offers to be more supportive and check in on Neighbor A more often. \nNeighbor A's favorite book is \"The Great Gatsby,\" which causes Neighbor B to admire Neighbor A's career advancement and express interest in borrowing the personal development book. Neighbor B's admiration leads Neighbor A to offer help with getting into a workout routine. Both neighbors then emphasize the importance of taking care of each other as neighbors.",
        "speaker": "Neighbors B",
        "raw_prediction": "I think we've covered everything for now. I appreciate your proactive approach to avoid misunderstandings. Let's continue to communicate openly if anything comes up in the future.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t7",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.",
        "memory_text": "Neighbor A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement. This belief causes Neighbor A to offer to help Neighbor B with getting into a workout routine. In reaction, Neighbor B offers to be more supportive and check in on Neighbor A more often.\nNeighbor A's favorite book, \"The Great Gatsby,\" causes Neighbor B to admire Neighbor A's career advancement and express interest in borrowing the personal development book. As a result, Neighbor A wants to help Neighbor B with getting into a workout routine. Both neighbors emphasize the importance of taking care of each other as neighbors.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's important. Setting boundaries can help create a more productive work environment. How did your team react to the new expectations you set?",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t5",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.\nClassmates B:  You're right. Our class definitely has a unique energy about it. What do you think sets us apart from other classes?\nClassmates A:  I think it's our sense of community. We all support each other and work together to achieve our goals.\nClassmates B:  That's definitely a big factor. And I also think our class has a lot of diversity, which brings new perspectives and ideas to the table.\nClassmates A:  Yes, absolutely. I love hearing everyone's different viewpoints and experiences. It really helps us all grow and learn.",
        "memory_text": "1. Classmates B, after complimenting Classmates A on their suit and bringing up a past conversation about feelings, is planning to check their schedule to see when they can go to the mall together.\n2. Despite the rejection, Classmate A values their friendship with Classmate B, who appreciates Classmate A's honesty about their feelings but does not feel the same way.\n3. Classmates B enjoys people watching at the mall and feels relieved that they can still be friends with Classmates A, leading both classmates to value their friendship and suggest helping each other find the right person in the future.",
        "speaker": "Classmates B",
        "raw_prediction": "It's so true. I feel like we all benefit from the different backgrounds and ideas we bring to the table.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t6",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.\nClassmates B:  You're right. Our class definitely has a unique energy about it. What do you think sets us apart from other classes?\nClassmates A:  I think it's our sense of community. We all support each other and work together to achieve our goals.\nClassmates B:  That's definitely a big factor. And I also think our class has a lot of diversity, which brings new perspectives and ideas to the table.\nClassmates A:  Yes, absolutely. I love hearing everyone's different viewpoints and experiences. It really helps us all grow and learn.\nClassmates B:  And it's not just in the classroom, but also in extracurricular activities and events. We always have a strong turnout and participation.",
        "memory_text": "Classmates B enjoys people watching at the mall.\nClassmates B appreciates Classmates A's honesty about their feelings, but doesn't feel the same way.\nClassmates A has been busy with work and hanging out with friends, looking forward to the wedding as a fun night out.",
        "speaker": "Classmates A",
        "raw_prediction": "I agree, our class really knows how to come together and make things happen outside of the classroom too. It's impressive to see everyone so involved and engaged.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t9",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.",
        "memory_text": "- [Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.] - (Want) - [Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.]\n- [Co-worker B is concerned about Co-worker A's punctuality and drinking habits.] - (React) - [Co-worker A went through a painful breakup and finds it hard to trust people.]",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear. It's important to stay on top of things and be reliable, especially at work.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t12",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.\nCo-workers B: That's great to hear. It reminds me of the time when you were a great leader in your country. You were strong, determined, and made a positive impact.\nCo-workers A: Wow, that was a long time ago. But I appreciate the compliment. It's nice to be reminded of my successes.\nCo-workers B: Yeah, and even though you had some rough times in your personal life, like that painful breakup, you still managed to pick yourself up and move forward.",
        "memory_text": "Co-worker B supports Co-worker A's efforts to improve their life by being more responsible and reliable, despite concerns about punctuality and drinking habits. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n\nCo-worker B advises Co-worker A to be more disciplined and plan ahead for their actions, recalling Co-worker A's leadership in their country that made it prosperous and safe.\n\nBoth co-workers display a supportive and caring attitude towards each other, with Co-worker B being supportive of Co-worker A's efforts to improve their life by being more responsible and reliable. Co-worker A appreciates the extra space in their new place and the separation between living and sleeping areas for privacy.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks for bringing that up. It's important to remember that I can overcome challenges and keep moving forward.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t11",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?\nNeighbors A: Not really, it was just a fun hobby back then. Plus, I don't think I have the same energy as I did when I was younger.\nNeighbors B: That's understandable. Do you still play any instruments?\nNeighbors A: I have a guitar but I haven't played it in a while. Maybe I should start practicing again.",
        "memory_text": "- [Neighbor A's positive experience with chiropractic care sparks Neighbor B's interest in trying it out.]\n- [Neighbor A's recovery from back pain motivates Neighbor B to look forward to playing together again when Neighbor A feels better.]\n- [Neighbor A and Neighbor B share a mutual fondness for Neighbor A's dog and are excited to play with it again.]\n- [Neighbor A expresses gratitude for Neighbor B's support and friendship.]",
        "speaker": "Neighbors B",
        "raw_prediction": "You should definitely pick up the guitar again! I'd love to hear you play sometime.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t14",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?\nNeighbors A: Not really, it was just a fun hobby back then. Plus, I don't think I have the same energy as I did when I was younger.\nNeighbors B: That's understandable. Do you still play any instruments?\nNeighbors A: I have a guitar but I haven't played it in a while. Maybe I should start practicing again.\nNeighbors B: Yeah, that sounds like a good idea. Maybe you could even teach me a thing or two.\nNeighbors A: Sure, I'd be happy to. Maybe we could even play some music together.\nNeighbors B: That would be great! I've always wanted to learn how to play an instrument.",
        "memory_text": "Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience. Neighbor A looks forward to playing with Neighbor B again when feeling better. Neighbor A found some of their dog's toys while packing, indicating they have a golden retriever. Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.",
        "speaker": "Neighbors A",
        "raw_prediction": "That sounds like a plan! I'll dust off my guitar and we can jam together sometime.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t1",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.",
        "memory_text": "Co-worker B finished a project and sent it to the manager for review. Co-worker A made changes to modernize processes and invest in new technology for the business. This shows Co-worker A's proactive approach to improvement in the workplace.\n\nCo-worker A gave Co-worker B a pen as a thoughtful gesture, which was appreciated. This kind act reflects Co-worker A's friendly and considerate nature. Co-worker A's father was hesitant to hand over the business but now trusts Co-worker A, leading to the success of the family business.",
        "speaker": "Co-workers B",
        "raw_prediction": "I'm sure she'll appreciate the effort you put into it. Good job on completing the report!",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t3",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.",
        "memory_text": "Co-worker A modernized processes and invested in new technology for the family business after taking over, which has been doing well recently.\nCo-worker A gave Co-worker B a pen that they still use and appreciate the gesture.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great, I'm sure your boss will appreciate the thoroughness of the report.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t8",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.\nCo-workers A: It's been a journey, but I'm glad to see the business flourishing. It gives me a sense of pride and accomplishment.\nCo-workers B: I can tell. You're always trying to find ways to improve things.",
        "memory_text": "Co-worker A's father was initially hesitant to hand over the business, but now trusts Co-worker A, who took over their family's business a few years ago and has since seen significant improvement. \nCo-worker A gave Co-worker B a pen as a thoughtful gesture, which was appreciated and thanked for, showcasing Co-worker A's growth and success in managing the family business.",
        "speaker": "Co-workers A",
        "raw_prediction": "I believe continuous improvement is key to success in any business.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t3",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.",
        "memory_text": "- Co-worker B is supportive and interested in the evidence collected by Co-worker A, which leads to Co-worker B commending Co-worker A for their courage in defending their beliefs. This prompts Co-worker A to agree to be more conscious of how they come across to others in the future. Additionally, Co-worker A shares their experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n\n- Co-worker A has been collecting evidence for a case and is confident in the strength of their argument, sparking Co-worker B to commend Co-worker A for their courage in defending their beliefs. This encourages Co-worker A to be more conscious of how they come across to others in the future. Furthermore, Co-worker A shares their experience dealing with challenging clients and stresses the importance of communication and setting expectations.\n\n- Co-worker B is supportive and interested in the evidence collected by Co-worker A, leading to Co-worker B commending Co-worker A for their courage in defending their beliefs. As a result, Co-worker A is willing to take on the project of building a deck for Co-worker B.",
        "speaker": "Co-workers B",
        "raw_prediction": "That dedication to practice really shines through in your speeches. It's impressive how you can make complex topics so relatable and engaging.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t4",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument. This experience has led to Co-worker A presenting evidence in front of a judge to support their position in the past, where they denied that their reputation had any impact on Karen giving them the money.\n   \n2. Co-worker A plans to present the evidence clearly and persuasively in court, which has already changed to Co-worker A having presented evidence in front of a judge to support their position in the past. In that instance, Co-worker A denied that their reputation had any impact on Karen giving them the money.\n   \n3. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument. This has led Co-worker B to commend Co-worker A for having the courage to stand up and defend their beliefs, resulting in Co-worker A being willing to take on the project of building a deck for Co-worker B.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate that, thank you. It's important to present information clearly and convincingly, especially in a courtroom setting.",
        "previous_summary": "Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\nCo-worker B is supportive and interested in the evidence collected by Co-worker A.\nCo-worker A's evidence includes statistics and personal accounts from clients.\nCo-worker A believes their evidence is more compelling than the opposing side's evidence.\nCo-worker A plans to present the evidence clearly and persuasively in court.\nCo-worker A has presented evidence in front of a judge to support their position in the past."
    },
    {
        "utter_id": "e30-s5-t12",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?\nCo-workers A: Yeah, I remember. But she eventually gave me the cash, and I was able to take care of what I needed to.\nCo-workers B: That's good. And speaking of taking care of things, your carpentry skills are amazing. I loved the house you built for me last year.\nCo-workers A: Thanks! I really love building houses. It's a great feeling to take a blueprint and turn it into someone's dream home.\nCo-workers B: You're a true professional. Speaking of professional skills, your speech at the rally really moved the crowd. You have a great way with words.",
        "memory_text": "Co-worker B is interested in Co-worker A's carpentry skills and praises the house built for them. \nCo-worker B praises Co-worker A for standing up for their beliefs and mentions how their reputation may have affected Karen's initial hesitation to give money. \nCo-worker A's confidence in their argument is evident from collecting evidence for a case and presenting it persuasively in front of a judge, despite denying any influence on Karen's decision to lend money.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you, I appreciate that. It's always fulfilling to see how words can inspire and motivate others.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t3",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.",
        "memory_text": "1. Classmates B has been supportive and helpful to Classmates A. As a result, Classmates A wants to value each other's opinions, even though Classmates B was initially worried about Classmates A going out with friends.\n   \n2. Classmates A is struggling to make friends and adjust to a new school, which makes Classmates A appreciate Classmates B's efforts and support.\n\n3. Classmates B advised Classmates A to drive safely to avoid accidents, showing responsibility and reliability. This changed the dynamic, leading to Classmates B being supportive and helpful to Classmates A.",
        "speaker": "Classmates B",
        "raw_prediction": "That's so thoughtful of you to help out your neighbor like that. I'm sure she really appreciated your assistance.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t2",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?",
        "memory_text": "1. The wife's support and pride in her husband's goals inspire him to take action towards his dreams.\n2. The wife's encouragement for the husband's goals makes her want to be more involved in them.\n3. The husband's long-awaited plans drive him to finally act on them, causing disappointment in the wife for not waiting for her and wanting to be included in the plans.",
        "speaker": "Husband",
        "raw_prediction": "I was thinking of a cozy cabin in the mountains. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t4",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.",
        "memory_text": "The wife supports the husband's goals but wishes to be involved in them. Both the husband and wife are supportive of each other's dreams and aspirations.\nThe husband has long-awaited plans and is finally taking action on them. This causes the husband to apologize and promise to involve the wife in his plans in the future. He acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.",
        "speaker": "Husband",
        "raw_prediction": "I'll start looking into cabin rentals and plan out our weekend getaway.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t4",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.",
        "memory_text": "1. Classmates B suggested redirecting the ship towards a nearby planet or moon for help, which caused Classmate A to show determination in fixing their spaceship after it was damaged in a meteor shower. In reaction, Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n\n2. Classmates A expressed gratitude for Classmates B's support during a difficult situation, leading to Classmate A's perseverance in repairing the spaceship, reflecting their determination to not give up in challenging situations. This resulted in Classmates B praising Classmates A for their resilience and quick thinking during a scary experience in space.\n\n3. While stranded in space, running out of oxygen and feeling lightheaded, Classmates A's situation made Classmate B admire their attitude and see it as a good example for others. They then mentioned that life is full of surprises and anything is possible, keeping the conversation on a similar topic.",
        "speaker": "Classmates A",
        "raw_prediction": "Oh, come on, you can't leave me hanging like that! What happened?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t5",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.",
        "memory_text": "1. Classmates A showed determination in fixing their spaceship after it was damaged in a meteor shower, which caused Classmates B to suggest redirecting the ship towards a nearby planet or moon for help. This led to Classmates B praising Classmates A for their resilience and quick thinking during a scary experience in space.\n\n2. Classmates A and B have been on field trips to other planets or moons before, like Mars, leading to Classmate B admiring Classmate A's attitude as a good example for others. This admiration was reciprocated when Classmate A patiently and helpfully taught driving material to Classmate B, who also mentioned that Classmate A helped them prepare for a driving test, showcasing patience and dedication.\n\n3. Classmates A expressed gratitude for Classmates B's support during a difficult situation, reflecting Classmate A's perseverance in repairing the spaceship and determination to not give up in challenging situations. This led to Classmates B praising Classmates A for their resilience and quick thinking during a scary experience in space.",
        "speaker": "Classmates B",
        "raw_prediction": "Well, I accidentally tripped and spilled my drink all over myself in the cafeteria. It was quite a spectacle.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t6",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.",
        "memory_text": "1. Classmates A supported Classmates B during a difficult situation, which reflects their determination to not give up in challenging situations, and in return, Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n2. Classmates A's support for Classmates B was hindered by their belief in friendship and mutual support.\n3. Classmates A's support for Classmates B led to Classmate A pushing themselves to do better, emphasizing the importance of hard work and dedication in skill improvement.",
        "speaker": "Classmates A",
        "raw_prediction": "Oh no, that does sound embarrassing! Don't worry, we all have those moments.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t8",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.",
        "memory_text": "1. Classmates A praised Classmates B for their resilience and quick thinking during a scary experience in space, showing mutual admiration for each other's strengths.\n2. Both classmates value supporting and uplifting each other in their learning and growth, with Classmates A helping Classmates B out of friendship and belief in mutual support.\n3. Classmate B praises Classmate A's attention to detail and work ethic as truly impressive, while Classmate A emphasizes the importance of hard work and dedication in skill improvement.",
        "speaker": "Classmates A",
        "raw_prediction": "It happens to the best of us, don't worry too much about it. Just a funny mishap.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.\nClassmates A: Exactly! That's what you should do too. Own up to it and move on. Don't let it bother you.",
        "memory_text": "1. [Classmates B suggested redirecting the ship towards a nearby planet or moon for help.] - (React) - [Classmates A felt relieved and grateful for the quick thinking and problem-solving skills displayed by Classmates B during a crisis in space.]\n2. [Classmates A and B have shared experiences on field trips to other planets or moons, such as Mars.] - (Want) - [Classmates A and B aspire to be positive role models for each other and their peers, promoting a supportive and encouraging learning environment.]\n3. [Classmates A expressed gratitude for Classmates B's support during a challenging situation.] - (React) - [Classmates B commended Classmates A for their meticulous work ethic and attention to detail, recognizing their remarkable dedication.]",
        "speaker": "Classmates B",
        "raw_prediction": "You're right, I shouldn't let it get to me. Thanks for the reminder, Classmates A.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t3",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.",
        "memory_text": "Neighbors A is working on improving themselves and Neighbors B is supportive of their efforts. Neighbors B advised Neighbors A to change their behavior at work, causing Neighbors A to strive to be a better colleague. Neighbors B wants Neighbors A to succeed and treats others with respect, while Neighbors A reassured Neighbors B about the dog's disappearance.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds like a fantastic idea! Have you started marketing it yet?",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t3",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.",
        "memory_text": "Co-worker B was nervous about working with Co-worker A because of their talent as an actor. This caused Co-worker B to emphasize the importance of learning from mistakes and working together as a team. As a result, Co-worker A felt remorse for what they did and appreciated Co-worker B's understanding, leading them to be grateful for life experiences and open to new possibilities in the future.\n\nDuring their collaboration, both Co-worker A and Co-worker B felt that they brought out the best in each other. However, Co-worker A had a tough week on set, feeling overwhelmed and chaotic. This stress led Co-worker A to mention a past event involving blowing up a rabbit with dynamite, indicating a history of poor coping mechanisms for frustration, which still angers them.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's great to hear that you feel secure and motivated at work. Having that kind of support can really boost your confidence and performance.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t7",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.\nCo-workers B: That's right. It's important to have someone to talk to when you're feeling overwhelmed or upset.\nCo-workers A: And speaking of talking it out, do you remember when I was a kid and I ran to our parents screaming because of that spider?",
        "memory_text": "1. [Co-worker B was nervous about working with Co-worker A because of their talent as an actor.] - (Causes) - [Co-worker B emphasized the importance of learning from mistakes and working together as a team.] - (React) - [Co-worker B acknowledges that some people have fears and suggests finding healthy ways to deal with frustrations.]\n\n2. [Co-worker A and Co-worker B met on a movie set and are now good friends.] - (SameTopic) - [Co-worker A felt remorse for what they did and appreciated Co-worker B's understanding.] - (React) - [Co-worker A has grown as a person and as an artist, learning about empathy and compassion.]\n\n3. [Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.] - (React) - [Co-worker A had a tough week on set, feeling overwhelmed and chaotic.] - (React) - [Co-worker A mentions a past event involving blowing up a rabbit with dynamite, indicating a history of poor coping mechanisms for frustration.]",
        "speaker": "Co-workers B",
        "raw_prediction": "Yes, I remember that! It's funny how some childhood fears stick with us. It's great that we can support each other through those moments.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t1",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?",
        "memory_text": "Neighbors A thanked Neighbors B for the suggestion of the necklace and stumbled upon Neighbors B's shop. Neighbors B offered to help Neighbors A with the apology process. Neighbors A has a picture of the dress on their phone and will show it to Neighbors B.",
        "speaker": "Neighbors B",
        "raw_prediction": "Absolutely, I'm glad we can support each other. Let me see the picture of the dress you're thinking of wearing for the apology dinner.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.\nNeighbors B: Yes, and I appreciate it so much. It's always nice to have someone you can count on.\nNeighbors A: That's true. And speaking of which, I'm helping another friend move next weekend. It'll be a big job, but I know they'd do the same for me.\nNeighbors B: That's great. And if you need any help, just let me know.",
        "memory_text": "Neighbors A thanked Neighbors B for the suggestion of a new necklace and stumbled upon Neighbors B's shop. Neighbors B offered to help Neighbors A with the apology process.\nNeighbors A bought a necklace from Neighbors B's shop and loves it. Neighbors A has a picture of the dress on their phone and will show it to Neighbors B.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I appreciate that. I'll keep that in mind.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t1",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.",
        "memory_text": "1. Classmates A invited Classmates B to join the study group together for extra support and studying. This offer was made after they started working on a group project together. Classmates A also offered help and support to Classmates B, recalling a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n\n2. Despite initial doubts about trusting Classmates B due to rumors about their reliability, Classmates A and B are students in the same class. This connection led to Classmates A discovering a secret that Classmates B has been keeping. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n\n3. While working on a group project together, Classmates A was worried about a situation that turned out to be not a big deal. This experience led Classmates A to believe that simple actions can have a significant impact. In a related discussion, Classmate B emphasizes the importance of making mistakes and learning from them for personal growth.",
        "speaker": "Classmates A",
        "raw_prediction": "I've noticed you've been feeling a bit stressed lately. Is everything okay?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.",
        "memory_text": "1. Classmates A and B are supportive friends who look out for each other during stressful times, which contributes to their close relationship built on trust.\n2. Classmates A and B, working on a group project together, share a moment where Classmate A admired Classmate B's courage in sharing a secret, highlighting their supportive nature.\n3. Classmates A values setting high standards and is reluctant to compromise on them, a trait appreciated by Classmates B in their interactions.",
        "speaker": "Classmates B",
        "raw_prediction": "I appreciate your honesty, and I value our friendship a lot. Let's take some time to think about this before making any decisions.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t10",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. ",
        "memory_text": "1. Classmates A and B share a strong bond as supportive friends, offering help and reassurance to each other during stressful times.\n2. Classmates A recalls a moment when they admired Classmate B's courage in sharing a secret, showcasing their compassionate nature.\n3. Classmates B feels relieved to confide in someone about a secret they've been carrying.\n4. Classmates A appreciates Classmates B's support and advice while working on a group project together, especially because of their tendency to overthink things.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad we're on the same page about this. So, what do you think we should do next?",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t1",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!",
        "memory_text": "Neighbors B recalls a cooking class they took with Neighbors A last year. They also remember Neighbors A teaching a kid a special move, followed by mentioning their struggle with keeping their room tidy and wasting time looking for things. Additionally, Neighbors B expresses concern about the safety of hooking up with strangers and advises caution.",
        "speaker": "Neighbors A",
        "raw_prediction": "I bet you had some incredible experiences there!",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.",
        "memory_text": "Classmates A is facing sudden pain in their left arm and is considering going to the hospital. Classmate B reminds Classmate A to trust their instincts and know when to seek medical attention.\n\nClassmates B acknowledges Classmates A's determination and competitiveness. They offer support and suggest taking a step back to find a balance. Both classmates value taking moments to relax and appreciate the small things. \n\nClassmates A faced tough competition in middle school from a fast girl, motivating them to improve. They acknowledge the need to find a balance and accept the advice given. Classmates B is supportive and emphasizes the importance of having someone to talk to about personal matters. Classmate A emphasizes the importance of self-care and relaxation.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad to hear that your hard work is paying off. Keep it up!",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t5",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.",
        "memory_text": "Classmates A and Classmates B used to dance a lot in middle school, which Classmate A appreciates having friends who are there for them during difficult times. They are also friends who help each other with schoolwork.",
        "speaker": "Classmates B",
        "raw_prediction": "Thanks for the recommendation! I'll definitely check out Microsoft Office for my basic tasks.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t7",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?\nClassmates A: Yeah, I also learned some basic coding languages like HTML and CSS. It was challenging but really interesting.",
        "memory_text": "- Classmates A appreciates having friends who are there for them during difficult times, especially when Classmates B supported Classmates A through a tough time by listening to them.\n- Classmates A got grounded for a week for kicking a door and causing damage, which hindered the friendship dynamics between Classmates A and Classmates B, who used to dance a lot in middle school.",
        "speaker": "Classmates B",
        "raw_prediction": "That's impressive! Coding languages can be quite useful. Have you thought about applying your new skills in a specific project or field?",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t11",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.\nCo-workers B: That's awesome, congratulations! I'm proud of you and all the hard work you've put in. You've definitely grown and matured in the workplace.\nCo-workers A: Thank you, I appreciate that. But I have to admit, I'm still a bit nervous about being wrong. Remember when we talked about my constantly questioning myself and second-guessing my decisions?\nCo-workers B: Yeah, I remember that. Is there anything specific that's been bothering you?\nCo-workers A: Not really, it's just a general feeling of uncertainty at times. But hey, speaking of uncertainty, do you remember when we talked about my love for singing a while ago?",
        "memory_text": "Co-worker B reassures Co-worker A that making mistakes is okay as long as they learn from them. Co-worker B reassures Co-worker A and encourages them to have more confidence. \nCo-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else. Co-worker A is nervous about making mistakes in their new position. Co-worker A expresses nervousness and self-doubt despite their achievements. \nCo-worker B mentioned that Co-worker A is responsible in their work, even if not always in other aspects of life. Co-worker B reminds Co-worker A of their progress and potential for success.",
        "speaker": "Co-workers B",
        "raw_prediction": "Yes, I remember your passion for singing. Have you had the chance to perform or practice lately?",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.",
        "memory_text": "1. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed. Classmates A believes in hard work and dedication to achieve goals both in basketball and their job. Both classmates have a positive attitude towards each other and their respective goals.\n2. Classmate B reassures Classmate A that they are all in it together and offers help if needed. Classmates A practices basketball every day, both individually and with their team, and also does weight training to build strength. Classmates A started working at the grocery store last week and is enjoying the experience, learning about running a store. Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\n3. Classmate A appreciates the support and understanding from Classmate B. Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.",
        "speaker": "Classmates B",
        "raw_prediction": "You should never cheat, especially on something as serious as taxes. It's important to find legitimate ways to handle financial struggles. How can I support you through this?",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t2",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!",
        "memory_text": "1. Classmates B finds Classmates A's involvement in the community admirable and important. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference. As a result, Classmate A realizes that their current allergic reaction could be related to the previous discussion on allergies.\n\n2. Classmate A and Classmate B are classmates who attended a party together. In reaction to this, Classmate B suggests that Classmate A should go see the nurse immediately and take antihistamines if available.\n\n3. Classmates B finds Classmates A's involvement in the community admirable and important. This leads to Classmate A expressing a desire to find alternative ways to have fun and make a positive impact in the community. Subsequently, Classmate A, who is proactive and curious, takes the initiative to research topics of interest, resulting in the realization that their current allergic reaction could be related to the previous discussion on allergies.",
        "speaker": "Classmates A",
        "raw_prediction": "I know, right? I can't wait to spend the night here and just relax.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t3",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.",
        "memory_text": "- Classmate A hopes to encourage others to get involved and create a ripple effect for positive change, expressing a desire to find alternative ways to have fun and make a positive impact in the community. Additionally, Classmate A agrees to take better care of themselves in the future.\n- Classmates B finds Classmates A's involvement in the community admirable and important, as Classmate B is involved in an action committee working on organizing a community clean-up day. Furthermore, Classmates A was part of an action committee in high school to improve the community.",
        "speaker": "Classmates B",
        "raw_prediction": "It's great to know we won't have to deal with any uncomfortable surprises during the night. Thanks for finding this spot!",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t7",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.\nClassmates B: That's true. You always seem to find the best spots. Like that time we went camping near the lake and had the whole place to ourselves.\nClassmates A: Oh yeah, that was a great spot too. It's always fun to explore and go on new adventures.",
        "memory_text": "Classmates A expresses a desire to find alternative ways to have fun and make a positive impact in the community, leading to their proactive and curious nature in researching topics of interest. This curiosity eventually results in Classmate A experiencing an allergic reaction with symptoms of itchy skin and a tight throat. \nClassmates B, admiring Classmates A's involvement in the community, emphasizes the importance of being cautious with allergies and taking necessary precautions to prevent severe reactions.",
        "speaker": "Classmates B",
        "raw_prediction": "We should definitely plan more camping trips like this in the future. It's always exciting to discover new hidden gems in nature.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t3",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.",
        "memory_text": "1. Classmates A and B share a passion for music, often jamming together and planning future collaborations. Their friendly and supportive relationship is evident in their conversations about their musical experiences.\n2. Classmates A and B bond over music, reminiscing about childhood memories like playing on swings and making music with friends.\n3. Classmates A and B are diligent in keeping up with their math homework. They look forward to celebrating with a drink after Classmates B purchased a fun and freeing red sports car.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, I just want to be more self-sufficient. It's something I've been working on.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t9",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.",
        "memory_text": "1. Classmates A and B enjoy playing music together, as they have a friendly and supportive relationship.\n2. Classmates A and B find it awesome to pursue their passions after a conversation about following dreams.\n3. Classmates A and B both enjoy reminiscing about childhood memories, including playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a good idea. I'll start with making that list. Thanks for being so supportive.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t13",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?",
        "memory_text": "- Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n- Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams. Classmates A bought a sleek and red Mustang GT car, which Classmates B recently bought a red sports car and finds driving it to be fun and freeing.\n- Classmates A plays the guitar, takes lessons, and plays in a band, and has been dreaming of owning a Mustang GT since childhood.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't thought about it yet, but it's something I'd love to explore in the future. Thanks for the suggestion!",
        "previous_summary": "Classmates A plays the guitar, takes lessons, and plays in a band.\nClassmates B is interested in learning to play an instrument.\nClassmates A started playing the guitar because of a love for music and is working on their first album.\nClassmates A's band mostly plays at local bars and coffee shops.\nClassmates A's band is trying to build up their fan base and play at bigger venues.\nClassmates A and B enjoy jamming together and plan to collaborate on music in the future."
    },
    {
        "utter_id": "e47-s5-t20",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.\nClassmates B: That sounds like a challenge, but also kind of exciting. I'm in!\nClassmates A: Great, I'm looking forward to seeing you rock out on stage. Hey, remember when we talked about your new car a few hours ago? How's that going?\nClassmates B: I'm loving it! It's so much fun to drive. Thanks for asking, Classmates A.\nClassmates A: No problem, glad to hear it. Hey, I remember a few months ago when you talked about being reminded of your childhood and feeling emotional. How are you feeling about that now?\nClassmates B: I'm still feeling a bit emotional about it, but I've also been trying to focus on making new positive memories to replace the old ones.",
        "memory_text": "1. Classmates A and B share a friendly and supportive relationship, discussing their experiences and keeping up with homework in their math class.\n\n2. Classmates A and B bond over music, with A playing guitar, taking lessons, and participating in a band. They enjoy jamming together and plan to collaborate on music in the future. They also reminisce about childhood memories, like playing on swings and making music with friends.\n\n3. Classmates B admires Classmates A's pursuit of their musical passion after a conversation about following dreams. Additionally, B finds driving their recently bought red sports car to be fun and freeing.",
        "speaker": "Classmates A",
        "raw_prediction": "It's great that you're focusing on creating new positive memories. It's important to cherish those moments too. If you ever want to talk more about it, I'm here to listen.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t5",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.",
        "memory_text": "Neighbor A finds joy in constructing houses efficiently, which led them to assist Neighbor B in constructing a new house with impressive features. Neighbor B then recalls Neighbor A's capability to do positive deeds, mentioning a house built by Neighbor A for them. This prompts Neighbor A to believe in the importance of sunlight, water, and love for plants to flourish.",
        "speaker": "Neighbors B",
        "raw_prediction": "Maybe creating a detailed schedule could help you stay on track.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t1",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.",
        "memory_text": "1. The wife suggests that husband should try using more modern language to be better understood, causing the husband to talk differently than most people, using words like \"thou\" and \"thee.\"\n2. The husband is open to learning more about movies, showing a willingness to try again, which leads to him acknowledging that it may be difficult for the wife but wants to be honest about his feelings for Sarah, and they both express a desire for happiness and understanding in the situation.\n3. The husband is open to learning more about movies, showing a willingness to try again, which leads to him acknowledging that it may be difficult for the wife but wants to be honest about his feelings for Sarah, and then he agrees to try adapting to modern language for better communication with his wife. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.",
        "speaker": "Wife",
        "raw_prediction": "Maybe you just need to take a break and clear your mind. Sometimes stepping away can help spark new inspiration.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t3",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.",
        "memory_text": "The husband is open to learning more about movies, showing a willingness to try again. The wife remembers the husband being nervous before the presentation.\nThe wife is knowledgeable about movies and is willing to share her passion with the husband. Both the husband and wife express a desire for happiness and understanding in the situation. The husband gave a fifth-grade presentation in the past.\nThe husband and wife plan to have a movie night together in the future. Both the husband and wife express a desire for happiness and understanding in the situation. Husband agrees to try adapting to modern language for better communication with his wife. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.",
        "speaker": "Wife",
        "raw_prediction": "You're not bothering me at all. I enjoy helping you with your writing. Let's brainstorm together and see if we can come up with something new.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t7",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.\nWife: Maybe it's time to take a step back and try something new. Have you ever tried writing in a different genre or experimenting with different styles?\nHusband: That's a good idea. I guess I just haven't had the courage to step out of my comfort zone.",
        "memory_text": "The husband and wife both express a desire for happiness and understanding in the situation, showing a willingness to support each other. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is. The husband agrees to try adapting to modern language for better communication with his wife. The husband, who gave a fifth-grade presentation in the past, is open to learning more about movies and trying again.",
        "speaker": "Wife",
        "raw_prediction": "Stepping out of your comfort zone can lead to new and exciting discoveries. Maybe trying a different genre will spark some fresh ideas for you.",
        "previous_summary": null
    }
]