[
    {
        "utter_id": "e0-s5-t1",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The parent values independence and self-sufficiency.\n3. The Child finds the Parent's story inspiring.\n4. The child offers help and reassurance to the parent.\n5. The parent wants to provide a safe and stable environment for the child.\n6. Both the parent and child enjoy spending time together in their new home.",
        "speaker": "Child",
        "raw_prediction": "I agree, being a good listener is so important. It helps us understand each other better and strengthens our bond. If you ever need someone to listen, I'm here for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t3",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The Child finds the Parent's story inspiring.\n3. The child offers help and reassurance to the parent.\n4. The parent values independence and self-sufficiency.\n5. The parent wants to provide a safe and stable environment for the child.\n6. Both the parent and child enjoy spending time together in their new home.",
        "speaker": "Child",
        "raw_prediction": "I agree, feeling heard and understood is so comforting, especially during tough times. I'm here for you, just like you've always been there for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee is feeling overwhelmed with the college application process.\n3. The Mentee has been offered a job and has decided to take the job in the city.\n4. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n5. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n6. Mentor emphasizes the importance of self-care for dealing with challenges.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way, Mentee. Building new relationships takes time, so be patient with yourself. Maybe try joining some local clubs or organizations to meet people who share your interests.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t8",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.\nMentor: That's just a fear, Mentee. You can join clubs or organizations that interest you to meet like-minded people. You could also start volunteering around the city to meet new people.\nMentee: Those are good suggestions, Mentor. I'll consider joining a club or volunteering.\nMentor: And remember, it's also important to keep in touch with your old friends. You can schedule video calls or even plan a visit back home.\nMentee: That's true, I'll make sure to keep in touch. Thanks for the advice, Mentor.\nMentor: Anytime, Mentee. Is there anything else you want to talk about or any updates you'd like to share?",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n3. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n4. Mentee is feeling overwhelmed with the college application process.\n5. Mentor advises Mentee to break down studying into manageable chunks, schedule study sessions and breaks, and use resources like practice exams and review books.\n6. The Mentee has been offered a job and has decided to take the job in the city.",
        "speaker": "Mentee",
        "raw_prediction": "Actually, I've been thinking about exploring more of the city in my free time. Do you have any recommendations for places to visit or things to do in the area?",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t9",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.\nMentor: That's just a fear, Mentee. You can join clubs or organizations that interest you to meet like-minded people. You could also start volunteering around the city to meet new people.\nMentee: Those are good suggestions, Mentor. I'll consider joining a club or volunteering.\nMentor: And remember, it's also important to keep in touch with your old friends. You can schedule video calls or even plan a visit back home.\nMentee: That's true, I'll make sure to keep in touch. Thanks for the advice, Mentor.\nMentor: Anytime, Mentee. Is there anything else you want to talk about or any updates you'd like to share?\nMentee: Actually, I did make a new friend at work. We've been hanging out after work sometimes and it's been nice.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n3. The Mentee has been offered a job and has decided to take the job in the city.\n4. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n5. Mentor advises Mentee to break down studying into manageable chunks, schedule study sessions and breaks, and use resources like practice exams and review books.\n6. The Mentee weighed the pros and cons of each option before deciding on the job in the city.",
        "speaker": "Mentor",
        "raw_prediction": "That's great to hear, Mentee! Building new friendships takes time, and it seems like you're already making progress. It's wonderful that you have someone to spend time with outside of work. Keep nurturing those connections, and remember, friendships grow stronger with time and shared experiences.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t1",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?",
        "memory_text": "1. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n2. Neighbor B is comforting and supportive towards Neighbor A.\n3. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n4. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n5. Neighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.\n6. Neighbor A's mom scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yeah, I'll never forget that. You always know how to liven things up. Remember that time we tried to grill and ended up ordering takeout instead?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t4",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.",
        "memory_text": "1. Neighbor B is comforting and supportive towards Neighbor A.\n2. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n3. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n4. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n5. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n6. Neighbor A's mom scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors A",
        "raw_prediction": "Alright, I hear you. I won't do it again, I promise.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t5",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.",
        "memory_text": "1. Neighbor B is comforting and supportive towards Neighbor A.\n2. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n3. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n4. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n5. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n6. Neighbor A's mom scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors B",
        "raw_prediction": "I appreciate you apologizing. Let's move on from this and enjoy the rest of our day together.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t18",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.\nNeighbors A: Ha, I remember when I took off my jacket and put my feet up in your armchair. It was so warm that day.\nNeighbors B: Yeah, that was a hot day. I'm glad you felt comfortable in my home though.\nNeighbors A: You know, I really enjoy spending time with you. I want to get to know you even better.\nNeighbors B: I feel the same way. We should plan something fun to do together.\nNeighbors A: Absolutely. Hey, do you remember when I ripped off the tag from my shirt?\nNeighbors B: Yeah, your mom was pretty upset about that.\nNeighbors A: I didn't think it was a big deal, but she sure did. Do you ever have disagreements like that with your parents?\nNeighbors B: Sometimes, but not often. We have a pretty good relationship.",
        "memory_text": "1. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n2. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n3. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n4. Neighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.\n5. Neighbor B is comforting and supportive towards Neighbor A.\n6. Neighbor A enjoys spending time in Neighbor B's cozy home and wants to hang out more often.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's great to hear. It's important to have a good relationship with family. I'm glad we have each other to hang out with and share our stories. It really makes a difference.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t1",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.",
        "memory_text": "1. Co-worker B is supportive and willing to help in any way.\n2. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n3. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n4. Co-worker A is humble and tries to make the world a better place by helping others.\n5. Co-worker A is alive but will need time to adjust to their new way of life.\n6. Co-worker A believes in surrounding oneself with positive energy and uplifting people.",
        "speaker": "Co-workers A",
        "raw_prediction": "That sounds like quite the plan! Just make sure it's all in good fun and not too extreme. Remember, positive energy attracts positive outcomes.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t4",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B appreciates Co-worker A's positivity and friendship.\n3. Co-worker B is supportive and willing to help in any way.\n4. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n5. Co-worker A is alive but will need time to adjust to their new way of life.\n6. Co-worker A intervened to help two women who were fighting, showing bravery and a desire to make a positive impact.",
        "speaker": "Co-workers A",
        "raw_prediction": "I know you're struggling with your feelings, but kidnapping is not the answer. It's important to respect her autonomy and choices. Let's find a healthier way to express your love and support for her.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t7",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.\nCo-workers B: That's not the same thing, Co-workers A. Stealing someone and keeping them against their will is illegal and immoral. You need to let go of this obsession and move on.\nCo-workers A: I know you're right, Co-workers B. I just don't know how to get over this feeling.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n3. Co-worker B appreciates Co-worker A's positivity and friendship.\n4. Co-worker A is alive but will need time to adjust to their new way of life.\n5. Co-worker B is supportive and willing to help in any way.\n6. Co-worker A intervened to help two women who were fighting, showing bravery and a desire to make a positive impact.",
        "speaker": "Co-workers B",
        "raw_prediction": "I understand that it's hard, Co-workers A. It's important to take some time to reflect on your feelings and find healthier ways to cope. I'm here for you, and we can work through this together. Let's focus on making positive choices and helping others like you did when you intervened to stop that fight.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t4",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n3. Co-worker A values their health to continue working at their best.\n4. Both co-workers are looking forward to starting their partnership and are open to seeking extra help if needed.\n5. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n6. Co-worker B agrees that their skill sets complement each other well.",
        "speaker": "Co-workers A",
        "raw_prediction": "Don't worry about burdening me. We're a team now, and I'm here to support you just as much as you support me. Let's tackle this workload together.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t7",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n3. Co-worker B agrees that their skill sets complement each other well.\n4. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n5. Co-worker A expressed gratitude for the horse that Co-worker B gave them, mentioning it brings joy and happiness.\n6. Co-worker A values their health to continue working at their best.",
        "speaker": "Co-workers B",
        "raw_prediction": "I couldn't agree more. Knowing that we have each other's backs makes all the difference in tackling our workload effectively. Your support means a lot to me, and I'm grateful for our partnership in the workplace.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t10",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.\nCo-workers A: Me too! I think we would make a great business partnership.\nCo-workers B: Definitely. It's great to have someone I can trust and rely on in both work and personal matters.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\n3. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n4. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n5. Co-worker B agrees that their skill sets complement each other well.\n6. Co-workers A and B have a positive and optimistic attitude towards their future collaboration.",
        "speaker": "Co-workers A",
        "raw_prediction": "I feel the same way. It's important to have that level of trust and support in a partnership. And hey, don't forget to prioritize your health too. We need you at your best to make this collaboration a success.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t11",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.\n4. Neighbors A enjoys trying new things, like new recipes.\n5. Neighbors B is excited and supportive of Neighbors A's new ability.\n6. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad you enjoyed it! I've been thinking about trying to recreate that roasted vegetable and quinoa dish you made. Do you think you could share the recipe with me? I'd love to give it a try at home.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t17",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.\nNeighbors B: Oh, why are you hiding from her?\nNeighbors A: She wants me to go to a family dinner tonight, but I'm too tired and just want to relax at home.\nNeighbors B: Maybe you should talk to her about it and let her know how you feel.\nNeighbors A: I know, but I don't want to disappoint her.\nNeighbors B: It's important to take care of your own needs and speak up for yourself. Plus, maybe you can compromise and go to the dinner for a little while and then come back home to relax.\nNeighbors A: That's a good idea, thanks for the advice.\nNeighbors B: No problem. Speaking of compromise, remember that dinner we went to a few days ago?\nNeighbors A: Yes, it was so much fun!\nNeighbors B: I'm glad you enjoyed it. Maybe we can make it a regular thing and try out new restaurants together.\nNeighbors A: That sounds great! And it gives me something to look forward to after work.\nNeighbors B: Speaking of work, how are you feeling about your job lately?\nNeighbors A: Honestly, still a bit unfulfilled. But I've been thinking about exploring some new opportunities and seeing what else is out there.\nNeighbors B: That's a good plan. It's important to pursue what makes you happy and fulfilled.\nNeighbors A: Definitely. Thanks for being such a great listener and always giving me good advice.",
        "memory_text": "1. Neighbor B offers support and suggests planning a dinner to celebrate Neighbor A's new adventures in learning.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors B is excited and supportive of Neighbors A's new ability.\n4. Neighbors A enjoys trying new things, like new recipes.\n5. Neighbors B is open to trying new recipes and is excited to receive the chickpea curry recipe from Neighbors A.\n6. Neighbors A made a roasted vegetable and quinoa dish that Neighbors B enjoyed.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm always here for you, happy to listen and support you in any way I can. And hey, if you ever need a break from work stress, I'm looking forward to trying out more of your delicious recipes together. Maybe we can have a cooking night soon!",
        "previous_summary": null
    },
    {
        "utter_id": "e7-s5-t4",
        "current_dialogue": "Classmates A: , I have some exciting plans for the future that I wanted to share with you.\nClassmates B: Oh really? What are they?\nClassmates A: Well, I was thinking that we could work on a project together and maybe even become business partners.\nClassmates B: Wow, that sounds amazing! What kind of project are you thinking about?",
        "memory_text": "1. Classmates B encourages Classmates A to work through their feelings and take steps towards a better future.\n2. Classmate A and Classmate B enjoy singing karaoke together and look forward to future outings.\n3. Classmates A and B are open to meeting for coffee again in the future.\n4. Classmates A is looking forward to meeting up with Classmates B again after getting better sleep.\n5. Classmates A is social and enjoys meeting new people.\n6. Classmate B admires Classmate A's outgoing nature and wants to be more like them.",
        "speaker": "Classmates A",
        "raw_prediction": "I was thinking we could start a YouTube channel where we showcase our karaoke sessions and maybe even offer singing tips and tricks to our viewers. What do you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t8",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?\nNeighbors B: Wow, you do look very strong! Have you been working out?\nNeighbors A: Yes, I go to the gym every day and lift weights. It's been really helping me build muscle.\nNeighbors B: That's great to hear! It reminds me of the time when you apologized to me for the way you treated me.\nNeighbors A: Yes, I realized that I needed to take responsibility for my actions and I didn't want to make the same mistake again.\nNeighbors B: It's always important to own up to our mistakes. It's like when you forgot your backpack in high school and had to deal with the consequences.\nNeighbors A: Definitely. It taught me to always be prepared and double-check everything. It's like how I make sure to tighten screws and wires when working on my computer.\nNeighbors B: It's all about being responsible and taking care of ourselves, just like how you take care of your physical health by working out.",
        "memory_text": "1. Neighbors A apologized to Neighbors B for their behavior and admitted to being wrong.\n2. Neighbors B appreciates Neighbors A's handy skills.\n3. Neighbors A values double-checking before leaving the house.\n4. Neighbors A and B emphasize the importance of taking care of trees and the environment for future generations.\n5. Neighbors A is good at fixing things, particularly electronics.\n6. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.",
        "speaker": "Neighbors A",
        "raw_prediction": "And just like how we take care of ourselves, we should also take care of our surroundings for future generations, like the trees in our backyard. Have you noticed how much they've grown since we planted them together?",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t5",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?\nClassmates A: Yeah, I just finished building a custom bookshelf for a client. It was a challenging project, but I'm really happy with how it turned out.",
        "memory_text": "1. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n2. Classmates B is supportive and encourages Classmates A in their business venture.\n3. Classmates A has had a business idea for a while and is now taking steps to make it a reality.\n4. Classmate B offers to support and potentially collaborate with Classmate A in the future.\n5. Classmates A is willing to work hard and learn the necessary strategies for business success.\n6. Classmates B mentions the importance of seeking advice from mentors and staying motivated and passionate about the business idea.",
        "speaker": "Classmates B",
        "raw_prediction": "That's impressive! Building custom pieces must be so rewarding. Have you thought about expanding your carpentry skills into starting your own business someday?",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t6",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors A is excited to explore the neighborhood and make new friends.\n3. Neighbors A just moved to a new neighborhood and is getting to know the area.\n4. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n5. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.\n6. Neighbors B acknowledges Neighbors A's friendly and outgoing nature.",
        "speaker": "Neighbors A",
        "raw_prediction": "I did, and I'm so glad I did. I feel like I've found a real sense of community here, and it's all thanks to people like you who welcomed me with open arms.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t7",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors A is excited to explore the neighborhood and make new friends.\n3. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n4. Neighbors A just moved to a new neighborhood and is getting to know the area.\n5. Neighbors A and B live in the same place and find comfort in it.\n6. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that our neighborhood has become your home. It's always wonderful to see how much you've grown to love it here. And I have to say, having you as my neighbor has definitely made this place feel even more special.",
        "previous_summary": null
    },
    {
        "utter_id": "e11-s5-t10",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.\nNeighbors B: And you're still spending time with God every day, right?\nNeighbors A: Yes, I am. It brings me so much peace and happiness.\nNeighbors B: That's really admirable. And speaking of power, I remember you telling me about that time when you could make me do anything you wanted.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n3. Neighbors A is excited to explore the neighborhood and make new friends.\n4. Neighbors A finds spending time with God brings them peace and happiness.\n5. Neighbors A values the relationship with Neighbors B and considers them like family.\n6. Neighbors B acknowledges Neighbors A's friendly and outgoing nature.",
        "speaker": "Neighbors A",
        "raw_prediction": "Oh, that was just a silly joke! I would never use any sort of power over you. Our friendship means more to me than anything like that. I'm just glad we have each other in this wonderful neighborhood.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t2",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?",
        "memory_text": "1. Classmate B is interested in attending a new technology conference next month.\n2. Classmates B noticed Classmates A's improvement and acknowledged their hard work.\n3. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n4. Classmates A's grades are looking good according to their teacher.\n5. Classmate B is working on finishing a history project.\n6. Classmates B is supportive of Classmates A's new relationship and believes they found someone who makes them happy.",
        "speaker": "Classmates A",
        "raw_prediction": "It was all about the future of artificial intelligence and how it's shaping different industries. I found it fascinating!",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t10",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.",
        "memory_text": "1. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n2. Classmates A struggled with motivation but found a way to stay focused by thinking about the payoff of their hard work.\n3. Classmates B noticed Classmates A's improvement and acknowledged their hard work.\n4. Classmates A had a moment of frustration in the past but has learned to channel that energy into studies.\n5. Classmates A is willing to work hard to achieve their dreams.\n6. Classmates A showed up to school in pajamas due to oversleeping after studying late.",
        "speaker": "Classmates A",
        "raw_prediction": "Haha, oh, the pajama incident! That was definitely a memorable day. I guess I've always had a knack for standing out, even if it was unintentional. But hey, it all adds to the colorful tapestry of high school memories, right?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t11",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.",
        "memory_text": "1. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n2. Classmates A met the girl of their dreams at a party and have been texting her nonstop.\n3. Classmates A is determined to make the relationship work, similar to their determination to get into college.\n4. Classmates A feels like everything is falling into place and is excited to see where the new relationship goes.\n5. Classmates A had a moment of frustration in the past but has learned to channel that energy into studies.\n6. Classmates A is willing to work hard to achieve their dreams.",
        "speaker": "Classmates B",
        "raw_prediction": "That's amazing! It's great to see you so happy. How are things going with her?",
        "previous_summary": "Classmates A met the girl of their dreams at a party and have been texting her nonstop.\nClassmates B is supportive of Classmates A's new relationship and believes they found someone who makes them happy.\nClassmates A is determined to make the relationship work, similar to their determination to get into college.\nClassmates A is not afraid to be themselves and embraces their quirks, which their girlfriend appreciates.\nClassmates A feels like everything is falling into place and is excited to see where the new relationship goes."
    },
    {
        "utter_id": "e12-s5-t12",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.\nClassmates B: Aww, that's fantastic. How has everything been going with her?",
        "memory_text": "1. Classmates A met the girl of their dreams at a party and have been texting her nonstop.\n2. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n3. Classmates A feels like everything is falling into place and is excited to see where the new relationship goes.\n4. Classmates B is supportive of Classmates A's new relationship and believes they found someone who makes them happy.\n5. Classmates A is determined to make the relationship work, similar to their determination to get into college.\n6. Classmates A is not afraid to be themselves and embraces their quirks, which their girlfriend appreciates.",
        "speaker": "Classmates A",
        "raw_prediction": "It's been amazing. She really appreciates all my quirks and encourages me to be myself. It feels like everything is falling into place, and I can't wait to see where this new relationship goes.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t4",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.",
        "memory_text": "1. Mentee has a history of substance abuse but has been sober for a year.\n2. Mentee values living in the moment and staying focused on their sobriety and goals.\n3. Mentor is proud of Mentee for making positive changes and taking control of their life.\n4. The Mentee is dedicated to their sobriety and believes incorporating yoga into their routine will benefit their mental and physical health.\n5. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n6. The Mentor advises the Mentee to be gentle with themselves when they slip back into old patterns.",
        "speaker": "Mentee",
        "raw_prediction": "I've found that incorporating yoga into my routine has been so beneficial for my mental clarity and focus. It really helps me stay grounded and present in the moment.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.\nMentor: That's fantastic, Mentee. Being present and mindful can do wonders for your mental health and overall satisfaction with life. Keep it up!\nMentee: I definitely will, Mentor. And thanks again for finding my glasses. Your help means a lot to me. ",
        "memory_text": "1. Mentor is proud of Mentee for making positive changes and taking control of their life.\n2. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n3. Mentee values living in the moment and staying focused on their sobriety and goals.\n4. Mentee has a history of substance abuse but has been sober for a year.\n5. The Mentor encourages the Mentee to prioritize self-care and explore new ways to stay healthy and happy.\n6. Mentor is willing to share their knowledge with Mentee and help them achieve their goals.",
        "speaker": "Mentor",
        "raw_prediction": "You're very welcome, Mentee. I'm always here to support you in any way I can. Just remember to keep taking care of yourself and focusing on your sobriety and goals. I'm proud of the progress you've made.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t12",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?",
        "memory_text": "1. The Child is caring and offers help to the Parent.\n2. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n3. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The Parent is working and feels tired after a long day.\n6. The child expresses gratitude for being adopted by the parent and believes other children will be lucky to have them as a parent.",
        "speaker": "Parent",
        "raw_prediction": "Yes, I remember that! It was a lot of fun getting creative with you. I'm grateful for those moments we share. It's wonderful to have you by my side, supporting me in my new ventures too.",
        "previous_summary": "The Parent is working and feels tired after a long day.\nThe Parent agrees to make an effort to start pulling their weight around the house and to follow the chore schedule.\nThe Parent acknowledges being lazy about washing dishes and promises to contribute more to keeping the home clean.\nThe Parent expresses a desire to be a better role model for the Child and their siblings.\nThe parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores."
    },
    {
        "utter_id": "e14-s5-t14",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.\nChild: Sure, that sounds like fun! Speaking of creativity, remember that time we made those homemade decorations together?\nParent: Yes, I do remember that. That was a fun afternoon.\nChild: It was! Maybe we can do that again someday.",
        "memory_text": "1. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n2. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n3. The Child is caring and offers help to the Parent.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The Parent is working and feels tired after a long day.\n6. The Parent expresses a desire to adopt more children in the future.",
        "speaker": "Parent",
        "raw_prediction": "I would love that, Child. Your creativity and enthusiasm always brighten up my day. Let's definitely plan another crafty afternoon together soon.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t2",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.",
        "memory_text": "1. Co-worker A has grown and become more confident over the years.\n2. Co-worker B acknowledges and supports Co-worker A's growth and progress.\n3. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n4. Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.\n5. Co-worker A used to fantasize about being a great leader and being respected and admired.\n6. Co-worker A has fantasies of being a great leader.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks! I'm really looking forward to taking on this new challenge and continuing to grow in my role.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t3",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.",
        "memory_text": "1. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n2. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n3. Neighbors A has developed romantic feelings for Neighbors B.\n4. Neighbors B values their friendship with Neighbors A.\n5. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n6. Neighbors A ordered pizza for Neighbors B in the past.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds really calming. I'm glad it's been helping you unwind. Maybe we can try it together sometime when we hang out at the park again.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t1",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors A took the leap to make a change and is glad they did.\n3. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n4. Neighbors A's husband thinks they are crazy for believing they saw a UFO.\n5. Neighbors A and B had a conversation a couple of years ago about needing a change.\n6. Neighbors A plans to start looking for new opportunities soon and needs to update their resume and start networking.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's incredible! I'm so happy for you. It must feel like a dream come true after all the hard work you've put in.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t4",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n3. Neighbors A took the leap to make a change and is glad they did.\n4. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n5. Neighbors A and B had a conversation a couple of years ago about needing a change.\n6. Neighbors A and B have a friendly and supportive relationship.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm still processing it myself! I want to make sure it's used wisely, maybe invest in some projects I'm passionate about. It's a lot to think about, but I'm grateful for this unexpected blessing.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t7",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n3. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n4. Neighbors A took the leap to make a change and is glad they did.\n5. Neighbors A and B had a conversation a couple of years ago about needing a change.\n6. Neighbors A and B have a friendly and supportive relationship.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's a great idea! With your entrepreneurial spirit, starting your own business sounds like a fantastic opportunity. I'm excited to see where this new chapter takes you.",
        "previous_summary": null
    },
    {
        "utter_id": "e18-s5-t9",
        "current_dialogue": "Neighbors A: Can you believe it? I'm a millionaire now!\nNeighbors B: Wow, that's incredible! How did it happen?\nNeighbors A: I inherited it from a distant relative. It's still sinking in, to be honest.\nNeighbors B: That's amazing, congratulations! What are you going to do with all that money?\nNeighbors A: Well, first I'm going to pay off my mortgage and all my debts. After that, I think I'll take a nice long vacation and maybe donate some to charity.\nNeighbors B: That's very generous of you. Have you thought about investing any of it?\nNeighbors A: Yes, actually. I've been doing some research and I think I want to invest in some stocks and maybe even start my own business.\nNeighbors B: That sounds like a great idea. You have the opportunity to do so much with your newfound wealth.\nNeighbors A: Definitely. It's funny how things can change so quickly. Just a few years ago, I was stuck in a job I hated and now I have all this freedom.",
        "memory_text": "1. Neighbors A made a big career change recently and is much happier now.\n2. Neighbors A took the leap to make a change and is glad they did.\n3. Neighbors B is supportive of Neighbors A's decision and admires the courage it took.\n4. Neighbors A and B had a conversation a couple of years ago about needing a change.\n5. Neighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\n6. Neighbors A plans to start looking for new opportunities soon and needs to update their resume and start networking.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's truly inspiring to see how far you've come since then. Your journey is a testament to the power of taking risks and embracing change. I'm so happy for you and excited to see all the amazing things you'll accomplish with this new chapter in your life.",
        "previous_summary": "Neighbors A is feeling stagnant in their current job and is looking for more growth and challenge.\nNeighbors B has been supportive of Neighbors A's job search, offering to connect them with people in different industries.\nNeighbors A plans to start looking for new opportunities soon and needs to update their resume and start networking.\nNeighbors A made a big career change recently and is much happier now.\nNeighbors A and B had a conversation a couple of years ago about needing a change.\nNeighbors A took the leap to make a change and is glad they did.\nNeighbors A and B have a friendly and supportive relationship."
    },
    {
        "utter_id": "e20-s5-t1",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n3. Co-worker A and Co-worker B shared happy memories from their time working together.\n4. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n5. Co-worker A and Co-worker B used to work together at a clothing store.\n6. Co-worker A has a talent for solving puzzles and mysteries.",
        "speaker": "Co-workers A",
        "raw_prediction": "That's awesome! I bet you sounded amazing. How did it feel to sing in front of everyone?",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "1. Co-worker A and Co-worker B shared happy memories from their time working together.\n2. Co-worker B was surprised when Co-worker A found out they were married.\n3. Co-worker A has a talent for solving puzzles and mysteries.\n4. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n5. Co-worker A suggests celebrating their detective work with drinks after work.\n6. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, thanks! I guess I have a knack for uncovering secrets, whether it's through singing or solving puzzles. Maybe we should combine our detective skills and find the hidden talent in everyone at the office!",
        "previous_summary": "Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.\nCo-worker A discovered that an employee was hiding clothes to sell on the side.\nCo-worker A enjoys solving puzzles and mysteries, even considering becoming a detective.\nCo-worker A has a talent for solving puzzles and mysteries."
    },
    {
        "utter_id": "e20-s5-t11",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker A and Co-worker B shared happy memories from their time working together.\n3. Co-worker A has a talent for solving puzzles and mysteries.\n4. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n5. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n6. Co-worker A suggests celebrating their detective work with drinks after work.",
        "speaker": "Co-workers B",
        "raw_prediction": "It was definitely unexpected, but you did some impressive detective work to figure it out. I guess we both have our hidden talents!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t18",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.\nCo-workers B: Oh gosh, yes. I forget sometimes that not everyone knows. But yeah, I've been married for a few years now.\nCo-workers A: Crazy how time flies. Like when we found out Ms. Singh was leaving our school. I still can't believe that was two years ago.\nCo-workers B: I know, right? She was such a great teacher. Speaking of which, have you heard anything about her lately?\nCo-workers A: Not really. I think she moved to another state, but I'm not sure where.\nCo-workers B: Ah, okay. Well, hopefully she's doing well wherever she is. But hey, getting back to your solo, I think you should definitely do it again sometime.\nCo-workers A: Really? You think so?\nCo-workers B: Absolutely. You've got a gift, and it would be a shame not to use it.",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker A and Co-worker B shared happy memories from their time working together.\n3. Co-worker A has a talent for solving puzzles and mysteries.\n4. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n5. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n6. Co-worker A suggests celebrating their detective work with drinks after work.",
        "speaker": "Co-workers A",
        "raw_prediction": "Aw, thank you for the encouragement. Maybe we can even do a duet together sometime! It could be a fun way to showcase our talents outside of work.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t4",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.",
        "memory_text": "1. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n2. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n3. The wife is glad to see the husband finding a sense of purpose and being happy.\n4. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n5. The wife is supportive of her husband's hobbies and interests, such as playing the guitar.\n6. Husband values the supportive community of believers at church and appreciates having his wife by his side.",
        "speaker": "Husband",
        "raw_prediction": "It brings me joy to create a cozy atmosphere for us to relax and unwind. It's those little touches that make our home feel special and filled with love.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. Husband values the supportive community of believers at church and appreciates having his wife by his side.\n3. The wife is glad to see the husband finding a sense of purpose and being happy.\n4. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n5. The husband's faith has been strong lately, and he is involved in various church ministries.\n6. The husband believes it's important to cherish meaningful connections in life, like the one he has with his friend.",
        "speaker": "Husband",
        "raw_prediction": "Yes, I've found so much fulfillment in serving and connecting with our church community. It's been a blessing to have your support and encouragement in these endeavors.",
        "previous_summary": "Husband is grateful for his Christian upbringing and is passionate about his faith.\nHusband was baptized at eight years old and is involved in different ministries at church.\nWife is supportive of her husband's faith journey and values having a close relationship with him.\nHusband values the supportive community of believers at church and appreciates having his wife by his side.\nThe husband's faith has been strong lately, and he is involved in various church ministries."
    },
    {
        "utter_id": "e21-s5-t12",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.\nHusband: Yes, I'm so grateful for the community and support I've found there. It's helped me grow in my faith so much.\nWife: It's wonderful to see you so passionate and dedicated to something you believe in.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. Husband values the supportive community of believers at church and appreciates having his wife by his side.\n3. The wife is glad to see the husband finding a sense of purpose and being happy.\n4. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n5. Wife is supportive of her husband's faith journey and values having a close relationship with him.\n6. The husband's faith has been strong lately, and he is involved in various church ministries.",
        "speaker": "Husband",
        "raw_prediction": "Thank you for always encouraging me, dear. It means a lot to have your support in everything I do, especially when it comes to my faith journey and activities at church.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t2",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.",
        "memory_text": "1. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n2. Co-worker A had a positive experience with a commander who helped them feel safe.\n3. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n4. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\n5. Co-worker A values making money and is interested in opportunities to do so.\n6. Co-worker A is self-aware about being stubborn and needing to learn to compromise.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks, I appreciate that. It's important to me to create a safe and supportive environment for everyone around me.",
        "previous_summary": null
    },
    {
        "utter_id": "e22-s5-t5",
        "current_dialogue": "Co-workers A: I feel really fulfilled as a leader and guide. Helping others gives me a sense of purpose.\nCo-workers B: I can see that. You always seem to know just what to do to make people feel better.\nCo-workers A: Yeah, I've had a lot of practice over the years. It's just something that comes naturally to me.\nCo-workers B: Do you remember that time when you were led to a safe place by the commander? You must have felt pretty grateful for his guidance then.\nCo-workers A: Absolutely. It was a really tough time and I was so relieved to have someone show me the way. I try to pay it forward by being that kind of leader for others.",
        "memory_text": "1. Co-worker A had a positive experience with a commander who helped them feel safe.\n2. Co-worker B values finding fulfillment in work, pursuing hobbies, making a difference in the world, and building relationships with others.\n3. Co-worker B emphasizes the importance of acknowledging privileges and using them to make the world a better place.\n4. Co-worker A believes that everyone has the ability to create opportunities and make their own luck through hard work and seizing opportunities.\n5. Co-worker A is self-aware about being stubborn and needing to learn to compromise.\n6. Co-worker A values making money and is interested in opportunities to do so.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's amazing how that experience shaped your leadership style. Your ability to empathize and guide others is truly inspiring. It's like you're creating a ripple effect of positivity and support in the workplace.",
        "previous_summary": null
    },
    {
        "utter_id": "e23-s5-t4",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?",
        "memory_text": "1. The teacher and student have a positive and understanding relationship.\n2. The student mentioned feeling stressed lately, which may have led to the outburst.\n3. The teacher expressed understanding and encouraged the student to seek help when needed.\n4. The student once saved a kid from drowning and had a moment of yelling at the teacher in the past.\n5. The student felt rewarded by the experience and emphasized the importance of being aware of surroundings and acting quickly in emergencies.\n6. The teacher advises the student on effective communication and problem-solving, emphasizing the importance of talking calmly and finding solutions together.",
        "speaker": "Student",
        "raw_prediction": "Yeah, I've heard that! Maybe I should start slowly increasing my tolerance so I can enjoy it without feeling like my mouth is on fire every time. Thanks for the tip!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t2",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.",
        "memory_text": "1. Neighbor A and Neighbor B went to a concert together in the past and had a great time.\n2. Neighbor A enjoys reading and sharing books with Neighbor B.\n3. Both neighbors emphasize the importance of taking care of each other as neighbors.\n4. Neighbors A offers to help Neighbors B with getting into a workout routine.\n5. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n6. Neighbors A is feeling overwhelmed and stressed, mentioning having a lot on their plate.",
        "speaker": "Neighbors A",
        "raw_prediction": "I just thought it would be helpful to avoid any potential misunderstandings in the future. It's always good to have clear boundaries, right?",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t11",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.\nNeighbors A: Absolutely. And hey, on a related note, I wanted to talk to you about something else. Lately, I've been feeling really overwhelmed and stressed out.",
        "memory_text": "1. Neighbors A is feeling overwhelmed and stressed, mentioning having a lot on their plate.\n2. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n3. Neighbors B was read to from a book about personal development by Neighbors A, which had a positive impact on Neighbors A's career growth.\n4. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\n5. Both neighbors emphasize the importance of taking care of each other as neighbors.\n6. Neighbors A offers to help Neighbors B with getting into a workout routine.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sorry to hear that you're feeling overwhelmed. I'm here for you. Let's talk about what's been on your plate and see how we can work together to ease some of that stress. Remember, we're in this together as neighbors.",
        "previous_summary": "Neighbors A has been promoted to manager at their job and is taking on more responsibilities.\nNeighbors A is feeling overwhelmed and stressed, mentioning having a lot on their plate.\nNeighbors A was recently promoted to manager and is struggling to adjust to the new responsibilities.\nNeighbors A tries to work out every morning to relieve stress but has been finding it difficult to maintain."
    },
    {
        "utter_id": "e25-s5-t4",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.\nClassmates B:  You're right. Our class definitely has a unique energy about it. What do you think sets us apart from other classes?\nClassmates A:  I think it's our sense of community. We all support each other and work together to achieve our goals.\nClassmates B:  That's definitely a big factor. And I also think our class has a lot of diversity, which brings new perspectives and ideas to the table.",
        "memory_text": "1. Classmates B complimented Classmates A on their suit and brought up a past conversation about feelings.\n2. Classmate B feels relieved that they can still be friends with Classmate A.\n3. Classmates A values their friendship with Classmates B and looks forward to wearing a black suit to a wedding reception.\n4. Classmate A is disappointed when Classmate B does not feel the same way.\n5. Classmate A has been hiding their feelings for Classmate B and finally confesses to being in love with them.\n6. Classmates A confessed their love for Classmates B, who does not feel the same way.",
        "speaker": "Classmates A",
        "raw_prediction": "I completely agree. The diversity in our class is truly enriching. It's amazing how we can all come together and learn from each other's unique experiences and viewpoints.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t8",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.",
        "memory_text": "1. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n2. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n3. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n4. Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\n5. Co-worker A is trying to improve their punctuality and cut back on drinking.\n6. Co-worker A went through a painful breakup and finds it hard to trust people.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, I'm trying to be more responsible in all aspects of my life. It's a work in progress, but I'm getting there. Thanks for noticing the effort.",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t1",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?",
        "memory_text": "1. Neighbors A appreciated the support and friendship of Neighbors B.\n2. Neighbors A is enjoying the different culture and exploring the city.\n3. Neighbors B is familiar with Neighbors A's dog and looking forward to playing with it again.\n4. Neighbors A mentions having back pain and needing a break.\n5. Neighbors B expresses concern for Neighbors A's back pain.\n6. Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience.",
        "speaker": "Neighbors A",
        "raw_prediction": "Hey there! I'm doing well, thank you. How about you? How's your back feeling?",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t8",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.\nCo-workers A: It's been a journey, but I'm glad to see the business flourishing. It gives me a sense of pride and accomplishment.\nCo-workers B: I can tell. You're always trying to find ways to improve things.",
        "memory_text": "1. Co-worker A took over their family's business a few years ago and it has improved since then.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n4. Both Co-worker A and Co-worker B value trust in their personal and professional relationships.\n5. Co-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.\n6. Co-worker B finished a project and sent it to the manager for review.",
        "speaker": "Co-workers A",
        "raw_prediction": "I believe that constant improvement is key to success, both in business and in personal growth. It's all about striving to be better every day.",
        "previous_summary": null
    },
    {
        "utter_id": "e29-s5-t5",
        "current_dialogue": "Athlete: Ted Athlete unrolls the map. He looks at it for a few moments before tracing his finger along one of the highways. \"This is our route,\" he says finally, feeling in control.\nCoach: What route are you planning, Ted?\nAthlete: I'm thinking of taking the highway through the mountains, it's a bit longer, but the scenery is beautiful.\nCoach: That sounds like a good plan, as long as we factor in enough time for rest stops and breaks.\nAthlete: Yes, I was thinking we could stop at a few rest areas along the way. It's important to stay hydrated and keep our energy levels up during long drives.",
        "memory_text": "1. The coach advises the athlete on pre-game meals, emphasizing the need for a balance of carbohydrates, protein, and healthy fats, as well as staying hydrated.\n2. The Coach reminds the Athlete that little distractions can add up and impact performance.\n3. The Athlete is focused on helping the team succeed and has shown leadership qualities during warm-ups and stretches.\n4. The coach encourages the athlete to continue their good work with nutrition and training.\n5. The Athlete is focused on improving their performance and energy levels.\n6. The Coach encourages the Athlete to keep up the good work and acknowledges their achievements.",
        "speaker": "Coach",
        "raw_prediction": "Absolutely, staying hydrated and taking breaks will help us arrive feeling refreshed and ready to perform at our best. It's all about maintaining that focus and energy, both on the road and on the field.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n2. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n3. Co-worker A's evidence includes statistics and personal accounts from clients.\n4. Co-worker A believes their evidence is more compelling than the opposing side's evidence.\n5. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n6. Co-worker A agrees to be more conscious of how they come across to others in the future.",
        "speaker": "Co-workers B",
        "raw_prediction": "Your ability to combine statistics with personal anecdotes really makes your evidence stand out. It's not just about presenting data; it's about connecting with people on a deeper level, and you excel at that.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t12",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?\nCo-workers A: Yeah, I remember. But she eventually gave me the cash, and I was able to take care of what I needed to.\nCo-workers B: That's good. And speaking of taking care of things, your carpentry skills are amazing. I loved the house you built for me last year.\nCo-workers A: Thanks! I really love building houses. It's a great feeling to take a blueprint and turn it into someone's dream home.\nCo-workers B: You're a true professional. Speaking of professional skills, your speech at the rally really moved the crowd. You have a great way with words.",
        "memory_text": "1. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n2. Co-worker A is a skilled builder who recently completed building a house for Co-worker B.\n3. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n4. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n5. Co-worker A's evidence includes statistics and personal accounts from clients.\n6. Co-worker A appreciates the support and hard work put into the case.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you so much for the kind words. I believe that clear communication and connecting with the audience are key in delivering a powerful message.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t1",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n3. Classmates A appreciates the support and friendship of Classmates B.\n4. Classmates A and B are making plans to spend time together outside of school.\n5. Classmates A and B started as acquaintances and have developed a strong friendship.\n6. Classmates A and B had a mix-up with names in the past but resolved the issue through communication.",
        "speaker": "Classmates A",
        "raw_prediction": "That's amazing! You always go above and beyond to help others. Your kindness is truly inspiring.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t3",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n3. Classmates A appreciates the support and friendship of Classmates B.\n4. Classmates A and B are making plans to spend time together outside of school.\n5. Classmates A and B started as acquaintances and have developed a strong friendship.\n6. Both Classmates A and B are looking forward to hanging out outside of school.",
        "speaker": "Classmates B",
        "raw_prediction": "Wow, that's so thoughtful of you to lend a helping hand! Your neighbor must have been really grateful for your assistance. It's great to see you making a positive impact in your community.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t8",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.\nClassmates B: Definitely. It's the small acts of kindness that can make the biggest impact. Remembers when we talked about how I made sure the mix-up won't happen again? That was because I wanted to make a small impact, like you did for your neighbor.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates A appreciates the support and friendship of Classmates B.\n3. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n4. Classmates A and B started as acquaintances and have developed a strong friendship.\n5. Classmates B was initially worried about Classmates A going out with friends but they value each other's opinions.\n6. Classmates A and B value their friendship and feel comfortable talking to each other about anything.",
        "speaker": "Classmates A",
        "raw_prediction": "I remember that. Your responsibility and reliability really shine through in moments like that. It's great to see how we both strive to make a positive impact, whether big or small, in our own ways.",
        "previous_summary": "Classmates B had to apologize for a mix-up due to two people having the same name.\nClassmates B made sure to double-check everything to resolve the issue and prevent it from happening again.\nClassmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability."
    },
    {
        "utter_id": "e32-s5-t6",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.",
        "memory_text": "1. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n2. The husband is inspired by his wife to take action on his dreams and goals.\n3. The husband apologized and promised to involve the wife in his plans in the future.\n4. The husband and wife are committed to each other and excited about their future together.\n5. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n6. The wife is supportive and proud of her husband for working towards his goals.",
        "speaker": "Husband",
        "raw_prediction": "I'm glad you're excited about it, wife. It's going to be a wonderful time for us to unwind and enjoy each other's company without any distractions.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t8",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.",
        "memory_text": "1. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n2. The husband is inspired by his wife to take action on his dreams and goals.\n3. The husband apologized and promised to involve the wife in his plans in the future.\n4. The husband and wife are committed to each other and excited about their future together.\n5. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n6. The wife is supportive and proud of her husband for working towards his goals.",
        "speaker": "Husband",
        "raw_prediction": "Thank you for believing in me, wife. Your support means the world to me. I can't wait to make this weekend getaway a reality and create beautiful memories together.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t10",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.\n3. The wife brings up past disappointment when the husband left without her, breaking a promise to wait for her.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband is inspired by his wife to take action on his dreams and goals.\n6. The husband values the wife's encouragement and positivity in his pursuit of his goals.",
        "speaker": "Husband",
        "raw_prediction": "I appreciate your understanding, wife. I promise to always involve you in my plans moving forward and make sure we create more beautiful memories together.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t16",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.\nWife: Thanks, husband. And speaking of good times, I had so much fun at the dance a few weeks ago. Dancing with you always puts me in a good mood.\nHusband: Same here, wife. I love spending time with you, and I feel grateful for every moment we get to share. \nWife: I feel the same way, husband. And, I appreciate you doing the dishes for me today so we could have this conversation.",
        "memory_text": "1. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n2. The husband is inspired by his wife to take action on his dreams and goals.\n3. The husband acknowledges his wife's bravery and selflessness.\n4. The husband apologized and promised to involve the wife in his plans in the future.\n5. The wife admires the husband's determination and big heart.\n6. The husband and wife are committed to each other and excited about their future together.",
        "speaker": "Husband",
        "raw_prediction": "I'm glad I could help out, wife. It's the least I can do to show my love and appreciation for you. You truly make every moment special, even something as simple as doing the dishes together.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t7",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.",
        "memory_text": "1. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n2. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n3. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n4. Classmates A is stranded in space, running out of oxygen and feeling lightheaded.\n5. Classmates A mentioned that life is full of surprises and anything is possible.\n6. Classmate B praises Classmate A's attention to detail and work ethic as truly impressive.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, I know it's not a big deal, but it was still pretty embarrassing at the moment. I guess I just overreacted a bit.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t10",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.",
        "memory_text": "1. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n2. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n3. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n4. Classmates A is stranded in space, running out of oxygen and feeling lightheaded.\n5. Classmate B praises Classmate A's attention to detail and work ethic as truly impressive.\n6. Classmates B also mentioned that Classmates A helped them prepare for a driving test, showing patience and dedication.",
        "speaker": "Classmates A",
        "raw_prediction": "Well, thanks for the reminder. We all have our clumsy moments, but it's how we handle them that really matters. Just like how you're handling your lunch mishap now - with grace and a sense of humor.",
        "previous_summary": "Classmates A and B have been on field trips to other planets or moons before, like Mars.\nClassmate A showed determination in fixing their spaceship after it was damaged in a meteor shower.\nClassmate A's perseverance in repairing the spaceship reflects their determination to not give up in challenging situations.\nClassmate A is patient and helpful in teaching driving material to Classmate B.\nBoth classmates value supporting and uplifting each other in their learning and growth."
    },
    {
        "utter_id": "e35-s5-t6",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.\nCo-workers B: That's right. It's important to have someone to talk to when you're feeling overwhelmed or upset.",
        "memory_text": "1. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n2. Co-worker A and Co-worker B met on a movie set and are now good friends.\n3. Co-worker A had a tough week on set, feeling overwhelmed and chaotic.\n4. Co-worker B and Co-worker A met on a movie set where Co-worker A was focused on acting.\n5. Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.\n6. Co-worker B acknowledges that some people have fears and suggests finding healthy ways to deal with frustrations.",
        "speaker": "Co-workers A",
        "raw_prediction": "Absolutely, having someone to talk to and support you during tough times can make a huge difference. I'm glad we were able to work through that together on set.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t7",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.\nCo-workers B: That's right. It's important to have someone to talk to when you're feeling overwhelmed or upset.\nCo-workers A: And speaking of talking it out, do you remember when I was a kid and I ran to our parents screaming because of that spider?",
        "memory_text": "1. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n2. Co-worker A had a tough week on set, feeling overwhelmed and chaotic.\n3. Co-worker B acknowledges that some people have fears and suggests finding healthy ways to deal with frustrations.\n4. Co-worker A and Co-worker B met on a movie set and are now good friends.\n5. Co-worker B encourages Co-worker A to try relaxation techniques or find a hobby to de-stress and overcome fears.\n6. Co-worker B and Co-worker A met on a movie set where Co-worker A was focused on acting.",
        "speaker": "Co-workers B",
        "raw_prediction": "Yes, I remember that vividly! It's interesting how our reactions to fear change over time. Finding healthy ways to cope with those fears is crucial. Have you tried any relaxation techniques or hobbies to help manage stress and fears now?",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t7",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.",
        "memory_text": "1. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n2. Mentor became a mentor to help others going through similar situations.\n3. Mentee agrees to try the advice and express gratitude towards Mentor.\n4. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n5. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.\n6. Mentee has been thinking about helping others who may be in abusive cults.",
        "speaker": "Mentor",
        "raw_prediction": "You're absolutely right. Recognizing and respecting those differences is key to fostering empathy and understanding in our interactions with others. It's wonderful to see your commitment to approaching teaching religion with an open mind and heart, as it will undoubtedly make a positive impact on people's lives.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t8",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.",
        "memory_text": "1. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n2. Mentor became a mentor to help others going through similar situations.\n3. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n4. Mentee agrees to try the advice and express gratitude towards Mentor.\n5. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.\n6. Mentee agrees to teach in a way that allows people to make their own decisions about their beliefs.",
        "speaker": "Mentee",
        "raw_prediction": "I couldn't agree more. Being open-minded and willing to learn from others is key to personal growth and understanding. It's amazing how much we can gain by simply listening and trying to see things from different perspectives.",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t12",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?\nMentor: I'm originally from Italy.",
        "memory_text": "1. Mentor is from Italy and has lived in the United States.\n2. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n3. Mentor became a mentor to help others going through similar situations.\n4. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n5. Mentee agrees to try the advice and express gratitude towards Mentor.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentee",
        "raw_prediction": "That's amazing. Living in two different countries must have given you a unique perspective on life. I appreciate your openness to different cultures and your willingness to share your experiences with me. It's inspiring to see how you've embraced diversity in your life.",
        "previous_summary": null
    },
    {
        "utter_id": "e37-s5-t6",
        "current_dialogue": "Neighbors A: It's great to have friends who can help each other out, isn't it?\nNeighbors B: Absolutely. It's a two-way street, and it's important to be there for each other.\nNeighbors A: I remember when I helped you move last year, and then you watched my cat when I went on vacation.\nNeighbors B: Yes, and I appreciate it so much. It's always nice to have someone you can count on.\nNeighbors A: That's true. And speaking of which, I'm helping another friend move next weekend. It'll be a big job, but I know they'd do the same for me.\nNeighbors B: That's great. And if you need any help, just let me know.",
        "memory_text": "1. Neighbors A thanked Neighbors B for the suggestion.\n2. Neighbors B offered to help Neighbors A with the apology process.\n3. Both neighbors express the difficulty of not being able to adopt all the animals they see but appreciate those who do adopt and give them loving homes.\n4. Neighbors A bought a necklace from Neighbors B's shop and loves it.\n5. Neighbors B emphasized the importance of apologizing to show care for the relationship.\n6. Neighbors A was looking for a new necklace and stumbled upon Neighbors B's shop.",
        "speaker": "Neighbors A",
        "raw_prediction": "Thanks, I really appreciate that. It's nice to know I have such supportive friends like you.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t1",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.",
        "memory_text": "1. Classmates A was worried about a situation but it turned out to be not a big deal.\n2. Classmates A and B are students in the same class.\n3. Classmates A offered help and support to Classmates B.\n4. Classmates A discovered a secret that Classmates B has been keeping.\n5. Classmates A invited Classmates B to join the study group together for extra support and studying.\n6. Classmates A and B are close and have a level of trust between them.",
        "speaker": "Classmates A",
        "raw_prediction": "Sure, what's on your mind?",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t8",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmates A discovered a secret that Classmates B has been keeping.\n3. Classmates A and B are students in the same class.\n4. Classmates B feels relieved to have someone to confide in about the secret.\n5. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n6. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.",
        "speaker": "Classmates A",
        "raw_prediction": "That's great to hear! I'm really glad we're on the same page about this. I think exploring this could be a wonderful journey for both of us.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t2",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?",
        "memory_text": "1. Neighbors A and B both took a cooking class together last year.\n2. Neighbors A and B believe in doing nice things for others to bring the community together.\n3. Neighbors A saw George at the store and exchanged waves.\n4. Neighbors B admires Neighbors A's organization skills and wishes to improve their own organization.\n5. Both Neighbors A and B believe in the importance of learning and self-improvement.\n6. Neighbor A is feeling frustrated and is considering going to a bar to find someone for a casual encounter.",
        "speaker": "Neighbors A",
        "raw_prediction": "I visited Brazil, Argentina, and Peru. The sights and experiences were truly unforgettable. I even took a cooking class in Argentina and learned to make empanadas!",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t4",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?\nNeighbors A: I visited Brazil and Peru. The culture and food were incredible.\nNeighbors B: That sounds awesome. I've always wanted to go to Peru to see Machu Picchu.",
        "memory_text": "1. Neighbors A and B believe in doing nice things for others to bring the community together.\n2. Neighbors A and B both took a cooking class together last year.\n3. Neighbors B admires Neighbors A's organization skills and wishes to improve their own organization.\n4. Both Neighbors A and B believe in the importance of learning and self-improvement.\n5. Neighbor A is feeling frustrated and is considering going to a bar to find someone for a casual encounter.\n6. Neighbors A saw George at the store and exchanged waves.",
        "speaker": "Neighbors A",
        "raw_prediction": "You should definitely plan a trip there! Machu Picchu is truly breathtaking. I can share some travel tips with you if you're interested.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t3",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmate A and Classmate B are classmates.\n3. Classmates B offers support and suggests taking a step back to find a balance.\n4. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n5. Classmates A expresses gratitude for the support and friendship of Classmates B.\n6. Classmate A emphasizes the importance of self-care and relaxation.",
        "speaker": "Classmates B",
        "raw_prediction": "That's great to hear! Your dedication to improving yourself is truly admirable. Just remember to find a balance and not burn yourself out. Enjoy the process and the learning journey.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n3. Classmates A expresses gratitude for the support and friendship of Classmates B.\n4. Classmate A and Classmate B are classmates.\n5. Classmates B offers support and suggests taking a step back to find a balance.\n6. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, it really is. It's like that feeling I had when I beat your brother in that race. Remember how competitive I can be?",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t8",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n3. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.\n4. Classmates A is competitive and recently beat their brother in a race.\n5. Classmates A expresses gratitude for the support and friendship of Classmates B.\n6. Classmate A and Classmate B are classmates.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad you see the connection! It's all about putting in the effort and enjoying the journey, not just the end result.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t2",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmates A has matured since then and learned from past mistakes.\n3. Classmates B and Classmates A used to dance a lot in middle school.\n4. Classmates A acknowledges the mistake and plans to learn from it.\n5. Classmates B supported Classmates A through a tough time by listening to them.\n6. Classmate B is a supportive friend who listens and offers to help.",
        "speaker": "Classmates A",
        "raw_prediction": "I learned about different operating systems, software applications, and even some coding basics. It was really eye-opening for me.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t1",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.",
        "memory_text": "1. Co-worker B is supportive and encouraging towards Co-worker A.\n2. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n3. Co-workers A and B have worked together on a big story in the past.\n4. Co-worker B points out that Co-worker A doesn't always consider how their actions can affect others.\n5. Co-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else.\n6. Co-worker A appreciates Co-worker B's support and plans to perform in the final round of the competition.",
        "speaker": "Co-workers B",
        "raw_prediction": "Of course, I'd love to join you for lunch on Tuesday at the school cafeteria. It'll be great to catch up and chat about how your preparation for the competition is going.",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t2",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?",
        "memory_text": "1. Co-worker B is supportive and encouraging towards Co-worker A.\n2. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n3. Co-worker B points out that Co-worker A doesn't always consider how their actions can affect others.\n4. Co-workers A and B have worked together on a big story in the past.\n5. Co-worker A appreciates Co-worker B's support and plans to perform in the final round of the competition.\n6. Co-worker A is trying to be more conscious of how their actions impact others and avoid causing problems for anyone else.",
        "speaker": "Co-workers A",
        "raw_prediction": "I was thinking around 12:30 pm. Does that work for you?",
        "previous_summary": null
    },
    {
        "utter_id": "e42-s5-t10",
        "current_dialogue": "Co-workers A: Hi there, I was wondering if you'd like to join me for lunch on Tuesday at the school cafeteria.\nCo-workers B: Oh, sure. Thanks for the invitation. What time were you thinking?\nCo-workers A: Noon works for me. Is that okay with you?\nCo-workers B: Yeah, that works for me. Thanks for asking me to join you.\nCo-workers A: No problem, it'll be great to catch up. Hey, do you remember when we talked about me being irresponsible a few years ago?\nCo-workers B: Yeah, I remember that conversation. What about it?\nCo-workers A: Well, I wanted to share some good news with you. I've been recently promoted to the night shift and have been doing a great job. I think I've come a long way since those days.\nCo-workers B: That's awesome, congratulations! I'm proud of you and all the hard work you've put in. You've definitely grown and matured in the workplace.\nCo-workers A: Thank you, I appreciate that. But I have to admit, I'm still a bit nervous about being wrong. Remember when we talked about my constantly questioning myself and second-guessing my decisions?\nCo-workers B: Yeah, I remember that. Is there anything specific that's been bothering you?",
        "memory_text": "1. Co-worker B reassures Co-worker A and encourages them to have more confidence.\n2. Co-worker A expresses nervousness and self-doubt despite their achievements.\n3. Co-worker A is nervous about making mistakes in their new position.\n4. Co-worker B reassures Co-worker A that making mistakes is okay as long as they learn from them.\n5. Both Co-worker A and Co-worker B acknowledge the importance of taking responsibility for their actions and learning from mistakes.\n6. Co-worker B is supportive and encouraging towards Co-worker A.",
        "speaker": "Co-workers A",
        "raw_prediction": "I think it's just the fear of making mistakes in this new role. I keep worrying that if I mess up, it'll reflect poorly on me.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t2",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?",
        "memory_text": "1. Neighbor A is grieving the recent loss of their grandmother.\n2. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n3. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n4. Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.\n5. Neighbor A recently moved to a new neighborhood and feels safer and happier there.\n6. Neighbor A's old apartment building was not the best place to live in.",
        "speaker": "Neighbors A",
        "raw_prediction": "I have tried calling him a few times, but he hasn't answered. I don't know what to do.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t6",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?",
        "memory_text": "1. Neighbor A is grieving the recent loss of their grandmother.\n2. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n3. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n4. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n5. Neighbor A recently moved to a new neighborhood and feels safer and happier there.\n6. Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.",
        "speaker": "Neighbors A",
        "raw_prediction": "I appreciate that, Neighbor B. Talking about it does help, but maybe we could go for a walk in the park together. Nature always has a way of calming me down and helping me clear my mind.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t9",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.\nNeighbors B: How about we go for a walk and you can talk to me about everything that's been on your mind?\nNeighbors A: That sounds good. You've always been such a good listener, Neighbor B. Thank you for being there for me.",
        "memory_text": "1. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n2. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n3. Neighbor A is grieving the recent loss of their grandmother.\n4. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n5. Neighbors A and Neighbors B enjoy going for walks together, especially to the park.\n6. Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm here for you, Neighbor A. Let's take a walk and you can share as much or as little as you want. Just know that I'm here to support you through this difficult time.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t1",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed.\n2. Classmate A has tried practicing in front of others but still feels nervous.\n3. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n4. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n5. Classmates A sometimes doubts if they are good enough to make it to the professional level.\n6. Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.",
        "speaker": "Classmates A",
        "raw_prediction": "Don't worry, we'll figure this out together. I'm here to support you through this. Just take a deep breath and let's tackle this step by step.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t2",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed.\n2. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n3. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n4. Classmate A has tried practicing in front of others but still feels nervous.\n5. Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.\n6. Classmates A sometimes doubts if they are good enough to make it to the professional level.",
        "speaker": "Classmates A",
        "raw_prediction": "I know, I panicked and made a mistake. I'm really stressed about the consequences.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t3",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed.\n2. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n3. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n4. Classmate A has tried practicing in front of others but still feels nervous.\n5. Classmate B brought goods to Classmate A's house and is supportive of their basketball dream.\n6. Classmates A sometimes doubts if they are good enough to make it to the professional level.",
        "speaker": "Classmates B",
        "raw_prediction": "I understand that you were in a tough spot, but cheating is never the solution. It's important to face these challenges head-on and seek help when needed. I'm here to support you through this difficult time.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t4",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.",
        "memory_text": "1. Classmate B reassures Classmate A that they are all in it together and offers help if needed.\n2. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n3. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n4. Classmate B advises Classmate A to take deep breaths, stay confident, and focus on delivery.\n5. Classmate A has tried practicing in front of others but still feels nervous.\n6. Classmates A sometimes doubts if they are good enough to make it to the professional level.",
        "speaker": "Classmates A",
        "raw_prediction": "I understand that you were facing financial difficulties, but cheating is never the solution. It's important to address the issue in a legitimate way and seek help if needed.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t9",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n4. Classmates A and B are both keeping up with the homework in their math class.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.",
        "speaker": "Classmates B",
        "raw_prediction": "That sounds like a great idea! I'd love to work on that list with you. It could be a good way for me to take small steps towards independence. Thanks for being so supportive!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t13",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?",
        "memory_text": "1. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n2. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n3. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n4. Classmates A finds pursuing music rewarding and is passionate about it.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't considered that yet, but it's definitely something I'd love to explore in the future. It's exciting to think about collaborating with you on music as well.",
        "previous_summary": "Classmates A plays the guitar, takes lessons, and plays in a band.\nClassmates B is interested in learning to play an instrument.\nClassmates A started playing the guitar because of a love for music and is working on their first album.\nClassmates A's band mostly plays at local bars and coffee shops.\nClassmates A's band is trying to build up their fan base and play at bigger venues.\nClassmates A and B enjoy jamming together and plan to collaborate on music in the future."
    },
    {
        "utter_id": "e47-s5-t14",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.",
        "memory_text": "1. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n2. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n3. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n4. Classmates A finds pursuing music rewarding and is passionate about it.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.",
        "speaker": "Classmates A",
        "raw_prediction": "That's completely understandable. Take your time with it, and when you're ready, we can definitely jam together more often to build up your confidence. Just enjoy the process and remember, we're in this together.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t2",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.",
        "memory_text": "1. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n2. Neighbor B is against Neighbor A's idea, emphasizing the ethical and legal implications.\n3. Neighbor A has skills in manipulation and getting what they want.\n4. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n5. Neighbors A values their friendship with Neighbors B, describing them as a great neighbor.\n6. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.",
        "speaker": "Neighbors A",
        "raw_prediction": "You're absolutely right, Neighbor B. I really need to get my act together and stop putting things off. Maybe we can work on staying accountable to each other and help each other stay on track with our tasks.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t6",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?",
        "memory_text": "1. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n2. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n3. Neighbor A has skills in manipulation and getting what they want.\n4. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n5. Neighbors B admires Neighbors A's gardening skills and wishes to have a green thumb.\n6. Neighbor B is against Neighbor A's idea, emphasizing the ethical and legal implications.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's a good point. Maybe a change in environment could help me focus better. I'll give it a try and see if it makes a difference. Thanks for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t14",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.",
        "memory_text": "1. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n2. Neighbors A had help from friends in building the new house.\n3. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.\n4. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n5. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n6. Neighbors A values their friendship with Neighbors B, describing them as a great neighbor.",
        "speaker": "Neighbors A",
        "raw_prediction": "I'm so glad we shared that moment together. It's memories like those that make all the hard work worth it.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t16",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.\nNeighbors A: Speaking of London, have you heard about those recent cases of identity theft? It's terrible that people like that exist.\nNeighbors B: Yes, it's scary to think someone could steal your identity and ruin your life like that.",
        "memory_text": "1. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n2. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n3. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n4. Neighbors A values their friendship with Neighbors B, describing them as a great neighbor.\n5. Neighbors A had help from friends in building the new house.\n6. Neighbors B received a new house built by Neighbors A and is grateful for the extra space.",
        "speaker": "Neighbors A",
        "raw_prediction": "It's definitely a reminder to always be vigilant with our personal information and security measures. We have to look out for each other in times like these.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t17",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.\nNeighbors B: No problem. Speaking of goals, how's the house project coming along? \nNeighbors A: It's finished! Three bedrooms, two bathrooms, and a big backyard. It was a lot of work, but worth it in the end. \nNeighbors B: That's amazing, thanks for building me such a beautiful house. \nNeighbors A: Of course, I'm glad you like it. Remember when we watched the sunset over the London skyline? That was such a beautiful moment.\nNeighbors B: Yes, I still remember the pink and orange hues reflecting off the buildings. It was breathtaking.\nNeighbors A: Speaking of London, have you heard about those recent cases of identity theft? It's terrible that people like that exist.\nNeighbors B: Yes, it's scary to think someone could steal your identity and ruin your life like that.\nNeighbors A: Exactly, that's why I always try to be a kind person and help others when I can. Like arranging flowers in a vase, for example. Small acts of kindness can make a big difference. ",
        "memory_text": "1. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n2. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n3. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n4. Neighbors A values their friendship with Neighbors B, describing them as a great neighbor.\n5. Neighbors A and B value gratitude and being alive to witness incredible moments.\n6. Neighbors A had help from friends in building the new house.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's such a thoughtful gesture. It's true, small acts of kindness can really brighten someone's day. Just like how our community event brought everyone together and uplifted spirits. It's all about spreading positivity and making a difference, no matter how small.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t1",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.",
        "memory_text": "1. Wife suggests that husband should try using more modern language to be better understood.\n2. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.\n3. Husband agrees to try adapting to modern language for better communication with his wife.\n4. The husband claims to have a real connection with Sarah and wants to find a way to move forward while still considering his current marriage.\n5. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\n6. The husband felt like he was being judged and humiliated during the presentation.",
        "speaker": "Wife",
        "raw_prediction": "Have you considered taking a break and maybe trying a different approach? Sometimes stepping away for a bit can help clear your mind and spark new inspiration.",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t8",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.\nWife: Maybe it's time to take a step back and try something new. Have you ever tried writing in a different genre or experimenting with different styles?\nHusband: That's a good idea. I guess I just haven't had the courage to step out of my comfort zone.\nWife: Remember when you faced your fear of public speaking during your fifth-grade presentation? You can do this too. Sometimes, the biggest breakthroughs come from taking risks.",
        "memory_text": "1. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.\n2. Wife suggests that husband should try using more modern language to be better understood.\n3. Husband agrees to try adapting to modern language for better communication with his wife.\n4. The wife remembers the husband being nervous before the presentation.\n5. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\n6. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.",
        "speaker": "Husband",
        "raw_prediction": "You're right. I did manage to push through my fear back then, so I can definitely do it again with my writing. Thanks for the encouragement and for believing in me, it means a lot. I'll give it a try and see where it takes me.",
        "previous_summary": "The husband gave a fifth-grade presentation in the past.\nThe wife remembers the husband being nervous before the presentation.\nThe husband felt like he was being judged and humiliated during the presentation.\nThe wife reassures the husband that it's okay to be different and encourages him to embrace who he is."
    },
    {
        "utter_id": "e49-s5-t9",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?\nHusband: I have, but I feel like I'm just repeating the same stories over and over again.\nWife: Maybe it's time to take a step back and try something new. Have you ever tried writing in a different genre or experimenting with different styles?\nHusband: That's a good idea. I guess I just haven't had the courage to step out of my comfort zone.\nWife: Remember when you faced your fear of public speaking during your fifth-grade presentation? You can do this too. Sometimes, the biggest breakthroughs come from taking risks.\nHusband: You're right. Maybe it's time to try something completely different and see where it takes me.",
        "memory_text": "1. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.\n2. Wife suggests that husband should try using more modern language to be better understood.\n3. Husband agrees to try adapting to modern language for better communication with his wife.\n4. The wife remembers the husband being nervous before the presentation.\n5. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\n6. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.",
        "speaker": "Wife",
        "raw_prediction": "I'm glad you're open to trying new things. Remember, I'll always be here to support you, no matter what direction your writing takes. Just believe in yourself and your creativity, and you'll see amazing results.",
        "previous_summary": null
    }
]