[
    {
        "utter_id": "e0-s5-t2",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The Child finds the Parent's story inspiring.\n3. The parent values independence and self-sufficiency.\n4. The child offers help and reassurance to the parent.\n5. The parent wants to provide a safe and stable environment for the child.\n6. Both the parent and child enjoy spending time together in their new home.",
        "speaker": "Parent",
        "raw_prediction": "I'm glad to hear that you feel heard when we talk. It's essential to create a safe space where we can communicate openly and support each other. Your willingness to listen and understand means a lot to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t4",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The child offers help and reassurance to the parent.\n3. The Child finds the Parent's story inspiring.\n4. The parent had a tough time when they got arrested and had to rely on a lawyer and the justice system for help.\n5. The parent values independence and self-sufficiency.\n6. The parent wants to provide a safe and stable environment for the child.",
        "speaker": "Parent",
        "raw_prediction": "Yes, it was a challenging time. I had to rely on my lawyer to make sure my voice was heard in that situation. It made me appreciate the times when I could truly listen and be listened to even more.",
        "previous_summary": "The parent was taken to juvenile detention for getting into trouble with the law.\nThe parent expresses fear and upset about the situation.\nThe parent had a tough time when they got arrested and had to rely on a lawyer and the justice system for help."
    },
    {
        "utter_id": "e0-s5-t6",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The Child finds the Parent's story inspiring.\n3. The Parent eventually got to see the sunrise after leaving detention.\n4. The child offers help and reassurance to the parent.\n5. The Parent and Child plan to watch the sunrise together in the future.\n6. The parent had a tough time when they got arrested and had to rely on a lawyer and the justice system for help.",
        "speaker": "Parent",
        "raw_prediction": "I'm glad you remember that moment, it meant a lot to me too. And I'm looking forward to watching the sunrise together again in the future. It's those small moments that really make a difference, don't you think?",
        "previous_summary": null
    },
    {
        "utter_id": "e0-s5-t10",
        "current_dialogue": "Parent: You know, I always valued being a good listener. It's an important skill to have in life.\nChild: Yeah, I think listening is really important too. I always feel heard when I talk to you.\nParent: That's great to hear. I think listening is especially important when people are going through a tough time. It can make a big difference to feel like someone is really hearing you.\nChild: Did you feel like that when you were in detention? Like nobody was really listening to you?\nParent: Yeah, it was tough. I felt so alone and scared, and I didn't know if anyone would understand what I was going through. But eventually, I found someone who was willing to listen and it made all the difference.\nChild: I'm glad you found someone to talk to. You know, I remember when we watched the sunrise together a few weeks ago. That was really special.\nParent: It was. I love being able to appreciate the beauty of nature. And you know, having my own place to live in the suburbs makes it even easier to do things like that.\nChild: Yeah, your house is really nice. You've always been good at taking care of yourself.\nParent: Well, I've always valued my independence. Even as a kid, I wanted to do things on my own. That's why I decided to live on my own a few years ago.\nChild: I can see why you would want to do that. You're just really good at being self-sufficient.",
        "memory_text": "1. The Parent found hope and appreciated small moments even in difficult situations.\n2. The parent values independence and self-sufficiency.\n3. The Child finds the Parent's story inspiring.\n4. The parent now lives in a little house in the suburbs that they love.\n5. Both the parent and child enjoy spending time together in their new home.\n6. The parent wants to provide a safe and stable environment for the child.",
        "speaker": "Parent",
        "raw_prediction": "Thank you for noticing. It's important to me to be able to provide a stable and safe environment for us. Your support means everything to me.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t3",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee is feeling overwhelmed with the college application process.\n3. The Mentee has been offered a job and has decided to take the job in the city.\n4. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n5. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n6. Mentor emphasizes the importance of self-care for dealing with challenges.",
        "speaker": "Mentor",
        "raw_prediction": "It's completely normal to feel that way, Mentee. Building new relationships takes time, so be patient with yourself. Maybe try joining some local clubs or organizations to meet people who share your interests.",
        "previous_summary": null
    },
    {
        "utter_id": "e1-s5-t8",
        "current_dialogue": "Mentee: Mentor, I'm feeling really lonely in this new city. I don't know anyone yet and I miss my old friends.\nMentor: I understand that starting over can be tough, Mentee. But remember, this is also an opportunity for you to meet new people and make new connections.\nMentee: Yes, I know, but it's easier said than done. I feel like everyone already has their own group of friends here.\nMentor: That's just a fear, Mentee. You can join clubs or organizations that interest you to meet like-minded people. You could also start volunteering around the city to meet new people.\nMentee: Those are good suggestions, Mentor. I'll consider joining a club or volunteering.\nMentor: And remember, it's also important to keep in touch with your old friends. You can schedule video calls or even plan a visit back home.\nMentee: That's true, I'll make sure to keep in touch. Thanks for the advice, Mentor.\nMentor: Anytime, Mentee. Is there anything else you want to talk about or any updates you'd like to share?",
        "memory_text": "1. Mentor reassures Mentee that many students feel the same way and that everyone works at their own pace.\n2. Mentee agreed to go back to the store to make things right and expressed gratitude for the mentor's advice.\n3. The Mentee expresses gratitude for the Mentor's guidance and support throughout the decision-making process.\n4. Mentee is feeling overwhelmed with the college application process.\n5. Mentor advises Mentee to break down studying into manageable chunks, schedule study sessions and breaks, and use resources like practice exams and review books.\n6. The Mentee has been offered a job and has decided to take the job in the city.",
        "speaker": "Mentee",
        "raw_prediction": "Actually, I've been thinking about exploring more of the city in my free time. Do you have any recommendations for places to visit or things to do in the area?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t3",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.",
        "memory_text": "1. Neighbor B is comforting and supportive towards Neighbor A.\n2. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n3. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n4. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n5. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n6. Neighbor A's mom scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors B",
        "raw_prediction": "I know you meant it as a joke, but getting pushed into cold water is not exactly my idea of fun. Let's stick to pranks that don't involve freezing temperatures next time, okay?",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t4",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.",
        "memory_text": "1. Neighbor B is comforting and supportive towards Neighbor A.\n2. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n3. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n4. Neighbor A and Neighbor B have known each other for a while, as they reminisce about past events.\n5. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n6. Neighbor A's mom scolds them for ripping off the tag from their new shirt.",
        "speaker": "Neighbors A",
        "raw_prediction": "Alright, I hear you. I won't do it again, I promise.",
        "previous_summary": null
    },
    {
        "utter_id": "e2-s5-t10",
        "current_dialogue": "Neighbors A: Haha, that was a good one! Aren't you glad I pushed you into the cold water?\nNeighbors B: No, I'm not glad. That was completely uncalled for.\nNeighbors A: Oh come on, it was just a joke. Lighten up a bit.\nNeighbors B: It wasn't funny. You shouldn't push people like that, especially into cold water.\nNeighbors A: Fine, I'm sorry. I didn't mean to upset you. Let's just forget about it.\nNeighbors B: Okay, but just don't do it again.\nNeighbors A: I won't. So, do you remember the time when I mowed the lawn with that old push mower?\nNeighbors B: Yeah, I remember that. That was pretty tough work.\nNeighbors A: It was. But it was also a good workout.\nNeighbors B: I prefer to work out indoors where there's air conditioning.",
        "memory_text": "1. Both Neighbors A and B enjoy spending time outside, even if it involves doing chores like mowing the lawn.\n2. Neighbors B agrees that mowing the lawn is a lot of work but acknowledges the exercise it provides.\n3. Neighbors A mentioned mowing the lawn with an old push mower, indicating they are responsible for the yard work.\n4. Neighbors B suggests having extra water on hand for the next time Neighbors A mows the lawn, showing consideration for each other.\n5. Neighbors A and B have had conversations about the temperature in the house and how it feels hotter outside.\n6. Neighbors A and B plan to work on mowing the lawn together next time to make it easier and possibly discover more things in common.",
        "speaker": "Neighbors A",
        "raw_prediction": "I get that, but being outside in the fresh air has its own charm, don't you think? Maybe next time we tackle the lawn together, we can make it more enjoyable and get the job done faster.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t7",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.\nCo-workers B: That's not the same thing, Co-workers A. Stealing someone and keeping them against their will is illegal and immoral. You need to let go of this obsession and move on.\nCo-workers A: I know you're right, Co-workers B. I just don't know how to get over this feeling.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n3. Co-worker B appreciates Co-worker A's positivity and friendship.\n4. Co-worker A is alive but will need time to adjust to their new way of life.\n5. Co-worker B is supportive and willing to help in any way.\n6. Co-worker A intervened to help two women who were fighting, showing bravery and a desire to make a positive impact.",
        "speaker": "Co-workers B",
        "raw_prediction": "I understand that it's hard, Co-workers A. It's important to take some time to reflect on your feelings and find healthier ways to cope. I'm here for you, and we can work through this together. Let's focus on making positive choices and helping others like you did when you intervened to stop that fight.",
        "previous_summary": null
    },
    {
        "utter_id": "e3-s5-t8",
        "current_dialogue": "Co-workers A: I have a plan to never let the bride get married to anyone else. I'm going to steal her and hide her away.\nCo-workers B: What?! That's not right, Co-workers A. You can't just take someone away like that.\nCo-workers A: But I love her and I don't want her to be with anyone else. It's the only way.\nCo-workers B: That's not love, Co-workers A. Love is about respecting someone's choices and feelings. You can't just kidnap someone and force them to be with you.\nCo-workers A: I know, but I can't help how I feel. It's like when I borrowed your pencil without asking. I felt guilty, but I couldn't resist using it.\nCo-workers B: That's not the same thing, Co-workers A. Stealing someone and keeping them against their will is illegal and immoral. You need to let go of this obsession and move on.\nCo-workers A: I know you're right, Co-workers B. I just don't know how to get over this feeling.\nCo-workers B: Maybe try talking to someone about it. A therapist or a trusted friend. They can help you work through these emotions in a healthy way.",
        "memory_text": "1. Co-worker A borrowed a pencil from Co-worker B without asking and felt guilty about it.\n2. Co-worker B reassured Co-worker A that it was not a big deal and even suggested making it up by buying coffee next time.\n3. Co-worker B appreciates Co-worker A's positivity and friendship.\n4. Co-worker B is supportive and willing to help in any way.\n5. Co-worker A is alive but will need time to adjust to their new way of life.\n6. Co-worker A believes in surrounding oneself with positive energy and uplifting people.",
        "speaker": "Co-workers A",
        "raw_prediction": "I appreciate your suggestion, Co-worker B. I think seeking help is a good idea. Talking to someone might give me a new perspective on how to handle these intense emotions. Thank you for being supportive and understanding.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t6",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n3. Co-worker A expressed gratitude for the horse that Co-worker B gave them, mentioning it brings joy and happiness.\n4. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n5. Co-worker B agrees that their skill sets complement each other well.\n6. Co-worker A values their health to continue working at their best.",
        "speaker": "Co-workers A",
        "raw_prediction": "We make a great team, and supporting each other is what it's all about. Remember, we work best when we look out for each other.",
        "previous_summary": null
    },
    {
        "utter_id": "e4-s5-t8",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n3. Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\n4. Co-worker B is supportive and encourages Co-worker A to prioritize their health.\n5. Co-worker B agrees that their skill sets complement each other well.\n6. Co-workers A and B have a positive and optimistic attitude towards their future collaboration.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad to hear that you're still excited about it! I've been thinking about it a lot too, and I truly believe our collaboration will be something special. Let's make sure to prioritize our health and well-being as we dive into this project together.",
        "previous_summary": "Co-worker A wants to become business partners with Co-worker B in the future.\nCo-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\nBoth co-workers believe they have the potential to create something great together.\nCo-worker A feels motivated about the future and is excited to work with Co-worker B.\nCo-worker B agrees that their skill sets complement each other well.\nBoth co-workers are looking forward to starting their partnership and are open to seeking extra help if needed.\nCo-workers A and B have a positive and optimistic attitude towards their future collaboration."
    },
    {
        "utter_id": "e4-s5-t11",
        "current_dialogue": "Co-workers A: Hey, how's your workload today?\nCo-workers B: It's pretty heavy, but I'm managing.\nCo-workers A: Do you need any help? I don't want you to get overwhelmed.\nCo-workers B: That's really nice of you, but I don't want to burden you with my work.\nCo-workers A: It's not a burden if it's something I can do to support you. Plus, helping you out makes me feel good too.\nCo-workers B: You're right, thank you. You always go above and beyond to help me out.\nCo-workers A: That's what co-workers are for. We're a team and we need to support each other.\nCo-workers B: Speaking of teamwork, remember when you showed me your plans for the future a few months ago? I'm still excited about the idea of working on a project together.\nCo-workers A: Me too! I think we would make a great business partnership.\nCo-workers B: Definitely. It's great to have someone I can trust and rely on in both work and personal matters.\nCo-workers A: I agree. We have a good working dynamic and I'm happy to help out whenever I can.",
        "memory_text": "1. Co-worker B offers help and support to Co-worker A.\n2. Co-worker B is impressed with Co-worker A's well-thought-out plans for their partnership.\n3. Co-worker A feels motivated about the future and is excited to work with Co-worker B.\n4. Co-worker B agrees that their skill sets complement each other well.\n5. Co-workers A and B have a positive and optimistic attitude towards their future collaboration.\n6. Co-worker B is supportive and encourages Co-worker A to prioritize their health.",
        "speaker": "Co-workers B",
        "raw_prediction": "I appreciate that, and I value your support. Remember, though, it's important to prioritize your health too. Let's make sure we take care of ourselves while we work towards our goals together.",
        "previous_summary": null
    },
    {
        "utter_id": "e5-s5-t8",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.",
        "memory_text": "1. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\n2. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\n3. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.\n4. Both Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\n5. Classmates A and B are interested in biology and studying cells.\n6. Classmate B admires Classmate A's dedication and believes they have a knack for science.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm sorry, I let my emotions get the best of me. I overreacted without knowing the full story. Can we talk this out and clear up any misunderstandings?",
        "previous_summary": "Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\nClassmates A has developed a crush on Classmates B, which Classmates B finds flattering.\nBoth Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\nBoth Classmates A and B enjoy talking to each other and consider themselves great study partners."
    },
    {
        "utter_id": "e5-s5-t9",
        "current_dialogue": "Classmates A: , I need to talk to you about something important.\nClassmates B: Sure, what's on your mind?\nClassmates A: I know about your affair with that other woman.\nClassmates B: What are you talking about? I don't have an affair with anyone.\nClassmates A: Don't lie to me! I saw you together at the restaurant last week.\nClassmates B: That was just a business meeting. We were discussing a potential collaboration on a music project.\nClassmates A: I don't believe you. You're just trying to cover it up. I'm going to tell everyone and ruin your career.\nClassmates B: Why are you doing this? I thought we were friends.\nClassmates A: I can't stand that you're a better singer than I am. I'm envious of your talent and success.",
        "memory_text": "1. Classmates A and B have a good relationship, with Classmates A expressing admiration for Classmates B's intelligence and sense of humor.\n2. Both Classmates A and B enjoy talking to each other and consider themselves great study partners.\n3. Classmates A suggests grabbing lunch together, showing an interest in spending more time with Classmates B.\n4. Both Classmates A and B are open to exploring a romantic connection and are looking forward to getting to know each other better.\n5. Classmate B admires Classmate A's dedication and believes they have a knack for science.\n6. Classmates A and B are interested in biology and studying cells.",
        "speaker": "Classmates B",
        "raw_prediction": "I had no idea you felt that way. I wish you had talked to me about this sooner. Let's figure this out together.",
        "previous_summary": null
    },
    {
        "utter_id": "e6-s5-t3",
        "current_dialogue": "Neighbors A: Hey, can you keep a secret?\nNeighbors B: Of course, what's up?\nNeighbors A: I can't be seen because I am hiding from my mom behind the door.",
        "memory_text": "1. Neighbors B is excited and supportive of Neighbors A's new ability.\n2. Neighbors B is interested in Neighbors A's cooking and asks about the vegetables and quinoa preparation.\n3. Neighbors A and B are discussing the idea of having telekinetic abilities.\n4. Neighbors B expresses concerns about accidentally moving objects and causing unintended consequences.\n5. Neighbors A is overwhelmed but also excited about their new ability.\n6. Neighbors A and B share a dream of developing telekinetic abilities together in the future.",
        "speaker": "Neighbors B",
        "raw_prediction": "Don't worry, your secret is safe with me! Is everything okay?",
        "previous_summary": null
    },
    {
        "utter_id": "e8-s5-t1",
        "current_dialogue": "Neighbors A: Hey neighbor, have you noticed how strong I've become?",
        "memory_text": "1. Neighbors B appreciates Neighbors A's handy skills.\n2. Neighbor A noticed some wood near their backyard and asked Neighbor B if they had seen it too.\n3. Neighbors A values double-checking before leaving the house.\n4. Neighbors A is good at fixing things, particularly electronics.\n5. Neighbors A and B are observing wood that appears to be freshly cut from a tree.\n6. Neighbors A apologized to Neighbors B for their behavior and admitted to being wrong.",
        "speaker": "Neighbors B",
        "raw_prediction": "Yeah, I did notice! It must be all that heavy lifting you've been doing while working on those electronics.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t3",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.",
        "memory_text": "1. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n2. Classmates B is supportive and encourages Classmates A in their business venture.\n3. Classmate B offers to support and potentially collaborate with Classmate A in the future.\n4. Classmates A is willing to work hard and learn the necessary strategies for business success.\n5. Classmates A wants to get to know Classmates B better and become friends.\n6. Classmates A has had a business idea for a while and is now taking steps to make it a reality.",
        "speaker": "Classmates B",
        "raw_prediction": "That's wonderful that you found something you're passionate about from such an early age. It's always amazing when you can turn a hobby or family tradition into a successful business venture. If you ever need any advice or support as you grow your carpentry business, I'm here for you.",
        "previous_summary": null
    },
    {
        "utter_id": "e9-s5-t9",
        "current_dialogue": "Classmates A: I really enjoy being a carpenter. It's a very fulfilling job.\nClassmates B: That's great to hear! How did you get into carpentry?\nClassmates A: My dad was a carpenter, so I grew up around it. I started by helping him out when I was young, and then I began to really enjoy it myself.\nClassmates B: That's awesome that you were able to learn from your dad and turn it into a career. Have you done any big projects lately?\nClassmates A: Yeah, I just finished building a custom bookshelf for a client. It was a challenging project, but I'm really happy with how it turned out.\nClassmates B: That's impressive! You must have a lot of skill to be able to build something like that.\nClassmates A: Thanks! It definitely takes a lot of practice and attention to detail. But I find it really rewarding to see a finished product that I created with my own two hands.\nClassmates B: I can imagine. It must also be nice to have a steady income from your work.\nClassmates A: Absolutely. It's a good feeling to be able to support myself and my family doing something that I enjoy. Plus, I never know what exciting project might come my way next.",
        "memory_text": "1. Classmates B is supportive and encourages Classmates A in their business venture.\n2. Classmates A is attending a seminar on starting a business and is excited about applying that knowledge to future plans.\n3. Classmates A has had a business idea for a while and is now taking steps to make it a reality.\n4. Classmate B offers to support and potentially collaborate with Classmate A in the future.\n5. Classmates B mentions the importance of seeking advice from mentors and staying motivated and passionate about the business idea.\n6. Classmates A is willing to work hard and learn the necessary strategies for business success.",
        "speaker": "Classmates B",
        "raw_prediction": "That's the beauty of being in a creative field like carpentry - every project is unique and presents new challenges. It's clear that you have a real passion for what you do, and that's such a valuable asset in any business. Keep up the great work, and I have no doubt you'll continue to succeed!",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t7",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.",
        "memory_text": "1. Co-worker A and Co-worker B excel at working well with others and resolving issues.\n2. Both Co-worker A and Co-worker B value communication and understanding in relationships.\n3. Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.\n4. Co-worker A strives to do their best in their work.\n5. Co-worker B appreciates Co-worker A's competence and effort in their work.\n6. Both Co-worker A and Co-worker B enjoy taking moments to connect with each other and find these moments make work more enjoyable.",
        "speaker": "Co-workers B",
        "raw_prediction": "I appreciate your willingness to consider different perspectives. It's all about finding a balance and working together as a team to achieve the best outcome for everyone involved.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t8",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.",
        "memory_text": "1. Co-worker A and Co-worker B excel at working well with others and resolving issues.\n2. Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.\n3. Both Co-worker A and Co-worker B value communication and understanding in relationships.\n4. Co-worker A strives to do their best in their work.\n5. Co-worker B appreciates Co-worker A's competence and effort in their work.\n6. Both Co-worker A and Co-worker B enjoy taking moments to connect with each other and find these moments make work more enjoyable.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thanks for the reminder. I appreciate your perspective and I'll keep that in mind moving forward. Let's continue working together to make our team even stronger.",
        "previous_summary": null
    },
    {
        "utter_id": "e10-s5-t14",
        "current_dialogue": "Co-workers A: I'm the boss!\nCo-workers B: Yeah, we know. You don't have to remind us every five minutes.\nCo-workers A: I just want everything to go smoothly and according to plan.\nCo-workers B: I understand that, but it doesn't always have to be your way or the highway.\nCo-workers A: Well, I just think that my way is usually the best way.\nCo-workers B: And sometimes it is, but we all have different ideas and perspectives to bring to the table.\nCo-workers A: Okay, I see your point. I'll try to be more open-minded in the future.\nCo-workers B: That's all we can ask for. Remember that we're a team and we all have something valuable to contribute.\nCo-workers A: You're right. I'm glad we can have these conversations and work towards being better together.\nCo-workers B: Me too. Speaking of working together, do you remember when you gave me back my watch a few months ago? That meant a lot to me.\nCo-workers A: Of course I remember! I'm happy we're friends again.\nCo-workers B: Me too. And do you still have that baby doll and rattle you bought a couple of years ago?\nCo-workers A: Yes, actually! I gave them to my niece and she loves them.\nCo-workers B: That's awesome. And I still remember when you scratched my neck and helped me relax. Sometimes I still need that kind of release.",
        "memory_text": "1. Both Co-worker A and Co-worker B enjoy taking moments to connect with each other and find these moments make work more enjoyable.\n2. Co-worker A returned a watch to Co-worker B, making them happy again.\n3. Co-worker B acknowledges Co-worker A's good work ethic and the positive impact it has on the workplace.\n4. Co-worker A has a history of helping out Co-worker B and values their friendship.\n5. Co-worker A and Co-worker B excel at working well with others and resolving issues.\n6. Co-worker A returned Co-worker B's watch a few years ago, leading to the rekindling of their friendship.",
        "speaker": "Co-workers A",
        "raw_prediction": "I'm glad I could help you relax. Just let me know anytime you need a neck scratch or some relaxation techniques. It's all about supporting each other and keeping the positive energy flowing in the workplace.",
        "previous_summary": "Co-worker A is giving Co-worker B a massage to help them relax.\nCo-worker B finds the massage from Co-worker A relaxing and helps them feel at peace."
    },
    {
        "utter_id": "e11-s5-t7",
        "current_dialogue": "Neighbors A: I just visited this amazing new city. The architecture was stunning, the streets were so clean, and the people were very friendly.\nNeighbors B: Sounds like you had a great time! Which city did you visit?\nNeighbors A: It was Chicago. I had never been before, but it exceeded all my expectations.\nNeighbors B: I bet it was a nice change of scenery from our neighborhood.\nNeighbors A: Definitely. But you know, it's interesting how much our neighborhood has grown on me over the years. I remember when I first moved here, I was so unsure about it.\nNeighbors B: Yeah, I remember. But you stayed because you wanted to be here.\nNeighbors A: That's right. And since then, I've made so many great memories here. It's become my home.",
        "memory_text": "1. Neighbors A enjoys living in the neighborhood, feeling comfortable and safe, and has made good friends, including Neighbors B.\n2. Neighbors A is excited to explore the neighborhood and make new friends.\n3. Neighbors B has been living in the neighborhood for some time and is supportive of Neighbors A.\n4. Neighbors A just moved to a new neighborhood and is getting to know the area.\n5. Neighbors A and B live in the same place and find comfort in it.\n6. Neighbors A appreciates having friendly faces around and hopes to make new friends soon.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm glad to hear that our neighborhood has become your home. It's always wonderful to see how much you've grown to love it here. And I have to say, having you as my neighbor has definitely made this place feel even more special.",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t1",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.",
        "memory_text": "1. Classmate B is interested in attending a new technology conference next month.\n2. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n3. Classmates B noticed Classmates A's improvement and acknowledged their hard work.\n4. Classmates A had a moment of frustration in the past but has learned to channel that energy into studies.\n5. Classmates A's grades are looking good according to their teacher.\n6. Classmate B is working on finishing a history project.",
        "speaker": "Classmates A",
        "raw_prediction": "That's great to hear! What was the talk about?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t3",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.",
        "memory_text": "1. Classmates B noticed Classmates A's improvement and acknowledged their hard work.\n2. Classmate B is working on finishing a history project.\n3. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n4. Classmate B is interested in attending a new technology conference next month.\n5. Classmate A shares interesting information about the spinning jenny and its impact on the textile industry.\n6. Classmates A's grades are looking good according to their teacher.",
        "speaker": "Classmates B",
        "raw_prediction": "Wow, that sounds fascinating! The engineering and cultural aspects of the pyramids must have been so interesting to learn about. Do you think you'll ever visit Egypt to see them in person?",
        "previous_summary": null
    },
    {
        "utter_id": "e12-s5-t12",
        "current_dialogue": "Classmates A:  I attended a really interesting talk today.\nClassmates B:  That sounds great. What was the talk about?\nClassmates A: It was about the history of the pyramids in Egypt. I learned so much about their construction and the cultural significance they held.\nClassmates B: Wow, that does sound interesting. Did you take any notes?\nClassmates A: Yes, I took lots of notes. I'm excited to study this topic more on my own time.\nClassmates B: That's awesome. It's great to see your enthusiasm for learning.\nClassmates A: Thanks. I've always been passionate about learning new things. Remember when we talked about how determined I was to get into college?\nClassmates B: Yeah, I remember. You were always studying and taking extra classes.\nClassmates A: And now, after all that hard work, I am actually in college. It just goes to show that with dedication, you can achieve your goals.\nClassmates B: That's so inspiring. It also reminds me of when you wore your pajamas to school. You were always doing something different and unique.\nClassmates A: Haha, yeah, I remember that. But hey, being a little weird sometimes adds some fun and excitement to life. Speaking of exciting things, I met the girl of my dreams a couple of years ago at a party.\nClassmates B: Aww, that's fantastic. How has everything been going with her?",
        "memory_text": "1. Classmates A met the girl of their dreams at a party and have been texting her nonstop.\n2. Classmates B recalls a funny moment from high school involving Classmates A wearing pajamas to school.\n3. Classmates A feels like everything is falling into place and is excited to see where the new relationship goes.\n4. Classmates B is supportive of Classmates A's new relationship and believes they found someone who makes them happy.\n5. Classmates A is determined to make the relationship work, similar to their determination to get into college.\n6. Classmates A is not afraid to be themselves and embraces their quirks, which their girlfriend appreciates.",
        "speaker": "Classmates A",
        "raw_prediction": "It's been amazing. She really appreciates all my quirks and encourages me to be myself. It feels like everything is falling into place, and I can't wait to see where this new relationship goes.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t3",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.",
        "memory_text": "1. Mentee has a history of substance abuse but has been sober for a year.\n2. Mentor is proud of Mentee for making positive changes and taking control of their life.\n3. Mentee values living in the moment and staying focused on their sobriety and goals.\n4. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n5. The Mentor advises the Mentee to be gentle with themselves when they slip back into old patterns.\n6. The Mentee is dedicated to their sobriety and believes incorporating yoga into their routine will benefit their mental and physical health.",
        "speaker": "Mentor",
        "raw_prediction": "It's incredible to see how far you've come, Mentee. Your dedication to sobriety is truly inspiring. Keep focusing on the positive changes you've made, and remember to be gentle with yourself as you continue on this journey.",
        "previous_summary": null
    },
    {
        "utter_id": "e13-s5-t9",
        "current_dialogue": "Mentee: Thank you for finding my glasses for me, Mentor. I always seem to misplace them.\nMentor: Not a problem, Mentee. I'm glad I could help. \nMentee: This actually reminds me of when I was struggling with substance abuse. I would often lose things or forget where I put things because of my drinking. It's amazing how much clearer my mind is now that I'm sober.\nMentor: That's a great observation, Mentee. Sobriety can definitely improve your cognitive abilities and overall wellbeing. It's amazing how much substance abuse can hold us back in life.\nMentee: Yeah, it's definitely a difficult journey, but I'm grateful for the support systems I have in place. Like you, Mentor. Your experience and guidance have been invaluable to me.\nMentor: I'm happy to be there for you, Mentee. It's been great seeing you grow and develop over the years.\nMentee: Speaking of growth, I've been really trying to live in the moment lately. It's been bringing me so much joy and fulfillment, and I feel more connected to the world around me.\nMentor: That's fantastic, Mentee. Being present and mindful can do wonders for your mental health and overall satisfaction with life. Keep it up!\nMentee: I definitely will, Mentor. And thanks again for finding my glasses. Your help means a lot to me. ",
        "memory_text": "1. Mentor is proud of Mentee for making positive changes and taking control of their life.\n2. Mentor acknowledges Mentee's achievements and provides ongoing support and guidance.\n3. Mentee values living in the moment and staying focused on their sobriety and goals.\n4. Mentee has a history of substance abuse but has been sober for a year.\n5. The Mentor encourages the Mentee to prioritize self-care and explore new ways to stay healthy and happy.\n6. Mentor is willing to share their knowledge with Mentee and help them achieve their goals.",
        "speaker": "Mentor",
        "raw_prediction": "You're very welcome, Mentee. I'm always here to support you in any way I can. Just remember to keep taking care of yourself and focusing on your sobriety and goals. I'm proud of the progress you've made.",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t1",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.",
        "memory_text": "1. The Child is caring and offers help to the Parent.\n2. The Parent is working and feels tired after a long day.\n3. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n4. The Parent expresses a desire to be a better role model for the Child and their siblings.\n5. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n6. The Child offers to bring water or make soup for the Parent while they are resting.",
        "speaker": "Parent",
        "raw_prediction": "That's great to hear, Parent! Is there anything I can do to help with your new project?",
        "previous_summary": null
    },
    {
        "utter_id": "e14-s5-t11",
        "current_dialogue": "Parent: Child, I have a new project that I've been working on.\nChild: What is it, Parent?\nParent: I created a website where I post advertisements, and people can pay to see them.\nChild: Oh, that's interesting. How does it work?\nParent: Well, I create the ads myself, and then I post them on my website. People who want to view the ads can pay a small fee, and then they can see them.\nChild: Do you think people will pay to see your ads?\nParent: I don't know yet, but I hope so. I've put a lot of effort into creating some eye-catching ads.\nChild: That sounds cool, but why do you want to make money from ads?\nParent: Well, I want to have some extra income coming in. Plus, I enjoy being creative and making things, so this is a great way for me to combine those passions.\nChild: I see. Well, I hope it works out for you, Parent.\nParent: Thanks, Child. And who knows, maybe someday you can help me create some ads for the website.",
        "memory_text": "1. The Child supports the idea of the Parent adopting more children and hopes for a happy home for them.\n2. The Child is caring and offers help to the Parent.\n3. The parent and child have open communication about various topics, including a past accident and the parent's willingness to contribute more to household chores.\n4. The Parent is working and feels tired after a long day.\n5. The Parent expresses a desire to be a better role model for the Child and their siblings.\n6. The Parent expresses a desire to adopt more children in the future.",
        "speaker": "Child",
        "raw_prediction": "That would be fun, Parent! I'd love to help you out with the ads. Just let me know how I can assist, and we can make some creative content together for your website.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t2",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?",
        "memory_text": "1. Classmates A ended up taking Classmates B's advice and found success with it.\n2. Classmates A was initially hesitant about following Classmates B's advice.\n3. Classmates B gave advice to Classmates A in the past that paid off.\n4. Both Classmates A and B value the importance of trying new things and taking risks for personal development.\n5. Classmates B expresses a desire to see Classmates A happy and successful in life.\n6. Classmates B has been working and traveling since high school.",
        "speaker": "Classmates A",
        "raw_prediction": "Well, I remember you mentioning how trying new things can lead to unexpected opportunities, so I decided to give it a shot. And you know what? It's been an amazing journey so far. Thanks for the encouragement!",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t3",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.",
        "memory_text": "1. Classmates A ended up taking Classmates B's advice and found success with it.\n2. Classmates A was initially hesitant about following Classmates B's advice.\n3. Classmates B expresses a desire to see Classmates A happy and successful in life.\n4. Both Classmates A and B value the importance of trying new things and taking risks for personal development.\n5. Classmates B gave advice to Classmates A in the past that paid off.\n6. Classmates B has been working and traveling since high school.",
        "speaker": "Classmates B",
        "raw_prediction": "That's amazing to hear! I remember when you were hesitant about taking that leap, but I'm so proud to see you pursuing your passion now. Your dedication to promoting under-the-radar artists is truly inspiring.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t5",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.",
        "memory_text": "1. Classmates A ended up taking Classmates B's advice and found success with it.\n2. Both Classmates A and B value the importance of trying new things and taking risks for personal development.\n3. Classmates A was initially hesitant about following Classmates B's advice.\n4. Classmates B expresses a desire to see Classmates A happy and successful in life.\n5. Classmates B gave advice to Classmates A in the past that paid off.\n6. Classmate B emphasizes the importance of positively impacting others while living a fulfilling life.",
        "speaker": "Classmates B",
        "raw_prediction": "I'm so proud of you for taking that leap! Your blog is not only showcasing your passion but also positively impacting those under-the-radar artists. It's wonderful to see you thriving and making a difference in the creative community.",
        "previous_summary": null
    },
    {
        "utter_id": "e15-s5-t6",
        "current_dialogue": "Classmates A: Hey, have you checked out my new blog? It's all about promoting under-the-radar artists.\nClassmates B: I haven't had a chance to yet, but that sounds really cool! What inspired you to start it?\nClassmates A: Well, I've always had a passion for the arts, but I was too afraid to pursue it. I finally realized that it's what I really love, and I wanted to share that love with others.\nClassmates B: That's amazing. It takes a lot of courage to pursue your passions like that.\nClassmates A: Yeah, it was scary at first, but the response has been really positive. I'm so glad I finally decided to take the leap.\nClassmates B: I'm proud of you. It's always great to see someone following their dreams.",
        "memory_text": "1. Classmates A ended up taking Classmates B's advice and found success with it.\n2. Both Classmates A and B value the importance of trying new things and taking risks for personal development.\n3. Classmates B expresses a desire to see Classmates A happy and successful in life.\n4. Classmates A was initially hesitant about following Classmates B's advice.\n5. Classmates B gave advice to Classmates A in the past that paid off.\n6. Classmate B emphasizes the importance of positively impacting others while living a fulfilling life.",
        "speaker": "Classmates A",
        "raw_prediction": "Thanks! Your encouragement and advice really helped push me in the right direction. I hope I can make a positive impact like you always talk about.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t10",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?",
        "memory_text": "1. Co-worker A used to fantasize about being a great leader and being respected and admired.\n2. Co-worker A has grown and become more confident over the years.\n3. Co-worker A has fantasies of being a great leader.\n4. Co-worker B acknowledges and supports Co-worker A's growth and progress.\n5. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n6. Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.",
        "speaker": "Co-workers A",
        "raw_prediction": "Absolutely, we did. It's great to see how far we've come since then. Your support and encouragement have really helped me grow into this new role.",
        "previous_summary": null
    },
    {
        "utter_id": "e16-s5-t12",
        "current_dialogue": "Co-workers A: Hey, I just wanted to share some exciting news with you. I was promoted to product manager!\nCo-workers B: Really? Congrats! That's a big step up from your previous role.\nCo-workers A: Yeah, I'm feeling a mix of excitement and nervousness. It's a lot of responsibility, but I'm ready for the challenge.\nCo-workers B: I have no doubt that you'll do great. You've always been a strong leader and have a great eye for detail.\nCo-workers A: Thanks, that means a lot. I'm looking forward to working with the design team and coming up with some innovative new products.\nCo-workers B: Speaking of new products, remember when you used to fantasize about being a great leader?\nCo-workers A: Ha, yeah. That seems like ages ago.\nCo-workers B: Well, now you can finally take on that leadership role and make your dreams a reality.\nCo-workers A: That's true. It's amazing how life works out sometimes. But it hasn't always been smooth sailing. Remember when I was really stressed about you not liking me?\nCo-workers B: Yeah, I remember. But we worked through it, didn't we?\nCo-workers A: We definitely did. And it taught me to just take things one step at a time, like I am with this new role.\nCo-workers B: Exactly, and I'm sure you'll apply that same mentality to your training as well. I remember you were really dedicated to it a couple of years ago.",
        "memory_text": "1. Co-worker A used to fantasize about being a great leader and being respected and admired.\n2. Co-worker A considers taking on more responsibility at work as a start towards being a leader.\n3. Co-worker A has fantasies of being a great leader.\n4. Co-worker A has grown and become more confident over the years.\n5. Co-worker B acknowledges and supports Co-worker A's growth and progress.\n6. Co-worker A has aspirations of being a great leader and emphasizes the importance of communication.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yeah, that dedication really paid off. It's all about continuous improvement and growth. I'm excited to see where this new leadership role takes me and how I can contribute to the team.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t1",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n3. Neighbors A has developed romantic feelings for Neighbors B.\n4. Neighbor A went to the park with their son, who had a great time.\n5. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n6. Neighbors A ordered pizza for Neighbors B in the past.",
        "speaker": "Neighbors B",
        "raw_prediction": "That's great to hear! I'm glad you found something that works for you. Remember, I'm always here if you need any more relaxation tips or just someone to talk to.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t6",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. ",
        "memory_text": "1. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n2. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n3. Neighbors B values their friendship with Neighbors A.\n4. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n5. Neighbors A has developed romantic feelings for Neighbors B.\n6. Both neighbors enjoy discovering new things in their neighborhood and spending time with their children.",
        "speaker": "Neighbors A",
        "raw_prediction": "Absolutely, having this breathing exercise as a tool has been a game-changer for me. It's amazing how something so simple can make such a big difference in how I feel.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t12",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.\nNeighbors B: It's always nice to find a good outdoor space like that. Have you been back recently?",
        "memory_text": "1. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n2. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n3. Neighbors B values their friendship with Neighbors A.\n4. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n5. Neighbors A has developed romantic feelings for Neighbors B.\n6. Neighbor A reminisces about simpler times and expresses missing them.",
        "speaker": "Neighbors A",
        "raw_prediction": "I haven't been back in a while, but I've been thinking about it a lot lately. It was such a peaceful place, and I miss those simpler times we spent there together.",
        "previous_summary": null
    },
    {
        "utter_id": "e17-s5-t13",
        "current_dialogue": "Neighbors A: I just tried this breathing exercise and it really helped me relax.\nNeighbors B: What kind of breathing exercise?\nNeighbors A: It's just a simple one, where you inhale for four seconds, hold your breath for seven seconds, and then exhale for eight seconds. I've been doing it every day for the past week and it's made such a difference.\nNeighbors B: That's really interesting. I've heard that breathing exercises can be really helpful for reducing stress and anxiety.\nNeighbors A: Yes, it definitely has helped me with that. Plus, it's something that I can easily do anywhere, whether I'm at home or out running errands.\nNeighbors B: That's great. It's always good to have a simple tool like that to help manage stress. \nNeighbors A: Speaking of managing stress, remember a few years ago when I pushed your shoulder because I wanted you to accept me?\nNeighbors B: Oh yeah, I do remember that. That was a stressful time for both of us.\nNeighbors A: It definitely was. But I'm so glad that we've been able to move past that and have a good neighborly relationship now.\nNeighbors B: Me too. And remember when you found that great park a few years ago?\nNeighbors A: Yes, I loved that park! It was such a fun place to hang out and play games.\nNeighbors B: It's always nice to find a good outdoor space like that. Have you been back recently?\nNeighbors A: Not in a little while, but maybe we should plan a visit soon. ",
        "memory_text": "1. Neighbor A and Neighbor B found a park together a couple of years ago and enjoyed playing frisbee and having a picnic.\n2. Neighbor B reassures Neighbor A about past embarrassing incidents and emphasizes their current friendship.\n3. Neighbors B values their friendship with Neighbors A.\n4. Neighbors A is willing to take things slow in their relationship with Neighbors B.\n5. Both neighbors enjoy discovering new things in their neighborhood and spending time with their children.\n6. Neighbors A has developed romantic feelings for Neighbors B.",
        "speaker": "Neighbors B",
        "raw_prediction": "That sounds like a wonderful idea. I'd love to go back to that park with you and maybe even bring the kids along this time. It would be a great way to spend some quality time together and enjoy the outdoors.",
        "previous_summary": null
    },
    {
        "utter_id": "e19-s5-t3",
        "current_dialogue": "Neighbors A: I'm sorry you had to hear me swear like that. I shouldn't have lost my temper like that.\nNeighbors B: It's okay, I understand how frustrating things can be sometimes. What got you so upset?\nNeighbors A: It was just something that happened at work. My boss was being unreasonable and I couldn't take it anymore.",
        "memory_text": "1. Neighbors B is supportive and understanding of Neighbors A's mistake.\n2. Neighbors A values appreciation and expresses gratitude for help received.\n3. Neighbors A is detail-oriented and strives for perfection.\n4. Neighbors B values reciprocity and acknowledges the mutual help between them as neighbors.\n5. Neighbors A wants to rearrange their living room and Neighbors B has experience with rearranging furniture.\n6. Neighbors A and B have a positive and helpful relationship as neighbors.",
        "speaker": "Neighbors B",
        "raw_prediction": "I'm sorry to hear that you had a tough day at work. Remember, everyone has those moments. If you ever need to talk more about it, I'm here to listen.",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t9",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.",
        "memory_text": "1. Co-worker A and Co-worker B shared happy memories from their time working together.\n2. Co-worker B was surprised when Co-worker A found out they were married.\n3. Co-worker A has a talent for solving puzzles and mysteries.\n4. Co-worker A and Co-worker B used to work together at a clothing store.\n5. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n6. Co-worker A and Co-worker B both plan to treat themselves to a nice dinner with their paychecks.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's always wonderful to share your talents with others. Maybe we should plan a karaoke night soon, you could pick all the songs!",
        "previous_summary": null
    },
    {
        "utter_id": "e20-s5-t10",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.",
        "memory_text": "1. Co-worker A and Co-worker B shared happy memories from their time working together.\n2. Co-worker B was surprised when Co-worker A found out they were married.\n3. Co-worker A has a talent for solving puzzles and mysteries.\n4. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n5. Co-worker A suggests celebrating their detective work with drinks after work.\n6. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.",
        "speaker": "Co-workers A",
        "raw_prediction": "Haha, thanks! I guess I have a knack for uncovering secrets, whether it's through singing or solving puzzles. Maybe we should combine our detective skills and find the hidden talent in everyone at the office!",
        "previous_summary": "Co-worker A is described as having \"Sherlock Holmes-like skills\" and enjoys solving mysteries.\nCo-worker A discovered that an employee was hiding clothes to sell on the side.\nCo-worker A enjoys solving puzzles and mysteries, even considering becoming a detective.\nCo-worker A has a talent for solving puzzles and mysteries."
    },
    {
        "utter_id": "e20-s5-t13",
        "current_dialogue": "Co-workers A: Hey, guess what? I sang a solo at church this past weekend!\nCo-workers B: That's awesome! I didn't know you sang.\nCo-workers A: Yeah, it's something I've always loved to do but haven't had the chance to do it in a while.\nCo-workers B: Well, it sounds like you did a great job. What did you sing?\nCo-workers A: I sang \"Amazing Grace\". It's always been one of my favorites.\nCo-workers B: That's such a beautiful song. You have a great voice.\nCo-workers A: Thank you! It was really nerve-wracking, but I'm glad I did it.\nCo-workers B: I'm sure the audience loved it. You've really got some talent.\nCo-workers A: Thanks again. It's just something I do for fun, but it's nice to know people enjoy it.\nCo-workers B: Definitely. It's great to have a hobby like that. Reminds me of when you uncovered that mystery a while back. You always seem to surprise us with your skills.\nCo-workers A: Haha, yeah. I do like a good challenge. Speaking of surprises, remember when I found out you were married? That was a shocker.\nCo-workers B: Oh gosh, yes. I forget sometimes that not everyone knows. But yeah, I've been married for a few years now.\nCo-workers A: Crazy how time flies. Like when we found out Ms. Singh was leaving our school. I still can't believe that was two years ago.",
        "memory_text": "1. Co-worker B was surprised when Co-worker A found out they were married.\n2. Co-worker A and Co-worker B shared happy memories from their time working together.\n3. Co-worker A is observant and did some research on social media to find out that Co-worker B is married.\n4. Co-worker A has a talent for solving puzzles and mysteries.\n5. Co-worker B is married and had a weekend where they went hiking and had dinner with friends.\n6. Co-worker A and Co-worker B used to work together at a clothing store.",
        "speaker": "Co-workers B",
        "raw_prediction": "Time really does fly, doesn't it? It feels like just yesterday we were all working together at the clothing store. Those were some fun times.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t1",
        "current_dialogue": "Husband: I hung up some more lights and candles today.",
        "memory_text": "1. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n2. The husband's faith has been strong lately, and he is involved in various church ministries.\n3. The husband feels happy and content being outside in the beautiful weather.\n4. The wife is glad to see the husband finding a sense of purpose and being happy.\n5. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n6. Both the husband and wife agree that it's the little things that add up and make life meaningful.",
        "speaker": "Wife",
        "raw_prediction": "That's great to hear! I love how cozy and inviting our home feels with all the lights and candles you've put up. It really adds a special touch to our evenings together.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t2",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. The wife is glad to see the husband finding a sense of purpose and being happy.\n3. The husband feels happy and content being outside in the beautiful weather.\n4. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n5. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n6. Husband values the supportive community of believers at church and appreciates having his wife by his side.",
        "speaker": "Husband",
        "raw_prediction": "I'm glad you appreciate it. It's the little things like that which make our home feel warm and inviting.",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t8",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. The wife is glad to see the husband finding a sense of purpose and being happy.\n3. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n4. The wife mentions that the husband had to run to catch the bus a couple of years ago.\n5. The husband enjoys being outside and loves the weather after being stuck indoors at work.\n6. The husband believes it's important to cherish meaningful connections in life, like the one he has with his friend.",
        "speaker": "Husband",
        "raw_prediction": "Absolutely, those little victories can really brighten our day. Just like how being outside in this beautiful weather after a long day indoors can lift your spirits. It's all about appreciating the small joys in life, isn't it?",
        "previous_summary": null
    },
    {
        "utter_id": "e21-s5-t10",
        "current_dialogue": "Husband: I hung up some more lights and candles today.\nWife: That's lovely! I always feel so cozy and comfortable when you do that.\nHusband: I know, and I love making the apartment feel like a warm and welcoming space for you.\nWife: You always go above and beyond, dear.\nHusband: It's the little things that count, right?\nWife: Definitely. Speaking of little things, do you remember when you told me about catching the bus just in time a few months ago?\nHusband: Oh yes, I remember. I was so relieved I didn't have to wait in the cold for the next one.\nWife: It's amazing how small moments like that can make such a big difference in our day, isn't it?\nHusband: Absolutely. It's the small moments that make life worth living.\nWife: And speaking of living, you mentioned a while back how involved you are in the different ministries at church.",
        "memory_text": "1. Both the husband and wife agree that it's the little things that add up and make life meaningful.\n2. Husband values the supportive community of believers at church and appreciates having his wife by his side.\n3. The wife is glad to see the husband finding a sense of purpose and being happy.\n4. The husband feels supported by his wife in pursuing activities that make him happy outside of work and family life.\n5. The husband's faith has been strong lately, and he is involved in various church ministries.\n6. The husband believes it's important to cherish meaningful connections in life, like the one he has with his friend.",
        "speaker": "Husband",
        "raw_prediction": "Yes, I've found so much fulfillment in serving and connecting with our church community. It's been a blessing to have your support and encouragement in these endeavors.",
        "previous_summary": "Husband is grateful for his Christian upbringing and is passionate about his faith.\nHusband was baptized at eight years old and is involved in different ministries at church.\nWife is supportive of her husband's faith journey and values having a close relationship with him.\nHusband values the supportive community of believers at church and appreciates having his wife by his side.\nThe husband's faith has been strong lately, and he is involved in various church ministries."
    },
    {
        "utter_id": "e23-s5-t5",
        "current_dialogue": "Student: Whew! This hot sauce really makes my mouth burn.\nTeacher: Hot sauce can definitely make things spicy. Do you enjoy the sensation?\nStudent: It's a love-hate relationship. I enjoy the flavor, but sometimes it's too much to handle.\nTeacher: That's understandable. Did you know that some people build up a tolerance to spicy foods over time?\nStudent: Really? Maybe I should try to build up my tolerance then.",
        "memory_text": "1. The teacher and student have a positive and understanding relationship.\n2. The student mentioned feeling stressed lately, which may have led to the outburst.\n3. The teacher expressed understanding and encouraged the student to seek help when needed.\n4. The teacher advises the student on effective communication and problem-solving, emphasizing the importance of talking calmly and finding solutions together.\n5. The student once saved a kid from drowning and had a moment of yelling at the teacher in the past.\n6. The student felt rewarded by the experience and emphasized the importance of being aware of surroundings and acting quickly in emergencies.",
        "speaker": "Teacher",
        "raw_prediction": "That could be a fun challenge! Just remember to take it slow and listen to your body. It's all about finding the right balance between enjoyment and comfort. Who knows, maybe you'll become a spicy food aficionado in no time!",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t1",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.",
        "memory_text": "1. Both neighbors emphasize the importance of taking care of each other as neighbors.\n2. Neighbor A enjoys reading and sharing books with Neighbor B.\n3. Neighbors A offers to help Neighbors B with getting into a workout routine.\n4. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\n5. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n6. Neighbor A and Neighbor B went to a concert together in the past and had a great time.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's a great idea! It helps avoid any confusion in the future. By the way, I picked up a new book that I think you'll enjoy. Would you like to borrow it after you're done working out?",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t6",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.",
        "memory_text": "1. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n2. Both neighbors emphasize the importance of taking care of each other as neighbors.\n3. Neighbor A and Neighbor B went to a concert together in the past and had a great time.\n4. Neighbors A offers to help Neighbors B with getting into a workout routine.\n5. Neighbor A enjoys reading and sharing books with Neighbor B.\n6. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.",
        "speaker": "Neighbors A",
        "raw_prediction": "Great, I'm glad you think so. It's all about open communication and understanding between us as neighbors.",
        "previous_summary": null
    },
    {
        "utter_id": "e24-s5-t10",
        "current_dialogue": "Neighbors A: I marked the boundary line with a pen on the wall so that we can both be clear about where my property ends and your property begins.\nNeighbors B: Oh, okay. I didn't realize there was any confusion about that.\nNeighbors A: Well, I just wanted to make sure we're on the same page. I don't want any misunderstandings in the future.\nNeighbors B: I understand. Is there anything else we should do to make sure we're clear about this?\nNeighbors A: I don't think so, but if you have any other suggestions, I'm open to hearing them.\nNeighbors B: No, I think the line is a good idea. It's clear and simple.\nNeighbors A: Great. Hey, speaking of lines and boundaries, remember when we talked about my promotion at work? I had to set some clear boundaries with my team about what I expected from them.\nNeighbors B: Yeah, I remember. How did that go?\nNeighbors A: It was tough at first, but eventually, everyone respected the boundaries I set and our team was more productive because of it.\nNeighbors B: That's great to hear. It's important to set boundaries and stick to them if you want to be successful in any area of your life.",
        "memory_text": "1. Neighbors A believes in setting goals, developing a positive attitude, and taking action for personal development and career advancement.\n2. Neighbors B was read to from a book about personal development by Neighbors A, which had a positive impact on Neighbors A's career growth.\n3. Neighbors B offers to be more supportive and check in on Neighbors A more often.\n4. Both neighbors emphasize the importance of taking care of each other as neighbors.\n5. Neighbor A and Neighbor B went to a concert together in the past and had a great time.\n6. Neighbors A offers to help Neighbors B with getting into a workout routine.",
        "speaker": "Neighbors A",
        "raw_prediction": "Absolutely, setting boundaries is crucial for personal and professional growth. It's all about maintaining a healthy balance and ensuring everyone is on the same page. I'm glad it worked out well with my team.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t1",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.",
        "memory_text": "1. Classmate B feels relieved that they can still be friends with Classmate A.\n2. Classmates B complimented Classmates A on their suit and brought up a past conversation about feelings.\n3. Classmate A has been hiding their feelings for Classmate B and finally confesses to being in love with them.\n4. Classmates A values their friendship with Classmates B and looks forward to wearing a black suit to a wedding reception.\n5. Classmates A confessed their love for Classmates B, who does not feel the same way.\n6. Classmates A has been busy with work and hanging out with friends, looking forward to the wedding as a fun night out.",
        "speaker": "Classmates B",
        "raw_prediction": "I couldn't agree more. It's amazing to see how we've all grown together over the years. And by the way, that black suit you mentioned wearing to the wedding reception? I'm sure you'll look stunning in it.",
        "previous_summary": null
    },
    {
        "utter_id": "e25-s5-t6",
        "current_dialogue": "Classmates A:  I can't believe how honored I am to be part of our class. I feel like we have something special going on here.\nClassmates B:  You're right. Our class definitely has a unique energy about it. What do you think sets us apart from other classes?\nClassmates A:  I think it's our sense of community. We all support each other and work together to achieve our goals.\nClassmates B:  That's definitely a big factor. And I also think our class has a lot of diversity, which brings new perspectives and ideas to the table.\nClassmates A:  Yes, absolutely. I love hearing everyone's different viewpoints and experiences. It really helps us all grow and learn.\nClassmates B:  And it's not just in the classroom, but also in extracurricular activities and events. We always have a strong turnout and participation.",
        "memory_text": "1. Classmates B complimented Classmates A on their suit and brought up a past conversation about feelings.\n2. Classmate B feels relieved that they can still be friends with Classmate A.\n3. Classmates A values their friendship with Classmates B and looks forward to wearing a black suit to a wedding reception.\n4. Classmates B enjoys people watching at the mall.\n5. Classmate A has been hiding their feelings for Classmate B and finally confesses to being in love with them.\n6. Classmate A is disappointed when Classmate B does not feel the same way.",
        "speaker": "Classmates A",
        "raw_prediction": "I completely agree. It's so amazing to see how involved everyone is outside of regular class hours. It really shows how much we all care about each other and our shared experiences.",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t3",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.",
        "memory_text": "1. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n2. Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\n3. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n4. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n5. Co-worker A has been successful in not being late to work for weeks.\n6. Co-worker B is supportive and encourages Co-worker A to give people a chance.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear! It's good to see you taking care of your errands efficiently. How did it feel to get everything sorted out without any delays?",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t7",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.",
        "memory_text": "1. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n2. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n3. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n4. Co-worker A went through a painful breakup and finds it hard to trust people.\n5. Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\n6. Co-worker A is trying to improve their punctuality and cut back on drinking.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's important to plan ahead and avoid situations like that in the future. How are you working on being more responsible with your late nights out and transportation?",
        "previous_summary": null
    },
    {
        "utter_id": "e26-s5-t9",
        "current_dialogue": "Co-workers A: Hey, did I tell you that I went to the post office today?\nCo-workers B: No, you didn't. What did you do there?\nCo-workers A: I paid for postage to send a package. It was a bit of a hassle, but I got it done.\nCo-workers B: That's good. I hate going to the post office. It's always so crowded.\nCo-workers A: Yeah, it was pretty busy today. But I needed to get this package sent out.\nCo-workers B: Speaking of packages, remember that time when you got stranded because you couldn't drive yourself home from a night out with friends?\nCo-workers A: Ugh, don't remind me. That was such a disaster.\nCo-workers B: It was definitely not one of your finest moments. But it's good to see that you're being responsible now and taking care of things like sending packages.\nCo-workers A: Thanks. I'm trying to be more responsible and reliable these days.",
        "memory_text": "1. Co-worker A is trying to be more responsible but still working on avoiding late nights out and expensive rides.\n2. Co-worker B is aware of Co-worker A's struggles with late nights out and expensive Uber rides.\n3. Co-worker B is concerned about Co-worker A's punctuality and drinking habits.\n4. Co-worker A is trying to improve their punctuality and cut back on drinking.\n5. Co-worker B advises Co-worker A to be more disciplined and plan ahead for their actions.\n6. Co-worker A has been successful in not being late to work for weeks.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's great to hear. It's all about making those small changes that add up to a big difference. Keep up the good work!",
        "previous_summary": null
    },
    {
        "utter_id": "e27-s5-t12",
        "current_dialogue": "Neighbors A: Hey neighbor, how's it going?\nNeighbors B: Not bad, thanks. How about you?\nNeighbors A: Oh, I'm doing alright. I was just thinking about the old days when I had my rock band.\nNeighbors B: Really? You had a band?\nNeighbors A: Yeah, we were called \"The Neighbors A Band.\" We used to play live shows around the city.\nNeighbors B: That's awesome! What kind of music did you guys play?\nNeighbors A: We played rock music, mostly covers but we also wrote some of our own songs.\nNeighbors B: Have you ever thought about starting the band again?\nNeighbors A: Not really, it was just a fun hobby back then. Plus, I don't think I have the same energy as I did when I was younger.\nNeighbors B: That's understandable. Do you still play any instruments?\nNeighbors A: I have a guitar but I haven't played it in a while. Maybe I should start practicing again.\nNeighbors B: Yeah, that sounds like a good idea. Maybe you could even teach me a thing or two.",
        "memory_text": "1. Neighbors B is familiar with Neighbors A's dog and looking forward to playing with it again.\n2. Neighbors A appreciated the support and friendship of Neighbors B.\n3. Neighbors B expresses concern for Neighbors A's back pain.\n4. Neighbor B is interested in chiropractic care after hearing about Neighbor A's positive experience.\n5. Neighbors A mentions having back pain and needing a break.\n6. Neighbor A offered to provide the name of their chiropractor to Neighbor B if they decide to go.",
        "speaker": "Neighbors A",
        "raw_prediction": "That could be fun! I'd be happy to show you some chords if you're interested. Who knows, maybe we can even jam together sometime.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t5",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.",
        "memory_text": "1. Co-worker A took over their family's business a few years ago and it has improved since then.\n2. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n3. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n4. Co-worker B finished a project and sent it to the manager for review.\n5. Both Co-worker A and Co-worker B value trust in their personal and professional relationships.\n6. Co-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.",
        "speaker": "Co-workers B",
        "raw_prediction": "It's great to hear that your family business experience has had such a positive impact on your work ethic. Your dedication and proactive approach definitely shine through in your work.",
        "previous_summary": null
    },
    {
        "utter_id": "e28-s5-t11",
        "current_dialogue": "Co-workers A: I just gave my boss the written report. I hope she finds it helpful.\nCo-workers B: Did you make sure to include all the necessary details?\nCo-workers A: Yes, I made sure to cover everything we talked about in the meeting. I even added some extra information that I thought could be useful.\nCo-workers B: That's smart thinking. It shows that you're invested in the company and want to make sure things run smoothly.\nCo-workers A: Thanks. I learned a lot from taking over the family business. It taught me the importance of being efficient and proactive.\nCo-workers B: I remember you telling me about that. It's amazing how much you've accomplished since then.\nCo-workers A: It's been a journey, but I'm glad to see the business flourishing. It gives me a sense of pride and accomplishment.\nCo-workers B: I can tell. You're always trying to find ways to improve things.\nCo-workers A: Exactly. That's why I felt a written report would be the best way to communicate the information to my boss. It saves time and ensures everything is organized.\nCo-workers B: Makes sense. I'm sure your boss will appreciate your efforts.\nCo-workers A: I hope so. I just want to make sure we're all on the same page and working towards our goals.",
        "memory_text": "1. Co-worker B appreciates the pen and thanks Co-worker A for the gesture.\n2. Co-worker A gave Co-worker B a pen as a thoughtful gesture.\n3. Co-worker A took over their family's business a few years ago and it has improved since then.\n4. Co-worker B finished a project and sent it to the manager for review.\n5. Co-worker A gave Co-worker B a pen as a symbol of trust in their professional relationship.\n6. Both Co-worker A and Co-worker B value trust in their personal and professional relationships.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's a great approach. Building that clear communication and alignment is key to success in any business. Your dedication to efficiency and improvement really shines through in everything you do.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t2",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.",
        "memory_text": "1. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n2. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n3. Co-worker A agrees to be more conscious of how they come across to others in the future.\n4. Co-worker A's evidence includes statistics and personal accounts from clients.\n5. Co-worker A is a skilled builder who recently completed building a house for Co-worker B.\n6. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you for your kind words. I believe effective communication is key in any situation, whether it's public speaking or dealing with challenging clients. It's all about connecting with people and conveying a message clearly.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t5",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n2. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n3. Co-worker A's evidence includes statistics and personal accounts from clients.\n4. Co-worker A believes their evidence is more compelling than the opposing side's evidence.\n5. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n6. Co-worker A agrees to be more conscious of how they come across to others in the future.",
        "speaker": "Co-workers B",
        "raw_prediction": "Your ability to combine statistics with personal anecdotes really makes your evidence stand out. It's not just about presenting data; it's about connecting with people on a deeper level, and you excel at that.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t6",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?",
        "memory_text": "1. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n2. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n3. Co-worker A's evidence includes statistics and personal accounts from clients.\n4. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n5. Co-worker A believes their evidence is more compelling than the opposing side's evidence.\n6. Co-worker A agrees to be more conscious of how they come across to others in the future.",
        "speaker": "Co-workers A",
        "raw_prediction": "Thank you for the compliment. I haven't been in a physical altercation before, but I believe in resolving conflicts through communication and understanding. It's crucial to handle challenging situations with care and empathy.",
        "previous_summary": null
    },
    {
        "utter_id": "e30-s5-t8",
        "current_dialogue": "Co-workers A: I really enjoy public speaking. It's such a great way to connect with people and convey a message.\nCo-workers B: I can see that you're a natural speaker. Your words always have a way of making people feel comfortable and confident.\nCo-workers A: Thank you! I've been practicing for a while now, and I'm glad that it shows.\nCo-workers B: Speaking of skills, you always present a compelling argument in debates. I remember when you presented your evidence in court, it was so persuasive.\nCo-workers A: Yes, I think it's important to back up your claims with facts and figures. It helps to convince the judge or the audience that you're right.\nCo-workers B: Speaking of convincing people, have you ever been in a physical altercation before?\nCo-workers A: Yes, unfortunately. But that doesn't mean I'm a danger to people. I just don't back down from a fight when I'm standing up for what's right.\nCo-workers B: That's understandable. Speaking of standing up for what's right, do you remember when you asked Karen for money and she was hesitant at first?",
        "memory_text": "1. Co-worker B commends Co-worker A for having the courage to stand up and defend their beliefs.\n2. Co-worker A has been collecting evidence for a case and is confident in the strength of their argument.\n3. Co-worker A has experience dealing with challenging clients and emphasizes the importance of communication and setting expectations.\n4. Co-worker A's evidence includes statistics and personal accounts from clients.\n5. Co-worker A believes their evidence is more compelling than the opposing side's evidence.\n6. Co-worker B mentions that Co-worker A's reputation may have influenced Karen's hesitation to give them money.",
        "speaker": "Co-workers A",
        "raw_prediction": "Yes, I remember that. I believe Karen's hesitation was influenced by my reputation and the misconceptions some people have about me. It's important to always communicate openly and honestly to clear up any misunderstandings.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t1",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n3. Classmates A appreciates the support and friendship of Classmates B.\n4. Classmates A and B are making plans to spend time together outside of school.\n5. Classmates A and B started as acquaintances and have developed a strong friendship.\n6. Classmates A and B had a mix-up with names in the past but resolved the issue through communication.",
        "speaker": "Classmates A",
        "raw_prediction": "That's amazing! You always go above and beyond to help others. Your kindness is truly inspiring.",
        "previous_summary": null
    },
    {
        "utter_id": "e31-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to share something with you. I helped out a neighbor in need over the weekend.\nClassmates B: That's really kind of you. What did you do to help?\nClassmates A: She was moving and needed some extra hands to pack up her things and load them onto a truck. So I spent most of the day helping her out.\nClassmates B: Wow, that's really generous of you. I'm sure your neighbor really appreciated it.\nClassmates A: I hope so. I just felt like it was the right thing to do. I know if I were in that situation, I would appreciate any help I could get.\nClassmates B: Absolutely. It's important to be there for each other, especially in tough times.\nClassmates A: Yes, and it feels good to make a difference in someone's life, even if it's just in a small way.",
        "memory_text": "1. Classmates A appreciates Classmates B's efforts and support.\n2. Classmates A appreciates the support and friendship of Classmates B.\n3. Classmates B handled a previous mix-up with the class schedule well, showing responsibility and reliability.\n4. Classmates A and B value their friendship and feel comfortable talking to each other about anything.\n5. Classmates A and B started as acquaintances and have developed a strong friendship.\n6. Classmates B was initially worried about Classmates A going out with friends but they value each other's opinions.",
        "speaker": "Classmates B",
        "raw_prediction": "It's wonderful to see how caring and thoughtful you are towards others. Your kindness truly shines through in moments like these.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t2",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?",
        "memory_text": "1. The husband is inspired by his wife to take action on his dreams and goals.\n2. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n3. The husband apologized and promised to involve the wife in his plans in the future.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband and wife are committed to each other and excited about their future together.\n6. The wife is supportive and proud of her husband for working towards his goals.",
        "speaker": "Husband",
        "raw_prediction": "How about we go to that cozy cabin in the mountains you've always wanted to visit?",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t4",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband is inspired by his wife to take action on his dreams and goals.\n3. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband and wife are committed to each other and excited about their future together.\n6. The wife admires the husband's determination and big heart.",
        "speaker": "Husband",
        "raw_prediction": "I'm really looking forward to it too. It'll be a lovely opportunity for us to relax and enjoy each other's company without any distractions.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t8",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.",
        "memory_text": "1. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n2. The husband is inspired by his wife to take action on his dreams and goals.\n3. The husband apologized and promised to involve the wife in his plans in the future.\n4. The husband and wife are committed to each other and excited about their future together.\n5. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n6. The wife is supportive and proud of her husband for working towards his goals.",
        "speaker": "Husband",
        "raw_prediction": "Thank you for believing in me, wife. Your support means the world to me. I can't wait to make this weekend getaway a reality and create beautiful memories together.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t11",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.",
        "memory_text": "1. The husband apologized and promised to involve the wife in his plans in the future.\n2. The husband acknowledges his mistake, apologizes, and promises to make it up to his wife, emphasizing the importance of keeping promises and taking action.\n3. The wife brings up past disappointment when the husband left without her, breaking a promise to wait for her.\n4. The husband is excited about his progress on long-awaited plans and is putting in a lot of effort to make them a reality.\n5. The husband is inspired by his wife to take action on his dreams and goals.\n6. The husband values the wife's encouragement and positivity in his pursuit of his goals.",
        "speaker": "Wife",
        "raw_prediction": "I appreciate your thoughtfulness, husband. Your effort to involve me in your plans and consider my feelings means a lot to me. Let's focus on making new memories together on our weekend getaway.",
        "previous_summary": null
    },
    {
        "utter_id": "e32-s5-t16",
        "current_dialogue": "Husband: Hey, Wife, I've been thinking that we should spend more time together. How about we go on a weekend getaway?\nWife: That sounds great, husband! Where do you want to go?\nHusband: Well, I was thinking of renting a cabin in the woods, away from all the hustle and bustle of the city.\nWife: Oh, that sounds like a perfect idea! It will be nice to have some peace and quiet for a change.\nHusband: Yes, and we could cook our meals together, go for a hike, and just relax. What do you think?\nWife: That sounds lovely, husband. I'm really looking forward to it.\nHusband: Great. I'll start looking for rental cabins right away. I know this may sound impulsive, but I'm really excited to make this happen.\nWife: Don't worry, husband, it's not impulsive. You always follow through with your plans, and I believe this will be a wonderful experience for both of us.\nHusband: Thank you, wife. And, I want to apologize for the time I left without waiting for you. I know I promised to wait, and I should have kept my word.\nWife: It's okay, husband. I understand that you were in a hurry, and it wasn't intentional. Besides, that was a long time ago, and we've moved past it.\nHusband: Thank you for being so understanding, wife. I just want to make sure I am not repeating the same mistake again.\nWife: I trust that you won't, husband. And hey, remember when I stopped a runaway carriage from causing harm to a group of people? That was quite the adrenaline rush!\nHusband: Oh, I remember that, wife. You are fearless, and I'm so proud of you.\nWife: Thanks, husband. And speaking of good times, I had so much fun at the dance a few weeks ago. Dancing with you always puts me in a good mood.\nHusband: Same here, wife. I love spending time with you, and I feel grateful for every moment we get to share. \nWife: I feel the same way, husband. And, I appreciate you doing the dishes for me today so we could have this conversation.",
        "memory_text": "1. The husband values the wife's encouragement and positivity in his pursuit of his goals.\n2. The husband is inspired by his wife to take action on his dreams and goals.\n3. The husband acknowledges his wife's bravery and selflessness.\n4. The husband apologized and promised to involve the wife in his plans in the future.\n5. The wife admires the husband's determination and big heart.\n6. The husband and wife are committed to each other and excited about their future together.",
        "speaker": "Husband",
        "raw_prediction": "I'm glad I could help out, wife. It's the least I can do to show my love and appreciation for you. You truly make every moment special, even something as simple as doing the dishes together.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t1",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?",
        "memory_text": "1. Classmates A is stranded in space, running out of oxygen and feeling lightheaded.\n2. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n3. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n4. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n5. Classmates A and B have been on field trips to other planets or moons before, like Mars.\n6. Classmate A is patient and helpful in teaching driving material to Classmate B.",
        "speaker": "Classmates A",
        "raw_prediction": "Oh, no, I didn't get sunburned. I think I might be having an allergic reaction to something. I appreciate your concern, though.",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t2",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.",
        "memory_text": "1. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n2. Classmates A is stranded in space, running out of oxygen and feeling lightheaded.\n3. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n4. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n5. Classmates A and B have been on field trips to other planets or moons before, like Mars.\n6. Classmate B struggles with parallel parking but is grateful for Classmate A's patience.",
        "speaker": "Classmates A",
        "raw_prediction": "Embarrassed? Don't worry, we all have our moments. Is it about the parallel parking incident earlier?",
        "previous_summary": null
    },
    {
        "utter_id": "e33-s5-t11",
        "current_dialogue": "Classmates A: Why is your face so red and splotchy, Classmates B? Did you get sunburned?\nClassmates B: No, I didn't get sunburned. I'm just feeling a bit embarrassed.\nClassmates A: Embarrassed? Why?\nClassmates B: It's nothing, really. Just something embarrassing happened to me earlier.\nClassmates A: Come on, tell me! I won't judge you, I promise.\nClassmates B: Well, I accidentally spilled my lunch all over myself in front of some people.\nClassmates A: (laughs) That's it? That's why you're embarrassed? I thought it was something serious.\nClassmates B: (sighs) Yeah, it's silly. But still embarrassing.\nClassmates A: Don't worry about it. It happens to everyone. Remember the time I tripped and fell in front of the whole class during our presentation?\nClassmates B: Oh yeah, that was pretty bad. But you handled it so well. You just got up, dusted yourself off, and continued with the presentation.\nClassmates A: Exactly! That's what you should do too. Own up to it and move on. Don't let it bother you.",
        "memory_text": "1. Classmates A expresses gratitude for Classmates B's support during the difficult situation.\n2. Classmates B praised Classmates A for their resilience and quick thinking during a scary experience in space.\n3. Classmates A helped Classmates B out of friendship and believes in supporting each other.\n4. Classmate A believes in doing their best at everything to avoid regrets later.\n5. Classmate B struggles with parallel parking but is grateful for Classmate A's patience.\n6. Classmate B praises Classmate A's attention to detail and work ethic as truly impressive.",
        "speaker": "Classmates B",
        "raw_prediction": "You're right, Classmates A. Thanks for the reminder. I'll try to brush off the embarrassment and carry on. Your positive attitude always helps me see things in a better light.",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t4",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?",
        "memory_text": "1. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n2. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n3. Neighbors A is trying to improve their behavior at work and be a better colleague.\n4. Neighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\n5. Neighbors B appreciated Neighbors A's support during this difficult situation.\n6. Neighbors A noticed that Neighbors B's dog has been missing for a few days.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, I've been reaching out to fitness enthusiasts and gym owners to gauge their interest. I've also been showcasing it at local fitness events to generate buzz. I'm hoping all this effort pays off!",
        "previous_summary": null
    },
    {
        "utter_id": "e34-s5-t8",
        "current_dialogue": "Neighbors A: I'm really excited about finding a buyer for my product. I think it has a lot of potential.\nNeighbors B: That's great to hear, what kind of product is it?\nNeighbors A: It's a new type of workout equipment that's designed to be more efficient than traditional equipment. I've been working on it for months now and I really think it's going to take off.\nNeighbors B: Wow, that sounds interesting. Have you started looking for potential buyers?\nNeighbors A: Yes, I've been reaching out to various gyms and fitness centers to see if they'd be interested in carrying the product. I've even gotten some positive feedback from a few places.\nNeighbors B: That's awesome! I'm sure with your determination, you'll find the perfect buyer soon.\nNeighbors A: Thanks, I really appreciate your support. It's been a long road, but I'm confident that all my hard work will pay off.\nNeighbors B: Speaking of hard work, have you made any progress at your current job? I remember you were having some trouble with your boss.",
        "memory_text": "1. Neighbors B expresses a desire for Neighbors A to succeed and emphasizes the importance of treating others with respect and putting in effort at work.\n2. Neighbors B is supportive of Neighbors A's efforts to change and become a better version of themselves.\n3. Neighbors A is trying to improve their behavior at work and be a better colleague.\n4. Neighbors B appreciated Neighbors A's support during this difficult situation.\n5. Neighbors A and Neighbors B have a friendly and supportive relationship, as they enjoy having coffee and chatting together.\n6. Neighbors B suggests that Neighbors A's attitude and behavior at work may be the reason for their boss wanting to fire them.",
        "speaker": "Neighbors A",
        "raw_prediction": "Yes, I've been making a conscious effort to improve my attitude and behavior at work. I've been more proactive in communicating with my colleagues and taking on additional responsibilities. I believe it's starting to make a positive impact, and I'm hoping to turn things around with my boss.",
        "previous_summary": "Neighbors A is at risk of losing their job due to conflicts with colleagues.\nNeighbors B suggests that Neighbors A's attitude and behavior at work may be the reason for their boss wanting to fire them.\nNeighbors A acknowledges the need to work harder, be nicer to colleagues, and improve their behavior.\nNeighbors B points out that it might be too late to change their boss's decision and emphasizes the importance of learning from mistakes.\nNeighbors A agrees to take responsibility for their actions and work on improving themselves.\nNeighbors A is having issues at work, such as not pulling their weight and being rude to colleagues.\nNeighbors B advised Neighbors A to change their behavior at work and be a responsible adult.\nNeighbors A is trying to improve their behavior at work and be a better colleague."
    },
    {
        "utter_id": "e35-s5-t5",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.",
        "memory_text": "1. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n2. Co-worker A and Co-worker B met on a movie set and are now good friends.\n3. Co-worker A had a tough week on set, feeling overwhelmed and chaotic.\n4. Co-worker B and Co-worker A met on a movie set where Co-worker A was focused on acting.\n5. Co-worker A and Co-worker B are excited about working on future projects together and even starting their own production company someday.\n6. Co-worker B emphasized the importance of learning from mistakes and working together as a team.",
        "speaker": "Co-workers B",
        "raw_prediction": "I'm glad I could be there for you during that tough moment. It's important to have someone to lean on and help you navigate those challenging times. Remember, we're a team, and we always have each other's backs.",
        "previous_summary": null
    },
    {
        "utter_id": "e35-s5-t9",
        "current_dialogue": "Co-workers A: I feel so grateful to have a boss who is always so supportive of me.\nCo-workers B: That's amazing to hear. Having a supportive boss can make all the difference in how you feel about your job.\nCo-workers A: Definitely. It makes me feel secure in my position and motivated to do my best work.\nCo-workers B: It's great to have that kind of positive reinforcement. Do you remember when we were working on that movie together and you were feeling really frustrated?\nCo-workers A: Oh yeah, I remember. I was so angry after blowing up that rabbit with the dynamite. But talking it out with you really helped me work through my emotions.\nCo-workers B: That's right. It's important to have someone to talk to when you're feeling overwhelmed or upset.\nCo-workers A: And speaking of talking it out, do you remember when I was a kid and I ran to our parents screaming because of that spider?\nCo-workers B: Ha, yes I do! It's funny to think about now, but phobias are no laughing matter.\nCo-workers A: Absolutely. And on a lighter note, I made a pair of wire earrings the other day. It was so much fun to create something beautiful with my own hands.",
        "memory_text": "1. Both Co-worker A and Co-worker B feel that their collaboration brought out the best in each other during the shoot.\n2. Co-worker A has overcome fears and anxieties to create beautiful earrings.\n3. Co-worker B encourages Co-worker A to try relaxation techniques or find a hobby to de-stress and overcome fears.\n4. Co-worker B acknowledges that some people have fears and suggests finding healthy ways to deal with frustrations.\n5. Co-worker A and Co-worker B met on a movie set and are now good friends.\n6. Co-worker A had a tough week on set, feeling overwhelmed and chaotic.",
        "speaker": "Co-workers B",
        "raw_prediction": "That's fantastic! I'm so proud of you for pushing through your fears and anxieties to create something so beautiful. Have you thought about trying relaxation techniques or maybe picking up a hobby to help de-stress and overcome those fears even more?",
        "previous_summary": null
    },
    {
        "utter_id": "e36-s5-t12",
        "current_dialogue": "Mentee: Mentor, have you ever tried to imagine what it would be like to think like someone else?\nMentor: Yes, I have. It's a great way to better understand and empathize with others.\nMentee: That's exactly what I thought. I've been trying to imagine what personY is thinking lately. It's been helping me to understand their perspective a bit better.\nMentor: That's a great approach. Putting ourselves in someone else's shoes can help us see things from a different angle and see where they're coming from.\nMentee: Exactly. And it also helps me to be more compassionate towards them. I think it's important for us to be more understanding and supportive of each other, especially in difficult times.\nMentor: I agree completely. It's important to be kind and compassionate towards others, especially when they may be going through something challenging.\nMentee: And I think it's also important to remember that we all have different perspectives and experiences that shape our thoughts and actions.\nMentor: Absolutely. Keeping an open mind and being willing to listen to others can help us to learn from them and grow as individuals.\nMentee: That's so true. And it's a great way to build stronger relationships with others. So, Mentor, have you ever tried to imagine what it's like to be in a different culture or country?\nMentor: Yes, as a matter of fact, I have. I think it's important to learn about other cultures and broaden our perspectives.\nMentee: That's really interesting. Where are you from, Mentor?\nMentor: I'm originally from Italy.",
        "memory_text": "1. Mentor is from Italy and has lived in the United States.\n2. Mentee wants to make a positive impact in people's lives and is grateful for Mentor's support.\n3. Mentor became a mentor to help others going through similar situations.\n4. Mentor encourages Mentee to approach teaching religion with an open mind and heart.\n5. Mentee agrees to try the advice and express gratitude towards Mentor.\n6. Mentee is taking the idea of teaching religion seriously and wants to make a positive impact on people's lives.",
        "speaker": "Mentee",
        "raw_prediction": "That's amazing. Living in two different countries must have given you a unique perspective on life. I appreciate your openness to different cultures and your willingness to share your experiences with me. It's inspiring to see how you've embraced diversity in your life.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t7",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmates A discovered a secret that Classmates B has been keeping.\n3. Classmates A and B are students in the same class.\n4. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\n5. Classmates B feels relieved to have someone to confide in about the secret.\n6. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.",
        "speaker": "Classmates B",
        "raw_prediction": "I appreciate your honesty and how open you are about your feelings. I value our friendship a lot, and I think it's important for us to talk more and see where this could potentially lead.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t9",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmates B feels relieved to have someone to confide in about the secret.\n3. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n4. Classmates A discovered a secret that Classmates B has been keeping.\n5. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\n6. Classmates A offered help and support to Classmates B.",
        "speaker": "Classmates B",
        "raw_prediction": "No, you're not crossing any lines at all. I appreciate your honesty and openness about your feelings. It means a lot to me that you shared this with me. Let's see where this takes us.",
        "previous_summary": null
    },
    {
        "utter_id": "e38-s5-t15",
        "current_dialogue": "Classmates A: , I wanted to talk to you about something.\nClassmates B: Sure, what's on your mind?\nClassmates A: Well, it’s been on my mind for a while now and I couldn’t shake it off. I just can't stop thinking about you.\nClassmates B: Oh, really?\nClassmates A: Yes, really. I know we've been friends for a while now, but I feel like there may be something more between us.\nClassmates B: Hmm, I never thought about it that way. But I can’t deny that we have a great connection.\nClassmates A: Exactly! I just feel like we could be more than just friends. If it's something you're open to, of course.\nClassmates B: I get what you’re saying,. And to be honest, I’ve had similar thoughts lately. I’m definitely open to exploring this.\nClassmates A: I’m so relieved to hear that. I was worried that I might be crossing a line by expressing my feelings.\nClassmates B: No, not at all. I’m glad you did. It takes courage to express your true feelings. \nClassmates A: Yeah, I guess it does. It’s just that I’ve been hurt before, and I don’t want to lose you as a friend too.\nClassmates B: I understand your concerns,. but I think we can make this work. We've already built a strong foundation of friendship, which is important for any relationship.\nClassmates A: That’s true. I feel like we can take this in any direction that we want.\nClassmates B: Definitely. We can take our time, explore our feelings, and see where it all leads.\nClassmates A: Agreed. I'm excited to see where this journey takes us.",
        "memory_text": "1. Classmates A and B are close and have a level of trust between them.\n2. Classmate A recalls a moment where they admired Classmate B's courage and strength in sharing a secret, showing their supportive and compassionate nature.\n3. Classmates B feels relieved to have someone to confide in about the secret.\n4. Classmates A offered help and support to Classmates B.\n5. Classmates A and B have had a previous positive interaction in a coffee shop where Classmates A rubbed Classmates B's neck, providing relaxation.\n6. Classmates A discovered a secret that Classmates B has been keeping.",
        "speaker": "Classmates B",
        "raw_prediction": "Me too. I'm glad we're on the same page about this. Your honesty means a lot to me, and I'm looking forward to seeing where this new chapter leads us.",
        "previous_summary": null
    },
    {
        "utter_id": "e39-s5-t9",
        "current_dialogue": "Neighbors A: I just got back from my trip to South America. It was amazing!\nNeighbors B: Oh really? Where did you go?\nNeighbors A: I visited Brazil and Peru. The culture and food were incredible.\nNeighbors B: That sounds awesome. I've always wanted to go to Peru to see Machu Picchu.\nNeighbors A: Yes, Machu Picchu is amazing. The view from the top is breathtaking.\nNeighbors B: Have you thought about where you want to go next?\nNeighbors A: Yeah, I'm thinking about visiting Australia and Antarctica next. I want to see the Great Barrier Reef and the penguins.\nNeighbors B: Wow, that's quite a contrast. From the hot desert to the cold ice. It must be interesting to experience such different environments.\nNeighbors A: Definitely, that's what I love about traveling. You get to see and experience so much diversity in the world.",
        "memory_text": "1. Neighbors A and B believe in doing nice things for others to bring the community together.\n2. Neighbors B admires Neighbors A's organization skills and wishes to improve their own organization.\n3. Neighbors A and B both took a cooking class together last year.\n4. Both Neighbors A and B believe in the importance of learning and self-improvement.\n5. Neighbor B suggests finding other ways to relieve frustration and looking out for Neighbor A's well-being.\n6. Neighbor A is feeling frustrated and is considering going to a bar to find someone for a casual encounter.",
        "speaker": "Neighbors B",
        "raw_prediction": "It's great that you enjoy exploring different cultures and environments through your travels. It's a wonderful way to learn and grow. Maybe we can even plan another cooking class together inspired by the cuisines you've experienced on your trips.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t2",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?",
        "memory_text": "1. Classmate A and Classmate B are classmates.\n2. Classmates B acknowledges Classmates A's determination and competitiveness.\n3. Classmates A has not experienced similar pains in the past and is feeling worried about the situation.\n4. Classmates A is competitive and recently beat their brother in a race.\n5. Classmates A expresses gratitude for the support and friendship of Classmates B.\n6. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.",
        "speaker": "Classmates A",
        "raw_prediction": "I want to make sure I excel in all my subjects. It's like when I beat my brother in that race - once I set my mind to something, I give it my all.",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t6",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n3. Classmates A expresses gratitude for the support and friendship of Classmates B.\n4. Classmate A and Classmate B are classmates.\n5. Classmates B offers support and suggests taking a step back to find a balance.\n6. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.",
        "speaker": "Classmates A",
        "raw_prediction": "Yeah, it really is. It's like that feeling I had when I beat your brother in that race. Remember how competitive I can be?",
        "previous_summary": null
    },
    {
        "utter_id": "e40-s5-t9",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n3. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.\n4. Classmates A is competitive and recently beat their brother in a race.\n5. Classmates A expresses gratitude for the support and friendship of Classmates B.\n6. Classmates A reminisces about a past race with their brother and a conversation with Tyler about a personal issue.",
        "speaker": "Classmates B",
        "raw_prediction": "That's a good reminder that perseverance and patience can go a long way. It's impressive how you push through challenges to achieve your goals.",
        "previous_summary": "Classmates A is experiencing sudden pain in their left arm and is considering going to the hospital.\nClassmates A has not experienced similar pains in the past and is feeling worried about the situation.\nClassmates B offers to take Classmates A to the hospital, but Classmates A declines, saying they will manage.\nClassmate A had a muscle strain in their arm but did not go to the hospital.\nClassmate B reminds Classmate A to trust their instincts and know when to seek medical attention."
    },
    {
        "utter_id": "e40-s5-t10",
        "current_dialogue": "Classmates A: I've been really focusing on studying algebra lately.\nClassmates B: Why is that?\nClassmates A: I want to be smart and I think algebra can help me think more logically and critically.\nClassmates B: That's a good goal to have. Have you noticed any improvements in your thinking since studying algebra?\nClassmates A: Definitely. I feel like I'm able to break down problems and analyze them more effectively.\nClassmates B: It's always rewarding when hard work pays off.\nClassmates A: Yes it is. It reminds me of when I proved my brother wrong in that race. I was so determined to win and it paid off in the end.\nClassmates B: It's great to see that determination and hard work lead to success in different areas of life.\nClassmates A: And even when I felt that pain in my arm, I waited and it eventually went away.\nClassmates B: It's important to listen to your body and take care of yourself.",
        "memory_text": "1. Classmates B acknowledges Classmates A's determination and competitiveness.\n2. Classmates B emphasizes the importance of enjoying the journey and effort put in, not just focusing on winning.\n3. Classmates B brings up a past event where Classmates A beat their brother in a race, highlighting their competitive nature.\n4. Classmates A expresses gratitude for the support and friendship of Classmates B.\n5. Classmates A is competitive and recently beat their brother in a race.\n6. Classmate A emphasizes the importance of self-care and relaxation.",
        "speaker": "Classmates A",
        "raw_prediction": "Absolutely, self-care is crucial for achieving success in the long run. It's all about finding that balance between pushing yourself and taking care of your well-being.",
        "previous_summary": null
    },
    {
        "utter_id": "e41-s5-t6",
        "current_dialogue": "Classmates A: I just finished my computer course, and I learned so much about using computers effectively.\nClassmates B: That's great! What did you learn specifically?\nClassmates A: Oh, a lot of things. I learned how to use different programs and software for different tasks, and how to choose the right one depending on what I need to do.\nClassmates B: Do you have any software recommendations for me? I always struggle with choosing the right program.\nClassmates A: It really depends on what you need the software for. But for basic tasks like word processing or spreadsheet management, I would recommend Microsoft Office. It's user-friendly and versatile.\nClassmates B: Thanks, I'll keep that in mind. Did you learn anything else in the course?",
        "memory_text": "1. Classmates A and Classmates B are friends who help each other with schoolwork.\n2. Classmate B is a supportive friend who listens and offers to help.\n3. Classmate A appreciates having friends who are there for them during difficult times.\n4. Classmates B supported Classmates A through a tough time by listening to them.\n5. Classmates B and Classmates A used to dance a lot in middle school.\n6. Classmates A has matured since then and learned from past mistakes.",
        "speaker": "Classmates A",
        "raw_prediction": "Yes, I also learned about computer security and how to protect my data online. It was really eye-opening to understand the importance of keeping my information safe while using the internet.",
        "previous_summary": null
    },
    {
        "utter_id": "e44-s5-t7",
        "current_dialogue": "Neighbors A: I just can't believe he left me like that. I thought we were happy together.\nNeighbors B: I'm so sorry, Neighbor A. Have you talked to him since he left?\nNeighbors A: No, I haven't. I don't even know what I would say to him. I feel like I'm not enough, like I wasn't good enough for him.\nNeighbors B: That's not true, Neighbor A. You are an amazing person and you deserve someone who appreciates you for who you are.\nNeighbors A: I just feel so lost right now. I don't know how to move on from this.\nNeighbors B: It's going to take time, but you will get through this. Do you want to talk about how you're feeling or do something to take your mind off of things?\nNeighbors A: Maybe both? I just feel so overwhelmed and I don't know what to do.",
        "memory_text": "1. Neighbor B is offering support and companionship to Neighbor A during their difficult time.\n2. Neighbor A is grieving the recent loss of their grandmother.\n3. Neighbor A finds solace in nature and believes that it helps in coping with their emotions.\n4. Neighbor A recently moved to a new neighborhood and feels safer and happier there.\n5. Neighbor A and Neighbor B have a close friendship and have shared memories of spending time together in the park.\n6. Neighbor A and Neighbor B are neighbors who catch up outside of their neighborhood.",
        "speaker": "Neighbors B",
        "raw_prediction": "I completely understand, Neighbor A. Let's take it one step at a time. How about we go for a walk in the park? The fresh air and nature might help clear your mind a bit. And if you feel like talking more along the way, I'm here to listen.",
        "previous_summary": null
    },
    {
        "utter_id": "e45-s5-t9",
        "current_dialogue": "Classmates A: I can't believe I got caught cheating on my taxes. This is such a mess.\nClassmates B: Wait, what? You cheated on your taxes? That's not okay.\nClassmates A: I know, I know. I was just really struggling financially and I thought I could get away with it.\nClassmates B: You can't just cheat and hope to never get caught. That's not how it works.\nClassmates A: Remember when we talked about me wanting to become a professional basketball player?\nClassmates B: Yeah, I remember. So, what does that have to do with cheating on your taxes?\nClassmates A: It's just that I feel like I keep hitting roadblocks in my life. Every time I try to move forward, something happens to set me back. It's really discouraging.\nClassmates B: I understand that it can be tough, but cheating isn't the answer. You have to keep working hard and doing the right thing, even when it's hard.\nClassmates A: On a completely different note, do you remember when I got a job at the local grocery store?",
        "memory_text": "1. Classmates B advises Classmates A to stay focused on their goal, believe in themselves, and ask for help if needed.\n2. Classmate A is pursuing a dream of becoming a professional basketball player and is working at a grocery store to save up money for training.\n3. Classmates A believes in hard work and dedication to achieve goals both in basketball and their job.\n4. Classmates B encourages Classmates A to keep pushing themselves and not let doubts hold them back.\n5. Classmates A has a big dream of becoming a professional basketball player and works hard towards that goal.\n6. Classmate B reassures Classmate A that they are all in it together and offers help if needed.",
        "speaker": "Classmates B",
        "raw_prediction": "Of course, I remember! You were so excited about that job and how it would help you save up for your basketball training. It's great to see you putting in the effort and dedication towards your goals. Just keep focused on your dream, believe in yourself, and don't let setbacks like this tax issue discourage you. Remember, we're all here to support you.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t1",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!",
        "memory_text": "1. Classmate A and Classmate B are classmates who attended a party together.\n2. Classmate A is concerned about the party being discovered and getting in trouble with the school.\n3. Classmates B finds Classmates A's involvement in the community admirable and important.\n4. Classmate A expresses a desire to find alternative ways to have fun and make a positive impact in the community.\n5. Classmates A is proactive and curious, taking the initiative to research topics of interest.\n6. Classmate A agrees to take better care of themselves in the future.",
        "speaker": "Classmates B",
        "raw_prediction": "That looks amazing! I love how you're always discovering new ways to have fun and connect with nature.",
        "previous_summary": null
    },
    {
        "utter_id": "e46-s5-t6",
        "current_dialogue": "Classmates A: Hey, check out this spot I found to camp out for the night. It's perfect!\nClassmates B: Wow, this view is amazing!\nClassmates A: I know, right? And it's completely level and free of any debris. We won't have to worry about rolling off our sleeping pads or anything like that.\nClassmates B: It definitely looks like a great spot to spend the night. How did you manage to find it?\nClassmates A: Just a stroke of luck, I guess. I was exploring the area and stumbled upon it. It's always good to be a little adventurous and explore new places, you never know what you might find.\nClassmates B: That's true. You always seem to find the best spots. Like that time we went camping near the lake and had the whole place to ourselves.",
        "memory_text": "1. Classmates B finds Classmates A's involvement in the community admirable and important.\n2. Classmate A expresses a desire to find alternative ways to have fun and make a positive impact in the community.\n3. Classmates A is proactive and curious, taking the initiative to research topics of interest.\n4. Classmate A and Classmate B are classmates who attended a party together.\n5. Classmates B remembers Classmates A's previous involvement in community improvement projects and acknowledges their passion for making a difference.\n6. Classmates A is passionate about making a difference and believes in educating oneself and taking action for a better future.",
        "speaker": "Classmates A",
        "raw_prediction": "That was such a memorable trip! It's these moments of tranquility and connection with nature that make me appreciate the importance of preserving our environment. I think it's vital to continue exploring and enjoying these spaces responsibly.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t7",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n4. Classmates A and B are both keeping up with the homework in their math class.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A finds pursuing music rewarding and is passionate about it.",
        "speaker": "Classmates B",
        "raw_prediction": "Yeah, you're right. Maybe I can start by taking small steps towards learning to play an instrument. It's something I've always wanted to do, and it might help me feel more independent. Thank you for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t8",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n4. Classmates A and B are both keeping up with the homework in their math class.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.",
        "speaker": "Classmates A",
        "raw_prediction": "How about starting with something you're interested in, like learning to play an instrument? It could be a fun and rewarding way for you to explore your own talents and interests. I'd be happy to help you get started if you'd like.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t11",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?",
        "memory_text": "1. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n2. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n3. Classmates A enjoys reminiscing about childhood memories, particularly about playing on swings and making music with friends.\n4. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates A finds pursuing music rewarding and is passionate about it.",
        "speaker": "Classmates B",
        "raw_prediction": "I haven't made much progress with learning the guitar yet, but I'm still interested in picking it up. Your dedication to music really inspires me to give it a shot.",
        "previous_summary": null
    },
    {
        "utter_id": "e47-s5-t16",
        "current_dialogue": "Classmates A: Hey, how are you feeling today?\nClassmates B: I'm feeling frustrated. I wish I could do things on my own.\nClassmates A: I understand how you feel. It can be tough when you feel like you're dependent on others.\nClassmates B: Yeah, exactly. I don't want to be a burden on anyone.\nClassmates A: You're not a burden, don't worry. And I'm always here to help you out.\nClassmates B: I appreciate that, but I don't want to always rely on others. I want to be more independent.\nClassmates A: I get it. Maybe there are some small things you can do on your own to start feeling more independent?\nClassmates B: Like what?\nClassmates A: Well, maybe you can start by making a list of things you'd like to do on your own and we can work on achieving those goals together.\nClassmates B: That sounds like a good idea. Thanks for understanding, Classmates A.\nClassmates A: Of course, I'm always here to support you. Hey, speaking of goals, remember when we talked about your guitar playing a few months ago? How's that going?\nClassmates B: It's going really well, thanks for asking! I've been practicing every day and I feel like I'm getting better.\nClassmates A: That's awesome! Have you thought about joining a band or playing gigs around town?\nClassmates B: Not really, I'm still a bit nervous about performing in front of people.\nClassmates A: I get it, performing can be scary. But maybe in a few months, we can work on setting a goal for you to do a small performance somewhere.\nClassmates B: That sounds like a challenge, but also kind of exciting. I'm in!",
        "memory_text": "1. Classmates B finds it awesome that Classmates A is pursuing their passion for music after a conversation they had about following dreams.\n2. Classmates A and B enjoy jamming together and plan to collaborate on music in the future.\n3. Classmates A and B have a friendly and supportive relationship, as evidenced by their conversation about their respective experiences.\n4. Classmates A finds pursuing music rewarding and is passionate about it.\n5. Classmates B is interested in learning to play an instrument.\n6. Classmates B is working on a new original song on the guitar.",
        "speaker": "Classmates A",
        "raw_prediction": "I'm glad you're excited about the challenge! I think you'll do great once you take that step. Just remember, I'll be right there cheering you on and ready to jam together whenever you need a confidence boost.",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t6",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?",
        "memory_text": "1. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n2. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n3. Neighbor A has skills in manipulation and getting what they want.\n4. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.\n5. Neighbors B admires Neighbors A's gardening skills and wishes to have a green thumb.\n6. Neighbor B is against Neighbor A's idea, emphasizing the ethical and legal implications.",
        "speaker": "Neighbors A",
        "raw_prediction": "That's a good point. Maybe a change in environment could help me focus better. I'll give it a try and see if it makes a difference. Thanks for the suggestion!",
        "previous_summary": null
    },
    {
        "utter_id": "e48-s5-t9",
        "current_dialogue": "Neighbors A: Ugh, I need to finish this project before the deadline, but I just can't seem to focus.\nNeighbors B: Sounds like a case of procrastination.\nNeighbors A: Yeah, I always find a way to put things off.\nNeighbors B: Have you tried setting specific goals or breaking down the project into smaller tasks?\nNeighbors A: I have, but then I get sidetracked with something else.\nNeighbors B: Maybe you need a change of scenery. Have you tried studying or working in a different location?\nNeighbors A: That's a good idea, I'll try working at the library instead of at home.\nNeighbors B: And remember, the longer you procrastinate, the more stressful and difficult the task will become.\nNeighbors A: You're right, I need to stop making excuses and just get it done. Thanks for the advice.",
        "memory_text": "1. Neighbor A considers using their skills for good instead of evil after Neighbor B's reminder.\n2. Neighbor A and Neighbor B discuss organizing a community event to make a positive impact and appreciate the beauty of their city.\n3. Neighbors A enjoys taking care of flowers and finds it calming.\n4. Neighbor B is against Neighbor A's idea, emphasizing the ethical and legal implications.\n5. Neighbors A had help from friends in building the new house.\n6. Neighbor A considers Neighbor B a great neighbor and wanted to do something special for them.",
        "speaker": "Neighbors B",
        "raw_prediction": "You're welcome! Remember, taking small steps towards your goal is better than not moving at all. Good luck with your project!",
        "previous_summary": null
    },
    {
        "utter_id": "e49-s5-t4",
        "current_dialogue": "Husband: I'm feeling stuck with my writing. I've been searching everywhere for new ideas, but nothing seems to work.\nWife: Have you tried brainstorming with me? Sometimes bouncing ideas off of someone else can help.\nHusband: I have, but I don't want to bother you too much with my writing stuff.\nWife: Nonsense! You can always come to me with anything. Plus, I enjoy helping you with your creative process. Have you also tried revisiting some of the writing prompts we did in our creative writing class?",
        "memory_text": "1. Wife suggests that husband should try using more modern language to be better understood.\n2. Wife brings up Sarah, the husband's previous partner, but husband says he hasn't thought about her much.\n3. The wife compares the situation to when the husband fell asleep during a movie she recommended, indicating past issues in their relationship.\n4. Husband agrees to try adapting to modern language for better communication with his wife.\n5. The wife reassures the husband that it's okay to be different and encourages him to embrace who he is.\n6. The wife remembers the husband being nervous before the presentation.",
        "speaker": "Husband",
        "raw_prediction": "I appreciate your support, and you're right, revisiting those writing prompts could spark some new ideas. I'll give it a try and let you know how it goes. Thank you for always being there for me.",
        "previous_summary": null
    }
]